{
    "YoutubeMetadata": {
        "author": "QCB5",
        "channelId": "https://www.youtube.com/channel/UC51mApBs4KUp4T8avIhyAnw",
        "title": "Queens Community Board 5 March 11",
        "publishDate": "2020-03-11",
        "shortDescription": "The regular monthly meeting of Queens Community Board 5\\nMarch 11, 2020\\n7:30 PM\\nChrist the King High School\\nMiddle Village, NY"
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "QCB5",
        "normalizedName": "Queens Community Board 5",
        "twitterName": NaN,
        "youtubeChannelName": "CB5 Queens",
        "youtubeChannelURL": "https://www.youtube.com/channel/UC51mApBs4KUp4T8avIhyAnw",
        "twitterHandle": NaN,
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "Like the welcome you all to the regular schedule committee board five meeting here at Christ, the King high school cafeteria for those of you at home and that of watching the live streaming, we appreciate you paying attention to what's going on and we understand why you may or may not have come to the meeting. So would you please rise and salute the flag to my right, I pledge allegiance to the flag of the United States of America and to the Republic for which it stands, one nation under God, indivisible with liberty and justice for all. Thank you, as you recall, board members, the at the last meeting we had a table in motion which takes president precedence, so the first order of business tonight is the table in motion on the report of the executive committee regarding the Fresh Pond road festival. At this point in time, the executive committee is withdrawing that motion and therefore will close the tabling procedure. Thank you. The next order of business is the public forum. Do we have that sign-in sheet for the public forum again speakers you had to be pre registered or registered before the meeting started? No more than three minutes: no foul language, no personal attacks, Richie. So the first person to speak tonight on the public forum and that's the microphone on the floor is Kathy masse, Kathy I promise. This is the last time that you're gonna hear about this, but it's a very important issue, I'm sure by now everyone's aware how hard that cures has been advocating for the containerization of waste coming from a long island to many years, the bill supporting their efforts was finally moved out of committee in the Senate for a floor vote. However, in the assembly it still is in the environmental conservation committee in 2015, I believe Steve Englebright Assemblyman was appointed chair of that committee. His environmental priority is included advancing policy and budgetary initiatives to improve the quality of our air and waters, open space preservation, recycling and sustainability. Q's is appealing to Assemblyman Albright to move this bill number a oh three to six nine out of committee. These open rail cars of waste are affecting the environmental, the environment and our quality of life cures is asking each of us and everyone here. If you haven't already signed one of these post cards, which John and Brian passed out the last couple of meetings to support their efforts, I'm going to ask that you do so and return the signed card to Cathy O'leary, who is going to get them to cures. Thank you. Everyone! Thank you. [Applause]. The next speaker is Natalie punsie Natalie are you here Nataly fun, say night here next speaker is Aaron Pierce, Jackie and Jeffrey hi good evening. So we're here today, because we're applying for a liquor license for a little cafe that we just purchased in Ridgewood and the cafes 350 square feet. We want to do an all-day service and provide a spot for the neighborhood that functions as Park Cafe part bar and part restaurant. We want to open at 7:00 in the morning and offer sort of quick casual counter service by day and a little more intimate setting by night, we're inspired by French, cafe and Italian bakery, which are little tapas bars in Venice, that provide a casual atmospheric environment for the enjoyment of eating and drinking, and we have a lot of experience in food and beverage. Combined jeff has been working in kitchens as a chef for 25 years and I've been working in service for about 15 years. We have been wanting to do this for a long time. We've finally got the opportunity, so tell them again the name of the business and the location, absolutely so we're working on a name. We haven't finalized it. Yet our LLC is table one for two and the business is located in Ridgewood on forests and catalpa. Okay, so I know there was one question that comes up from several of our board members. There are four establishments that then address and the question was: is that permitted or not? You had to get a special license to be participating in the fall of four businesses at that location? You purchased the cafe from someone else. It was already functioning as a cafe and bar I might be able to speak. The landlord current Westergaard is the owner of the building. There are four businesses in there born as a pizzeria being built out. Another one is an operating bar called sundown with a full liquor license. The third business is Oh wine store, and then this will be again it's about as small as you can be, and still be. A functional, restaurant and bar to 350 square feet single aggress. There is work being done at sundown. They are expanding into the basement area of their space. I'm. The that's why I'm here today, but the table for two is attached, but the all one that I spoke at length because I understood this was a community concern. The alt one that's applied for at sundown has been fully approved by the Department of Buildings. So when the DOB comes in, they look at the building in its entirety and the four businesses that are there are illegal and approved, and the alt one has been also the plans there have been approved for expansion into the basement, so you would like it to many malls so to speak, because the bolts have multiple liquor license establishments functioning molls. That is true in that there will be two with the addition, as there's no objection here with another liquor license, there will be two in this building. The pizza store is not one in the retail store is just an off. What's called an off premise: license notice for shoppers coming by and leave so not quite at the mall level. But yes, there is multiple businesses in one building. Thank you very much. Yes, Peggy. Okay, my microphone Peggy Athena's microphone. Then you can wipe it down afterwards, unless you threw the wipes away. I assume that faces the forest avenue not knocked its alpha, because there is a cos alpha, 68 38 forest, their view, yeah I know, but it can cover a multitude of sins. It doesn't face on to cake alpha. That's all I'm asking correct fine. They are not the corner business. Yes, that's correct anything else. Thank you very much. Okay. Thank you. I'd like to temporarily suspend the public forum to introduce our borough president Sharon Lee good evening. Everyone I don't mean to interrupt your regularly scheduled program, but I kind of do. As the chairman mentioned, Sharon Lee, as you may know, I have had the honor and the privilege to serve as your acting borough president for the last two months and change, and it's been its. It's been great. It's actually very fun. Anybody who's like I, don't knock anybody who wants this job. It really is a lot of fun and really fulfilling to. But I am here because I wanted to say farewell as I promised a few months ago, when I first came before you to introduce myself to some of you or to say hello again to some of you promised that I'd be back in March and Here I am but since I have the mic in front of me, I'd like to remind you of two things and things that you already know, but I want to make sure that they're at the forefront, because there's a lot going on right now in our borough number one. We have a special election coming up, despite all the uncertainties that are happening right now, it is still on and it's still scheduled for March 24. We will elect our next borough president into office and that's March. 24 special election begins this Saturday, and so, if you're interested in doing that, you'll look up where your problems are. Your early voting excuse me. Thank you. Early voting begins this Saturday thanks for that check and then March 24 is the actual special election and as we know, we don't vote you just don't matter. We just don't count so March 24. What are we gonna do and then, of course, in April, if you are so inclined, we've got a presidential primary. What are we gonna do and then, a few weeks later in June, we've got a statewide primary, where we will again elect our borough president and some of our state legislators. What are we gonna do in June primary vote and a few months later after that? This is all in 2020. In November, we've got the general election where we will vote for our president, our borough, presidents and, of course, our state legislators, and what are we gonna? Do yes, so consider yourself reminded thank you in advance for voting. The second thing I would be remiss if I did not mention is the census. We cannot overemphasize how important and critical the censuses I firmly believe that the future of New York is Queens. I firmly believe that the future of New York is Queens, but our future is counting on being counted and that we matter and that we're visible, and so it is just critically important, fortunately had nothing to do with the Covid-19 19 or any other things that are before us right now. But this is the first time that it will be online and the way that they're strategizing the census count. It begins tomorrow. The count begins tomorrow, and this is the first time it's gonna be online and for the first few weeks, we'll have an opportunity to fill out that questionnaire online, whether it be from your tablet from your phone from the comfort of your home, you can be wearing your PJs whatever you do, you can do it from the privacy of your home or wherever you are, and then, after a few weeks, they're gonna track us as to whether we are filling out the census and if we don't they're gonna come to our doors. I, don't know about you, I, don't like opening my doors to anybody, and so that's actually extra motivation for me to fill out that census. As soon as I can online to prevent somebody knocking on my door and disrupting my day or evening, but all jokes aside, as you know, it is determinant of the next ten years, whether you're one day old or whether you're 150 years old. Whether you arrived yesterday, whether you arrived yesterday or whether you're fifth generation Queens resident, everyone needs to be counted, it's census.gov, but we actually urge you to come to Queens, VP org, and so those are the two things that I wanted to put before you front and center. On your mind, in addition to all the great things on the agenda, but thank you for your indulgence for allowing me to just say hello and farewell, as I promised, not necessarily I plan to move out of the way as students. We elect our borough president and they are sworn into office because they certainly won't have a lot of time before their June primary, so they're gonna want to hit the ground running, I'm sure, whoever that is March 24th through December 31st or next November. Next, how long is this person, so the special election is for a person to fill that be the borough president from sometime after March 24th, when they get sworn in to December, 31st 20-20-20 and in November, or is it June in June? That's a primary. So when is the election for the borough president starting January, 1st 2021, November? Ok, so you're gonna have this year, we'll have to borough presidents, three borough presidents and make them will be voting for we'll be voting for one to serve until December 31st in November, we'll be voting for another that spots, January 1st and then you'll get to vote twice more next year during the primary in the presidential. But there are future really is at stake. I, don't have to tell you that everyone, every single person here I know, cares deeply about the strength of our borough, of our families, of our neighborhoods in our communities. But I will tell you that Queens we are not getting our fair share. We are just getting shortchanged compared to the rest of the city. These are facts. These are facts. The borough board just voted a few weeks ago on the Queen's budget priorities for fiscal year 2021, and we submitted it to the mayor and the City Council, but there are three areas in particular and I: do want to leave you with this, because these are facts and I'd like to equip you with some of the facts that we, you know, we crunched the numbers of Borough Hall trying to see. Is it really that unfair and I indulge me for just a moment, because I think this is important. There are three areas that were of deep concern to the borough board number one: it's your schools! When you look at New, York, City, hello, council member, when you look at New York, City and New York, City, school, kids, all New, York, City, school kids, a third of the mayor of New, York, City, school kids are in Queens, yet a third of them. Yet the city spends the least amount of dollars per pupil for Queens. Kid think about that. So that means the city is spending less dollars on a Queens kid than on a Bronx kid, a Brooklyn kid a Manhattan! Kid, a Staten, Island kid facts: that's number 1 of 3 number 2 of 3 are all ders are seniors same situation there of all of New York City elders, a third of New York City's elders live in Queens, yet the city spends the least amount of dollars per capita on our elders here in Queens than it does on a senior from Brooklyn senior from the Bronx senior at Manhattan senior in Staten Island, the least sir facts and third. The third main concern which is more acute in recent days. The recent weeks, our hospitals Queens, we only have we are the largest borough by land, very close second by a population. Although you know I wouldn't put my bets on that, but we'll see how the count turns out this year, but we have only nine acute care hospitals in the borough of Queens and we are the least vetted meaning we are under bedded. We have the least number of beds per 1000 residents here in Queens than in any other borough, and we are overburdened already by the closures of I, believe it was like four hospitals just in the last decade and so those three areas: schools, seniors hospitals and many other areas, but those are the most glaring disparities, glaring areas of us getting shortchanged relative to the rest of the areas of the city of New York. So I leave you with that, because all the more reason that we are counted all the more reason that were visible in the count that were visible in every single election coming up this year. Next and so I humbly remind you of all these things and of course thank you very much for this deep honor to serve you over the last several months. Thank you. Did you tell us where you're going to be after you leave office? Okay, very good! Thank you! Good luck! Okay! We'll go back to our first order of business with the public forum. The next speaker is Rob is miss me all are possible. You can feel free to wipe that microphone. If you like, the wipe, is there board members, chairperson d, I, guess? First of all, I would like to thank you for accepting our request to be here today to present I'm speaking on behalf of the company called for cable we're coming from Brooklyn and to introduce our company our mobile application platform. We were writing to all community boards around New, York City, and actually you guys were the first to say yes and to invite us to this meeting. So the idea what's parka bill is portable is trying to create a peer-to-peer community based mobile application for drivers in the cities like New York City, so two drivers can exchange free street parking spot between each other, so how it works is as soon as the driver finds a parking spot in the street. We are talking about not meter just the free parking spot as soon as the driver finds the parking in the street. He parks in the application detects its location and ask the driver to share his departure time in the future, and his parking spot was a departure time in the future would be shown as available spot in the future to all other drivers who are coming to this neighborhood in search of parking. So it's very easy and the drivers can chat with each other communicate with each other and they can request pre request parking spots in the areas they're going in the future beforehand. So we came to the idea of the application, not by chance we're also drivers in New York City, and we know how frustrating it is how stressful it is to find a parking spot for most of the drivers. We don't have their driveways, we don't have enough funds to pay for the parking etc. So if you look at some statistics, it's very interesting. For example, New Yorkers spent more than 100 hours a year, just in search of parking and parking in this street is also one of the major causes of traffic congestion in cities like New York, every three cars in ten cars we see in our streets, they're, not just moving or going anywhere they're just cruising around in search of parking, so helping drivers to find parking spot can also help to decrease the traffic congestion in our streets. So the reason we try to raise the idea of our application, our mobile platform to the world is just to see what kind of interaction we can get with it more. We also address the same issue, the Department of Transportation of the New York City, and we just some general answers and in one of the conversations over the phone, the representative of the D-O-T told us that they are not interested at the moment because they consider themselves as a revenue bringing organization revenue bringing branch. So they concern. They are concerned only about metered parking, not free street parking, but we're confident that in the nearest future, we'll also find some common points of touch and try to communicate our idea to them. But the reason we're here today is just to know to first of all introduce our idea we're just getting our first users early adopters of the application around New, York City, and also to find out what are the best ways to interact with the community boards. Thank you. Thank you very much. Thank you. Okay. The next speaker is Jason ho good evening. My name is Jason. Ho I recently moved my place of business San Cong to 6575 traffic avenue, and I do some just some issues. I want to bring up with you guys- maybe you guys already know about it, but during my time there there's been like five or six incidents of illegal dumping, of just piles of wood and possibly sometimes furniture bed bedding. So there's also the issue of a garbage and debris that collects under the vehicles that are parked on Woodbine and Palmetto Street between whooping and Palmetto, and you just can't clean it because you can't get into the cars and I assume all that dumping is because the place looks like a and abandoned lot because of all the garbage and the vehicles that don't move there are kind of contributing to it as well, because I believe there are a couple instances of abandoned vehicles there I think and then yeah it's just something. I want to bring up with you guys and see you can work on a solution because I was told. This was something that the community board could help with and that's pretty much all I have to say thank you. So, let's clarify you're looking for a street sweeping alternate side parking akin to that so Peggy O'kane is in that area. Peggy. Would you like to address it? Hello, I'm, your neighbor on Woodbine in traffic right on the corner. We already have alternates on the west side of traffic Avenue yeah I noticed because that's residential, the other side is m1 I. We finally got that big construction thing moved away. That was abandoned there for a year, I'm a machine that had to cost a hundred thousand dollars, which that's left an industry for at least a year. There was a truck car there that my neighbor by googling it on Google Maps, was able to prove that it had been in the same exact spot for a complete year, so it needs cleaning and there is right across the street from me. There is a regular dump out location right at the end of the traffic of the MTA which the tries to transfer the garbage, people come and clean regularly, but people persist and dumping. It's not as bad as it was years ago. But it's not yes, so you support the gentleman's request and you could articulate that to the Sanitation Services Committee. It's been a mess since I've lived 50 years that I've lived there, it's not as bad as it was, but there are still people who've come to do everything. That's illegal, immoral or fattening on traffic area, John, Mayer I'm, just wondering since you have you cameras yeah, we did to share those with enforcement yeah. They ever asked you okay. So it's something to also recommend that you would be open to them. Yeah! It's just that the there's nobody keep like and so gotten. The camera is like 24/7 and they'll come in like at midnight when everyone's asleep and then just dump a pile of wood and just dry off yeah. But if we can capture license plates, we need some kind of getting a quest Peggy. You could do the requesting committee and if you could I guess you time out on your recordings right leaves like about two weeks all right. So at some point in time we may ask you for discs that we could share a problem. Thank you. Thank you all right. The next speaker is tiara Utley and that tilts down tiara so good evening. Everybody, my name, is tiara Utley I'm, a recruiter from fourth Dale. If the foster care and preventive agency I'm just here tonight, we're actively recruiting foster parents to service the children and the families that we work with and I wanted to share that our next orientation is tomorrow. Thursday March 12 from 10:00 a.m. to 12:00 p.m. and our open house is Friday March 20th from 12 p.m. to 6 p.m. so, if you're interesting to come to fluster family or if you normally want to interested in coming to foster parents, you can reach out to me or use more force, still website for a still in that org. Thank you. The next speaker is Robert Cooper, our key Barada hi good evening, distinguished community board, five members guests and chairperson I'm here referenced by Neil Seiji Gianelli, and this is in regards to residents of bridge, request, speed reduction devices on Forest Avenue between Putnam Avenue and Palmetto Street. This is a very congested area where the streets are very narrow. Within the last I'm gonna say three months. As of the new year I've seen cars either go around buses parked at the red light and almost running kids over to kill cars. Speeding at fifty to sixty miles an hour on Forest Avenue on in front of the school, which is 93, there's a lot of foot traffic, pedestrian and children. I walk my daughter there every morning, and this is a constant problem. What I'm requesting is of the New York City Transportation Department, to start a an assessment of the traffic that is going on there? The speed limit that is being introduced in the area by cars that are speeding, whether it be male or female. It doesn't matter- and this is all this is not happening within the span of probably one or two blocks of the school. Every school has speed bumps everywhere, I go in Queens, Brooklyn Bronx, you name it. These schools have within the radius of one block to have speed bumps. Why? Because this is a deterrent for cars to slow down completely to almost a whole, because if you speed over them, these cars are going to get damaged. So speed bumps are a very great deterrent for speed people who actually speed all over the place they did have. They did put a camera up a speed camera which it falls to 25 speed limit, but the cameras are just do a minimal job, because people just don't hear the speed bumps will greatly reduce the speed of this traffic going by in front of the school and potentially could prevent any one of our children. I'm pretty sure any people who have children here and are in the neighborhood. They don't know what I'm talking about. So, if you have children, just please understand where I'm coming from I'm just a concerned parent- and this is just my request and I'm, putting it off to you guys and I. Thank you for the opportunity to be able to speak tonight. Thank you. Thank you. One of the problems we have. If it's a bus route, they usually turn down requests for speed bumps so input the Transportation Committee. If you give us something a request in writing, we'll turn it over to the committee and they'll review it at the next meeting. Thank You next speaker is Tony D Piazza. Thank you board members for considering against our street festival. One more time not gonna bore you with the history of the street festival again just to reiterate that in 25 years we never had an incidence. As a matter of fact, this year the 100 4th precinct commander already sent in a letter to the community assistance office. Basically a lot of no objection because there were there were no incidents. Last year at the last meeting, there was a request made for some details of fire finances which we have submitted to the board, but just to give you a brief rundown. We made in profits like 28,000 last year, out of which we gave a thousand dollars each to five community groups, and they were the one, a fourth person council, Glendale housing, Santa, Lucia's, Food, Pantry, Glendale, civilian Patrol and the original community assistance office. In addition to that, we also gave money to local groups, and we also has promised to open up a community assistance office for Italians on Merrill Avenue, where we provide the assistance in matters of Social, Security, Medicare and so on. The only thing I mean we ask that you support this. At the last meeting, there were other street festivals that were approved, which really the objection to our street festival was always that the traffic congestion yet I mean the other festivals. Without naming them, they have no parallel streets on them. They create havoc in their community, but yet there is no objection, but the Italian Street festival there. We have traffic Avenue, we are Forest, Avenue, 60th place, and yet there's objection. So I certainly hope that you will. We can we consider this and approve it like all the other street festivals and in Ridgewood. Thank you. Thank you. The next speaker is Joe Raynor, oh yes onto question all Don Tony yeah, Tony, hey Tony I, have a question Tony. Last year last year, the board approved and by the way, another objection I'm here, 12 years. Another objection was the amount of days. That was the thing that was a keeper last year. The board approved it the year before the board did not approve it, and in my 12 years there were a couple of years. They did not approve it, but you've had the affair for the four days. Every all the time, no matter it doesn't seem the only wire voting. There's my yeah. Thank you for that. The only objection that the last that I would say here, two three four five: was they reduced the number of days because of the construction on Metro and Fresh Pond, but naturally that's over, and that is why the community didn't see no problem with approving the fall for the street festival last year and I hope you'll do the same but years we disapprove that it still went on. Yes, okay, so my question is: what are we voting on that's for later on, not in folk a problem? Okay, questions, nope next speaker, Joe Reina, not here, then he loses turn because with that we're closing the public forum and we'll go to the next item of business. Is the chairpersons report I happen to be the chairperson, Vincent or Curie? Thank you all again for coming like to introduce his staff, pressing Cathy, O'leary Laura Mulvihill, just a granted - Gary Giordano, representing the borough president, is Jonah. Sereno Joe, you have anything to say: okay, mr. Holden I'm sure you'll wait a little bit while I introduce police officers Barrish and Perez, and Sanada and Sergeant rain premium right, [Applause] good evening. Everyone glad to see everyone walks. The bearish sergeant Raymond Road through these stats for the past 28 days for 28 days, rape, we're up by one case, robberies we're up by 4 felony assaults up by 12 burglaries up like two grand larceny is up by 17 crying lost under the order weighted down by two. We do have a robbery condition going on mainly in Ridgewood water in the area. Also, there are ties and rims run around later in the evening early mornings, a group of individuals going around to specifically Honda Civics and our courts under courts are Honda Civics and they're. Removing the tires and rims be mindful of that. As usual, don't leave any property in the cars, that's driving our ground laws, and these also remove electronics cell phones iPads any of that stuff. Don't leave in the car overnight and, as always, be sure to lock your car I know it's silly. We have to say this, but people do leave their car unlocked with the keys in it. Basically inviting and you want to take their car, so all stuff that could be prevented on those terms. Also, tomorrow, there's a blood drive at the 104 precinct from 12 p.m. to 6 p.m. anybody that would like to tell me Thursday. That's all we're gonna change, the dates. Don't change to tap l1 back, okay, April, 2nd I'll just refer McGann will be doing a basically like an open house at the precinct, where the captain will just be holding a meeting. If anyone has any questions that concerns is a good type good time to come voice. Your concerns, questions, opening up the precinct open to everyone. 6:30 a precepted, come down to the precinct, we'll have a little meeting. Captain will give you information answer any questions, any issues that we have going on as of late anything new by that time, April 2nd 6:30. Yes, it's important that all of us try to get there because she expressed a concern that she would like to put the faces with the voices and the people that she speaks to she and it's very hard to do. Unless you get over to the meeting and say hello, it's more or less a meet-and-greet and from the neighborhood. This is Maryanne. This is Joanne. This is Bob this way ship. When you speak to her. She knows who she's talking to. Thank you. Thank you very much for doing what you've been doing, but we need more. You need you to do more, so in precedence, councilmember I, guess we have to introduce the mayor's office. What's her name again, yeah Judy jessica says Chbosky, I'm, sorry and then your next club good afternoon, everyone, my name, is Jessica shahbazi and I'm. The Queensboro director for the mayor's office, in terms of our kovin 19, responds I, just like to highlight that you can text Co the ID two, six, nine, two, six, nine two. In order to get regular updates on the coronavirus, the mayor's office is providing support to small businesses. Who can demonstrate that their business has gone down as a result of the corona virus? We are organizing multiple tasks for us to target, not only the wide city up response, but also the response that we have towards our senior citizens and our most vulnerable populations. We remind everybody to wash your hands, cover your nose amount and to please stay home if you are sick as of earlier today, our case total was fifty three confirmed cases and I'd just like to remind everyone that is the first of this month. So over 11 days we have 53 confirmed cases. We are still relatively containing the situation and again I just like to emphasize. Everybody should continue to remain civically engaged participate in the census, as it starts March 12th and participated in the special election as it starts this weekend. Does anybody have any questions? Thank you. Thank you. [Applause] Julio Salazar from Canadian valence quiz office good evening, Community, Board, five again: Julio Salazar Congress member Nydia Velazquez office, Thank You mr. chair for giving me an opportunity to give the community an update, just one piece that I wanted to share really two pieces. The member from the outset of the corona virus now pandemic. The member has been advocating, together with her partners in the House of Representatives and as the chairwoman of the house and small business, how small business committee advocating for additional resources for the SBA, the Small Business Administration, to provide emergency loans that are very accessible to small business owners so who have been impacted by the corona virus. So they can access those funds, those emergency loans to cover any needs that they might have at the moment. That's something that the member has been pushing for and her committee has eventually made its way to the house and was passed in the house, and it's now on its way to the Senate. So that's a provision that she had advocated for together with her colleagues the New York delegation to secure that extra funding in the face of in the face of the corona virus. Additionally, I wanted to just provide a small update to the board regarding the Wyckoff Avenue reconstruction project, which we are working with, the community board our district manager to get an update from the Department of design and construction on this project, which has been stalled for some time, so we're just working on some logistics as to when we can get all the agencies involved. It's a multi-agency project inter Interborough broke into the community board for Brooklyn, and it's a community board five Queens. So there's a lot of hands on this project. A lot of agencies a lot of people working on this, so we're gonna get hopefully an update on that project. If not at the end of this month, we're trying to work out the logistics with the agencies, we're ready to meet with them. I know the community board is has expressed that they're ready to meet with them. So we're just waiting out on the agencies that are that are taking on that project and we'll have an update on the Wyckoff Avenue reconstruction project, but other than that again Thank You mr. chair Thank, You mr. deshee district manager and stay safe. Thank you. Thank you. Thank you, Vinnie and thank you all for again. Volunteering coming out and doing your part and, like I, said last night we had the MTA workshop virus aside, people came out and in I think about 120 130 people were there and it was a very productive workshop as opposed to a presentation. So a workshop is one where you can go over the bus routes and so forth and so on, and you know, give you two cents and they write it down and we had the chairman. Pao Foy was there, so it was interesting that he showed up because he knows that people are upset. Certainly at this in this part of Queens, and we don't want our buses taken away. We want them improved and that's what I think the he got the message. So he did. He did admit that they started off, rather poorly I would say, to put mildly, the coronavirus we had an emergency meeting again today in the council and by the way the City Council feels that we have to do a lot more. In fact, we don't have enough tests, obviously people who want to get tested can't get tested, and until we get to that point we can have at least a handle on it. The City Council is actually talking about closing offices and the council office is to try to stem the I. Don't think that will help so much as to we have to talk about large, larger gatherings. I do want. I did voice my opinion that we should keep staff there, because people come in and they have to have information some people. You know they're going to switch our phones if we have to if we get to that point to our personal cell phones, which that will work too, but we need to be there in the offices to answer not only answer calls but to meet with constituents. So, but there is talk about this virus spreading to the point where we'll have to shut down, and even community boards might have to shut down we're not there yet, but if the numbers keep coming in and they keep them all if it keeps multiplying, we could be there. So just be aware, if you like, the mayor's office said if you don't have to, if you have a cold, don't go out and if you feel that you know it's, a non-essential meeting don't go, and some people feel that sporting events should be canceled because I was at the garden the other night for the Ranger game they lost. But you know it came into my mind that there's a decent large gathering, 15,000 people or more and it's it- does cause concern that this will spread the virus even much faster. So the City Council is talking about a lot of things, we're taking it very seriously, and we have to show leadership here and certainly my office will answer any questions, but we're trying to desperately get more testing kits and get more testing sites. So that's what we're working on just want to go over quickly. I know: Benny, were you have large agenda, but I visited the homeless shelter at 7816 on Friday, along with Andy hevesy Assemblyman Hevesi and reps from Mike. Miller saw the sanjaya dabo's office and I just want to tell you what I saw and you make your own assumptions. We walk in and there's a security station and a metal detector security station to the right metal detectors Center and we took the stairs the stairs I feel not that wide and walked up to the second floor and ran into another security station. Walk down saw the dormitories 10 to 10 people to a room kind of tight I feel for the space they have. Everything seems a little tight. The men are on top of one another. They didn't show us any rooms with men in it which was interesting and walk to the other side of the hallway. Another security station with complete with monitors and a security guard same thing on the third floor: identical a lot of meeting rooms, conference rooms, but to me I felt this is not a place to live. This look more like a minimum security jail and that's the feeling. I got and that's the honest truth that I'm telling you. If anybody walks in there, that's the feeling you get and that's what concerns me. This is not a place to live or to stay or to feel comfortable, I understand that, but it doesn't have to feel like a halfway house or a jail, and it does folks it does and I'm concerned just the mentality of building this kind of facility to house 200 men. They say there they're going to get jobs and they're going to be they're protected inside that facility with a heavy security force. But what about outside and the community? And this is why I don't know what I think they said: they'll have 48 security guards in there or not only not at one time, but a force of 48 I'm, just wondering. Why does it have to look like a jail? And this is what concerns me now. I feel like. Let's talk about the temporary CFO that they've gotten, which I think was coerced, that the somebody DHS possibly put pressure on the Department of Buildings but they're still outstanding safety concerns. There was supposed to be a stairwell built on the outside to get to CFO. They didn't do it, they said they're going to do it, but it's not built, and it seems to me and there's a bunch of other concerns safety concerns that the community had. You know, rightfully complained about and suddenly many of the security that many of these safety concerns were not addressed when they got the TCO, they can only put up 250 people in there for a reason, because it's not really the safety concerns were not addressed period, so they went around and did it the back end got state approval. They said, but I still I've asked for an investigation as to how this happened, how they got a TCO with safety concerns. Three at least outstanding safety concerns that weren't addressed now. I understand people need shelter, but this is not to me again. This is not a shelter. This is a minimum security jail like I mentioned before, but another issue is going around the building department process, which I feel they definitely did, and we just mentioned a couple of other things. I've asked a priest in to address a lot of the commercial overnights in the area, the illegal parking that we see on a regular basis. They have started to respond to a lot of it, but, as the preset is concerned, I'm very upset about the Sacred Heart incident that we all know about. That's totally unacceptable and I will not take. Oh, it was just kind of a mix-up. No, it wasn't, and it's often and then he also mentioned something that we need a procedure with parochial schools, especially because the public schools have a safety procedure in place, the parochial schools, as we witness they really don't, and if central command, that's the people that actually send out the cars from the precinct or from the in the neighborhood here when they hear a school is involved and there's a safety concern. That's somebody you're suspicious man outside of school that should automatically result in an emergency or a police car direct route within minutes not hours, and there are two things that were. Would that happen? Would Sacred Heart that I, don't like and I did see the video by the way that day I went into Sacred Heart and looked at the video, and that gentleman was upset at the door because he wasn't getting an answer that he thought he wanted. He apparently was told he wanted directions, but he didn't get the answer and he stayed and he banged on and once the door was closing he banged on the door with some kind of metal pipe or a pipe. The certainly the secretary felt that they need to call 911 one. When that happens, the police car should have been there. So we're working I've spoken to the commanding officer. I did speak to borough command north. They feel also that things weren't done. That should have been done. So we're going to try to correct it, but it gets to the bottom line with the priests in is, has too many jobs, and if anybody listens to the scanner, you know that they're holding many jobs, one unit is holding many jobs. That's unacceptable, especially when children are concerned. So I think if this was like I said a test. The precinct failed miserably on that test and I will not sugarcoat it, and nobody else should and there's no other excuses that there was an some kind of 53 with injuries that was two hours later folks on the initial call that the 53 with injuries. So that's not that's, not an excuse, so the ball was dropped, but we will we'll try to rectify that. It doesn't happen again. Roof scammers are again around again: we've had a call to the office that somebody attempted and here's what happens. They come up to you. They say I'm in the area. The contractor will he'll have a truck there. He looks like a roofer and he'll come up to the end, individual, mostly seniors and say I'm in the area. I finished early I have all my equipment, I noticed from your neighbor's roof that you need work on that roof you're going to have a leak, if you, if you don't, have it now, you'll have it soon, and if my equipment here can I go up, there now take care within an hour or so and save you thousands of dollars, and they charge usually a couple of thousand two thousand three thousand for less than an hour's work. And it's not really work. It's a scam. Why they pick on seniors because seniors don't climb up on the roof to check the work. So it's a very good scam and most of the time they get away with it, so just be aware, spread that a word around we'll do the same. We also have social security scammers, as you know, and so forth. So I won't get into all the rest of the things, but I will say that the Cooper Avenue fight is not over I just want to make people aware. That's not over! Thank you! Thank You counsel, respect to Cooper Avenue. We spoke with Nicholas Orlock, who is the day-to-day person who handles operations at the site? He works for West hab and when we spoke to him we told him that many of the gentlemen, his clients say that they're from the Bronx and he responded by saying. Well, they have Queens history. Now. What exactly does that mean Queens history? As far as I'm concerned? Rikers is a part of Queens, so we directly said: are they coming from Rikers and he said well, I'll tell you. No one comes directly, there's an intake process, so yeah the answer is yes, they're using it as a halfway house single most important thing: we've had to deal with as a community board in the past five years right and by the way I'm on the Criminal Justice Committee and I mentioned this a number of times in print that it was said that 40% of the individuals leaving jails go into the homeless shelter system. So that's definitely a concern for a neighborhood like ours and have 200 men in one spot and like I've, been saying we have, we should have smaller shelters. Faith-Based is what the mayor's recently rediscovered when I mentioned it to years ago to him it wasn't feasible. Now it is when the mayor mentioned. Okay, quick question, Bob I understand there were residents living there, I don't know, but I'm told that there are always. He just said that yes, well I wanted 20 23 men in there. Yes did you actually see any of them going to the bathroom coming up? Now we were that high, so our one man standing in the cafeteria who they said was a success story because he already is leaving the facility and he's going to you know to a residence to get a permanent apartment. Thank you. Thank you. Thank you. Thank you. Like the recognized Kevin Wisniewski from Andy heavy seas office good evening, everyone Kevin was nasty with the Sun. Women have a C's office, just two quick updates for you guys tonight number one. The Assemblyman is in Albany at the moment and they have entered kind of the final phases of budget negotiations and the census. We're getting at this moment is that the state is ready to move on our rent supplement for the homelessness program. So as we move forward on that, we'll be keeping the board involved and just updated in our day-to-day and then I just want to quickly touch base on everything going on with the corona virus. We've been monitoring this very closely. We've been in touch with the governor's office on a daily basis, so I just want to say: if there's anything, you think the state can do better in this pandemic. Just give us a call and we'll make sure they flag it, and then I just want to echo what Jessica from the governor from the mayor's office said about texting, COV ID, two, six, nine, two, six, nine two to stay updated, so thanks again feel free to call us with any concerns and stay safe, Thank, You Leslie here EV from Brian Vaughn walls, office. Okay, what's the question point it away from the microphone Thank You Leslie Alessi bless you Rebbe, please everyone hi everyone good evening, just really quickly from Brian's office we're having our annual breast cancer screening. That's completely! Free, please call eight seven six, two, eight nine zero nine zero I will say, however, that we are partnering with Maspeth Federal Bank, which you all know for a few events, including our rain barrel event, but they have postponed a lot of events due to the virus, so the rain barrel event pick up, which was supposed to be on the 25th, where you can reserve a free rain barrel. I think we have a few left for everyone that if anyone wants to call has been postponed so just spread the word you could still call and reserve one, but the dates for that and the breast cancer screening about is kind of TBD, so feel free to call our office for any questions or concerns are always happy to help. Thank You Allison Cummings from Catherine Nolan's office, everyone I know, there's a lot going on. I'm, not gonna rehash all this. If you'd like to get in touch with the district office, you know how its seventeen seventy four three one, nine four. There call me aside from that. No real announcements I have newsletters for anyone who doesn't receive them at their residence who would like one from the Assemblywoman thanks Carmen Torres from Assemblymember Miller's office, good evenin, everybody. As you will know, the Assemblyman is up in Albany, also and down couple of months from now he will be hosting if everything goes well. Three events, April 26th recycling event in Forest, Park, May, 30th, the rain barrel and May 31st. The mammography van, is in front of our office. Any questions our call our office, seven, one: eight: zero, five: zero, nine, five zero! Thank you for having you, okay, so as a special guest and because of what's going on, we have jano from the Department of Health and Mental Hygiene for presentation. Thank you hi good afternoon, everyone. My name is good afternoon. Oh my gosh! Oh sorry, it's been a long day. It's been a very long day, so my name is Chad know from the New York State Department of Health, a Mental Hygiene I am the assigned liaison for the borough of Queens, so the entire borough is my jurisdiction. Currently we are responding to this thing called Kovan. 19 I'm here to give you some overview and give you some information about it and hopefully answer some questions. So this information that we have right now is current. As of March 11th. Today, 12:45 p.m. so my team works on this I work on it myself we're trying to update as quickly as possible, but due to the rapidly changing numbers, it's kind of hard to keep up so I'll make this quick since it's almost nine o'clock, so I'll do a basic overview of the novel coronavirus. How the New York's responding, how you can protect your community and our you know: greater city and resources. Oh, what's that? Okay! So what are Colonel viruses? Crenna viruses are zoonotic viruses, which means they usually are originated in animals. They make animals sick. For example. They make you know: cats get cold, diarrhea things like that, but every so often the virus jumps shipped from an animal to a human. So in that case we call it novel and so far we have about seventy eight strains that it actually made humans sick. This is one of them and we call coronavirus because if you look at the microscope it looks like it has a crown. So in the past we had two major instances where we had a zoonotic virus outbreaks. Back in 2003, we had South Asian respiratory syndrome in 2003 over 8,000 cases, start in China from civet cats, no cases since 2004, thank goodness in 2012. We had Middle East respiratory syndrome and we had two thousand four hundred cases globally. It still continues to infect humans, but it's not as bad as before. That's also a good thing, and now we have the novel coronavirus. So what is a novel coronavirus? So it's a respiratory disease that began in whoo-hah, China and the Hebei province. It was identified in December, 2019 originated from animals like I said before. Is it notic and in fact the humans who came in contact at a live animal mark in Wuhan and scientists when they first saw it they're like what is this so they tested? It did the research and it was news what they call it: novel coronavirus, and now we call it kovin, 19 and the symptoms range from fever, cough or shortness of breath, and the incubation period is about 2 to 14 days after exposure. That's what we're seeing from the current cases that we have about a hundred something thousand and severe cases of infection can cause pneumonia, respiratory issues, kidney failure and death, and unfortunately, since this is a new virus that we discovered, we don't have any vaccines or treatment available right now. Pharmaceutical companies are actually pushing the pedal, so research and development is going really quickly and hopefully, we'll have something. How is it transmitted so we're still trying to figure this thing out, but all we know from current cases is that they can't be transmitted from one person to another and when the person is most symptomatic, when they're coughing a lot sneezing a lot having a huge you know, you're very hot fever, they're the sickest and some spread may occur if the person does not exhibit symptoms. We call that asymptomatic that happens ever so often, but from the keys that we've seen so far, they're likely to be spread person-to-person, who are in close contact within six feet through respiratory droplets that are produced when someone coughs or sneezes and unfortunately I mean I, don't know, I, don't know how you see it, but it was declared. It's declared a pandemic by the World Health Organization. Today we have about a hundred 21,000 confirmed cases more than 100 countries have at least one confirmed case it's worldwide. We have 4,300 deaths and globally, mostly with adults with underlying health conditions. So you can see that over here, China has large cases followed by Italy, which caught up really quickly and that we have Iran South, Korea and France in Germany, and you can see that here and the United States on the right side 1039, as of March 11th found to Guelph. So, like I said before this was this slide was updated earlier today we have 53 cases in York City. Now we have over a thousand cases worldwide with California and other states. Oh, this is nice. Thank you. So, what's going on our presidents, Donald J Trump mr. Trump nominated mr. mr. pence as the leader of this novel coronavirus task force to lead to American response. It's actually under the National Security Council, that's pretty mean that's a. It means that's a big issue, so CDC developed the rapid test and they show travel warnings level three, which is avoid all non-essential travel to China, Italy, Iran and South Korea he's gonna. Have a press conference at nine o'clock, we'll see what happens and level to practice enhanced precautions in Japan? Basically, what CDC says is that if the country it has level two or higher people with pre-existing conditions shouldn't go there and what we're doing with maternal child returning travelers is that for foreign nationals who visited China or Iran in the past 14 days may not enter the u.s.. The ash get turned back at the airport. Green card holders and family of American citizens and green card holders are allowed entry and New Yorkers, who return to who returned from China Iran, Italy, South, Korea or Japan are being asked to stay at home for 14 days, where we told them don't go to work, don't go to school, don't go outside stay home so right now the New York City is identifying people who may have been exposed to the virus. They we investigate and we inform communities like yours and providers, so we're conducting enhanced surveillance, we're not stooping our phones or actually looking at different cases, we're also implementing federal monitoring requirements which happen to change ever so often or educating the public, we're providing guidance to health care providers, and we have good news. We can test at the Public Health Laboratory. So that's good. What you can do to help us! Please stay informed, prevent stigma and discrimination and we're going to teach you how to protect yourself and others from covert 19 stay informed. A lot of fake news going around. So please visit our website. New York, nyc.gov, slash health and CBC gov our site. Stopping can be easy to use we're pushing all sorts of guidance for business owners. You know: students, college students, New York, City employees, where we have all sorts of guidance. So there's a lot of fake news going around like I said before, and it happens to encourage stigma against a certain population. So you're gonna see a rise in hate crimes for people wearing masks or people being who they are and that's based on. You know stigma and, like I said before, misinformation of rumors cause fear bullying, derogatory comments on found exclusion from work in school. Let me give you an example: so a dog, the owner and the dog went to China and they came back and the owner wanted to send the dog to a puppy daycare. The hobby daycare said: oh, your dogs been to China, so he can't come because it may have the kernel virus and the dog has shunned and we have. We have various reports of bullying in schools, because their family members are reported to have traveled to different countries. That is not good and we have heard of people being excluded from work in school because they traveled overseas and I'm singling out people like that. It causes distrust we're trying to we're all in this together because we're trying to keep our city safe and it causes a lot of trouble and we're trying to prevent that. So do not harass or discriminate people against people who are face masks people were face, masks for a variety of reasons. You don't need to report anyone that you think may be infected we're getting a lot of complaints, we're getting a lot of calls through 301, saying that oh my neighbor traveled overseas. Therefore he may have the coronavirus. No, it doesn't work like that. We're keeping an eye on people it's illegal to discriminate, like I, said before, if you feel that you're being harassed you to race, nation of origin or other identities, please report this to 3-1-1 and say human rights. We investigate claims every can involve and impose fines. What can you do to protect yourself from kovin 19? This is important, but actually so wash your hands, often with soap and water for at least 20 seconds or use alcohol-based hand sanitizer. We suggest you to you actually wash your hands often compared to using the sanitizer, because the alcohol-based hand sanitizer, is just a stopgap because you're not close to a sink we're asking people to not shake hands. Unfortunately, so you bump elbows, you wave or you know you do whatever to avoid bodily contact, don't touch your face with unwashed hands, so you touch a surface and the subway and the bus, and then you touch your face with it. That's how you get sick, avoid close contact with people who are sick. If you're, coughing and sneezing it's needed to a tissue or interior sleep, don't do it on your hands, because you're gonna be touching something with it and I also get the flu vaccine and watch your health closely for fever and cough. This is our poster with the person covering his nose and mouth with tissue sneezing into the elbow and doing such and such so. The precautions are, we have are for older adults and people with chronic conditions. Such as lung disease, heart disease, diabetes, cancer or a weakened immune system, we ask them to yes, so should avoid unnecessary gatherings and events. People who feel who feel sick should not visit family or friends who have one of these conditions and, if you're feeling sick, please don't visit family in nursing homes or hospitals. If you are feeling sick, work from home and possible, avoid crowded trains or buses wait for the next one, I came too late. I came to work late today, but that's good. This is the new campaign that we're giving out we're introducing this to television. You know internet media and so forth. I have a couple copies here on the side: nice purple posters, giving you easy guidance on what to do at this time. You don't need to wear a face. Mask you mean to wear at the medical provider if your medical provider tells you to because masks are for sick people who should seek medical care if you're feeling sick, if you're feeling caught if you're coughing having shortness of breath. If you have a fever sore throat, if you don't feel better than 24 to 48 hours, seek medical care from your doctor, but here's the thing please call your doctor first go knock on his door or her door and say: listen, doctor, so-and-so, I'm, feeling, sick and you're coughin to his face. Please don't do that only visit an emergency department if you're, very sick, so 4 solve our neighbors and they may not have a doctor. They may not have insurance, they may be in a difficult situation: the New York City, Health and Hospitals facilities, they're prepared and we're, regardless of ability to pay regardless of status. We don't ask your questions, we're ready to treat. So if you have any questions, please call 3-1-1 and ask for medical care and, let's see yeah here are resources. And if you have any questions after this, please call 3-1-1 and say coronavirus and we you'll be connected with an operator that can help and that's it any questions. Yes, I. Do yes, please so. I have a good friend that was skiing in the Alps. The Italian Alps yes came home and experienced some of the symptoms. His doctor told him to quarantine himself at home and then it got progressively worse. So we made sure he got an ambulance and went to the hospital. Yes, there's only two ways you could go if you have these symptoms is bring yourself to the emergency room or call an ambulance. No one else will be able to transport you. So my question is he's been tested, but they haven't gotten the results. They said it takes 72 hours if he does test positive and he's in for treatment. Yes, whatever it is, because there is no treatment right and he returns home. Yes, how does he get his home cleaned? So the standard cleaning procedures are very similar to influenza and it's not like tuberculosis or measles, where, if someone coughs or you know, sneezes the part, don't stay in the air for tuberculosis, a measles, they stay in the air for hours upon hours. This is a droplet based transmission, so basically it stays in your saliva and your mucus, the excretions that come out from in your mouth and your nose. So when you sneeze what happens that water either lands on a surface or lands on the ground and when it's on the ground, you know you know it stays alive, for you know, cause some time and it dies, and by the time your friend comes home, the virus may it's probably dead, but just to make sure he should use a HT use, a bleach solution or any other disinfectant that he normally uses to clean the surface of the of the house surface, all the doors and everything and he should be okay. He wasn't exposed himself to it again. No okay, somebody else Kathy, yes, I was looking at the list of schools, private schools, yes enclosed and I'm 20 or 30 schools here in New, York City alone are closed and who makes the decision to close the public schools. And where are we with that? So public schools is a tricky decision, because so right now the mayor and the Chancellor said that closing the schools is the last option. It's the final option, because New York City public schools serve as a shelter serve as a place where children can actually learn. But they can also get food. Some school provide for laundry services about 750,000 students in the New York City school system are considered under poverty conditions. So if we do that, then the parents would have to stay home and they can't you know they can't make a living, so it would lead to lost wages, but in 2009 we conducted shutdowns observe several schools due to transmission in 2000 that we had two h1n1 influenza. So it's too early to tell I mean the people upstairs above my high grade above my pay grade they're coming up with the plan, maybe I'll read and I'll be read into it. If the situation really escalates to that point, but regardless we will keep your office and other community partners in the loop as well as elected officials. Thank you any other questions. Yes, occupation period, yes, sir. How long is that incubation period ranges from 2 days to 14 days depending on the immune system of the individual? Thank you. Thank you. Thank you very much Morris, it's my pleasure. Okay. So I'll continue with my report: introduce David, Russell and Benjamin Fogg David's from the Queens Chronicle and Benjamin is from the Queens ledger. Thank you for being here and we have a student watching us today and I can't read what he wrote so I'm. Sorry I can't recognize your name: okay, well housekeeping before I get to the report. Building demolition and construction notices; nothing in Glendale, nothing in Maspeth, six, nine to zero, juniper, Valley, Road middle villages at garage, nothing in Ridgewood, liquor, wine and beer license applications at renewals, new liquor license. You heard from table 142 LLC at 68, 38, Forest, Avenue Stauffer; indeed, fumo hookah, lounge, co-op, six to eight forest area; Ridgewood la casita, mexicana Inc doing business as they don't have one 6-2 3-6 Forest, Avenue, Ridgewood liquor, license renewals, 1563 Decatur, cafe, LLC, doing business as Houdini kitchen laboratory, 1563, Decatur, Street, Ridgewood, great pizza, Romeo food corporation, doing business as El Manabe restaurant 341, st. Nicholas, Avenue Ridgewood, the Avenue restaurant Bar and Grill seven, one two myrtle avenue: Glendale DMI Inc - business as a knockdown Center, five, two one: nine Flushing Avenue Maspeth, eight six, one la rubia, restaurant corporation, eight, six, one Wyckoff Avenue, no new wine and beer licenses. Wine and beer license renewals, Tendo, sushi Inc, six, two six Fresh Pond Road. We have minutes and they're pretty thick, there's a lot in there. What's your pleasure on two minutes: Kathy Massey, second, by Walter Clayton, all in favor, okay, the executive committee met early earlier. This evening we received a revised up-to-date festival event for Fresh Pond Road from michael hyatt of metro, meteor festivals, inc. The revised event is the Fresh Pond Road Street festival. Setup date is nine three 2020 at noon. Events thought nine for 20 25 30. It will operate nine five, thirty to ten and ninety-six from noon, I believe it's noon to ten and it will break down after 10:00 p.m. on a sixth. The committee met reviewed it and we have no position on the matter Walter. Could you wait till after they think yeah? They took him under I, think new business or old business, whatever alright, a reminder: Queens Brooklyn and New York Public Library's, as of the 13th of this month, will suspend all programs, events, classes and workshops to further notice. Our next board meeting because of the religious holidays, will be April, Tuesday, April, 7th, okay, because this place is closed and we don't meet on Jewish holidays. You know what I guess I will take your motion: Walter Sanchez! Thank you, Thank You Vincent, the executive committee, I believe, was four to four. We vote for four in favor, four against the application, so I'd like to make a motion about this festival that we have no objection to the festival. The motion is that we have no objection to the festival as amended, and you know in speaking, for that I was at the festival. They've run it without problems without issues without police issues, without calls to the community board. There are two ways to get up and down forests and traffic, as was explained earlier, the 60th Orion. It was, as was explained earlier- and you know, we've spoken about this before they've run it for dozens of years at least a dozen years, and they have given back to the community. It's a wonderful festival. People are happy. We close down Fresh Pond Road for four days and I think that we should have no objection to this festival. Do we have a second I like to second that, okay to Walters on the question? Anyone on the question? If there's no question, you want to read from the bottom up, so I, don't all right! So my Killeen vondre --then Patrick's friend Chazy Denis Stefan, Walter, Sanchez, Luis, Rodriguez Ted runs Mike Porcelli Don pass Santino Michael okhane Peggy okhane, Eileen, Maloney, Kathy, Massey, Edgar, Mantell, John, Mayer, ed Lu, Tao, Marianne, Lattanzi, Oh, porkers. Now Ritchie bird Steve Fiedler Demetriou fikowski Jerry Drake Brian, Dooley, Pat, Crowley, Walter, Clayton, Bob, Chameli, Tony Benanti, mr. Rock Harry, whoa. Well he's doing the count. Is there anything you have or questions or comments for the chair? Anyone? Okay, the other vote is 16 in favor of the proposed four-day street festival on freshman road 11 against no intentions, none now go. Thank you. I'd like to introduce Gary Giordano, a district manager where's. The report. I will be brief, but as far as this coronavirus goes, the spread of it is much more quick than I could have imagined. So it's like an example of let's not take things lightly when it didn't seem like much here in the beginning and I want to thank Jessica for being here from the mayor's office they've. Given us a lot of good updates, as far as where the situation is at any point in time, so they've been right on top of this. As far as I can see, I don't agree with the mayor with everything, but on this I think they've been very good, as has the Health, Department and I wish that nationally, we were as on the ball as we seem to be in New York City, a couple of other things on a maybe I, wouldn't say a lighter note, but maybe a more positive note. So we have a new sanitation super. His name is William Miley. He replaced Charles smiler, who was also excellent, as our sanitation super came in to see us right away and I've seen conditions getting better and better and a lot of the worst dumped out locations. Finally, maybe the sewer project and the water main project is coming to a conclusion in that penelope, Avenue 74th, Street area that we've been talking about for so long where there was a big delay because of toxic soil found in a portion of that project, and they had a increase, the budget by eight million dollars and so they're starting to do the curb and sidewalk work on 74th, Street, beginning I, think Monday, big problem we have citywide is crime. Is up significantly and more significantly than it has been in my memory at one time? How much of this is due to not just what's happening with bail reform, but the message that I think it may have sent to people now looking to do the right thing or looking to do criminal activity may be a bigger part of the problem. Then, actually people not being held on bail to the extent that they were that message that it says. Stephen Feliz got some report with regards to the parks committee and star playground. The library committee is going to need on Monday at the Ridgewood library and the Public Safety Committee is going to meet at the board office on Monday any questions. Okay, I. Thank you thank you for being here and please, let's stay healthy, take good care! Thank you. The first committee to report is Parks Steve, for you have a report. So we met the other night parks. Department came down and gave us a presentation for 2.3 million Phase, two of us star park, which would be spray shower, which star park down on the dolphin star spray shower play area. Seating areas, a very nice layout, we had some, we had some input from the people who live around a park asking for different items. Another slide for them. Remember it's a very tight area and they also have trees that they can't touch so, and it was pretty good presentation and everybody on the board liked what they saw right, yeah I think so. The only other thing I got a letter back from a Kip star. Kip Stein, who is in charge of NRG, will be doing the 2.3 million dollar removal of invasive species in 1 & 3. To reiterate that we do not want any heavy equipment bobcats or anything like that in a basement. If the contract that suggests anything to him about bringing in a bobcat or a steerer to take down the invasive species, they will check with their project manager and they will get back to this board and the parks committee to see if we would agree to it or not. We will not agree to it. We'd like for rights right now is trying to find a destination. Okay. They want to put it down below on the four fields and they said that it's too difficult to deal with all the permit holders for two days they wanted to go up to the little park and there's going to be construction up there soon for a memorial garden, fatah Magna Benny, so that canceled that so they're offering them Elmer's, Park and I believe there's a few other things into work right now, but there's no destination yet for Relay for Life at juniper Valley this year. Thank you thank you and it's just the tip of the iceberg. As we predicted once we started rehabilitation of juniper track-and-field that we'd have problems public transit services, john transportation, I mean I'm gonna, keep people too long. I was just gonna say our meeting was here on the 25th of February. It was a presentation from the folks at New, York, City Transit that are doing the bus redesign. It was informative, it we were able to voice a number of concerns we have with their current approach. We feel that we were heard, but we are going to be meeting again at the end of this month. On the 31st, which we are going to have a moment to speak to the Wyckoff Avenue project, but we are going to start to formulate our response back to them because we would like to get them our comments by April when they're hoping to collect people's comments. As the councilmember said, they had another workshop here just last night. They are having ongoing meetings with elected officials, community organizations. There is an active website that people can put their thoughts and ideas into and I recommend you do that, even if we catch what you're trying to say, because you've already told us one of the things that we need to say to them. It doesn't hurt to have them here at multiple times, the more we can repeat it, the better for us and we did lose a lot of residential service in this community board, and they need to hear that and they need to do something to address that. On that note, we sorry, if you just basically put in a search engine, Queen's bus redesign, MTA your to get their website I'm, not going to try to give you a URL that I might get wrong, but I. That's how I find it I. You know. I just do Queens bus route redesign. Yes, they have some very interactive maps. The website has the whole plan. They have multi page kind of presentations on each of the proposed lines, as well as two maps interactive maps that you can kind of manipulate. You can turn everything off and turn on the lines that you're interested in looking at. It has some rough estimates of what they're looking at headways and where those routes fall and there's one for the express routes and there's one for the local routes, traffic safety request and discuss those Walter sent people from Maspeth above principie Park on 54th Avenue came and asked for a one-way. What were you guys? Looking into that? What's happening with that? There's multiple requests in that area Gary take the mic. Don't we are asking for an area wide study, because I think a lot of the committee members felt that there was no easy solution over there were other requests in the area. I just had one today that we looked at they came in so can I also just throw in. We were one of our committee members who lives in that area is also going to look at some of it, but our recommendation first off was for the board to request an area wide study for that area. Okay and I live on that block -. So, okay take a look: okay, any other committees that I fail to recognize: okay, any old business. We took care of you right and any new business. Yes, any word on the Amazon moving into. So we know at this point is that they are plant they've signed a lease to utilize, the space that was Toys, R, Us and Kmart, the Kmart being a much bigger space and another space. That's adjacent to that I think was a storage site for the Museum of Modern, Art I. Think it's three hundred thousand square feet, I'm, not sure at this stage with regard to timetable, but as far as they're moving as far as they're moving in it would be typical material in sorting and distribution correction. So the question I, don't know if you got that John. The question is when we reviewed the prior request for that property to allow them to put in loading docks on the east end. We don't know if that, if we don't know if that's necessary for Amazon and we're gonna, probably try and meet with them, Jonathan can I just correct something that Gary said it was actually the Metropolitan Museum had their catalog warehouse, so they were basically receiving merchandise for the store at the main Museum, as well as shipping stuff out for orders at one time that space is what's been consumed next to the Toys R Us and the Kmart space, and with that it actually gives them quite a few trucks lots. So they might not need to do anything with the other side and, let's hope, that's the case, correct. If you know how warehousing and shipping works you come in with the raw product, you offload that it goes through distribution and handling, and then it gets to a shipping and amazon has gone to franchise. You see the little prime trucks most of those are now franchisees. So if those are the ones that are going to be delivering, they don't need a massive loading dock because they don't have a high-end tail, so they should be able to pull in and pull out so yeah, it's going to be the beehive for all those prime vans very likely about the traffic. That's why I think. Besides the front loading docks on Metropolitan Avenue I believe that, on the lower level just needed a furniture store, there was some lift loading docks wooden elevator in there. So if you remember going into what was it just the store on the left? Not toys arrested I believe that it was silly Kmart had and elevated. It went down because that's how I came on got their product, that's how they got their product. Up to the first floor. They had the two loading docks in the bottom. No, they used loading, docks behind Toys R Us and brought it around the back of Toys R Us like behind it within the structure. The structure is built so the first. The top floor is not connected to the lower level in any way, shape or form anything else. Yes, microphone. It doesn't work without a microphone. Yeah I just wanted to mention one thing with the coronavirus and all that stuff everybody, a lot of organizations taking a lot of precautions and what's happening is a lot of events are being canceled and that kind of thing so I heard today that you know some of these st. Baldrick's events were canceled and a bunch of other charity. Events were canceled. So just if the board members keep that in mind that if your favorite charities or your local charities are forced to cancel, events still give to them, I mean because they're going to be hurting when they don't have some of these events. You know they only come once a year and they're big moneymakers. So keep that in mind. Please write a check mail to them and I think you know. It'll help. Keep these organizations going and since they canceled the st. Patrick's Day parade I'll, make a real effort to support the local pubs, just make sure you drink greater than fifty proof. Any other proof come before us. A motion to adjourn Walter is seconded to meet Road all in favor. Thank you. Stay healthy, I do hope. The media got that quote. She's got some shopping bags hold that up.",
        "summary": "The next order of business is the public forum Do. We have that sign-in sheet for the public forum No more than three minutes, no foul language, no personal attacks, Richie So, the first person to speak tonight on the public forum This is the last time that you're gonna hear about this, but it's a very important issue, I'm sure by now everyone's aware how hard that cures has been advocating for the containerization of waste coming from a long island to many years, the bill supporting their efforts was finally moved out of committee in the Senate for a floor vote However in the assembly.\nBut I am here because I wanted to say farewell as I promised a few months ago when I first came before you to introduce myself to some of you or to say hello again to some of you promised that I'd be back in March, but since I have the mic in front of me, I'd like to remind you of two things and things that you already know, but I want to make sure that they're at the forefront, because there's a lot going on right now in our borough number one We have a special election coming up, despite all the uncertainties that are happening right now, it is still on and it's still scheduled for March 24 We will elect our next borough president into office and that's March.\nEarly voting begins this Saturday thanks for that check and then March 24 is the actual special election and as we know, we don't vote you just don't matter What are we gonna do and then, a few weeks later in June we've got a statewide primary where we will again elect our borough.\nI firmly believe that the future of New York is Queens, but our future is counting on being counted and that we matter and that we're visible, and so it is just critically important, fortunately had nothing to do with the Covid-19 19 or any other things that are before us right now This is the first time that it will be online and the way that they're strategizing the census count.\nEveryone needs to be counted, it's censusgov, but we actually urge you to come to Queens VP org, and so those are the two things that I wanted to put before you front and center On your mind, in addition to all the great things on the agenda, but thank you for your indulgence for allowing me to just say hello and farewell, as I promised, not necessarily I plan to move out of the way as students We elect our borough president and they are sworn into office because they certainly won't have a lot of time before their June primary.\nThe borough board just voted a few weeks ago on the Queen's budget priorities for fiscal year 2021, and we submitted it to the mayor and the City Council, but there are three areas in particular and I.\nWe were writing to all community boards around New, York City, and actually you guys were the first to say yes and to invite us to this meeting So. The idea what's parka bill is portable is trying to create a peer-to-peer community based mobile application for drivers in the cities like New York City, so two drivers can exchange free street parking spot between each other, so how it works is as soon as the driver finds a parking spot in the street.\nWe are talking about not meter, just the free parking spot as soon as the driver finds the parking in the street He parks in the application detects its location and ask the driver to share his departure time in the future, and his parking spot was a departure time in the future would be shown as available spot in the future to all other drivers who are coming to this neighborhood in search of parking It's very easy and the drivers can chat with each other, communicate with each other, and they can request pre request parking spots in the areas they're going in the future beforehand.\nMore We also address the same issue: the Department of Transportation of the New York City, and we just some general answers and in one of the conversations over the phone, the representative of the D-O-T told us that they are not interested at the moment because they consider themselves as a revenue bringing organization revenue bringing branch They concern They are concerned only about metered parking, not free street parking, but we're confident that in the nearest future, we'll also find some common points of touch and try to communicate our idea to them The reason we're here today is just to know to first of all we're just getting our first users early adopters of the application around New, York City, and also to find out what are the best ways to interact with the community boards.\nI recently moved my place of business San Cong to 6575 traffic avenue But during my time there there's been like five or six incidents of illegal dumping, of just piles of wood and possibly sometimes furniture, bed, bedding and I assume all that dumping is because the place looks like a and abandoned lot because of all the garbage and the vehicles that don't move there are kind of contributing to it as well, because I believe there are a couple instances of abandoned vehicles.\nYes, so you support the gentleman's request and you could articulate that to the Sanitation Services Committee, it's not as bad as it was, but there are still people who've come to do everything That's, illegal, immoral or fattening on traffic area, , we did to share those with enforcement So it's something to also recommend that you would be open to them and they'll come in like at midnight when everyone's asleep and then just dump a pile of wood and just dry off You could do the requesting committee We may ask you for discs that we could share a problem If the foster care and preventive agency I'm.\nThank, you all again for coming like to introduce his staff, pressing Cathy, O'leary Laura Mulvihill, just a granted - Gary Giordano, representing the borough president, is Jonah I'm sure you'll wait a little bit while I introduce police officers Barrish and Perez, and Sanada and Sergeant rain premium right good evening, we're up by one case: robberies we're up by 4 felony assaults up by 12, burglaries up like We , do have a robbery condition going on mainly in Ridgewood water in the area.\nSome people You know they're going to switch our phones if we have to if we get to that point to our personal cell phones, which that will work too, but we need to be there in the offices to answer not only answer calls but to meet with constituents But there is talk about this virus spreading to the point where we'll have to shut down, and even community boards might have to shut down.\nIf you have a cold, don't go out, and if you feel that you know it's a non-essential meeting don't go, and some people feel that sporting events should be canceled because I was at the garden the other night for the Ranger game they lost You know it came into my mind that there's a decent large gathering, 15,000 people or more does cause concern that this will spread the virus even much faster The City Council is talking about a lot of things, we're taking it very seriously, and we have to show leadership here and certainly my office will answer any questions, but we're trying to desperately get more testing kits and get more testing sites.\nBut to me I felt this is not a place to live, This, look more like a minimum security jail and that's the feeling and I'm concerned just the mentality of building this kind of facility to house 200 men and they're going to be they're protected inside that facility, with a heavy security force But what about outside and the community?\nI've asked a priest in to address a lot of the commercial overnights in the area, the illegal parking that we see on a regular basis, and then he also mentioned something that we need a procedure with parochial schools, especially because the public schools have a safety procedure in place, the parochial schools, as we witness they really don't, and if central command, that's the people that actually send out the cars from the precinct or from the in the neighborhood here when they hear a school is involved and there's a safety concern you're suspicious man outside of school.\nRikers is a part of Queens, so we directly said: Are they coming from Rikers and they're using it as a halfway house single most important thing: we've had to deal with as a community board in the past five years.\nThey we investigate and we inform communities like yours and providers, so we're conducting enhanced surveillance, we're not stooping our phones or actually looking at different cases, we're also implementing federal monitoring requirements which happen to change ever so often or educating the public, we're providing guidance to health care providers, and we have good news and we're going to teach you how to protect yourself and others from covert 19 stay informed, New, York, nycgov, slash health and CBC gov.\nand you know, we've spoken about this before they've run it for dozens of years, at least a dozen years, and they have given back to the community Do. We have a second I like to second that There's no question: you want to read from the bottom up, so The other vote is 16 in favor of the proposed four-day street festival on freshman road 11 against no intentions, none now go The report.\nIt was a presentation from the folks at New, York, City Transit that are doing the bus redesign On, the 31st, which we are going to have a moment to speak to the Wyckoff Avenue project, but we are going to start to formulate our response back to them because we would like to get them our comments by April when they're hoping to collect people's comments.\nThere is an active website that people can put their thoughts and ideas into and we did lose a lot of residential service in this community board That note, we sorry if you just basically put in a search engine, Queen's bus redesign, MTA your to get their website.\nIt has some rough estimates of what they're looking at headways and where those routes fall and there's one for the local routes, traffic safety request and discuss those Walter sent people from Maspeth above principie Park on 54th Avenue , There's, multiple requests in that area We are asking for an area wide study, because I think a lot of the committee members felt that there was no easy solution over."
    }
}