{
    "data": {
        "YoutubeMetadata": {
            "author": "BXCB11",
            "channelId": "https://www.youtube.com/channel/UCG-BOeUcviapIkDFQfxLuiA",
            "title": "Full Board Continued",
            "publishDate": "2020-11-30",
            "shortDescription": "",
            "lengthSeconds": "0:10:41"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BXCB11",
            "normalizedName": "Bronx Community Board 11",
            "twitterName": null,
            "youtubeChannelName": "Bronx Community Board 11",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCG-BOeUcviapIkDFQfxLuiA",
            "twitterHandle": null,
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "T4cSgJhI3Tc",
            "fillerWordCount": {
                "uh": 19,
                "um": 14
            },
            "readTimeFullTranscript": "6 min read",
            "readTimeSummary": "2 min read",
            "wordCountFullTranscript": {
                "calendar": 12,
                "complaint": 5,
                "links": 5,
                "program": 5,
                "staff": 4,
                "laws": 4,
                "details": 4,
                "pdf": 4,
                "complaints": 3,
                "incidents": 3
            },
            "wordCountSummary": {
                "calendar": 8,
                "agendas": 3,
                "staff": 2,
                "instructions": 2,
                "second": 1,
                "guidelines": 1,
                "motions": 1,
                "complaint": 1,
                "incidents": 1,
                "22nd": 1
            },
            "fullTranscript": "Pm, do you want to work actually we'll get started, because this is it's going to be recorded and it's going to be available, so we'll get started so we're out of executive session and we have a few complaints. Some of the complaints were closed. Complaints regarding incidents that occurred on March, 4th, 2020, April, 14, 2020, June, 11 and June 16 2020 were closed. No further action was warranted. Additionally, another complaint that was that occurred on October 5th. The incident occurred on October 5th. It was partially substantiated, but no action is warranted. The committee closed the complaint. There are three other motions that we will make: referencing specific dates of incidents, so I'll call for a motion for complaints that are alleged on the October 22nd 2019 May, 15th, August, 26 and August 27th of 2020. The committee recommends that FOIL guidelines be distributed to all community members and staff. That was the recommendation. We do not need a second for this motion: community board members, not community members, oh yeah, community, Board, member, sorry, good Point, Community, board members and staff, so the FOIL guidelines will be distributed to community board members and staff discussion, okay, anyone abstaining or anyone against all right, so I'm gonna say that passes unanimously. We still have the number of people that we need in here to make it happen all right. So second motion regarding complaint: an alleged incident on July 17 2020. The committee recommends that social media policy be distributed to all community board members and staff. No second is required discussion. Anyone abstaining or anyone against Okay passes unanimously and the last one for tonight, motions regarding the complaint on alleged incidents that have been occurring, I guess since March 22nd of 2020 this year. Up until this point that complaint was submitted on October 22nd 2020. The committee recommends that dial in options and instructions be included in invites in meeting, invites whether it's committee meeting or General Board meeting and that the calendar is updated routinely and that the community board will comply with all open meeting laws. No second is necessary for discussion. I have questions Jeremy. What do you mean by routinely for the calendar, since I'm going to be the one doing this? Okay, there we go, I would say a reasonable time. If a if, for example, a committee meeting is set up and the information is updated with the dial-in option within an appropriate time, it should be at least follow the open laws and be done within 72 hours. Let's put it that way. Okay, so yeah I mean we're. Gonna have to work out details you mean no later than 72 hours prior, not within yeah no later yeah, and we as I've put out before just remember that we in reality at this point, we need a lot more than 72 hours, because you know the I'm relying on the city like I, said earlier: I emailed them minutes last Friday that still haven't been published yet so I mean all right. You know what we're definitely going to have to work out details on this and we'll establish that I think we all agree that we need to get some procedure in place with all these things and I. Think for minutes. I don't know if we need city hall clearance or city clearance for it, but for minutes that we probably do, but I'm not sure but I think there is procedure that needs to be established, and we should develop that as we go along as long as in accordance with all laws and requirements. Sorry I don't want to take up too much time. I just want we're. Gonna have to work out some of these details. That's all I mean honestly I, don't think it's that difficult, there's a calendar that you is posted for each month and we everybody knows when the meetings are supposed to happen, like this meeting happens on the fourth Thursday of every month, well of most months, so in that calendar and instead of waiting for the agenda to be posted, why don't we make sure that, in that calendar that monthly calendar, the links with the dialing numbers are posted and that's how you get around any issues with agendas being posted or when it's being posted, so that calendar is very limited in its ability, you're talking about calendar with the instructions or the agendas with the instructions, because they're, two different things, the calendar and the agendas right, I know they're different things. That's why I'm saying why can't you just post it on the calendar, because it's that I don't have that ability, because that program which we've been using prior to me being district manager does not have a p I can't make I have to do that. Calendar I can't make it I can't directly turn it into a pdf. That program is very old. It's from like 2005. I. We can look into getting a different program, but I can't the only thing I can do is make it a I can't make it a pdf where you can click on a link or anything like that, all right. So again, I think this is more stuff we're going to have to progressively put into it. We need to get a new program, we'll get a new program, but we have to be in compliance with all rules and regulations and laws. So you know. Ideally we do want all the links and everything if the like it said if it can be populated several months in advance because there's regular routine meetings that just need to be modified as things change, we can do that, but we can have a calendar set with our regular dates down, and you know links actually put in if we need to get new software to do that. Just takes away people complaining about stuff. So, let's just do what we need to do to get it covered and I know it's not going to happen overnight and we'll continue discussions on how to get there. Thank you can I just say one quick thing about something like that: Jeremy I know that if you do a calendar with a pdf, even if you do it in word, you can export it with links. I, don't know! If that's something that, if you can't do it on the website, because it is a jpeg that you'd be able to do a pdf that has all the links in and send it to everybody which might be easier, and you could do that with word. So what were other details? Okay, it's just an idea. Okay, any further discussion, no second is required. Now we'll go to anyone, abstaining or anyone against okay. The motion passes unanimously so again, to recap: three motions passed unanimously and a few were closed with all that being said, I don't have anything else for the Ethics Committee Jeremy I, guess that was basically old business. Do you want to take over from here? It's all business new business. Does anybody have anything I, don't think we have a quorum at this point. In fact, then we don't, but so here yeah so beating it at 10:57 p.m, because we have a quarter. Sorry 10:57 either way sounds good. Thank you. Everyone really appreciate you. All right have a good night, everyone all right! Thank you, happy Thanksgiving and say happy person thanks, bye, guys goodbye.",
            "summary": "We do not need a second for this motion: community board members, not community members, oh yeah, community, Board, member, sorry, good Point, Community, board members and staff, so the FOIL guidelines will be distributed to community board members and staff, discussion, okay, anyone abstaining or anyone against all right, so I'm gonna say that passes.\nAnyone, abstaining or anyone against Okay passes unanimously and the last one for tonight, motions regarding the complaint on alleged incidents that have been occurring, I guess since March 22nd of 2020, this year.\nDo you mean by routinely for the calendar, since I'm, going to be the one doing this.\nWe as I've put out before just remember that we in reality at this point, We need a lot more than 72 hours, because you know the I'm relying on the city like I, said earlier.\nThere's a calendar that you is posted for each month and we everybody knows when the meetings are supposed to happen, like this meeting happens on the fourth Thursday of every month, well of most months, So in that calendar, and instead of waiting for the agenda to be posted, why don't we make sure that, in that calendar that monthly calendar, the links with the dialing numbers are posted and that's how you get around any issues with agendas being posted or when it's being posted, so that calendar is very limited in its ability, you're talking about calendar with the instructions or the agendas with the instructions, because they're, two different things, the calendar and the agendas."
        }
    }
}