{
    "YoutubeMetadata": {
        "author": "BCB14",
        "channelId": "https://www.youtube.com/channel/UCHXJOh2dSnYbneMYwkc6zZQ",
        "title": "Human Services Committe Meeting",
        "publishDate": "2020-06-10",
        "shortDescription": "Community Board 14 Brooklyn\\nHuman Services Committee Meeting\\nTuesday, June 9, 2020\\n5:30 PM"
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "BCB14",
        "normalizedName": "Brooklyn Community Board 14",
        "twitterName": "Brooklyn Community Board 14",
        "youtubeChannelName": "Brooklyn Community Board 14",
        "youtubeChannelURL": "https://www.youtube.com/channel/UC_BAkpXTYFoKdHVRvswVgtg",
        "twitterHandle": NaN,
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "Allowed us to look at how much money we were losing per non-responder and we know that individually. Each person is four thousand so it'd be you know it wouldn't be a heavy lift to show comparison and then again you know try to really tie that into current events where we have, you know I pandemic, and you know we, you know well, I, would say Nassau and New, York, City and Suffolk. You know we're all pretty heavily hit, and so, if you drive home the current events with the loss of funding regarding health care alone, that's something that we can think about pushing it. I think as much as we can use very current events in the messaging I. Think you'll just grab people's attention at this point, because it's everywhere, especially you know, all of the room that we had taken up in the links system was, you know. Basically, the census messaging was sort of moved aside for Public Health statements regarding cope in nineteen. So but yeah I mean it's, you know making it a competition is one way, I'm really curious to see what is gonna borrow at the Brooklyn complete count committee meeting, so that will also drive the conversation a little bit I'm going to promise to do one thing and then share an idea of something that we might. But one thing is I will look back to all of the foodie based organizations that attended our nonprofit round table and get the information that was shared here today to them and ensure that they're maintaining connection new to census activities and support them were there or they're finding a loss in their capacity to do so and just see. If we can, we can shake that tree a little bit right now. I was also thinking with the various messaging ideas and the fact that you know there are events and efforts in process that we might- and this is where I'm not gonna promise, but maybe you mean word 14 can put together another newsletter. We've done a few of them since we've been working from home and onions been great about getting them together. I'm in for matching them, but maybe, instead of just being written strictly from CD 14 I'll reach out to those of you, who've, been out there continuing to work on this and ask for some contributions to it and then we'll take those contributions, put them into a newsletter with their various messages, the various approaches and their various for local outreach abilities and then we'll see if we can distribute that far and light. So those are, those are two sort of action items that I'm taking away from you on this conversation news. The contributions in the newsletter is a great idea. Sean all right to be continued to beauty. I, don't see any other questions from the participants. If we don't have any anything else, I wanted to just start by thanking Amy for updating us on the library's activities and what we can expect in the future, and thanks to Shelley for updating us on the bureau and their activities and the timeline for you know federal census activities and then I want to thank all of you that joined us here today, because many of you are the ones that are doing a heavy lift and we haven't been able to meet since March. So I'm really happy that we've been able to see each other again, you've been all abet, virtually I'll even start my video and Joanne thanks to you for being a committee co-chair extraordinaire and then just if I could also adequate thanks to mark multiple we're hosting these meetings. For us, it's a lot of work, so we appreciate you doing the list for us. You don't think how much and thank you Anya and the staff. Thank you so much so, let's see you again. We have the Brooklyn complete count. Committee has a meeting tomorrow at 11:00 a.m. so. Let's see you know what the direction is going to be and everyone please stay safe, and hopefully we can get to phase two very quickly, a reopening, it's nice to see everyone. Thank you. Thank you.",
        "summary": ""
    }
}