{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UCXwRxm0zS0jBNTMOVI6xZJw",
            "title": "Know Your Workplace Rights During Covid-19: Workplace Resources Town Hall with Commissioner Salas",
            "publishDate": "2020-08-04",
            "shortDescription": "This video is from Manhattan Community Board 3’s August 3, 2020 Town Hall with Commissioner Lorelei Salas from the NYC Department of Consumer and Worker Protections. The town hall was co-sponsored by NYC Council Members Margaret Chin and Carlina Rivera. Below are the various resources mentioned during the town hall:\\n• DCWP has new educational resources for workers including an overview of their rights as they return to work in Phase 1,   Phase 2 , Phase 3 and Phase 4. Please visit nyc.gov/workers\\n• We encourage everyone to make an appointment for free financial counseling available by phone.  Visit nyc.gov/talkmoney\\n• Workers with reopening questions can call 311 and ask for the Worker Protection Hotline. You can also visit nyc.gov/workers.\\n• For more information or questions about DCWP's Office of Labor, Policy and Standards call 311 or email OLPS@dca.nyc.gov\\n• https://www1.nyc.gov/nycbusiness/article/free-face-coverings\\n• https://www1.nyc.gov/assets/dca/downloads/pdf/workers/NYC-Business-Reopening-Phase2-WhatWorkersNeedToKnow.pdf\\n• https://www1.nyc.gov/assets/dca/downloads/pdf/workers/NYC-Business-Reopening-Phase3-WhatWorkersNeedToKnow.pdf\\n• Information on the Freelancer Isn't Free Act https://www1.nyc.gov/site/dca/about/freelance-isnt-free-act.page\\n• You may use accrued sick time under NYC’s Paid Safe and Sick Leave Law because your childcare provider is closed due to a public health emergency. https://paidfamilyleave.ny.gov/\\n• Detailed industry specific guidance is on https://forward.ny.gov/\\n• https://www1.nyc.gov/assets/cchr/downloads/pdf/AgeDiscriminationGuide_COVIDSupplement_2020_Final.pdf\\n• You can also call 311 for the Worker Protection Hotline or 1-212-436-0381 with questions about reopening, health and safety guidelines for the workplace, or to report an employer that is not following reopening requirements."
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 97,
            "um": 186
        },
        "wordCountFullTranscript": {
            "workers": 40,
            "people": 25,
            "business": 24,
            "time": 23,
            "employer": 23,
            "law": 23,
            "work": 22,
            "employees": 22,
            "questions": 21,
            "state": 21
        },
        "wordCountSummary": {
            "workers": 5,
            "laws": 5,
            "work": 5,
            "right": 5,
            "employers": 5,
            "employees": 5,
            "rights": 4,
            "city": 4,
            "lot": 4,
            "department": 3
        },
        "fullTranscript": "Hey michael yeah, she's gonna. Try again, I guess, with the zoom link that we that you guys had shared okay, so one of them yeah. Why don't we get yeah and if she joins, we will add yeah she's able to join, but I don't want to hold this up much longer since we're already 10 minutes into our hour, so yeah all right. So welcome everybody to our town hall on workers rights. We are very excited to have laura lysalis with us. The commissioner of the consumer department of consumer worker protections, as well as our two council members for community board. Three margaret chin, carlina rivera, I'm going to quickly just explain to people how to get into the interpretation before the event, and then our chinese, orlando interpreter, we'll repeat that, and then we will start the interpretation room right now. Our spanish interpreter is having some technical difficulties. So if you need under an interpretation, you just go down to the bottom, where the toolbar is and click on the globe icon and select chinese for the mandarin interpretation. And then you will hear the rest of the town hall in mandarin. Okay interpretation rooms have been turned on we'll give people a minute to get into their rooms, so while people are getting into their rooms, my name is mike moreno. I'm the first vice chair of community board, three I'll, be moderating some of the discussion tonight we have about a dozen or so questions that were sent in advance. But if you have a question for the commissioner, please use the q a feature or the chat feature. She's got some of her staff on the town hall tonight as well. That can be fielding some questions in the chat as needed, but we're going to start with some opening remarks from our two council members. So we'll start with council member chin. Thank you, michael. I'm really impressed with the translation service, and I wanted to thank commissioners alice, my fellow councilmember helena, rivera and Manhattan board three for partnering with my office to hold this educational town hall, as our city continue to reopen. This hound call is occurring at a perfect time. You know. Just last week, the council passed legislation to officially change the department of consumer affairs name to department of consumer and worker protection, and with that comes a bigger mission and in addition, the new york city commission, on human rights issue, legal guidance on age discrimination. You know the workplace is constantly changing and age stereotypes affects all of us, whether it's being too old or too young for a job, but now cover 19, has doubled the pressure on all the workers to adapt to a new job expectation and economics. Reality you're the new guidance outline do's and don'ts from the job posting and the hiring practice to discrimination in the workplace all the way to retirement. For example, an employer cannot ask you how old you are during your interview. An employer cannot allow an environment where all the workers or younger workers are single out and pass over for opportunities because of their age, and an employer cannot force you to retire at a specific age unless is legally mandated. So while this is a step in the right direction, there's still so much more work to be done. So no one should feel uncomfortable or threatened in their workplace because of who they are. Let's work together to make sure new yorkers know what their rights are, and I look forward to hearing how the department of consumer and worker protection will be an ally to report any instance of discrimination and hold people accountable, and I wanted to thank everyone for being here today. Thanks. Thank you, margaret and now we'll hear from our council member carlina rivera, hey everyone good evening. I just want to thank you, michael of course, and community board 3 and my colleague councilmember chen, who I just can't wait to see in person sometime soon and of course, commissioner salas for all the work that you have done. You've been in my district multiple times, really trying to listen and reach out to people proactively, whether business owner or worker. So I'm just so glad that we can come together. For this know, your rights town hall, I'm very excited to share and also learn about all the city resources we have to support new yorkers and small businesses that are currently suffering. I know it's a very confusing time for every working new yorker and those who are underemployed or even seeking some sort of supplemental income or employment. The future of the federal unemployment benefits is really uncertain, and the public health landscape feels like it changes every single day, and I also know that the current pandemic has hit some of my district's beloved mom and pop stores really hard, and it breaks my heart because we know that small businesses are the lifeblood of our communities. This pandemic has exacerbated existing inequalities, making it harder for part-time, immigrant and day workers to find and maintain a source of income, and, as we've seen, our undocumented new yorkers have been left out of that type of assistance. I, along with my colleagues here today and committed to fighting for the necessary protections for all new yorkers, especially our essential workers and local businesses. We worked in the city council to pass my bill on personal liability protections for small businesses and we have pushed for legislation to be passed to give workers stronger rights during covent 19., but there are also a number of tools out there right now that may help you at your place of employment or may help you find employment during this pandemic. So many of my constituents have questions and I think they've submitted a couple of them about safely reopening and returning to work. So I hope that we can answer all of those questions today, whether you are an essential or non-essential worker. I know we all deserve the right to be safe in our workplaces and have a place to contact if our workplace isn't following the rules. So thank you all again for being here today and I'm looking forward to an informative discussion. Thank you, councilmember rivera, as I mentioned before, we have about a dozen or so questions that were submitted in advance that we will get to, but first it's my distinct honor to introduce commissioner masalas, who will give us a brief overview about the department of consumer and worker protection. Commissioner, thank you so much good evening. Everyone thank you michael and council members, chin and rivera for hosting this town hall. It is so very important for us to be bringing information into the hands of our communities when they need it most, and I really encourage the audience to ask questions and follow up. I have two members of my team joining today: tangila rahman, who works on all the outreach for the office and ben holt who's, the deputy commissioner for the office of labor policy and standards, and will help me to supplement some of the answers and or answer better than me in many cases. But you know they're here right now, but even after today, please reach out to us. I know that we're going to post our contact information, because this is right now a process of continuing to have more and more information every day. There are new things that are happening and we want to make sure that our new york city residents are getting trusted information from the right sources. So I appreciate tonight's invitation a couple of things about the agency and, yes, we have recently been officially renamed. Thank you to the council for naming us department of consumer and worker protection. As our name implies. We do enforce the laws in new york city that protect both consumers and workers. During this pandemic we have seen a number of issues come up with regards to consumers and you probably have been aware of some of the price gouging issues we've seen in our communities. We want to make sure that the products that new yorkers need to take care of themselves and prevent the disease are available to them at prices they can afford. So certainly, we've done a lot of education about this issue and also have published rules that make it illegal to to increase prices for some of these products. That again, are meant to just make sure new yorkers can stay healthy. We also know that at a time of need, it's usually the moment when some actors will take advantage of that of our communities that are most vulnerable and oftentimes. Take the opportunity to even deceive and trap some of our new yorkers who really are hoping for any assistant assistants. They can get in order to survive this crisis, and so we again we encourage you to come to our office or come to your council members offices. When you hear about issues happening in your communities, we want to stay vigilant. There are a lot of benefits right now from the state, the city and the federal government. I will speak about some of them right today, but one reminder to new yorkers is that all of these benefits government benefits are available for free. No one should be charging you to make yourself. You know to be to avail yourself of some of these. Very important benefits so in terms of worker protection, I would say that also- and I know that the focus today is about reopening and coming back to work in a safe manner, but all of the new york city workplace laws are in effect right now we haven't stopped answering questions from both workers and businesses. I mean certainly there's been a lot of interest from businesses in new york city to know what their obligations are and to do the right thing. So I echo the sentiment of council member rivera. A lot of people are trained really hard and we also have workers who are nervous about coming back to work because they want to stay healthy and they don't want to infect their families, and they have a lot of a lot of questions. My office has published guidance for both workers and businesses in various languages, guidance that keeps getting updated. As you know, as you know, we continue to progress in the faces of reopening so come and visit us on our website. We have materials in different languages. Another very important thing that I want to say about most of the laws that we enforce and the programs that we have and the services we offer are available to everyone, only your course, regardless of immigration status. That is very important. It is not a piece of information. Anyone in my office will ask, for it is not something that is necessary for any of our cases. If you call us with a complaint, we will never ask you that question. So we want you to trust that when you come to our office, we're going to try to help you and and that your information is safe with us. In addition to protecting workers and consumers, we have an office of financial empowerment and I'm going to mention a couple of things about this office. Because again we are, you know, experiencing a health crisis, a financial crisis, and it's the time when new yorkers really are looking for every door. They can open that will help them get through this difficult time, and so we have financial counselors across the city. Typically, when, before the pandemic, we had, our services were provided in the five boroughs throughout, I would say the services were provided by community-based organizations housed in different boroughs. Right now, the services are being done over the phone and by video because of safety reasons, but we hope to soon be able to reopen in person. But today you can get in touch with a financial counselor. To talk about your finances to talk about tackling your debt, our counselors are trained to really know what what the different type of relief is available to new yorkers. With respect to student loan debt with respect to even consumer debt. Our agency has some licensing authority of debt collection agencies and we're working really hard to make sure that during this time, new yorkers are not being burdened by phone calls and communications from debt collectors. So we encourage new yorkers to call 3-1-1 and ask for a financial counselor who will be a trusted advisor to you in this time of need and again, the only requisite for accessing financial counseling is just you just have to be over at the age of 18. and we have counselors who speak different languages. So I want to focus a little more on the worker protection piece because it is, you know so important right now that we are all working together to make sure that in new york we continue to make progress in battling this disease, and we have a worker hotline. We've gotten over 3 000 phone calls to date from workers in the last month, or so with questions about their rights. But many times workers are still expressing fear and anxiety about reporting a violation, and the truth is that we can keep workers information anonymous. We don't have to tell anyone who called us, but it's so very important for us to get the information of those businesses that are not complying with the safety guidelines, because you know it's not just the workers who are employed in the business, but it's everyone else around them that are going to be put at risk. So we do encourage people, whether it's the public or the workers or other businesses to let us know when they see an issue of a business was not complying really. The city has been putting a lot of resources into educating businesses and bringing them the tools they need to comply with these guidelines, which I understand it's a lot of information, there's a lot of requirements, but it is very important that we all work together on this. In the last four weeks, my team has been on the ground. We have done over 14 or 15 business education days in collaboration with some of the council members and the business improvement districts, bring bringing materials the state guidelines in different languages, door-to-door to businesses that really are trying to do the best they can to protect themselves. Protect their workers just last week we were in council member chains district and we saw a really high level of compliance, and you know street dining locations that look great, so we're really encouraged by that and we want to remain positive, but we have to do it together. So that is my call to action to please let us know if you see an issue, we will go out there and educate that business to make sure that again we all continue to reopen in a safe manner and then, just generally, we are all operating all our services and programs are in place. The easiest way to reach us is to call 3-1-1, and I know that there are some more specific contact, information for the office of labor policy and standards, and I believe that tangila and ben will be putting it in the in the chat for people to write it down, but as always three one we get all those calls. We get all the emails, and we are here for you, so I will leave it there because I know there are a lot of questions so I'll hand it to you. Michael, thank you, commissioner, and if you haven't noticed already, our spanish interpreter has joined us. So if you need spanish interpretation, you can just click on the global icon and choose spanish. So, commissioner, we did get a slew of questions. A lot of them are related to people's concerns, going back to work rightfully so I'll start off with with some of the ones related to that. What precautions and protections are my employer required to provide me. So there are some general guidelines that apply to all industries and there are some other more specific guidelines for certain types of jobs like construction like manufacturing, but in general, and every business is supposed to first affirmed to the state, by going on to the state website to affirm that they understand what the guidelines are and that they will be complying with them and then post a safety plan in the workplace that tells workers employees. Basically, what steps the employer is taking to ensure safety and health in the workplace. So a number of things that are the things that everyone already knows about right, face coverings or face masks. Those are required to be provided to employees at no cost, so just like any other type of protected equipment, employers are not allowed to charge workers for those face coverings. The city has been making available face coverings for free to businesses. So if that is an issue please reach out, and our colleagues from small business services will be helping the businesses to make sure they have those space coverings for free social distancing is another very important requirement, so for most businesses that have reopened- and we are now in phase four of the reopening with some restrictions you know the most probably the one that is the most known is the fact that restaurants are still not allowed to do dining inside the location right, but social licensing is very important and so most workplaces will be limited to up to 50 capacity. So, for instance, if a retail store was able to have 80 people inside including workers at any given time before the pandemic, now they're limited to 40, including workers, employers are also supposed to be making hand cleaning hand sanitizing sanitation materials available to workers, so either workers should be allowed to wash their hands regularly or should have access to hand sanitizers, and they should be able to do that. To use them. Often employers are required to do a health in health. Exam had health intake every day before workers come back to work. Now, there's no specific requirement as to whether employers have to take employees temperature or not, but there are some models, some guidelines that department of health has published- and this is just to prevent workers from coming to work, sick right so every day and even us as an agency, we have to do the same thing. Employees who are scheduled to work must answer three or four questions that are designed to capture whether anyone has any symptoms and employers have to keep a log of those records that they've asked those questions. It's a requirement to keep that every day. The business also must be doing cleaning and disinfecting of the workplace at least once a day, preferably after every shift, and if there are certain surfaces that are used commonly by more than one person, they need to be cleaning those regularly. Employers also have to keep track of that. So, at any time, if a city or a state inspector visits the business to do an inspection to check for compliance with the guidelines, they could be asking the business to show them those records right in certain cases again. So another reminder is like: if employees are sick, obviously they must be sent home and there are laws that require employers in new york city and in the country to pay workers for time they use to take care of themselves or their families. The basic league laws are a very important benefits right now life-saving benefits, and there are three different levels of benefits from the city, the state and the federal government, and I can talk more in detail about it after and then. The other thing that I would say is that employees must also receive training on safety and hygiene protocols so that they, you know they again help they're all protecting themselves protecting their co-workers. I think those are the most general guidelines. There are certain, like industry, specific mandates like, for instance, with hair, salons and other like personal, like personal care type of business. Basically, there are some limitations on services. If a particular service would require the customer to take their mass, their face covering off that service is not allowed right. So a man cannot have their. You know their beer shaped. If it requires the you know, if they have to take the face covering off right so, depending on the industry, there may be more specific requirements: yeah I'll stop there. Thank you, commissioner. So on that that theme of returning to work can employers, request, test results or proof of antibody testing by the employee in order for them to return to work. So employers can there's nothing that prohibits them from requiring those tests, but employers can do that, cannot do that in a discriminatory manner. Right employers cannot ask only certain class of workers to take the test. They cannot just go by race. They cannot say over a certain age right if you're asking employees to take the test, a covert, 19 test or an antibodies test, it must be a blanket policy that applies to all workers. Nothing requires an employer to mandate that, but what they are required to do is to do a health screening every day, as I mentioned earlier so again, the employers are free to design the way in which they will check for these issues, but they have to do it in a way that doesn't discriminate against any employee. Thank you and what about? We got a couple of questions asking if, if an employer can ask employees to sign an indemnification waiver so that if they do get sick on the job, they cannot sue their employer. We've seen that happen, I look whether it's a new issue right, whether that would be something that would held up hold up in court, is yet to be seen. But a lot of the laws that are in place cannot be weighed by a worker signing an agreement right. If there are protections that are in place, they just cannot be waived by a worker but I'll ask ben if he has anything else to say about that. No, I think you hit the main point, which is that legally we don't know what the impact of these kinds of waivers is going to be. Yet I think we would encourage anyone who's being asked to sign one if you have any opportunity to take the time and show it to someone else, an attorney someone else to look at it with you before you do sign, but yeah at this point we just don't know how they're gonna play out in the long run, but obviously it's not a practice that we would encourage. I don't think that workers should be asked to waive any rights under these circumstances, commissioner, we're getting some questions about paid sick leave as well. So you know there's a couple of scenarios. So if an employee is sick, but they don't have enough paid sick days left to cover 14 days of quarantine, what do they do? Yes, and so the new york city paid sick leave law. You know, thanks to the council, has been in place since 2014 and it's pretty broad in the way that it covers workers for different types of situations right it is. It requires a minimum of up to five days a year for businesses to have five or more employees, and yes, five days may not always be enough right, but these five days can be taken not just when someone is sick to take care of themselves or take care of the children that can also be taken when there's a state of emergency that closes schools, for instance, and kids cannot go to school and parents need to stay home to take care of the kids. Now, as I mentioned earlier, there are state and federal laws that protect workers now who are sick because of covert 19. Very importantly, since March the state recognized that this is something that's really badly needed and the federal government did too they provide more up to 14 days or up to 40 hours. I think up to 80 hours, maybe right then up to 80 hours now the it is not that easy to navigate the system, because the benefit depends on the size of the employer and sometimes on how much money the business is earning in a year. So I encourage people to call us and tell us about their specific situation, because we would have to do an analysis of how big the employer is, how many employees in place how much money the business is earning before we can better advise, but in general I would say right now. Our state and federal governments have recognized how important it is to have paid sick leave benefits and there are expanded rights. I would also say that under the family, medical leave act the fmla again. If the employer is covered by that law, workers could take up, I believe, up to 12 weeks of benefits at a reduced salary, but they could take that time. If they need more time, so these are all different types of avenues that I think workers should be able to have enough coverage for the 14 days, depending on the law and depending on the size of their employer. Can you talk maybe a little bit there's some questions in the q, a box from people who work as freelancers or gig workers? So how does how does paid sick leave affect them in relation to congress? So paid leave basically applies to employees right who so individuals who are employees under the law? Okay, so there's got to be enough control by the employer. There has to be a relationship of employer, employer and employee in place. An employee may be working part-time or on a temporary basis and they're still covered by this law. The law currently does not apply to freelancers, so true, independent contractors, true freelancers, are not covered by this law. Now, oftentimes, though employers are have misclassified employees, so we always encourage people to call us and to tell us the specific specifics of their situation, because just because someone is labeled a freelancer or was made to sign an independent contractor agreement, it's not what determines the status of the individual right, we would decide if there was they were improperly misclassified and that they should be eligible for basically benefits, but a true freelancer someone who's truly working for themselves and can control the terms of their of their work, wouldn't be covered by this law. There is currently a proposal I think, before the city council, to provide more expanded, benefits, underpaid sick leave. That would cover some of these independent contractors, but that's still a proposal. Thank you, commissioner. What about child care so people? You know, obviously there's a lot of talk in the news these days about what's happening with schools. Are they reopening? Are they not reopening? What's the plan for students potentially doing a blended model of learning remotely some days and learning on site some days so for workers who may not have child care or for who child care is an issue for them to return to work if they're, if their child is not in school, what resources are available to them? So one of the you know the benefits of our new york city paid sick leave law again, is that it's very broad and workers could use that leave to take care of their children if the schools are closed or they're partially closed. Now, it's not a lot of time, but I believe and ben. Maybe you can help me supplement this. I believe that the cares act, expanded the family, the one of the laws to provide additional benefits for parents who may need to stay home with their kids right yeah, so under the first under the federal paid sick leave law, those 80 hours of leave that commissioner salus was describing. Those are also available for care of a child, so you have the 40 hours under city law, the up to 80 hours under federal law and then possibly the ability to get additional female family medical leave under federal law. Similarly, the state paid sick leave law that went into effect in March also expands some of the uses for the state paid family leave law which again might apply to some circumstances where you're caring for a child there's a number of questions that relate to reporting and confidentiality around that, and how are you know if a worker feels unsafe at their job? There's one example in that q a she works for a workplace. That's only has seven people 800 square feet office, the boss, isn't even wearing masks, nobody's wearing masks, they feel very unsafe, but they also feel afraid that if they make an anonymous report, people are going to know it was them yes and look. There's. No, I understand the anxiety about you know, reporting your employer right. People have just come back to work and they need the money, they need the jobs, but it's super important that we are made aware of those locations again when we walk in to do some education or to do an inspection, we're not going to say that we're there in response to a complaint right, we are going to go and we're not just going to go to that business, we're going to go to the business next door and the other business, because this is again like I said this is about all of us working together to make sure that we continue to be safe and healthy. So we need to know about that. She needs to obviously protect herself immediately right and make sure that she is wearing a face covering, but it is certainly not not a good thing to be in a place, a very small workplace with other people who are not wearing face coverings. So we do need to know and we can act, but we need the information. Otherwise, we won't be able to take action. There's so many businesses out there. We cannot possibly be everywhere, but she's doing it not just for herself. I mean she needs to think that she's doing it for her co-workers and for her family and everyone else somewhat related to that. There's a question in the q a and also one that came in email related to working from home. So if they don't feel safe at work, can they request to continue working from home? So this is tricky because an employer can call you back right. We have reopened. An employer, can tell you that you need to come back to work. We are still asking as a city. We have asked businesses to allow employee. I mean employees to continue to work from home when the job can be done from home. We also have said that occupancy rates have to cannot be a more than 50 right, so the employers will still have, even if they call everyone back to work they'll. They need to be doing it in a staggered manner right and have people who are doing both telecommuting and in the workplace. I mean we cannot force an employer to establish a telecommuting policy right now, but we are encouraging it. So if they feel like this is the kind of business where they could be doing that, we can also talk to them, and you know maybe there's some advocacy we can do also, but an employer can call you back to work and if they are taking all the measures that the state guidelines require, then you know it should be safe to be to be going back to work. This is also somewhat related to a question that we got from one of our constituents: who's a uft member for the past 23 years, they're in their mid-50s, and they were asking about reasonable accommodation due to the increased risk of severe illness from Covid-19. So I think they were saying. I didn't fact check this. So don't quote me on this, but they were. They were saying that the CDC is saying that the risk for people in their 50s they're at high risk for severe. So we are in the illness, not just people over 65. So can somebody use their reasonable accommodation rules to request working from home employees certainly have a right to request reasonable accommodation from their employers and their federal state city laws that require employers not to discriminate against employees who and to be able to accommodate them as long as the job can be done, and it's not a burden to the employer. Employers cannot do blanket policies that are just based on age right. They would be in violation of the law. If they actually said all workers over 50 cannot come into the office right. They cannot do that either, but it is an individualized analysis and if this person wants to, we can put them in touch with the commission on human rights, where they can do a consultation to make sure that their situation is being addressed, and I know that tangilla just posted the phone number to one two, four one: six, zero one, nine seven again, you know if a medical condition is considered can be considered a disability, so so that is something that will be taken into account, but employers cannot just make blanket policies based solely on age. Okay, thank you and I will I will say this is being recorded, so we will be posting this town hall on our youtube channel probably tomorrow, and we will make sure to also download all of the resources that changila is putting in the chat file and make those available to people so that, if you don't have a pen and paper handy, you know you know, writing everything down that she's putting in there we'll get it to you somehow. So, commissioner, we have a few more questions. We have about 10 minutes left and council members rivera and chen. If there's burning questions, you guys want to ask that I haven't gotten to yet just please feel free to interrupt me. The next question actually is very interesting to me, because it actually pertains to me what, if and actually isn't really an issue right now, because I think both new york city and most of the surrounding areas are at the same phase. But what if you live and work in areas that are at different phases, I work in long island, but I live on the lower east side. What rules do I follow right, because the state guidelines are requirements that employers need to follow right, so it is where you go to work that that basically governs whatever rules apply to your particular situation. Right, as you know, new york city was behind in the reopening compared to some other places in the state, and so, if you worked, if you work on long island, then you need to make sure that whatever face is long island on which, I'm sorry to say, I don't remember or know which face they're on they could be at the same place we are, but that is the particular phase and the guidelines that rule and when you go there, that is what you were just you're subject to right. So it goes by the place where you work, not where you live. Okay, thank you and on and speaking of phases. So what happens right now we're at phase four? What happens if the governor decides to roll us back a phase because of an increase in cases? I don't even want to think about it. No, I look. We are in a good place right now, right. Obviously, our state and city leaders are keeping a very close eye on all the numbers on the infection rates and trying to do their best to make sure that again, as a city will continue to support each other and continue to be safe. So right now we are good if the governor, for some reason, decided to roll back the reopening and certain businesses close very likely. Those employees who have to go back home and are cannot work would be able to apply for unemployment, insurance benefits, and I'm I mean I think, that's all I have ben do you have something to add there? No, I think we don't. We don't know what it would look like, and you know similar to how things happened as we were closing down and then going through this gradual reopening, I think we could expect. If there is a rolling back, there will probably be new specific guidelines that aren't necessarily the same ones. We've been dealing with. Thank you there's a question from somebody in that q a lisa is asking. Can I, as a customer, can she be charged a surcharge by the business for them having to provide PPE so, for instance, if she goes to the dentist or a nail salon, can they add a surcharge to her fees? So, right now there is sent. Businesses are not allowed to charge a searchers for actually this applies. You know I have to take back this question this in the restaurant industry. Businesses in new york city cannot charge a surcharge unless there is a let's say, a situation where they're serving six or more people or where customers are sharing one dish. It has to be a very specific situation. To be honest, I can't tell you right now: I don't want to give bad information, but if lisa, I think you said wants to talk to us, we'll make sure to give her the right answer. I'm blanking out on that right now, no problem and there's a follow-up from the question that we had about the from our uft member she's, saying that the DOE is allowing employees over 65 to receive accommodations based on age. However, employees over 50 are required to have an underlying medical condition to receive accommodations. Yes, I mean, like I said. That is a very again. I mean I'm not really I'm not familiar with the DOE policy, but I can tell you that on my agency, for instance, it is an individualized, you know, request an application and it's reviewed by our human capital people right. So I don't know the circumstances why they're differentiating there but yeah. I don't have a better answer than that yeah and we have one more question in the q a we might have covered this already, but they're asking what the legal policies are regarding employees, only employers who are only offering unpaid personal time off when you're sick with quoted so again. Basically, benefits are not optional right. The employers are required to provide them if they are covered by the law. It is again the state and the federal laws are new developments. So a lot of people may not be very well aware of what their obligations are. If they're employers, but an individual who's employed at a business in new york city can call us at 311. We will help determine what particular benefit applies to them right. So it's not optional. If the employer is covered by the law, whether it's the city, the state or the federal law, that employee has a right to get that get paid for the time that they need to take care of themselves. There may be situations in which businesses you know say if you need more time than that, I cannot pay you for that time, and you have to take the time and paid right. I know that at least under state law, some of the some of the benefit is actually paid with disability benefits, which is a type of insurance that every business already has. So it's not even an increase in the cost. At that point to the business, it's more of a benefit that it's already available because of the insurance but ben, I think, wants to say something I was just gonna add that for so for the city paid sick leave law. If your workplace has five or more employees, then it's paid under city law and under the state emergency paid sick leave law. As long as there are more than 10 employees in the business, then there's some form of paid sick leave, but that that's one of the other factors that the commissioner was explaining employer size and type of business. All things that we can, you know we can help sort out. If you give us a call. Thank you. I have a one last question that came in. We talked earlier about the self-reporting that employees have to do before they return to work as one of the requirements. So what? If any ramifications, are there if, as an employee, who's desperate to work, they falsify that self-certification because they just want to work well, I would just say that you are putting everyone at risk right. I, and I understand that this will, of course, there's a lot of need, and I really empathize with that. I know that the city is trying to do what they can to make sure that everyone who needs food has access to that right. There are so some benefits that are available to make status families so families that have both someone in their family, who has immigration status to be in the country and others who don't may be able to apply to some for some benefits like food stamps and other type of financial relief from the city. But it is a difficult time, and I know that a lot of families who are immigrant families have been left out of all of the federal benefits. So I don't blame anyone for wanting to go back to work, but the truth is that you're, putting yourself you're putting everyone else at risk, and I just urge you to please stay home if you're sick. Thank you. Thank you. Commissioner. We've lasted through a lot of questions in our hour, so I want to thank you again and your staff for taking the time to be with us tonight, thanks to our interpreters as well. Margaret and carlina. Do you want to say any last remarks before we sign off for the night? Just thank you for everyone for participating and thank you, commissioner, and your team. If anyone has any doubts or questions, please utilize, the resources. You know, public health and safety is our number one priority, and we want to make sure that everyone understands we're trying our best to do it responsibly and efficiently, and I know people want to go back to work so, thanks to all of you for bringing your voice and all of these tools to the public awesome thanks again everybody. We will be posting this, as I mentioned, on our youtube channel and website tomorrow and as well as all of the resources that shenzhen has been listing in the chat. So for now continue to be safe and wash your hands and practice social, distancing and wearing your masks and we'll see you all back at work. Sometime stay healthy. Everyone take care. Thank you. Bye.",
        "summary": "Last week, the council passed legislation to officially change the department of consumer affairs name to department of consumer and worker protection, and with that comes a bigger mission and in addition, the new york city, commission, on human rights, issue, legal guidance on age, discrimination.\nLet's work together to make sure new yorkers know what their rights, are, and I look forward to hearing how the department of consumer and worker protection will be an ally to report any instance of discrimination and hold people.\nWe worked in the city council to pass my bill on personal liability protections for small businesses, and we have pushed for legislation to be passed to give workers stronger rights during covent 19.\nWe do enforce the laws in new york city that protect both consumers and workers.\nAnd I know that the focus today is about reopening and coming back to work in a safe manner, but all of the new york city workplace laws are in effect, I mean.\nCertainly, there's been a lot of interest from businesses in new york city to know what their obligations are and to do the right, thing.\nYou know so important right now that we are all working together to make sure that in new york we continue to make progress in battling this disease, and we have a worker, hotline.\nThe city has been putting a lot of resources into educating businesses and bringing them the tools they need to comply with these guidelines, which I understand it's a lot of information, there's a lot of requirements, but it is very important that we all work together on this.\nNow, there's no specific requirement as to whether employers have to take employees, temperature or not, but there are some models, some guidelines that department of health has published- This is just to prevent workers from coming to work, Sick right Employees, who are scheduled to work, must answer three or four questions that are designed to capture whether anyone has any symptoms and employers The business also must be doing cleaning and disinfecting of the workplace at least once a day, preferably after every shift, and if there are certain surfaces that are used commonly by more than one person, they need to be cleaning those regularly.\nSo, another reminder is like: If employees are sick, obviously they must be sent home and there are laws that require employers in new york city and in the country to pay workers for time they use to take care of themselves or their families.\nDon't think that workers should be asked to waive any rights under these circumstances, commissioner, we're getting some questions about paid sick leave as well.\nSo I encourage people to call us and tell us about their specific situation, because we would have to do an analysis of how big the employer is, how many employees in place how much money the business is earning before we can better advise, but in general I would say right.\nSo we always encourage people to call us and to tell us the specific specifics of their situation, Because just because someone is labeled a freelancer or was made to sign an independent contractor agreement, it's not what determines the status of the individual right, we would decide if there was they were improperly misclassified and that they should be eligible for basically benefits, but a true freelancer someone who's truly working for themselves and can control the terms of their of their work, wouldn't be covered by this law.\nOne of the you know the benefits of our new york city paid sick leave.\nI believe that the cares act, expanded the family, the one of the laws to provide additional benefits for parents who may need to stay home with their kids So under the first under the federal paid sick leave.\nWe can do also, but an employer can call you back to work and if they are taking all the measures that the state guidelines require, then you know it should be safe to be to be going back to work.\nCan somebody use their reasonable accommodation rules to request working from home employees certainly have a right to request reasonable accommodation from their employers and their federal state city laws that require employers not to discriminate against employees who and to be able to accommodate them as long as the job can be done, and it's not a burden to the employer.\nAs you know, new york city, was behind in the reopening compared to some other places in the state, and so.\nI know that the city is trying to do what they can to make sure that everyone who needs food has access to that right."
    }
}