{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "title": "Business and Consumer Issues Committee",
            "publishDate": "2020-12-10",
            "shortDescription": "",
            "lengthSeconds": "0:35:35"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "th96_Jp7SEo",
            "fillerWordCount": {
                "uh": 94,
                "um": 49
            },
            "readTimeFullTranscript": "21 min read",
            "readTimeSummary": "2 min read",
            "wordCountFullTranscript": {
                "street": 17,
                "restaurant": 11,
                "businesses": 10,
                "business": 9,
                "restaurants": 9,
                "rate": 8,
                "license": 8,
                "applicant": 7,
                "place": 7,
                "door": 7
            },
            "wordCountSummary": {
                "street": 5,
                "business": 3,
                "dining": 3,
                "door": 3,
                "fair": 2,
                "infections": 2,
                "data": 2,
                "interviews": 1,
                "stations": 1,
                "applicant": 1
            },
            "fullTranscript": "Record the this particular discussion strategies on how to avoid tax taxation and I'll start the webinar that'll. Let among other things, did you all see Andrew on Neil Caboodle's show? Yes, no, but I don't watch that channel when I saw the clip. You know I've worked with Neil so on so many things he's actually a pretty decent reporter. Despite the station he's on, but I thought that they did great yeah I thought this segment was perfect. It was really showed what was going on and what needed to be done and I learned something about that too. I learned about the restaurant relief act and all and I wasn't aware that was part of the new stimulus package. So it was, it just hasn't, come out of the Senate yeah so anyway, good evening, everybody. How are we all doing? Hi Kristen hi FEMA, hello, hi? Sorry about that, as you can see, the trees in Verde Square are still green. It's just it's an amazing tag using chemicals or something but a little like E.T. You know the plant comes back to life when you walk by I really do have to change. My background and listen at least we've got one in order for me to get it when I have to put up a huge green screen behind me, which is the biggest pain in the neck, so I just I gave up on it. But anyway, oh we were just bragging about you, Andrew yeah, all Right Transportation committee, where's, your math blog you're, a star Android you're, really great. What did I do this time with Neil Caboodle, really good and Neil's amazing. So it's pretty cool, hey yeah! You have to see it's really funny. Out of you know, I! Do all these interviews on all these stations, so I always get to know like who watches what but anytime I do Fox News or Fox business I get these emails and phone calls from around the country. I won't play it now, because I know recording the message. I got the other day. Someone sent me a Bible, oh nice, I! Don't know how to do that. Oh my god. That's funny! That's really cool yeah, but the thing you know I work with him and the thing is with business. There are only so many channels that have really great reporters that you can discuss things with and he's one of them. You know that in Cnbc, so Andrew I, don't know. If you heard us, hang your compliments. I didn't, but it was really a great interview. It was perfect. It was so good, hey, mort wow, who was cooking tonight, one of your phenomenal meals. If you're there. No, actually we did a quick. We did quick chicken dogs because I came back late and I had to. But thanks and your tree looks nice I saw it he's beautiful yeah, that's it yeah. My husband put up a six foot tree and we can we get. We have a quorum yet, yes, okay, we should get started. He put up a six foot tree and I said nobody's coming to see it and he said it doesn't matter he had to have it so I don't know about it. He has it on Facebook. A lot of people see it yeah to make it your background, your zoom background, then everyone will see so, okay, so Christian. Should we start the ball rolling is, but we don't have the applicant for 434 amps in the house, Amazon Avenue here yet well. Okay, so I guess that's it, but we have everybody that counts for the street fair. So we could do that part. We could we when we get the street fair, yeah the street fair started when the applicant for 434 comes that way. We can kind of get the process going. Yeah, let's go okay, so Christian. There are three people in attendees you're, confident that they're not the applicant for 434. Well, they were not. Any of them were not in the paperwork that we received. Okay, great, go ahead: Linda yep may I make a quick comment. Sure thank you. After 45 years of running street fairs, I've decided that that's it and I'm merging with Todd Berman in Clearview. We know and I want to thank board 7 and the committee, especially for all the great cooperation and help that you've given me and my groups over the years. So thank you for running street fairs that people love to go to. That brings so much happiness to our community and hopefully we'll again soon, and thank you good luck on your mazel tov on your new venture. Thank you. It's real estate speak okay, so as part of the outline. Basically, unless there is any objections by anyone, we will take only one vote for all the multi-street fares. So if anybody has any comments, now is the time to make them wait. Christian yep we've got one, that's separate. The valley, restoration is Mardi, Gras Production, Dan Coyne is here okay. Should we separate that and then okay, I'm with you, okay? Is there anybody in the community that wants to be heard on these things? You know, let me promote to panda this everybody right now. Yeah that'd be a good idea. It's only so few of us yeah might as well right, yeah, okay, Naomi, Aaron and Trish hello. You guys are on unmute, okay. If anybody wants to be heard on the street fairs, now's the time Dan how you doing please walked away. Did anyone? Is anyone here to discuss the street fairs? Well, I was hoping to ask Dan if how he managed to do this. Dan I, don't know where Dan is. No one else will sit with his buddy Ron. Okay, so stay the vote. Okay are those in favor, that's one, two, three, four: five: six seven and non-committed members, that's one! So the vote is seven zero and one zero in favor. So we've got so. The only people who aren't here are Paul Fisher and arena standing correct, I'm motherly and oh and Madeline right. Okay, thank you very much and thank God. We survived 2020. and we're looking forward to 2021. Happy holidays, everybody, okay, bye-bye now bye-bye bye! Thank you. Okay, so just in case any of the attendees any of you from 434 Amsterdam, Avenue I guess not. Do you want to lick the, but we've got people here? Maybe they had you want to hear from the public and why they're short as well give it a little more time because it's still early yeah I know yes before we proceed. I wanted to us as officially as a community I wanted to congratulate Andrew and the New York Hospitality Alliance. For all the work they have done on behalf of the restaurant industry and they have been, they really have been significant. They have help. You know that industry quite a while quite a bit in a significant fashion. Indeed, here we're here, yeah greatly appreciate it. It's been intense, eight, nine months and now who knows if we'll shut indoor dining next week, it's just devastating on so many levels and you have any sense of where that's going Andrew. Well, we'll see you know it's like the ever-changing goal post. It was not free baseball. It's changed, sometimes the factors that these enclosures, but just this week it changed from infection rate to hospital, hospitalization, yeah and the formula on what would determine if it gets shut down or not is right by Saturday we should know whether or not it'll be shut down on Monday, but then we don't even know what the metrics would be to get it reopen and again it's troubling in the sense that you know, Manhattan has a positivity rate. I think today was 2.5, less right, half of counties throughout the state where indoor dining is going to remain open and we've seen since June reference has been open at 50 percent indoor occupancy and New York city, since September 25 and infection rates continued to go down, I mean just last week the governor said: 70 of the new infections are related to unregulated private social gatherings in people's homes. The city Health Department has no contact tracing data that we've seen and we got updated last week that there's any meaningful increase related to indoor dining I mean, if anything, it's probably one of the safer places to be all things considered. But we understand it's part of a much larger. What I want to know is what is Andrew? What are you doing to stop the small gatherings that are not taking place in restaurants from happening? Where are you on that huh? How are you what's? What are you doing to stop that are not taking place in restaurants and they have nothing to do with your industry? What are you doing to fix that yeah? That's the question that I've been asking 60,000 questions. Did you happen to see the governor's press conference? I was going to say he said that there is data. Well, they were talking about the comparison of the infection rate versus the hospitalization rate that they're at that even the infection rate is still a derivative, so it it's. You know what he said was that there was data that Robert restaurants a lot and he's the one who said that restaurants were somewhere between five and six on the list of air infections right five and six of how many out of five six areas or and three and four are your grandkids and your stepdaughters and yeah I know. But he also said that it's also the fastest growing rate right now yeah of infection. Now they also say they also said that they they're gonna, be looking at the hospitalization rate. If it doesn't level off that's when they would decide to shut down again, but they didn't give us any numbers, it's really not transparent at all, because it's not just hospitalization right. It's about the trend line for the hospitalization rate, which is not knowable by us right, so it's right and I think wait. Andrew I think the points that you made in the interview today about how many workers were going to lose their jobs and there's no there's nothing that'll that can help them. There's no stimulus, there's nothing! It's and again, there's very human level. They have to be put in context of you know the whole entire situation. If now highly regulated indoor dining is suspended again. Does that encourage more people to go indoors to these social private gatherings where there are no regulations and further increases? Governor Murphy of New Jersey just said this week when it was asked he said that he is not at any time now going to close indoor dining in New Jersey, because that's not where the infections are coming from right. You know this is a little bit when you lose your keys and you go over to the lamp post. Why are you searching for your keys? Didn't you lose your keys over there? Well, the light is better over here. So that's right. We're all deciding that we're going to Cl we're going to close the things that we can close like the restaurants and we can close the schools, because those are things that we can close and control, even if they are having only a minor impact or none at all on the infection right. So yeah I want to call all of your attention to Christian who's right now on a fabulous beach somewhere. We already voted on the I assumed you were here for the street fairs, I didn't even get a ch. I didn't even get chance to speak against it come on, but then it looked like you had poly health affair in September. Did you see again? Did you have the fair this September? No, we had nothing yeah, but so those financials are just for me that, where from when they were from 19 20, it was the previous year yeah I mean I figured I'll, give you know the data that I have, which is the year before it was helpful. Thank you yeah sure so. Well, thank you. All. You know sorry to I. Guess my random podcast since you're here, 434 Amsterdam Avenue since they're, not here, oh okay, I just had one last thing to what I was saying before. Is you know if we had a functional federal government, you could shut restaurants and other businesses and compensate them right. It's safe to open, you'd, open them up right, but you put people into a situation where they have to just make impossible decisions with no good outcomes, and it's really tragic and shameful in my opinion, well yeah and there's a president they're doing it in Germany, whatever it takes. Let's make that happen so, but they've already when they did this in Germany, they supported their restaurants. When they did this in Italy, they supported their respect for supporting their small businesses in France. That's the big thing, they're supporting their small businesses and they have another program for small businesses just to keep the old, mom and pops there, because they subsidize them. England too Canada as well. Yeah I just got through a whole round over the last few months of renegotiating existing leases to stabilize them during Covid-19 and now, with this next round of closures, we are going to have to renegotiate everything we just settled on. Did everyone get a chance to read the commercial observer article I sent you about landlords, you know certain landlords actually helping you get. It was a good great article, actually helping their tenants and working with them, and you know without Colombia, is doing that Colombia. You know because they control so much of Morningside Heights retail thing, but not every landlord is in a position to be able to do that, and there are some landlords that are doing work on their buildings. You know local law, 11, work and other stuff, which is extremely costly, and they can't make that stretch so right. You know we can't penalize without really examining. What's going on here, 100 percent 100 and for the commercial buildings they've also gone now. They've got local law, 97, so they're, adding to that level, 11 and 97, and it's insane refitting the interiors. It's insane the amount of money that they have to spend just and pretty soon coming down. The pike will be all of you. I just wrote a blog about it today about all of the new protocols for commercial buildings that they're going to need in order to keep their internal air quality Iaq to new standards. So that's going to cause them sprinkler requirements, yeah, that's local, on 97, right and then you're going to have more requirements, you're going to have all new air filtrations, it's going to be costly, you're going to need some help and by the way banks aren't giving anyone a break. So no landlords are getting a break from their banks. Unless you can have forbearance and if you have a Freddie Mae or you know, I mean pretty Mac or Fannie Mae, but most commercial landlords do not have federally backed type of loans like that, I'm going to sign off. Thank you all for the support. Okay, then, thank you. I will see you in September, if not sooner at the street. Fair right, we'll see you at the street fair. Yes, indeed, how would you wait for this? Other applicant, how long one more minute does somebody have the phone number of the applicant I'm glad to call them okay hold on. Let me tell you: is that three four seven, six one four three four yeah, let me put it up you're right! That makes more sense, yeah and what's the name of the person hold on, let me put on the screen, so you can see it yeah, so we can call them and everybody should get a chance to see what the application is. If you haven't already, because it came in late, so I have the contact info for the landlord and their broker there too. Well, let's, maybe we should call Kathleen what kind of food is this restaurant, Greek Creek? Well, that's the doubt you're going to get a lawyer this time unless it's you know, are Aaron or Naomi here for a particular purpose or just observing hey it's. This is mark dealer for the chair of community world 7 for Salil Meta, your application, something to appear for your application for your SLA license. Please zoom in! If you don't know, the zoom then go to Cb7's website, which is Nyc.Gov, Slash, mcb7 and click on the links for future meetings and then zoom into the meeting as soon as you can. Please, because we're all sitting here waiting for you thanks so much bye that wasn't too snotty. Was it what about his attorney? That's the one I would call I'll try next yep yeah, oh wow. This is the old tank blind space. Here's Madeline, oh good, okay, hi Madeline, oh you're, muted, oh sorry, I said I had a hard time. Logging on hello. Let's take a look if you get a chance folks, let's take a look at the application, and so you know we're the hours were reasonable. I, don't know what kind of restaurant I was just being it's a restaurant. So it says that in the application yeah well, the hours are reasonable. The hours are very reasonable. You know so, and they don't have to tell us what kind of restaurant it is. Usually they come in and tell us so it's not on the application. So that's why we usually talk to them. The hours I couldn't tell from the name I couldn't either, but I'm sure it's a delicious restaurant and let's point this out folks, it's a restaurant that is opening I, know true a good space. What was the space Doug? What was it originally tangled vine because it was the sushi before that favorite very yeah? It's a very good one. Yeah, so I know way too much about that site and I mean why is it problematic, Doug there's some stuff going on there? Well I, don't know if it's appropriate I don't want to prejudice that it's not appropriate. Well, there's work that needs to be done on the sidewalk and it's been on and on for a long time. It's a high traffic area, though it's a great location, it is it's great I can tell you for sure. I did the original. It was there for years when that was Lange. No Lengue is where the oh, what the bakery is the Magnolia Baker? What was the japanese restaurant that was there for years? Oh I, love that place. It was good yeah, hi Madeline, we're waiting for the applicant hasn't shown up. Yet, oh, okay! So that's why we're just hanging out so we've been talking about the state of restaurants and the economy and I mean I'm getting information from people from out of state that New York is shutting down period. I'm like oh, my god, I just ran into this father and son. They opened up a new business, a nail salon, so I said: is it asian or black? They said black. This is the first african-american nail salon that we ever had in this community. They're opening up on I, think this 105th street between 104th 105th or maybe 100,500- that they're opening up now and I was shocked that they got money to open up a new business. It's Madeline, 115 or Columbus. Sorry, Columbus well I mean there's still some programs available for the small business administration, but I see what you're saying it's difficult in this period to open yeah, B Wilson. Who is a broker at element for many years she had a nail salon on Frederick Douglass Boulevard between 118th and 119th streets. I know the place yes, I, don't think it's open still, but that was Mel's. Life would be a lot and so I went to the nail salon with my miserable nails didn't mean Wilson. Also have a wine bar up there, I don't know. Did she yeah I think she did? She was partners of wine bar and she I know that she was part of that in the new development on Frederick Douglass yeah, because we were working for well. That was when we were working with Kyle Prop, so yeah, you know Madeline the and everybody Andrew's organization sponsored an nwbe forum as a few months ago now, and one of the really most compelling takeaways from it- was not just requirements about contracting with nwbes, but in unequal access to capital, and it's exactly what you're talking about the capital needed to start and launch a business. It is and I, don't know that anything much has changed in any of that. I. Don't think any of the federal stimulus has targeted or made a reasonable effort at supporting the small, not just smaller businesses but M/ WBE, smaller businesses, it's something that it's a little bit confounding, but maybe we ought to think about in some time I just gotta go. We had a webinar about that. It was precipitated by Madeleine Right, with Madeleine's idea. We had a very successful webinar could be more successful at the board office to push it out better, but yeah I would yeah. No you didn't! No, you did you guys did great, I'm just thinking about structurally. You know we can't lend money. We can only highlight the issue, so we can call attention webinar well, yeah or I, don't know what else, but some something's got to give with some access to capital. That's the thing: I just got a text from somebody looks like the lawyer. I'm appearing will log in momentarily okay b. Her name is Kathleen, so yeah, that's the name of the attorney okay yeah, but she's assigned to b, but anyway, okay, so she should be logging in any minute. I think you know we have such a reputation on the board that nobody ever expects us to once start on time and two gets things done expeditiously, except it's not that bad. We start within five minutes. It's one of the few committees that actually does get things done expeditiously and efficiently. Remember the time when what was his name, George was a chair and then he had an emergency had to leave and then I. That was the first time. I took one vote for those affairs and when we left there were people sit coming in because they figured they were gonna, be here for a while right. Dems was the old days now he's got a different point. The restaurants Act, which is the federal legislation that 120 billion dollar revitalization fund, has bipartisan support. Yes, the program for the first I forget, maybe it's two weeks prioritizes grants to marginalized and underrepresented communities and with businesses with less than one and a half million dollars a year in gross sales. So really, the point is to get to money to female black and brown businesses. Small businesses, as that versus you, saw like what happened with the Ppp. Were these large corporations that had relationships Landry, my favorite current example of that apparently Tom Landry, I'm sorry Tom Brady the star Quarterback. Apparently he got something several hundreds of thousands of dollars for some small business that he theoretically runs. Anyway. It looks like we've been joined by Kathleen, Negreese and I. Don't have the last name in front of me but I think that's the applicant for 434, so welcome to community Board 7. Yes, thank you! Sorry, I'm late! Thank you very much. Do you want to do you want to come on camera? Kathleen? Oh sure, yeah I, I'm not looking my best these days, but that's what many of us are. Let me just keep it for yourself: yeah, okay, just for the men to say that right, okay, I, don't know! Can you okay? Let me see okay here, I am there, you go hi, so tell us about 434 yeah okay. So this is a place called Lao, which is the proprietor. Has two other places downtown one will be closing due to Covid-19 and he's moving up now to Amsterdam, so Lao is established, business he's going to be using the same menu that he has down there, which is I. Guess you can say it's curry, food, Indonesian, yeah and indonesian cuisine. Yes, and what else can I tell you about it? It's less than 74 people. We do have a certificate of occupancy. There was a previous license there, but that establishment closed up and the license has since expired, oh yeah, and he is looking for a full liquor license, which was the same as the license there as well. Okay, what's the what used to be in this space? What's the space angle line and repugnant, it's on the corner of 81st street, it's on the South West corner, yeah right and I'm just trying to Amsterdam yeah I. Remember him well, yeah, exactly so! That's basically it I mean. If I can answer any questions. I'd be happy he is experiencing. He has been in the restaurant business for about 15 years, whatever his other restaurants down there downtown. Yes, I can tell you the names of them. Let's see, let me only because I'm writing. Minutes and I want to add some more stuff, yeah sure absolutely I told I pulled the SLA licenses for those and they have full liquor as well, so one of them is froze I think she froze okay and the second one is Lotus 17 and doing businesses aloud and that's at 15, East, 17th street I believe one of them. He will be closing because he's having a difficult time negotiating with the landlord, but I'm not 100 sure of that Kathleen I hate to do this to you, but you froze what was the first one, please, oh sure, a Lotus 20 Inc and that's at 31, East, 20th, street, okay and the second as low to 17 inc at 15. East 17th got it okay, thank you and he has full Lakers in both of those. We never had any issues with them and I did tell you there's there is an active Cfo in that location. Well, there had to be because there was a previous license. Catherine, did you mention what kind of food you're going to be having Indonesia okay, yeah Kathy, the 70 74 is so you don't need a public assembly permit no public assembly effect. I can tell you how many seats there are going to be. Let me see there are see it's I, don't know, I thought. Somebody said it's big, because it doesn't look big from the plans to me. It's eight tables I mean I'm sorry, two tables with two four tables. So that's eight seats, I'm looking at the plans now and then there's another table. That's with two seats, that's ten and then he has about 15 bar of 15 stools around the bar. So it's not a big place. It's going to be less than 50. yeah and I'll. Give you an hour he's closing every day at 10 o'clock, except Sundays will close at 9:30 and fridays and saturdays at 11. It's very reasonable, yeah background music, nothing, no outdoor, cafe, no backyard use. No outdoor. Obviously, there's got to be construction and significant construction. So what is his estimated time of well I, don't know 100, but I know that he's bugging me every single day for this license and nothing is ready to open, but this license will take four to we haven't filed it yet I plan on filing it probably the beginning of next week, and this will take four to six months. Okay, that's the return on time these days. What's that so we're talking really about in the spring or spring yeah late spring. Okay, one thing you might want to know there were I, don't know if it's still the condition at that place, but there's a back door that opens onto the side street as opposed to the main door, which is on the avenue and the back door has a staircase about three stairs that lead up to that back door. The last time I saw it. The staircase was made out of wood, which is non-compliant and the reason I'm mentioning is not because I care deeply about these things, but because I actually received a complaint about the former operator because of that, so why not fix it before you're? If you're going to be doing work anyway, why not fold that into the world? It's been like that for years upstairs that's been complaining about it for years. Oh I'm sure. Obviously, oh that's kind of not there. So I'm just you say it's like three steps that go up to the side door. Is that what you just know the kitchen, it's kind of like a kitchen door or a side door, property right across the street, the same landmark district, and if you look at what they did on their ramp to an ADA ramp on that side they did a wonderful job with it and it might be something they may want to look at okay, great! Thank you. I love, more watches too so call the question: can we call the question folks, all those in favor as one two, three, four, five, six, seven, eight non-committee members, that's one! So the vote is eight zero and one zero, fantastic. Okay. Thank you very much. I'm sorry to keep you waiting once again. No problem! Good luck! Thank you! Have a nice night, you too, and thank you Kathleen. Thank you. Looking forward to this I don't think we have an indonesian restaurant in the neighborhood. This is very exciting, I think you're going to like it. It's really good. It's like street fair. He just describes it as I. Think you're going to really like it sounds like happened to me. I love. Anything! Sadly, I think you guys are just hungry right now, that's what it says. Okay, so good night have a good night, so anybody else has any a so called new business to bring to our attention. In that case, I'm gonna call a motion to 20 million. Then second, okay, so you'll have a good night. Now and we'll see you not everyone happy holidays, enjoy your luck, guys.",
            "summary": "You know, I've worked with Neil, so on so many things.\nDo, all these interviews on all these stations, so I always get to know like who watches what.\nBut the thing you know, I work with him and the thing is with business.\nOkay, so I guess that's it, but we have everybody that counts for the street fair.\nThe street fair started when the applicant for 434 comes that way.\nThank you for running street fairs that people love to go.\nIt's been intense, eight, nine months and now, who knows if we'll shut indoor dining next week, it's just devastating on so many levels.\nI think today was 2.5, less right, half of counties throughout the state where indoor dining is going to remain open.\nAnd we've seen since June reference has been open at 50 percent indoor occupancy and New York city, since September 25 and infection rates continued to go, down.\nThe governor said: 70 of the new infections, are related to unregulated private social gatherings in people's homes.\nYou know what he said was that there was data that Robert restaurants, a lot.\nJust said this week when it was asked, he said that he is not at any time now going to close indoor dining in New Jersey, because that's not where the infections are coming from right.\nI mean I figured I'll, give you know the data that I have, which is the year before it was helpful.\nIt was a good great article, actually helping their tenants and working with them, and you know without Colombia, is doing that.\nYou know local law, 11, work and other stuff, which is extremely costly, and they can't make that stretch so right.\nYou're going to get a lawyer this time unless it's you know, are Aaron or Naomi here for a particular purpose or just observing.\nFolks, let's take a look at the application, and so you know we're the hours were reasonable.\nYou, know so, and they don't have to tell us what kind of restaurant it is.\nThey opened up a new business, a nail salon, so I said: Is it asian or black.\nAnd I was shocked that they got money to open up a new business, It's, Madeline, 115 or Columbus.\nSorry, Columbus well, I mean there's still some programs available for the small business administration, but I see what you're saying it's difficult in this period to open.\nI, think you know we have such a reputation on the board that nobody ever expects us to once start on time and.\nOkay, One thing you might want to know there were I, don't know if it's still the condition at that place, but there's a back door that opens onto the side street as opposed to the main door, which is on the avenue and the back door.\nIt's like street fair, I, love, Sadly, I think you guys are just hungry right."
        }
    }
}