{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCuJFXsVDZ66dGdlcYYOn4TQ",
            "title": "November 2020 CB8M Parks Committee Meeting",
            "publishDate": "2020-11-13",
            "shortDescription": "",
            "lengthSeconds": "2:03:25"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "tJXwtb1-0oc",
            "fillerWordCount": {
                "uh": 304,
                "um": 287
            },
            "readTimeFullTranscript": "73 min read",
            "readTimeSummary": "11 min read",
            "wordCountFullTranscript": {
                "building": 62,
                "buildings": 57,
                "flood": 44,
                "height": 35,
                "parks": 33,
                "resiliency": 30,
                "flooding": 24,
                "areas": 23,
                "project": 20,
                "proposal": 20
            },
            "wordCountSummary": {
                "building": 15,
                "buildings": 15,
                "flood": 14,
                "flooding": 9,
                "areas": 9,
                "resiliency": 8,
                "level": 7,
                "mechanicals": 7,
                "parks": 7,
                "spaces": 6
            },
            "fullTranscript": "I thought I saw a scott earlier, but maybe I'm wrong. This is Scott Baker here, yeah I think that's a different person yeah, it's Scott. It's got williamson or williamson, I'm sorry! Maybe we should just give everybody another minute or so absolutely oh, there's actually as I see, Axa is here: okay, I, think and trisha. You may need to either speak a little bit more loudly or your mic may be a little big, maybe covered or something I'm sorry is that at all better I think so, yes, I apologize. I've been having this problem barry if 6:30. So. Do you mind if we just jump right in please do okay, good evening, everybody! It's really nice to see you all virtually again. My name is Trisha Shimamura and I am a co-chair of the parks and Waterfront committee, along with my other half, maybe right next to in the square. Next to me, Barry Schneider! Thank you. So we're going to jump right into the agenda tonight and I believe. The first item is a presentation from asca from the City Planning Commission on the zoning. The coastal flood resiliency great and I, see also Scott Williams in here. Oh there we go Scott good afternoon good evening, Scott hey there. Thank you very much for having us yeah treasure. Just one point. This is listed on the agenda as a joint meeting with housing and Zoning Development committee. I do not know any of those members are here, but we will acknowledge them that this part of their co-hosting co-chairing this meeting I saw Elizabeth Ashby. Is here? Oh okay! Thank you. Oh I'm, sorry go ahead, Scott, it's all yours, oops and Scott. If you mute yourself, you will not be able to unmute yourself. Actually it's a great segue just for everybody. If it's your first time at one of our Zoom Community board meetings, everybody is muted. You are not able to unmute yourself. The way that you will be called on is by using the participants menu at the bottom of your screen. You click the button that says participants a box will pop up and you'll use the raise hand button to be recognized by Trisha and Barry as we move through the meeting, and there is a chat box. It is only to chat me about technical problems about the software, but if you have any problems do feel free to chat Scott. Sorry, thanks will yeah sorry, I did mute myself there, not knowing I could not undo that. So thanks for that, I will also need to share my screen in a second which I see. Zoom is going to stop me from doing so. If you do not mind, you know in a second or two that will be. That would be great whenever so good afternoon. Everyone thank you for having us again my name's Scott Williamson, I'm the East side team leader at city planning, I, believe one of my colleagues is with me as well. Her name is Oscar and I do not know if she'll be presenting much tonight, but she may be available for some questions as well. If she's on the line but I think it's just the two of us here tonight and the main reason we're here is to talk to you about a project that I mean city planning has been working on for years in different iterations, particularly since Sandy happened, and it's called zoning for coastal resiliency. Now you may accidentally hear me refer to that as Zcfr throughout the presentation, and that's because I have a script that our resiliency planner experts have written for us, so apologies advanced fade if I do revert to the acronym there, but just so you know it is referring to zoning for coastal resiliency. So there's there's that so I'm going to run through this presentation and I mean if you wanna, save any questions for us until the end of the presentation. That would be much appreciated because I mean hopefully the presentation answers as much as possible for you and I guess. I probably do want to just underscore as well that azka and myself are not specifically resiliency planners in that sense, so we are typically liaisons with the community board. So we will try to explain this to you. The best we can but I mean, if you have a question that we can't answer, then we're certainly happy to try and follow it up after this, for you, if it is of a more technical nature, because a lot of this stuff is very detailed and has a lot of you know technical background to it. So, yes, just so, you know what what we're getting into here. So if you go with me a second I'm just going to try and share my screen very quickly. Okay, can you see the presentation there? Yes, sir? Okay, so it's zoning for coastal resilience for coastal flood. Sorry was someone saying something, though: zoning for coastal flood resiliency proposes updates to the zoning resolution, specifically in chapter six, sorry specifically of article six chapter four and some other related sections, and it's driven mainly because various different mechanisms have been introduced to improve resiliency, in particular, in building since Sandy happens and many of those expire in the coming years. So the department is trying to be as proactive as possible in implementing some more permanent type solutions now I would I would mention as well that this is a small portion of the city's greater plan called one NYC. So there is various other different. You know resiliency type measures that are being taken across the city. You may know of the East side, coastal resiliency project, which is a specific engineering. You know coastal resiliency exercise in Community board, 3 and Community Board 6, just to the south of you, so that's a different piece of it as an example, but this is dealing primarily with you know: zoning mechanisms for private property to enable you know improved resiliency. As you know, flooding potentially continues to to increase in occurrence but effectively. The proposal is seeking to modify and improve the previous provisions that we're expecting to expire in the coming years, and it's doing so through a text amendment to the article 6 of chapter 4, that I mentioned in the zoning resolution and that part of the zoning resolution is called special regulations applying in flood hazard areas. So I mean the different solutions that this project proposes affects various different parts of the zoning resolution as well, and the way this presentation categorizes, it is into the different goals that each set of those parts of the text amendment are trying to achieve so. I hope that they've sort of done that in a as much of a user-friendly way as possible, but I mean, if there's a takeaway piece of this. It is that the changes that we're talking about here they affect those properties that are in the one percent annual chance flood plain. So we're talking about specific sites that are very close to the coastline and you know obviously Community board. Eight has quite a bit of that. Roosevelt island is quite a bit of that, and I'll show you a map with that in a second. The part of this proposal, as well as the department is expanding on those provisions which previously you know they applied to the one percent annual chance floodplain. They will now be increased to apply to the 0.2 annual chance floodplain, so that is trying to future proof. The mechanisms that we have in place in the zoning you know to the best extent, that the department can, at this point so on to the you'll, see here a series of maps, and while there are many sources of flooding that pose issues in New, York City Coastal storms present the most significant flood risk in terms of compromising human safety, property damage and business disruption. When we're analyzing the city's coastal risk, we focus on the area that FEMA designates as the high risk flood zone and, as I mentioned to you just previously the area that has a one percent chance of risk of being flooded. Every year, however, in 2012 Hurricane Sandy awakened us to more widespread flooding that went well beyond the one percent area, close to half of the properties that are technically classified as being moderate risk of flooding or having 0.2 chance of flooding. We're inundated as well and with climate change, the floodplain will continue to expand by the 2050s. Today's moderate risk flood zone will likely be a high risk flood zone and the area that today is becoming that area today is becoming home. To you know almost a million new yorkers, so you know some widespread implications of this, particularly for where a lot of our city currently lives, so I think in anticipating a logical question out of this slide that you're looking at here, I suspect. A lot of you might want to know how exactly this applies to community board. Eight and I do have another map for you that I can show you that on right now, I just want to try and switch over to it for a second, if you bear with me really quickly. Okay, so here is a special map that they put together for you. Let me know if you can't see it, but this is the specific community board, eight geography and how it applies. So on the left, you can see that the existing rules we have for resiliency that are in the zoning resolution that have been done in the years following sandy in 2012. You can see in yellow there and that relates to the one percent chance plain in Community board eight. So you can see that's a majority of Roosevelt Island and there's some portions to the south along the East River in Community Board, eight, as well as up towards east Harlem along the East River as well. So that was on what exists today and those are the rules that are potentially expiring soon and that the department is proposing to update so the material difference between what exists in the applicability of today and effectively. What is being proposed. You can see in red there, so you can see some additional parts of Roosevelt island which pretty much captures the whole island from that point. There's some sights down in the south of Community board eight and some additional sites. Further up to the north and the red again I would highlight, represents what the department is proposing to expand our resiliency measures to include the 0.2 percent floodplain. So that's 0.2 percent chance of flooding every year from coastal inundation and happy to make these materials available to you as well after the meeting, probably I assume through will. So I'm just going to switch back to my powerpoint now. Okay, so now that we've sorted out geography, just to give you some more summary here, this proposal builds on two zoning text, amendments that were put in place shortly after Hurricane Sandy to help coastal neighborhoods recover and rebuild quickly and I had alluded to those two zoning text amendments just before, but those zoning flexibilities which were passed as temporary emergency measures are beginning to expire. The Department of City planning has conducted years of research and outreach, which uncovered many issues that communities are still facing. The proposal now is to make many of those provisions added after Sandy permanent to expand, so the communities have even greater flexibility for adaptation. Ultimately, zoning for coastal flood resiliency will help those living and working in the flood plain to do a number of things, including reduced damage from future coastal storms be resilient in the long term, by accounting for future risks from including climate change and potentially help save on flood insurance costs. It would also assist with disaster recovery from future disasters, including the present situation with covered, so I mean if I, if I can give you a main summary of what this project is seeking to achieve. It's probably this slide and again we'll make sure it's available to you afterwards, but there's sort of four goals, or you know pillars that this project is seeking to make changes to the zoning resolution based off of so I, guess just to go into the depths of that after a long. Excuse me, after a long process of studying the floodplain and engaging with more than 3,000 new yorkers on a wide set of issues, we were able to establish these four overarching goals that help us move from sandy recovery to a longer term resiliency strategy. So we know that, firstly, the floodplain community wants to be able to prepare buildings for flooding, even if they are not located in what FEMA determines to be the current high-risk flood zone, especially those located in the areas that face moderate risk of flooding, and that did experience coastal flooding from Sandy. Secondly, people also want the option to raise their occupiable space a little higher than the current flood level that FEMA projects again. This is because they have seen higher flood levels and expect that risk to grow in future when people are undertaking big investments to retrofit the buildings that they live in. They only want to do that once understandably so related to that investment that one has to pursue in fully retrofitting to resiliency standards. The third point is important here, so residents and businesses, residents and business owners are seeking options to invest in resiliency incrementally in some circumstances, so that it's more affordable. They want options like moving their mechanical equipment to higher elevations, without necessarily triggering your requirement to raise or fully fr flood proof. The entire structure which you can understand gets quite costly, so the fourth goal is, after undertaking two zoning updates for resiliency. We know that we need a way for the city to be nimbler in responding to future events that might require rebuilding homes or other forms of recovery. So, specifically, the sort of go through those four goals. A little more in detail so bear with me on some of that detail anyhow. Firstly, starting with goal one. This speaks to the text applicability of the proposed regulations. It is important to note that these regulations are optional and they would be facilitating buildings to meet or even exceed flood resistance, construction standards that have been set by a FEMA and enforced by the city's building code and that part of the building code is known as Appendix G. If anyone has specific familiarity with it, zoning for coastal resiliency would expand the applicability of the current text to a broader set of buildings that are also exposed to flooding in the event of coastal storms by allowing any lot located within both the 1 and the 0.2 annual chance. Flood plains to have access to the proposed special rules that help enable resiliency at the building scale. The 0.2 chance floodplain serves as a proxy for the high-end projection of the 2050s one percent annual chance floodplain, allowing the city to advance resiliency in the longer term, as it would allow those living in those areas to proactively undertake resiliency improvements, even if they're not yet required to buy the building code. So, regarding goal 2, this section illustrates regulations that would be available only if the building fully complies with the flood regulations of the building code in Appendix G and is split into five separate subcategories, starting with building envelope. These sets of rules would allow buildings to physically elevate habitable spaces and other building support features above expected. Flood elevations by offering more flexibility with bulk regulations, including height, rear, Yards, floor area. So the buildings can be made resilient without putting homeowners in a hard spot of potentially having to choose between keeping their whole building versus making their homes resilient regarding ground floor regulations. This set of rules would help promote good, long-term resilient design of buildings and would and how they meet the sidewalk through floor area exemptions. The proposed rules would encourage internal access and active uses to be kept at the sidewalk level as much as is possible for flood plain communities to continue to be vibrant and accessible. As a reminder, all of these allowances can only be used if buildings fully meet Appendix G to ensure that buildings meet the full resiliency standards. In addition to that, to ensure resilient buildings contribute to their surroundings, we would also mandate that a set of streetscape requirements are met so that the ground floor level design of resilient buildings is also improved. Now, moving on to speaking about situations where neighborhoods and buildings may be old, and maybe they do not fully comply with our current zoning regulations leaving residents and in those instances it leaves residents in these areas in a hard position when they try and undertake any resiliency improvements. An example of that are homes that are currently located on substandard lots, which may not comply with floor area or yard regulations. At present, the proposal would set up a framework that would allow these and many other situations in which buildings do not conform with our use regulations or do not comply with bulk regulations to be able to be retrofitted, without bumping into zoning constraints. So last, and with a such vast and diverse building stock and conduction and conduction within the floodplain, we recognize that all buildings in not all buildings in all situations would be helped by the as of right rules. Therefore, the proposal would continue to offer discretionary pathways in the form of BSA special permits to ensure that all unique situations are enabled to meet the standards for construction within the flood plain so moving on to goal three now set of provisions located within these four categories are what we call partial resiliency strategies as they assist buildings, undertaking incremental steps towards resiliency without requiring the structure or sites to meet the full set of rules within Appendix G of the building code. We learned that raising mechanical equipment is often the first step to make buildings more resilient, and so the proposal would enable more options for the placement of equipment above flood level, either atop of roofs, which is a common strategy for larger buildings or in a separate structure, which is a common strategy for large sites or smaller buildings that can not accommodate the added heavy load of equipment within their building or on the roof of the building. So a big portion of the floodplain contains businesses that offer either neighborhood services or that are part of the a large industrial, the large industrial economy of the city. Many such businesses can not really be completely elevated or dry proofed, and may therefore need to prioritize what kinds of spaces they would raise out of harm's way of flooding, so such spaces can offer the necessary support immediately after a storm event and reduce business disruption. The proposal would also enable different buildings of flood protection. Sorry, the proposal would also enable different types of flood protection measures to be implemented across all areas. In the flood plain, this would include allowances for flood panels and landscaped berms and their associated egress systems to be considered permitted obstructions within open areas. It would also allow spaces used for the storage of panels to be exempted from floor area to enable on-site storage. Lastly, in many areas of the city, zoning requires waterfront sites to provide waterfront access and in a wider range of sights at the water's edge. The grade of such waterfront yard or required visual corridor can not be modified. The proposal would continue to offer flexibility for grading to occur and facilitate other resiliency measures such as soft shorelines to be designed to help account for sea level rise so now for goal 4, which is the last of the goals that make up the project. This applies differently from the previous regulations, providing rules that would mostly apply on the city-wide scale. So Hurricane Sandy showed us how a storm's effects can go beyond the floodplain, especially across our energy grid. The proposal would allow power systems, including generators and solar energy systems, fuel cells, batteries and other energy storage systems to be considered permitted obstructions in open areas across all zoning districts to facilitate their installments. In addition to ensure all areas of the city can easily provide ADA access, the proposal would classify both ramps and lifts as permitted obstructions in all required open areas to facilitate accessible designs. Another important issue is how disasters, especially those that by the evacuation of residents, impact vulnerable populations, nursing homes have populations that require continual medical care, and research shows that this dependency can be strained, whether nursing homes, shelter in place or evacuate prior to a coastal storm. Therefore, the city believes it would be appropriate to limit the growth of nursing homes in high-risk areas to loosen the health consequences and logistical challenges of evacuating residents of these facilities. The proposal would prohibit the development of new nursing homes within the high risk, and that's the one percent chance floodplain and other selected geographies that would have limited vehicular access during a storm event. Existing facilities in those areas would still be able to conduct enlargements for modest improvements, including those that help with Resiliency. Lastly, Sandy showed us. Sandy also showed us that a lengthy process to update zoning regulations can present obstacles to the necessarily fast-paced disaster response. The proposal would include rules that could be made available to facilitate the recovery process from future disasters, some of which would be implemented now to help address the Covid-19 pandemic and its associated economic effects. The first one would be to give property owners who hold special permits and authorizations an additional term so that they can complete their original plan for construction on a longer timeline. The second would be support businesses that do not conform with zoning regulations by allowing them more than two years the current limit of discontinuance to return to operation in terms of next steps. The city-wide text amendment that we're presenting to you today is being referred out to all community boards borough presidents and to the city Council in the land use process. Community boards being asked to submit recommendations on to the City Planning Commission and those are asked for by December 28th. More information about the project, including an annotated version of the proposed zoning text, can be found on Dcp's website and I'll also know, there's a lot of information that has been part of the referral package that I believe will has put on the Community board website as well. So thank you for the time for this update and happy to try and take any questions that you might have Scott. Thank you very much and before we get to questions, I do want to remind you and, as we discussed earlier, that at this meeting this evening there will be no resolution coming forth. However, we will have a further discussion at the land Use committee meeting on December, 3rd and I at that time of resolution. If we so desired, we'll be will be produced. We would like to be sure that you have a staff member on hand at that meeting, so they can answer be prepared to answer any questions that may come up at that meeting. Okay, yeah! Let's do it December 9th. Do you say, will yes December 9th? Yes, that's the date! I have yes, okay! Trish! You want to stop asking the members of the public for questions. I see we have one member of the public. You want to introduce that member. Please sure wendy mcaver go ahead. Can you hear me? Yes, oh excellent. Thank you Scott. What a what a really pretty presentation! Thank you for coming to cba with this I am a resident of cba and I noticed that most of the pictures have nothing to do with us in terms of our buildings, our structure, our architecture, so I'm very sympathetic with people in those really lovely single family homes and I am very well aware of the coastal influences, for example, in North Carolina, where buildings have had to have been placed on stilts as a as a remediation for regular flooding, seasonal flooding- and that is you know, certainly a solution, but there's a you know an enormous problem with cutting zoning review time. That's a very hard one process that voters have put in place because we feel bulldozed by developers who just want to go for a race to the sky and the height of buildings themselves causes the global warming that facilitates all of this flooding. And we know for a fact that, above you know, the 210 height cap. That's you know available in many areas of the city that buildings above that level put out an exponential amount of greenhouse gases that cause just this kind of sea rise and flooding, and yet we're talking about placing mechanicals above ground, which may be absolutely a wonderful idea in terms of being able to keep buildings functional. But it does not mean that buildings should be going above that level that should simply be incorporated into that height level, and I'm wondering how it is. You are reflecting that it's a beautiful presentation, especially for other parts of the city but I, do not see how it relates to our pretty showed a map of our of our zone and I was very encouraged. But not one picture showed our buildings, our construction. We are built on granite, we're not a sandy shore. We have different geophysical problems and I'm wondering if you can rejigger your presentation and come back and talk to us about us, so I do not have a specific presentation that takes into just community board eight. This has been. This presentation has been done to apply to the 59 community boards across the city. So, as you can see, and as you highlight, there is some community boards that have a huge amount of implication. Out of this I mean as far as how the concepts apply to community board. Eight I would suggest they're the same where there is that type of development, so the say, for instance, the differences in streetscape requirements and things that are being proposed. Ada requirements, the ability to relocate mechanicals and things like that. Those are all largely enabled today, as part of the previous text, amendments that went through after Hurricane Sandy. The proposal at the moment is to increase it to the area that you saw in red on the map that I pulled up in community board eight, and really it's not doing a great deal beyond that. So I mean no. We had significant flooding, please forgive me. We had significant flooding during super storm. Sandy I was here, I saw the FDR drive become a kayaking lane. People were actually kayaking, so we are quite vulnerable and I very much respect, engineering, expertise, but I. You gave a wonderful presentation for areas, for example with a topography that is sandy or right adjacent to a beach seashore, and that in that sense we are not that, and when you look at our map you know we had significant flooding in 96th street that impeded patient access to Metropolitan hospital. We know that downtown. Of course the Veterans Administration hospital was affected and had to be evacuated as well as parts of Nyu. These are absolutely. You are completely right. Significant issues, but I did not see a presentation that talked about that and when you're talking about relocating mechanicals I am all for that. Then you talked about you know a permitting extra height. That is not okay. That part is not okay, that's something that voters do not think is okay and is in fact not okay in terms of environmental considerations that directly affect the flooding. So I'm wondering if you can actually readdress that I appreciate that there are so many districts in New York and that we have a very diverse topography. Even though four of the five of our boroughs are islands, and one is a peninsula also very much affected by the tides of the Atlantic Ocean, but this did not address Us wendy. We do. We do not like to have this back and forth. Please confine your remarks to the president. I will stop and I and I and I think you all have enough material to be able to continue. If you are also curious, thank you. If I can address the height component of that I mean within the yellow area. At the moment, you a building that is within the flood plain, can increase its height based upon its likelihood of flooding and the necessity for them to elevate to comply with. Firstly, the building code, which is the base requirement of all buildings, so the extent to which they can increase height is not to an excessive standard. It at most is about 10 feet and it allows them to measure their height instead of from the ground level, which would be susceptible to flooding. They measure their height from what is the design flood elevation so that effectively puts their ground floor and measures above that at the maximum flood elevation. So the extent of increase in height, as I said, is largely available to those properties in yellow. Today, it's proposed to be increased to the ones in red as part of this proposal to reflect the 0.2 floodplain, but I mean you know as far as how much that increase would materially be I would not suggest it's a huge amount, but I'll leave that up to the discretion of how the board views that we have elaine Walsh, the Margaret, Tamayo, Michelle, Burnham and Lowell Barton. Please try to keep your questions to Scott for two minutes or less. Thank you. Thank you for your. Can you hear me? Yes, thank you for the presentation, but I am very upset about the presentation. Cpc has chosen not to do a presentation to our community board. We saw this presentation many years ago that went to the other boroughs. We need to see and I'm asking that when they come December 9th to do a presentation, particularly to CB8 mechanicals, have been an issue and new buildings being built have put them higher. However, what you did not address is that, although nursing homes must now not be permitted to build in these areas, our area is filled with hospitals along York Avenue, where the flooding does not count. So I'm asking because I'm very disappointed with the presentation I thought tonight was CB8. I've seen this before we've heard it before you've. Given us, no new information and I ask that for December 9th meeting, if that's the correct date that we not have no insult to you, the community liaison, but somebody who can speak to the technicalities of what we're discussing in our area, I'm aware of the low 60s, I'm aware of in the low 90s, the public housing, that's been impacted and definitely the FDR as well as Roosevelt Island. No one has come out to talk about what we need to build as far as height. No, if the zoning is a certain level, you do not get extra to build. You knowingly, purchase and build in an area where there are certain regulations into the basements most were in building and should never have put their mechanicals. We saw in Sandy what happened with all the hospitals and garages in the basement. So I'm asking now because I'm very disappointed with this presentation from a zoning perspective that Cpc come back in December and if you have a problem reach out to us and we will move to get a presentation that talks about us. I agree with the previous speaker that I do not need to know about the private houses in the other boroughs and what they need to do to go up nine feet to be above. The zoning flood, which now you're telling us probably should be at 12 to 15, which will make ADA regulations impossible, but I'm I must say I'm disappointed if you could identify tonight which I see it on the map but which exactly areas are in contests and what you see these buildings, because we do not have private houses can do to rectify their existence. Thank you, okay. Would you want to mute marco, please? Thank you. It was a beautiful presentation. It helped me a lot for this is my first time that I had to disclose who am I. I'm a licensed architect. Okay, I am a practitioner of all these revelations. This is what I'm very happy to learn. The second part is also I'm a certified female professional. So I understand is yes. The first speaker went and hit the nail on the top I hit the hammer on the top. So my point is very simple: for instance, you have a building that you showed the nursery home. Then you said you know these buildings. We do not have in our case, but the building we have in our case, you said this building. It has to discontinue the use to a nursery home. Great now you said you're going to you going to change the co. When you change the co, they apply the Appendix G and they append the g. Unless, if it's in compliance with the floating zone, you can not rebuild almost anything, you can not change anything, and that may happen the change of use in our buildings in our community, because there are buildings, especially on the low 60s, that have this kind of problems. However, on the 96th street I studied deeper in the those projects. Why? Because those projects, they never thought, there's going to be an approach area. Now there is an afro area, and my studies show that one of the biggest problems when the level of the water is coming at the level, whatever you put it eleven feet, that's deflated in that area. It's not the water is coming from that part, but also it's coming from the bottom up, so those buildings become floating from this percolate inside of the building of the water. So you can not do these kind of solutions. Yes, I appreciate that you go in the direction to look for solutions great, but the problem is not only that the building code, the only the floating area, is designed and is established like that. You propose there is the design floating elevation, which is three feet above the flood area which is higher. What are you are recommending, and this is absolutely right. The problem is, I'm practical how we're going to approach in our community I'm very happy for the other part, because new training is even better for me, but in this case we are in the community or eight. We have different kind of typology of buildings and we have to address in that direction and I found it that if you put barriers like you, recommend the water, you think that is the water thing. That's coming just only from the river up. No, it's coming from the floor for underground up, because the water table increase the level inside of the buildings, so it's unpractical, especially for the existing buildings for new construction. Yes, you can apply- and this is beautiful- the revolution for new buildings, but not for the existing buildings, because at any time they can create serious structural damage and not only that they can break the sewer system, the electrical system and any other system that is penetrate inside of the building. So this kind of solution you got to find out how you're going to propose to resolve that fire and I think it's completely wrong in that direction that you neglect to come and propose something for our community for myself, I'm happy because I learn more in the other part, because I'm a practitioner in the architectural field, but the point is in this case- is for our building. I have understanding for right now we need a solution for our buildings and then is coming the other issue, which is the esplanade, and this is coming other country issues. You say the floating zones, yes, is practical for other section of the community or what other community world I'm sorry, but for our community we are almost flat with the river. We do not have a chance like on the Houston area. You allowed to come the river inside of the land, and then the water is kind of recede back, so in our community. We do not have that chance. We need to create the different solutions and we have a problems in our esplanade that constantly collapse and they will continue collapsing, and that is why a standing pool in that direction so I strongly recommend you prepare something which is going to be very hard to resolve in a short, a short period of time. Thank you. Thank you. Mario Michelle. Thank you. Thank you, Scott for the presentation, a couple of points. Firstly, what I gleaned from this and I support the comments of all the prior speakers I feel the same way, but what I glean from this is in reality, there really is no proposal for our area. I. Do not believe that you came to us with this general proposal just because you know this is what you have if you had something more specific to CB8 I would imagine that you would have come to us with it. So my assumption is that, in fact, there is no proposal for the kind of topography that we have in CB8, so to the extent that you do not have a proposal. That, of course, is of concern. Let me address the height the height restrictions for the buildings, something that, as you may or may not know, Cba has been fighting for certain height restrictions because we have no zoning height limitations on first, second, third, Avenue etc, and a lot of building developers have been using the ability to put mechanicals in the middle of the buildings as a reason to increase the height very substantially and they're not doing that specifically for because of flooding, although because of the possibility of flooding, it's a good idea to put the mechanicals there, but what they're doing is putting it there so that they can increase their height and wear the residential portion and can afford themselves of the views etc and all the benefits of height. There have been some rules and regulations put in place that limit that extension based on whether or not there's an enclosure around those mid-level, mechanicals so number one in you're, considering of what's appropriate for CB8 I would like to ask that in fact, in order to put mechanicals above grade level, that developers not be afforded any additional space over what is absolutely necessary for the mechanicals. Sometimes they need eight feet, but the developer wants 20 feet and, secondly, that they're not considered as space, which then gets added as a bonus to the top of the building, because mechanicals are part of a building. So there's no reason to get an exemption because you're, including mechanicals in your building, there's no reason to get a height. You know to get more height ability because you're, including a necessary function of a functioning building, so that would be number one. That I would ask you not to you know. I would ask you if there is a presentation coming for us, that would certainly be included and addressed. The other thing is what we do face in our area that you have not addressed, and how would you propose to do it and if you do not have a suggestion now to please have it incorporated. We are loaded with buildings already built in our floodplain they're, already there they're their hospitals, their nursing homes, their residences, their parks, there's the FDR drive which routinely floods at about 125Th Street, and this has been true for as long as I'm alive and I believe engineers have tried to address it and somehow could not. So that's a very vulnerable area. I do not see a plan here, but how do you propose that the existing buildings deal with this? How do you deal with their basements? What do you do with that which currently exists? So I'm asking you that if and when you come back to us that you address the hype, the height statistics that I mentioned to you, how you propose to deal with our basements and how you propose to deal with the FDR drive, so thank you and I hope that you will have that information when you get back thanks very much. Thank you. Michelle and now Lowell Barton's last hand, I see up hello. Welcome hi. Can you hear me? Yes, sir yeah I, just I just wanted to point out to everybody that there are a couple projects ongoing in our neighborhood, where it is happening now at the Isaac houses they have raised all the mechanicals. They are building a building that was probably a open area or a parking lot, and they built up to raising the mechanicals, taking them out of the basement and they're putting them up above the flood floodplain. So that's a type of, and what they're probably going to do, I believe is build a flood wall around it, the property which was also in their presentation so they're doing like two of those components. Many other NYCHA buildings along the FDR drive have done that the reese houses, the Baruch and a lot of the private buildings, South Street Wall Street. What they have done, I believe on one of the presentations they showed how they build. They have walls that will go around right now. You can't see them, but in the sidewalk they have a lot of structure there. To put these flood walls around the building to protect the existing mechanicals that are in the basement. I have not really seen anybody just put them on top of the roof out of the out of the bottom, yet I do not know how they would have to support the roof or whatever, but the projects that I've seen that relate to this project have been flood walls and the raising of the mechanicals, and you can see that now on 96th Street 93Rd street at the Isaac houses. That's it! Thank you very much. Lol Tricia, let Barbara go first sure, just very quickly. I was going to say that metropolitan hospital is building the wall around just for that reason, Fema's it's FEMA money and it does, and the design and they're building a wall substantial wall to protect the hospital. Okay. Thank you I was I was just I was really just going to say that I, I'm really actually glad that we saw this early and that everybody was able to comment on it for Scott I like I, would have to agree, I. Think a lot and I do not know how much you flexibility you have with this, but I do think that if you're making this presentation to every community board across the city, I think it's very wise to think about the audiences for these, and particularly the in those that are not built on sand but are built on granite. Those who have more existing buildings that have more multi-family kind of homes and especially for us with the FDR drive and the esplanade and the hospitals as elaine said. I think that all of that does warrant just a slightly different focus. And so, when you do come to the to the December 9th meeting and I'm sorry the baby's crying in the background. But when you do come to December 9th meeting. I do think. That makes a lot of sense and I too would like to just see if we could get a little more focus. And if that's something that has to happen where we can provide with you, particularly as this committee focuses on the waterfront so as if we can provide for you just some more information about our specific waterfront and the and how this zoning change would impact that waterfront to get you to dial into more specifics on that or whoever else is presenting to us on December, 9th I. Think that would be extremely helpful. So I'm glad to have had this and I'm glad that our fellow board, members and Wendy raised some of these issues, because I think that overall, it's just going to be a better and more productive conversation on December 9th. If we just get if we can just kind of focus in on the information that kind of that is specific to our community I agree with Tricia Scott. Let's hear from you and some of the questions that were raised, I start okay, so I mean I, probably initially should address something that I think perhaps is has been lost in translation here, because I mean for this to be specifically tailored to community board. 8 would require FEMA to be issuing a specific flood regulation that applies to Community board 8 and for the zoning resolution to only specifically apply to a part of community board eight and the way this text amendment works is that it operates for the whole of the city in the same way, so FEMA issues, flood level elevations that apply to the whole city. So it does not matter if you're on sand or on bedrock or what your built context is. That level is the same. So this is seeking to solve an issue on a citywide basis. And, yes, you know the Upper East side and cba specifically has different built, form context and a lot more older building stock than a lot of neighborhoods, and it does not have you know factories and small houses and things that were perhaps you know shown as examples in the presentation, but regardless of what the structure is, that the building flood elevation plane that is being adopted here, it applies in the same way. The elevation of mechanicals and the ability to increase height applies in the same way as well, so I mean I will take all your comments back. I've been writing them down and we'll consult with the resiliency team. We had not anticipated presenting again on August 9 and I'm not sure that was what was specifically offered. We welcome all of your comments and they are welcomed as part of the exhibition of this or sorry, the public review of this August 9. We can certainly come back and try and answer some open questions, but I'm not sure we'll have a specific presentation for you, because this team is working on 59 community boards, so to tailor this specifically to every single one of them. It would be very difficult for them, so I mean I. Do not want to get your hopes up in that regard, but certainly your communication, your comments will be communicated back wayne. I have here, is on infrastructure such as the FDR and hospitals and things you'll. Remember at the start of the presentation I had outlined that one NYC is the citywide plan for resiliency, so there is numerous different components in that some of it is the east side coastal resiliency project. Some of it is protecting infrastructure and different specific projects. This one is a very narrow look at private building stock and how barriers can be removed for private building owners to either incrementally or at once, improve the resiliency of their building, specifically hospitals, completely separate of this, the FDR completely separate of this and infrastructure in general. For that, for that matter, so I mean I. Hope that clarifies some of that question. But again we'll take your comments back and I mean if they continue to be something that you think is relevant, then again we welcome them in the comments that you send back to the public review of this project, something else that was raised. There was the possibility of developers using mechanicals to their advantage to get extra height, and many of you will be familiar with a text amendment that the city did also I believe it was early last year relating to mechanical void spaces, and this does not supersede that developers won't suddenly be able to circumvent the action that the city took last year to start trying to increase the height of their buildings. Artificially again due to mechanical space, they still have to justify the you know, areas they're using as mechanical and when they get above a certain threshold, it automatically counts as floor area. That's the way that the Voids text amendment worked, and it's proposed to continue in that regard as well so I mean there's a number of different points there and again, I'm happy to communicate them back to the project team on this and and try and give you some appropriate answers, but also welcome your comments in the recommendation you have ultimately to to this project and by the way Scott you kept referring to August 9th. We really had in mind December 9th. Yes, sorry, that was definitely what I meant do not we wish we all I see. Elaine Walsh is back with a question marco and Tamayo, I'm Michelle, I'm sorry Michelle, I'm sorry, Elaine, let's go okay, Scott I appreciate what you just said, but it is an insult. We are volunteers on a cb-8. We give lots of time and you're telling us your staff do not have time to zero in to a particular present presentation to a community board. Your responsibility is to present a presentation to cba what the questions are that were raised. You've not answered. We do not, as a zoning committee co-chair except the broad presentation you just gave. We expect on December 9th that you come in with the impact on cba. If you can not, then suspend your timetable and come to us in January I have spent, as is my co-chair and many others on the board. Looking at this issue, I was familiar absolutely with after sandy, but what you've added is zero and I have to say personally, I'm insulted having to sat through your presentation of a generic plan for the city. Each community is different. You need to come in with a presentation for each community. We do not have rise the floor, so the water flows underneath the building. We have serious issues in our community, with institutions, with housing, with parking, etc. On that area and I have to say sitting through this I am so insulted by your not being prepared you're. The community of Liaison I do not want to hear this again. I want to hear from somebody who can respond and tell us the options. If not I will recommend. We disapprove not that we can, but I am really insulted by your presentation and dealing with other boroughs and not coming in with what the challenges are for our community and how far up the avenues we go on this it looks like York and Easton. Maybe first we need to see that from you or your plan is worth nothing. Thank you. I'm sorry, I'm angry and I am furious. I see a hand we have not seen before craig later. Will you unmute craig, please and then I'm going to Tricia, please Anthony Craig hi good evening. I just want to thank you for the presentation, as someone who lives in a building where we were evacuated in the height of Sandy and displaced for almost two weeks. I very much appreciate the effort that this that the city has gone through and DCP, especially to ensure that neighborhoods and communities and residents who live in vulnerable areas are going to have the ability to be able to harden their homes and their buildings and to be able to deal with the inevitable threats of climate change and sea level rise and flooding, threats that are going to continue. I understand as an urban planner. How difficult this is to come up with something that can accommodate the entire city. So I very much I just want to extend my appreciation for the work that you did and to let you know that there are some of us who are not insulted by your presentation and who think that this is a very thorough job and the impact on our community in many respects and I say this is someone who is affected by Sandy severely is going to be very minimal compared to much of the rest of the city, where you have tens of thousands of people who are going to really be able to benefit from this, so I just want to put that out there and provide those comments. Thank you. Thank you. Craig appreciate that thank you, I just I, just again, Scott I guess maybe I'm maybe I was misunderstood. I'm I think that, specifically it's not as much the data as it is the presentation piece to this of what of what to focus on the next time that this is brought up. I think that there, a lot of questions have been raised around like and specifically since this is parks and waterfront I'll talk about the esplanade which you mentioned in your presentation, but it was not like it really did. Not I was having a hard time better understanding of like how that translates to the esplanade and how that translates for this, for my community so and then specifically with like the mechanical voids piece and that sort of thing it just said if there can be additional clarity on like on what that really means for these existing buildings and what that really means for, like the for the type of properties that are in our that are in our neighborhood. So I'm it's really just a better just making it more applicable to, even though I understand that the zoning is for the entire city, it's really better understanding. How it's applicable to our community is what I'm is where I'm getting at and again like I, I'm more than happy to send you to send you some that I've been writing down these questions too. But more than happy to send you like how those specifically, how that, like those pieces, that I think that a lot of folks are kind of raising in terms of just better understanding what this really means for us certainly noted on the voids there. We could certainly, if you have specific questions on that, that's where this really sort of gets quite technical. So if you have specific questions about that, please feel free to communicate them back to us, I mean all I can say about the esplanade. Is it's a piece of infrastructure that the city maintains this text? Amendment does not do anything to address that. That's a different part of the one NYC project, but that's the extent of what I can elaborate on that. Thank you. Scott Marco did your second bite of the apple. Please make it brief. Thank you so much I'm going to raise the issue when you said that the Sunday resolution has to be general. First of all, let me put one thing to you: are in the hot seat: it's not against you! Please it's, because we want to have solutions for our neighborhood. We love our neighborhood and we fight for our neighborhood. What I'm trying to say is we are pushing to you to do the right thing for our neighborhood. That's it do not take personalities now when you refer about the low and high density and you make unique from the concept of course, when you read the Sony resolution, you put it, this dress resolution is for r12345 and then you put for high density, seven, eight r, seven, eight nine ten, so you put in general terms. So therefore, you have to cover and your solutions has to be very careful. Crafted otherwise I think is a failure. This kind of happened right here now. Let me address something very important. You just hear what a fellow community member mentioned that they put the mechanicals in the natural developments. You know, I do not know. If you pass over there, they were doing the boarding test like they're, building a hundred story building. You know why, because they are fully aware that the water is not coming from the river it's coming for underground and when it's coming underground is going to damage seriously the foundation that you'd never see, and nobody see that part- and this is why the is total engineer- probably rather myself. I will put it on the top of the buildings because it makes easier now these people that decide to use the open space they misuse, they neglect to use the means, their open space, which basically is drawn. We have that affect the quality of affordable housing in our community, but this is another discussion. I do not want to go in that direction. The point is, if you want to put I, hear, also a wall around the building. This is a joke. You know what, because water they always go for the weakest part, never go for the hardest part, so you put a wall in front of a building. The water go around the building. So the point, my point is you're, going to think carefully what you are proposing, especially in for our community for the other communities. I applaud. I agree and thank you so much training a little bit more I appreciate that part, but for our community I do not see that you actually represent something. Thank you. Thank you. Marco and Michelle has the last word before we move on. Thank you thanks Scott for addressing the the height and the mechanicals, let me ask you something: let's take craig's building the one he just described that actually was affected and he had to be evacuated. An existing building that exists in the floodplain, a multi-story multi-occupant building. Can you tell me how that building and the others like it? How do they address their position in the floodplain, so I mean I, do not know the building you're specifically talking about, but it's generic, it's a generic building. He described an existing building. Let's presume that and others are in the flood plain they exist. They're already built people are living there. How do you suggest? How does the agency suggest a building such as that protect themselves in case of a hurricane? What did they do we heard about building walls around it? We heard that water goes around walls, water, willow, it's flexible; it always finds a path. We heard that water comes up from underneath the building, so I'm just asking since Manhattan, particularly our area, has that kind of building an already existing building. It's either occupied by residents, businesses or community facilities. They their board decides they want to address their position in the flood plain just give me an idea of what it is that they do. How do they go forward? So it depends what exactly exists within the floodplain, because if, in particular there is habitable spaces below the design, flood elevation say on the ground floor and they want to relocate those. It gives them options to do that now, specifically how they would be able to do that within a you know, a certain building context, I'm not sure, because that depends on the exact building itself, but it's possible it would be, they would be allowed to add height to their building, where they've taken it away from the ground floor on the basis that ground floor will be presumed to flood within. You know the predicted design elevation, so the main I guess objective is to get habitable spaces out of the floodplain first and foremost for existing buildings. The second thing is: it encourages the dry or wet floodproofing of spaces that are also within the floodplains, so say, for instance, the building you're talking about it does not actually have any habitable residents below the flood elevation. It has, you know, say a store or something like that. It allows or encourages certain wet flood proofing, for instance, where say that space would be designed to flood, so you can put different things within a wet flood area such as you know, parking or storage and things like that, but it specifically tries to ensure that those spaces are either designed to flood. It also encourages dry floodproofing, which is more cumbersome to do, but basically that involves completely insulating the outside of the building to ensure that water is not designed to come in so that you know relates to seals and foundations, and things like that, but that does not allow for, as far as I understand habitable spaces to be under the design flood elevation. So there's I mean a few mechanisms there for existing buildings, which an exist which mechanism a specific building may choose to use will obviously depend upon its financial ability to do that, and how it's able to sort of compensate for that within the provisions within the mechanisms that the zoning is allowing them to do that. Okay, so I got that, so there are some alternatives to put things on top of a building that were originally. On the first floor, however, there are many buildings whose foundation can support additional height and weight, so that would be something that might be eliminated. I know the hospital is one. The hospital for special surgery is one such incident that you can't put any more stories on top of it. The foundation won't support it for an individual building to deal with this. Does the agency walk them through there? This is there any way to get funding for this or any kind of supplement to a building or an institution. Taking such a project on where do they get their guidance? Do they have to always hire their private engineers? Does the city help with this? Is there city, funding or partial funding available for any of this? So that is the sort of the specific sorts of questions. I would be happy to get back to you on, because I do not know the specifics of that. There is different types of initiatives that are available to different owners to you know assist with the financial component of this. As to the advice part of it, I mean everyone has to go through the department of buildings, the text amendment sorry to build things and to change things. The text amendment would promote them, working with the department of buildings and their own architects and engineers and consultants to try and solve the specific issues they're trying to they're trying to resolve within an increased flexibility framework I mean that's the extent of what I can comment on that. The financial stuff is a little beyond me. I'm sorry yeah, no well I. Thank you for that. It's helpful, but I think those kinds of parameters ought to be made known, because if you want to encourage buildings to do this, they have to know that they can financially otherwise as well. Most people- just let it be until there's the next disaster, there's going to be very little impetus to take this on and be aggressive for an individual institution in a building that has already been built. In other words, it's in existence to do something as monumental as this, without knowing the available resources, both professional and financial, to them. In order to take this on and to encourage them to do such a thing prior to the next disaster, so that's all I would say is to maybe include that kind of information in your next presentation or in your guidelines thanks. Thank you, Michelle Scott I want to thank you very much for your presentation, but take you have an opportunity now. Is there any anything you'd like to say before you leave no I. Think I'm good. Thank you. Thank you for your time. I appreciate everyone's time and comments and I mean again. This is on public review, so it is on public review to try and gain to try and get comments out of this. So please use this opportunity. Thank you very much, Scott and now I turn it over to trisha. The rest is yours: Trisha, thanks Barry, so we're going to move the agenda to the next item, which is a presentation and I'm just looking for our speaker. Oh Michelle. Thank you. Sorry Michelle! So Michelle go ahead please and from the Asia Society for Park Avenue Wonderful. Well, first I'd like to I think my colleague Jennifer from the New York Parks Department, is going to give a brief introduction. First. Is that right, Elizabeth? No okay, oh yeah there! She is I, think you need to unmute her. Actually can you hear me now? Yeah hi I'll just briefly introduce this and then Michelle can share all the information with you. I'm the senior public art coordinator at NYC parks. Our office is part of the art and antiquities division at parks. My job is to oversee permitting of temporary public art exhibitions in parks. Citywide we're a small team of two people working in all five boroughs, I think the most recent exhibitions we've done in CB8 include the Joseph La Piana exhibition, which was the kind of tension sculptures which was in early 2019. There was a piece at 70Th and at 67Th, Street and prior to that was Tony Craig in 2018. So tonight we're here to just share some information about a temporary public art exhibition that the Asia society will be exhibiting as part of their triennial, which is on view now. This will be part of phase two. We are looking for that to be installed in March it'll, be on view through June. Just some very quick details on the temporary public art program. Exhibitors are required to have general liability insurance for their exhibitions for the duration of the exhibition for Park Avenue because of the train, tunnels underneath and the sensitivities of those train tunnels. We do require MTA, Metro, North Engineer review, which we completed earlier this year, just to ensure that weight loads will not cause any structural issues to the train. Tunnels underneath so that's been taken care of to ensure safety all around and then I will turn it over to Michelle to show you some visuals and explain a little bit more about the work and the artist and the triangle as well. Great. Thank you Elizabeth and thank you Trisha, and thank you to the Community Board for inviting me this evening to speak with you all. It's really an honor and I. Thank you for your time. Just to introduce myself. My name is Michelle young maplethorpe, I'm the vice president of global artistic programs and the museum director at Asia Society. In addition to that, I'm the artistic director and co-curator of the inaugural Asia society Triennial. This triennial, which Elizabeth mentioned opened on October 27th, is the first initiative of its kind and actually sorry, let me let me get to the screen here. Okay, let's see okay hold on one second, sorry! So, yes, so let me introduce you briefly to the Asia society triennial. The inaugural edition is called. We do not dream alone and it's the first initiative of its kind in the United States that champions the work by Asian and Asian American contemporary artists. We had initially planned to have the exhibition on view from June to August of 2020. Oh sorry from sorry from June to yes from June to August of 2020, but because of the pandemic we had to pivot, and so now, instead of that more truncated schedule with a more purview we've consolidated most of the works at Asia Society, and it will run between two parts over eight months from October 27th to June 27 2021. So this just kind of gives you a little bit of the metrics for the project and then this is not moving. So here you can see the venues that we're working with as I mentioned, the primary core part of the exhibition is at Asia Society Museum. We are also planning to have the discrete installation that Elizabeth mentioned on the Park Avenue Median. There's the collateral exhibition, that's on view right now. The New York historical society called dreaming together. That will be on view through July and then, as part of our part, one edition, we will have a presentation in Times Square for the month of January. That will be installed as part of the midnight moment program that is presented by Times square arts. So for the month of January, one of our artists will be presented every evening in a panoramic presentation on the digital screens in times Square and then, additionally, we have a performance element to the project and that is going to be across the city. You know permitting health permitting and one of the venues will be David. Geffen Hall we'll have a one day installation there. So some of the themes that we're working with for this inaugural triennial are democracy and freedom, borders and identity, environment and climate change and gender and agency. So here is a rendering of the sculpture that we're planning to install on Park Avenue Median. It's called eternity male figure statue of Venuskinetrix and it will be presented as a public outdoor sculpture at in front of Asia Society's building at 70Th Street in the Park Avenue Median, and the outdoor component of this will be realized in conjunction with the fund for Park Avenue under the auspices of the New York Park, New York, City parks and art in the parks program. And so this outdoor sculpture will be accompanied by a companion of indoor sculptural editions which are actually on view right now at Asia society I welcome you to come, see them in person. If you're curious to get a better sense of the works. What this incorporates is actually very specific to Asia Society. We had commissioned the contemporary chinese artist Xujen to create these, and so the upper figure is an inverted replica of an 11th century cambodian figure from the Rockefeller Collection part of our esteemed traditional collection of asian art, and the bottom figure is a second century romanesque figure from a replica figure of a female form from the Getty collection. And so you know the dialectic between these objects and the multiplicity refer to issues in contemporary art relating to connoisseurship. This kind of class of civilizations, between East and west, about you know, collecting practices in the United States thinking about gender, male and female thinking about with contemporary artists. You know kind of this idea of what is unique and what is kind of an endlessly replicated way of working or kind of thinking, conceptually or thinking of the craft of working and so thinking about cultural appropriations. Many of these kinds of issues are all embedded in the ideas behind this work and just to give you a little bit of an idea of a background about the artist Xujen was born in 1977 in Shanghai China and he currently lives in Shanghai and he's very naughty, and his work is quite provocative. You know it's Multimedia, sculpture, painting, installation and he talks about in many of his works. The socio-political taboos in contemporary China and also thinking about the relationship of art and commerce in contemporary art and culture, and so you know he's he plays on this idea of the individual artist versus kind of an artist. You know as a brand or as a corporation and kind of thinking about the role that money and branding have in the success of contemporary artists. So these are just kind of an image of the two companion works together, but you know we're very excited to be partnering with time with New York, Parks Department, and you know with the neighborhood. This is just you know, for your reference, a truncated list of our triennial supporters, who have been working with us and have been supporting the project, and so you know that's just a quick, quick overview of the exhibition and I invite all of you to come see part one. Our museum is open from Thursday through Sunday and it's very safe. We have time ticketing, so we're very you know we're complying with the city and state regulations, and you can reserve a ticket ahead of time and I'd be happy to answer any questions you have either about the larger project or about the commission project that we're proposing today. Thank you. Can you just just before we go into questions? Can you just clarify when it would go up and how long yep and then when it would come down? Sure, apologies for that, so the outdoor component, that I proposed to you will be on view from March for part two, so it would be on view publicly from March 16th to June 27 2021. We are still working out the exact details of when the installation will happen, and perhaps you know we can get back to you on that. If that is a concern, but it will be very shortly before the 16th great thanks unless I see I do not see any members of the public raising their hands. So then we'll go straight to the community board members, so it's sherry, then Rita, then Michelle, then Alita Great Sherry you're unmuted, but we can't hear you will I still see her as muted. She one second, the one with her hand up is unmuted right now, okay, sure you're also signed in twice, so maybe try that other device how's this better yeah I, do not know why my ipad is not working a habit on two. So my question was especially the sculpture: that's going to be on park Avenue as you described it, as is quite controversial. So I'm wondering were these designs submitted to somebody for review, or they just were chosen by the asian Society or did the parks Department or anybody in anticipation of comments that we may be getting? I'm just curious who has approved, or did you get approval from some agency other than the Asia society? To put these particular works of art up I we have actually I mean this particular commission is not in itself controversial or provocative. I was referring to the artist's larger practice. I think there are certain series that he's worked on that are more provocative, I mean I. Think in his usage of these two sculptures from the Asia Society collection and the Getty collection, I mean they're quite universally regarded as benchmarks of Connoisseurship, and you know kind of the highest examples of their type, so he's just kind of having a conversation about you know, aesthetics and people's perspective of what they consider. You know, beauty or you know their personal preferences, but I do not think that it's controversial in a way that would cause any problems. That being said, we did have it vetted through the New York Parks Department. It went through a review and it went through and Elizabeth. If you want to speak to that, you are welcome to jump in yeah, so typically for projects on Park Avenue. They are first shared with the fund for Park Avenue, who maintains on the plantings along the malls. So we share with them. They have the sculpture committee and they will ultimately determine which proposals to advance parks's review is generally in terms of safety. Structural stability that they're going to comply with our requirements. In terms of you know the mta's requirements that they'll have insurance and things like that art is very subjective. You know we did not really have any concerns about this sculpture when it was brought to us. But if there are any concerns about the artwork, you know they ultimately do come to two parks department would respond to those great I hope that answers your question. Yes, thank you. Thank you. Rita Michelle Venalita hi I just want to thank you for what you do, which is bringing art to the masses who do not go into galleries, but I do have one question regarding this particular sculpture. What about wind? Only because of the position of you know of high and the legs are narrow. Has this been tested for extreme winds? Yes, that question, and we did that's part of the review with the MTA Metro north engineers. It's attached to a base which is engineered to prevent, overturning and to factor in for the wind loads. The engineers at the MTA are very familiar with the wind conditions on the malls, so we've properly, you know made sure that it's going to be stable and that we do not have any issues. I think we've done quite well on Park Avenue with other sculptures. We have not had any artworks toppling over or crashing through the train tunnel alternately. Thank you very much, joe yeah. Thank you. Thank you for the presentation. Yeah. My concerns were along those lines too, because the aesthetic of it is that's very subjective, so I'm not going to address that. But what is the overall height of this, including that very high base I, did not catch it off your initial slide. The overall height is 149, it's a just over 12 feet. How much is that? What what's the height of the base alone, the height of the base, is let's see I'm just trying to do my math hold on one? Second, it's about three and a half feet. I would say: okay, the reason I ask is we have faced this before I assume that the mounting and all that has been approved by the MTA, how this is down into the earth and all that I assume all that is done. The materials are. What is this cast? It's bronze yeah, yes, Cast, bronze, correct and the internal steel armature, and then the base is concrete, so it's very stable. We've done all of our due diligence. So that's a concrete base. Here's why I'm asking a sculpture came before us a while back that I do not remember the artist, but what it was is it had components which were very inviting for teenagers to climb on I. Do not mention little children because they're usually accompanied, but you know, for teenagers at night to climb on etc and the height of the base. Here three and a half feet seems to be very inviting to me for somebody to climb on you know a kid to climb on reach up to the top. I noticed that the sculptures that you have in your interior are on a much lower base, which is not as inviting and I'm wondering. If that could be a consideration here. I mean, are you feeling or is the artist feeling that three and a half foot base is critical to his sculpture, or is it just considered a mounting that was in some way arbitrary? So that would be the first question. The second question is I'll, just throw them all, so you can answer them in one. Are there? Are there any guards and is there any commercialization of this I know the Goodman gallery is his representative and so they're listed, and you know- and their interest of course, is in the promotion of this artist, which will be mutually beneficial to the artist and the gallery going forward. In terms of selling his work, but so I I'd like to hear a little bit more about the commercialization and also if you can address the climbing concerns and I think and that that's really it and a guard sure the climbing, if you, if you like, just we've, been exhibiting sculpture of all kinds on Park Avenue for probably 20 years, maybe longer we have not encountered any issues yet with anyone climbing. If that is a concern, we do also have no climbing signs. The parks can provide explicitly saying no climbing sculpture but I. Think I might recall the piece that you're referring to, which was a tony craig piece, and we did not hear any reports of anyone trying to climb it. Well, I, you know they're, not all they do not all lend to that kind of thing. That one was a horizontal with bars and everything it was particularly inviting this one is more inviting for climbing on the base for taking pictures. For you know if it is not an integral part of the artwork I. Just wonder if you can take that comment back and maybe others would see it more appropriate to put it on a lower base which would not be so inviting I. Do not imagine you have guards around the clock, but do you have any you know, cameras or security cameras or anything like that? Well, we will have a guard during business hours that is stationed right at the front just partially, for you know, security and temperature. You know the whole Covid-19 protocol and they are stationed right at the front door, and so they have a view of the sculpture. So at least during that part, there is somebody that has visual supervision on that in terms of the base. You know it was partially the artist's intent and their desire to have that scale just for the aesthetics of the piece, but there were also structural concerns, and you know I think that one of your colleagues had addressed that the safety issue in terms of wind and so having that base. We calibrated it for the safety and the structural soundness of the work, and so it does need to be that height for both aesthetic and safety reasons and in terms of the commercial Element Asia Society is a completely non-profit organization. We do not collaborate with galleries for the sale or promotion of artists work for that purpose. So you know what artists we can't control what artists and their galleries do outside you know, but for the purposes of our exhibition is it's a completely scholarly exhibition, we're not involved with Marion Goodman, and so there is no commercial aspect of this whatsoever. So I hope that answers your questions. It certainly did. Thank you wonderful! Well! Thank you. All I really appreciate your time. Oh is there? Oh yeah, sorry Michelle you're. If you can give us a few more minutes, we'll go quick through the rest of the questions. There's a couple more board members who have questions. Okay, sure I do have an appointment at eight another with my trustee, but if I can answer two more questions, if that is okay as well all right, elita and then Irma, I'm sorry, marco, if you want, you can send me the question we can see this. You know what I just wanted to say. Thank you to the museum for bringing some sense of beauty and normalcy, which we all crave so much so I do not have a question. I just really wanted to express gratitude. I appreciate that so much and I do hope that all of you will come visit and I apologize for my time. I thought we would be finished by now, and one of our trustees had asked me to do something. So if we do run out of time after this next question, I'd be happy to answer any subsequent questions. You know, shimomura can send them to me or you know we can communicate afterwards. I'm happy to address anything yeah I just want to thank you all for the presentation as well. It's great and I'm just one of the happy ones. I'm looking forward to going to the Asia society and seeing the triennial I actually have a time ticket for like this weekend 19th. So I'm really looking forward to it and I think the sculpture is great and I promise not to climb on it. Thank you. Thank you, we'll be looking out for you to make sure you do not be here, but please, if you come, please ask for me: I would love to meet you and you know if there's a possibility, we'll do that. Definitely I will thank you. Elizabeth and thank you. Michelle can I, just ask you a question. Elizabeth are we? Are you looking for, like a board resolution to support of this or no it's just informational, because it is very temporary. It's only three months about three months for any of our temporary public art exhibitions because they are temporary. We primarily come as an advisory. Great and Michelle. Please feel free to leave. I know that you have another appointment but marco. If your question has to do with the parks, Department you're they're here so can we on you, marco, just in case again take good care of you. Thank you very much, Michelle, wonderful, Presentation! Thank you. The only thing I'm going to say is thank you for the presentation and I support that thank you. Okay, a pleasure yeah. If I could and I do not know, just I want to step away as chair and just really quickly say how wonderful it is to see to see our on the On Park Avenue again, it's really nice to see it again and I honestly thought that everything that she was saying about speaking to gender and classics and the conflict between the two and all of these things were just really spot-on. So that's not as chair, but as a perspective, I thought it was it's wonderful to see it, so I'm so excited. So. Thank you. Thank you. We appreciate. We appreciate your support. It's been a challenging year for public art. You know normally, in a normal year, we'd have probably somewhere between 50 and 60 exhibitions, new exhibitions per year this year it's been 20. so we are thankful for partners like Asia Society, who are still able to make their exhibitions happen. Even if it's on a different timeline just to get art, that's out, you know, for the people and inherently public art is great for social distancing. Elizabeth can I can I just clarify your role at the parks Department, because I think I want to talk to you about something else, not tonight but yeah. What is your title at the Parks Department, a senior public art coordinator great, and can you give us your email address yeah? Is that best from I think will has it but yeah he has it. I. Do okay cool, follow up with you, wonderful anytime! You have questions, I'm happy to answer them so exciting. Okay, we're going to hear now from Wes Hamilton Barry can I just flag for you that I see that Mubeen is here, I. Think and stacy pappas is here. Two people who I just after West gets done. I would love to see if they have any reports from us, because stacey is our new executive director of the friends of the East River Esplanade and Mubin is our representative from muslim volunteers for New York, so just wanted to flag those two people and if they're around I, see at least stacy and I. Think moving is here as well, if they're around just please stick around afterwards thanks sure, good evening, everyone I hope. Hopefully you can hear me. Okay, I can't hear myself, but can everybody hear me? Okay, yep great welcome everyone, I'm Wesley Hamilton, I'm the parks, manager of New, York, City, Parks, Department and I appreciate everyone coming out tonight again to the Zoom meeting and I. Just have a few quick, brief updates, but I am pleased to give us some new information, some good information, not necessarily artwork, but it is definitely going to be music, especially the children's ears. I can tell you that Carl's shirts Playground has now been completed and is open to the public and it's been receiving very good reviews. So yes, thank you. Thank you for the collapse. I wish it was for me, but I really did not do it, but we are happy and pleased to have that area open and to the public. Also we'd like to note that the pathway on the esplanade at 76 to 78 has been been restored. There is some more work to be done with that would be done with the phase work, but it is safe. It is the pathway is open and it is completely usable to the public. So anyone who uses that area in the past or if you have not used it, we encourage them to go by there and walk that. It really was very frustrating to have that path, blocked for many people, but now so now you can go from 60th street all the way up to John Finley, all the way up to I believe 117 on the espionage. So we're pleased with that progress, 24 sycamore parks in progress. The contractors still work in there, St Catharines, is still under design. Honey locus is awaiting bids. Some another update that I'm happy to give not on the capitol project, but everyone may remember: John Jay we've had terrible issues for the last two years with flooding with the spray showers at the playground. We believe we have that issue resolved now. They took a great deal of effort from everyone. We hired a contractor last year with the a very large vacuum truck. You may see the trucks occasionally working on storm, sewers and stuff throughout the city blocking traffic and it's basically a vacuum truck. We did that last year and we were unsuccessful this year. The Parks Department rented a truck and let our plumbers do the work and we got schematics from our capital team to get a better understanding of our drainage and our staff went in there and our plumbers went in there and instead of last season, we took out two truckloads. This time we took out three truckloads of sand from our drains and did some repair work into the subsurface and the plumbers report that they had it open, wide open spring spray showers as much water volume as they could and they did not flood. So we're very we're very pleased with that. So next summer, we're expecting spray showers would be fully operational in that bar, which is a relief to many people. I'd like to mention, as we have some volunteers on here tonight, but that we had I think some very successful. It's my park day projects going on throughout the districts in various parks I'm not going to go into, and we would like to encourage coming up probably next spring, but thank you to everyone who participated and we truly appreciate all their efforts and hard work as far as permits and events in the parks. It's pretty much the same as it was last month. Currently right now. I hope it can stay like that, as our cover numbers are not going the direction we wanted to, but currently right now we are permitting small events under 50 people in events that would not draw a crowd so specifically we're talking like private parties of birthday parties. Of that nature. First amendment we probably won't be caroling or anything of that nature, but we will. We are doing Christmas tree lightings and locations and then, of course, I use sports we're permitting new sports in our parks. The other last thing I'd like to mention is the Parks Department is opening, is open to hearing suggestions for parks, renaming I know that's been. Some topics has come up politically and due to recent events, so we've already had some areas of parks. That's been renamed. The agency is open to him, wes you're, breaking up glad. You have a word on that, but if people have any suggestions for any park areas, I know that I believe that was a concern and an issue, a topic at one of our community board meetings, specifically I'm thinking like 86th street Plaza, or how do we do something similar to that more permanent? This may be an avenue to that, not necessarily trying to say it's a memorial. But again it's a naming of parks or naming of certain areas of the parks, and some of them have been done as memorials to some of the black lives matters in some of our parks. So we're open to hearing more suggestions. It does not have to be that issue is not, but whatever you suggest we're open to hearing it, and there is a format for that to happen. If you're interested and that's all I've got for tonight, unless anybody's got any questions for me, west can get event in West. Yes, the naming of the section of the park, you say, there's a forum for that I believe there's a forum. Yes, I got to get a little bit more details and information about it. They just brought it up in one of my meetings recently and but I believe they did sit on a forum and I'll have to dig it up and I'll get that out to you guys, but thank you suggestions and we'll work. It through look, Rita and then Michelle put in your reader like many new yorkers I was out celebrating this weekend and took a walk down the esplanade. Only to find a motorcycle coming going. North and I wondered if you had any reversal regulations. It seemed very strange of whether it's electric bikes or electric mopeds or motorcycles. It was a small motorcycle, but it was a motorcycle. Yes, I believe I believe there's rules for motorized vehicles on the espionage. We do report it to our parks, enforcement and NYPD is able to enforce that as well. However, you know realistically there's a lot of challenges with especially with electric bikes, electric scooters, electric skateboards, you name it and the fact NYPD, but it's it is. It is brought to the attention- and we have seen an an uptick in that as well, and I've observed it as well, but we report it to our parks enforcement patrols and they try to watch for it, and NYPD can also enforce that as well and who is responsible for taking care of the glass or whatever it is at the end of John Finley walk because there were spray painted in the center part. Three initials very large I lost par part of I could not hear part of it. My computer froze up there, but I heard who's responsible for cleaning up glass and then I also heard some spray paint right who's response. What was the location I mean it feels like it sounds like it's parks. I have not observed it myself, but where was the location I think I'll have our guys take a look right in the middle right on the glass, overlooking the FDR drive, John Finley walk on Finley, thank you and right in the middle, so is it the Pedestrian bridge is that where you've got 80 80s 81st street looking down, you know right when you're at 81st and yeah I'll take a look at it. We've cleaned it before it depends on where it's at as well. I mean if it's from the inside, which usually it is, then parks can take care of it. Obviously, you know I can't put a bucket truck on the outside of the of the bridge, but I did not see it today, but is it new? It must be really new and you're. Saying it's on the glass on the glass three very large initials. Is it if it's scratched it may be challenged, but if it's spray paint we can, we can try to get that off and we'll take a look at that in black and green okay. We'll take we'll look into that. Thank you, and last but not least, is just a sound out to Mubeen and the muslim women of New York. Thank from somebody who lives across the street from Rupert Park I want to thank you for the devotion that you have toward the park. You have literally made a silk purse out of a sow's ear. Unfortunately, we need to do more, but you have you have done more than anybody and I can't. Thank you enough great. Can we go to Michelle hi? Thank you. I just wanted to say that you, your screen, froze and and I it froze through the whole part where you were describing, which parks you were thinking might be wanting name, changes, I and also there's a there's, a little blurb over West over your screen that says that you're lacking bandwidth. So that's probably why it's freezing, if that's a problem, I'd like to recommend the Google Mesh system. If that could be of help to you, but anyway, can you just repeat that part, because I did not hear it sure? Well, first of all, let me explain that what I'm doing is I'm basically using my cell phone, my work cell phone for a camera, and I'm actually looking at my computer up here, which is my personal computer, because I'm at home, so Google is not really an option for that. Unfortunately, but hopefully you can hear me now, I did not mention any specific parks. I was just simply saying that it can it does, it can be a whole park or it could be an area of a park. One of the areas I believe that came up in the past was 86th street Plaza and I'm just using that as an example. I'm not you know, but it came up for what reason it has no name, somebody proposing a name. Is that what you mean? No somebody asked about trying to do a memorial or something is similar to like what has been going on at 87th street plaza. So you know what I'm, what I'm saying is. You could actually name a certain area. You could suggest the name of a certain area or a certain location of a park and I was using 86th street plaza as an example, and hopefully I did not freeze at that time. It looks like I'm freezing as well yeah. Okay, thank you you're welcome, so we have craig and then moving I, correct I just want to thank you in the parks Department for the speed in which you were able to complete the repairs at 76th street on the esplanade and deal with the sinkhole. I was down there a few days ago and very much appreciated being able to have that connection to points south of 76th street and given how warm it was and how crowded the esplanade was. I think it was very much appreciated by our community, so I just want to commend parks yeah if I could just jump in there very quickly before moving. I'm very appreciative, wes the between the Esplanade and Carl Scherz and John Jay flooding, which I won't completely. Let you off the hook for until next summer, when I see it for myself that it does not flood. But all of that is just so impressive and I also want to say that I saw your team out on sometime in the last I can't remember. 72 hours, planting trees in our neighborhood I saw at least four trees planted between 72nd Street and 76th street in areas. So I thought that was great. You guys are really working hard and we just really appreciate it before just I wanted to ask one thing and then we'll go to moving. I also wanted to ask if you had any plans to clean the sandbox at John, Jay or just all of our sandboxes in general, before the winter sets in because of the weird strange, warm weather, kids are still playing out there and I've just been noticing that, like with the trees and everything else like that blowing with the leaves falling, it's just getting like the ratio of sand to leaves is shifting towards leaves. So I'm wondering if you guys have any plans to do one more sweep or one more rake before the winter. Yes, we'll constantly monitor that I mean right now the leaves are probably we just passed, probably pete. They were really beautiful, but now they're starting to all fall down, and you know our crews will be cleaning. There'll still be plenty more leaves to do with John Jay we've got the tub to do with the pool so as well. Think you're I think we'll try and use him. Did you hear me? Okay, no I actually think it's my. It might be my signal because I where I'm at, can you hear me now, so we I anticipate we'll be cleaning again. The leaves we have to do the tubs at John Jay in the pool- and you know it's challenging right now to do it every day because the leaves are falling quicker than we can rake them up, but we will clean it again. Yes, thank you, so actually I see so I guess, moving I know you're going to speak, but I was actually thinking that you would speak right after this, so I'm going to go to Sandra next, just in case she has a question for Wes: Hi greetings all I'm Sandra I coleman, I'm a member of the Community Board and the member in the community. Of course, I would be interested in obtaining the form for dedicating an area of Paul Shoots Park for black lives matter. Maybe a memorial section of the area where we assemble it as one of the organizers. It would be great to dedicate that area of the park that we are at and I'm certain a group of attendees would like to see that, especially since we have been attending non-stop for over 160 plus days since June, 2nd, no matter what the weather is like. So if it's possible I can obtain the form through one of the co-chairs if they can get it and forward it to me via email, and we can start the process to see if it can happen or not so, but I'm definitely interested in it and I'm going to bring that information back to the group tomorrow. Thank you sure. Thank you. We'll do great moving hi Trisha. Thank you very much. I just again wanted to thank cba for these very informative monthly sessions, so much about maintaining better New, York, City, Park spaces and green spaces. So thank you for that. I actually just wanted to give a shout out to Rita. Thank you so much for your very kind comments. They mean a great deal to us. I wish all the neighbors could be as involved as you, but having neighbors like you, has really improved community engagement. We like how neighbors are really getting invested in that park. We have a long ways to go, so I wanted to ask you trisha I, do not know. We had talked in the last meeting about possibly having a much bigger global meeting with all the constituents involved. You and Barry said that. Maybe you might eat in orchestrating that just wanted to know what the status on that was and I also wanted to thank Wes. We've done two cleanup events since the parks open one in August and one in October, and we were able to do the bulk of the planting for the fall, even though we only had 25 volunteers. So, thank you so much wes for all the support that you and pfp provided, but one of the big concerns I have for the immediate needs is the irrigation in Rupert, Park I know it's been an age-old problem, but can we figure out a way to at least get either? You know maybe best if you can advise us whether we can invest in a hose that runs all the length from the shed down to the green spaces up front. At least we can look into if there's something we can do to working with our members and neighbors etc. To raise money for that, because I have been starting to go to John J park a whole lot more because they have a lot more resources and I see some of the improvements in that park versus ours. So just wondered if you could address that so one. When can we have that more global meeting? So, as Rita said, we really need to take this dialogue further and two to see if something can be done in the immediate near term, because it really is we're relying on mother nature to maintain that park. As far as water is concerned, and then when we do go, we fill up bottles of water and you know pour water when wherever we feel there is a need, but I think there has to be more efficient system minimally a hose. Yes, let me just so I'm moving and I'm sorry. If I'm, if I'm late on this but barry, we can, we can talk about putting putting muslim volunteers or Rupert Park on the agenda for next month. If that makes sense to you to talk about this or the alternative, or maybe we do both is that I've been thinking about this and this kind of directly goes into stacy, but I've been thinking about maybe having a convening of all of our conservancies and like and groups that are taking care of our parks and open spaces just to get everybody together and check in with them. So maybe this maybe we can do both of those and that may serve different purposes that could be beneficial, just live and do a status. Let's address that in the next coming day, certainly by the full board meeting, we may have something to report. Okay, great and then I see, Rita has her hand up and then we'll thank you moving and then moving we'll follow up to Wes. If you could follow up about the irrigation hose issue, that would be great I just wanted to take this opportunity to thank you, trisha billy and all the other members of Community Board 8, who came to Rupert Park I. Consider you the younger I'm good with the broom you're, obviously good with a spade. So thank you very much and I want you to know. It's really appreciated I cleaned up two dead rats. It's funny. We had the exterminator two days in a row. West was kind enough to pamper us and we did get the exterminator in twice that week. I guess it's! That problem is a very it's a much greater problem than we expected and I think the pandemic did not help yeah happy to do it. Give me I'll pick up rats free time, for you maybe no problem, okay and then just I wanted to everybody just to give you a quick introduction of stacy pappas she's, our new executive director of friends of the East River, Esplanade and stacy in the future. I'd love to have like I, said you on the agenda and talk about the work that you guys are doing. But if I wanted to give you just a few minutes to introduce yourself and say hi to everybody, great hi. Thank you so much trisha. If this was actually such a nice surprise, because I worked with Michelle Young at Moma many years ago and have not seen her since so when her face popped up, I kind of was like whoa. That's who we're talking to tonight, so that was really great and I was texting with Wes earlier today and now I get to see his face. So that's exciting and trish I feel like we're old friends, because we spent you know a morning cleaning up some garbage. So so thanks, everybody I think next time or next couple of times we'll have some updates and a presentation for you guys to look at I really liked hearing what you have to say. You guys are really passionate about the community and really passionate about. What's going on in your your neighborhood, and you asked really good questions tonight. So I got a chance to get to know all of you a little bit more. It's only my fourth week as executive director of esplanade friends, so I have a lot to learn and a lot to take in. So I'm looking forward to getting to know all of you a bit more great thanks. Thank you stacy and welcome. Okay, patricia you got the last word Barry. Please take us away want to wish everyone a good, sound, safe, healthy, good night, good luck and we'll see you next month. Thank you for joining us. We greatly appreciate your participation good night nice. Thank you good night, Wes good night.",
            "summary": "I. Think it's just the two of us here tonight and the main reason we're here is to talk to you about a project that I mean city planning has been working on for years in different iterations, particularly since Sandy happened, and it's called zoning for coastal resiliency.\nProposes updates to the zoning resolution, specifically in chapter six, sorry, specifically of article six chapter four and some other related sections, and it's driven mainly because various different mechanisms have been introduced to improve resiliency, in particular, in building since Sandy happens and many of those expire in the coming years.\nYou may know of the East side, coastal resiliency project, which is a specific engineering.\nThe proposal is seeking to modify and improve the previous provisions that we're expecting to expire in the coming years, and it's doing so through a text amendment to the article 6 of chapter 4, that I mentioned in the zoning resolution and that part of the zoning resolution is called special regulations applying in flood hazard.\nSo I mean the different solutions that this project proposes affects various different parts of the zoning resolution as well, and the way this presentation, categorizes.\nYou know to the best extent, that the department can, at this point so on to the you'll, see here a series of maps, and while there are many sources of flooding that pose issues in New, York City Coastal storms present the most significant flood risk in terms of compromising human safety, property damage and business disruption.\nYou know almost a million new yorkers, so you know some widespread implications of this, particularly for where a lot of our city currently lives, so I- think in anticipating a logical question out of this slide that you're looking at here, I, suspect.\nProbably this slide and again we'll make sure it's available to you afterwards, but there's sort of four goals, or you know pillars that this project is seeking to make changes to the zoning resolution based off of.\nSo, we know that, firstly, the floodplain community wants to be able to prepare buildings for flooding, even if they are not located in what FEMA determines to be the current high-risk flood zone, especially those located in the areas that face moderate risk of flooding, and that did experience coastal flooding from Sandy.\nSecondly, people also want the option to raise their occupiable space a little higher than the current flood level that FEMA projects again.\nThey want options like moving their mechanical equipment to higher elevations, without necessarily triggering your requirement to raise or fully fr flood proof.\nWe, know that we need a way for the city to be nimbler in responding to future events that might require rebuilding homes or other forms of recovery.\nZoning for coastal resiliency would expand the applicability of the current text to a broader set of buildings that are also exposed to flooding in the event of coastal storms by allowing any lot located within both the 1 and the 0.2 annual chance.\nFlood plains to have access to the proposed special rules that help enable resiliency at the building.\nThe 0.2 chance floodplain serves as a proxy for the high-end projection of the 2050s one percent annual chance floodplain, allowing the city to advance resiliency in the longer term, as it would allow those living in those areas to proactively undertake resiliency improvements, even if they're not yet required to buy the building.\nThis set of rules would help promote good, long-term resilient design of buildings and would and how they meet the sidewalk through floor area.\nMoving on to speaking about situations where neighborhoods and buildings may be old, and maybe they do not fully comply with our current zoning regulations, leaving residents and in those instances it leaves residents in these areas in a hard position when they try and undertake any resiliency improvements.\nWe learned that raising mechanical equipment is often the first step to make buildings more resilient, and so the proposal would enable more options for the placement of equipment above flood level, either atop of roofs, which is a common strategy for larger buildings or in a separate structure, which is a common strategy for large sites or smaller buildings that can not accommodate the added heavy load of equipment within their building or on the roof of the building.\nThe proposal would also enable different types of flood protection measures to be implemented across all areas.\nThe proposal would allow power systems, including generators and solar energy, systems, fuel, cells, batteries and other energy storage systems to be considered permitted obstructions in open areas across all zoning districts to facilitate their installments.\nThe city-wide text, amendment that we're presenting to you today is being referred out to all community boards borough presidents and to the city Council in the land, use process.\nWe would like to be sure that you have a staff member on hand at that meeting, so they can answer be prepared to answer any questions that may come up at that meeting.\nYou know available in many areas of the city that buildings above that level put out an exponential amount of greenhouse gases that cause just this kind of sea rise and flooding.\nThe proposal at the moment is to increase it to the area that you saw in red on the map that I pulled up in community board eight, and really it's not doing a great deal beyond that.\nAnd when you look at our map, you know we had significant flooding in 96th street that impeded patient access to Metropolitan, hospital.\nAnd I'm, asking that when they come December 9th to do a presentation, particularly to CB8 mechanicals, have been an issue and new buildings being built have put them higher.\nWhat you did not address is that, although nursing homes must now not be permitted to build in these areas, our area is filled with hospitals along York Avenue, where the flooding does not count.\nAsking now, because I'm very disappointed with this presentation from a zoning perspective that Cpc come back in December and if you have a problem reach out to us and we will move to get a presentation that talks about us.\nYes, I appreciate that you go in the direction to look for solutions great, but the problem is not only that the building code, the only the floating area, is designed and is established like that.\nAnd I think it's completely wrong in that direction that you neglect to come and propose something for our community for myself.\nWe need to create the different solutions and we have a problems in our esplanade that constantly collapse and they will continue collapsing, and that is why a standing pool in that direction so I strongly recommend you prepare something which is going to be very hard to resolve in a short, a short period of time.\nKnow, Cba has been fighting for certain height restrictions because we have no zoning height limitations on first, second, third, Avenue etc, and a lot of building developers have been using the ability to put mechanicals in the middle of the buildings as a reason to increase the height very substantially.\nThere have been some rules and regulations put in place that limit that extension based on whether or not there's an enclosure around those mid-level, mechanicals so number one in you're, considering of what's appropriate for CB8 I would like to ask that in fact, in order to put mechanicals above grade level, that developers not be afforded any additional space over what is absolutely necessary for the mechanicals.\nThey are building a building that was probably a open area or a parking lot, and they built up to raising the mechanicals, taking them out of the basement and they're putting them up above.\nI believe is build a flood wall around it, the property which was also in their presentation so they're doing like two of those components.\nYet I do not know how they would have to support the roof or whatever, but the projects that I've seen that relate to this project have been flood walls and the raising of the mechanicals, and you can see that now on 96th Street 93Rd street at the Isaac houses.\nAnd I do not know how much you flexibility you have with this, but I do think that if you're making this presentation to every community board across the city, I think it's very wise to think about the audiences for these, and particularly the in those that are not built on sand, but are built on granite.\nThose, who have more existing buildings that have more multi-family kind of homes and especially for us with the FDR drive and the esplanade, and the hospitals as elaine said.\nAnd I'm glad that our fellow board, members and Wendy raised some of these issues, because I think that overall, it's just going to be a better and more productive conversation on December 9th.\nSo I mean I, probably initially should address something that I think perhaps is has been lost in translation here, because I mean for this to be specifically tailored to community board.\n8 would require FEMA to be issuing a specific flood regulation that applies to Community board 8 and for the zoning resolution to only specifically apply to a part of community board eight and the way this text amendment works is that it operates for the whole of the city in the same way, so FEMA issues, flood level elevations that apply to the whole city.\nThat were perhaps you know, shown as examples in the presentation, but regardless of what the structure is, that the building flood elevation plane that is being adopted, here, it applies in the same way.\nWe can certainly come back and try and answer some open questions, but I'm not sure we'll have a specific presentation for you, because this team is working on 59 community boards.\nAlso I, believe it was early last year relating to mechanical void, spaces, and this does not supersede that developers won't suddenly be able to circumvent the action that the city took last year to start trying to increase the height of their buildings.\nI just want to thank you for the presentation, as someone who lives in a building where we were evacuated in the height of Sandy and displaced for almost two weeks.\nVery much appreciate the effort that this that the city has gone through and DCP, especially to ensure that neighborhoods and communities and residents who live in vulnerable areas are going to have the ability to be able to harden their homes and their buildings and to be able to deal with the inevitable threats of climate change and sea level rise and flooding, threats that are going to continue.\nVery much I just want to extend my appreciation for the work that you did and to let you know that there are some of us who are not insulted by your presentation and who think that this is a very thorough job and the impact on our community in many respects.\nI think that there, a lot of questions have been raised around like and specifically since this is parks and waterfront.\nNot I was having a hard time better understanding of like how that translates to the esplanade and how that translates for this, for my community so and then specifically with, like the mechanical voids piece and that sort of thing.\nHow that, like those pieces, that I think that a lot of folks are kind of raising in terms of just better understanding what this really means for us certainly noted on the voids there.\nI mean I, do not know the building you're, specifically talking about, but it's generic.\nWe heard that water comes up from underneath the building, so I'm just asking since Manhattan, particularly our area, has that kind of building an already existing building.\nIt depends what exactly exists within the floodplain, because if, in particular, there is habitable spaces below the design, flood elevation say on the ground floor and they want to relocate.\nWhere say that space would be designed to flood, so you can put different things within a wet flood area such as you, know, parking or storage and things like that, but it specifically tries to ensure that those spaces are either designed to flood.\nIt also encourages dry floodproofing, which is more cumbersome to do, but basically that involves completely insulating the outside of the building to ensure that water is not designed to come in so that you know relates to seals and foundations, and things like that, but that does not allow for, as far as I understand habitable spaces to be under the design.\nThe text amendment would promote them, working with the department of buildings and their own architects and engineers and consultants to try and solve the specific issues.\nIt's helpful, but I think those kinds of parameters ought to be made known, because if you want to encourage buildings to do this, they have to know that they can financially otherwise, as well.\nI, think my colleague Jennifer from the New York Parks Department, is going to give a brief.\nIt's called eternity male figure statue of Venuskinetrix and it will be presented as a public outdoor sculpture at in front of Asia Society's building at 70Th Street in the Park Avenue Median, and the outdoor component of this will be realized in conjunction with the fund for Park Avenue under the auspices of the New York Park, New York, City parks and art in the parks.\nThese are just kind of an image of the two companion works together, but you know we're very excited to be partnering with time with New York, Parks Department, and you know, with the neighborhood.\nIn terms of you know the mta's requirements that they'll have insurance and things like that art is very subjective.\nI'm looking forward to going to the Asia society and seeing the triennial I actually have a time ticket for like this weekend, 19th.\nCan I can I just clarify your role at the parks Department, because I think I want to talk to you about something: else, not tonight.\nProjects going on throughout the districts in various parks I'm not going to go into, and we would like to encourage coming up probably next spring, but thank you to everyone who participated and we truly appreciate all their efforts and hard work as far as permits and events in the parks.\nI hope it can stay like that, as our cover numbers are not going the direction we wanted to, but currently right now.\nYou have a word on that, but if people have any suggestions for any park, areas, I know that I believe that was a concern and an issue, a topic at one of our community board.\nMeetings, specifically I'm thinking like 86th street Plaza, or how do we do something similar to that.\nI just want to thank you in the parks Department for the speed in which you were able to complete the repairs at 76th street on the esplanade and deal with the sinkhole.\nI think it was very much appreciated by our community, so I just want to commend.\nI know you're going to speak, but I was actually thinking that you would speak right after this, so.\nI just again wanted to thank cba for these very informative monthly sessions, so much about maintaining better New, York, City, Park spaces and green spaces.\nI just wanted to take this opportunity to thank you, trisha billy and all the other members of Community Board 8, who came to Rupert Park I."
        }
    }
}