{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB10",
            "channelId": "https://www.youtube.com/channel/UCXwRxm0zS0jBNTMOVI6xZJw",
            "title": "Executive Committee Meeting",
            "publishDate": "2020-05-29",
            "shortDescription": "Manhattan Community Board 10's Executive Committee Meeting"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB10",
            "normalizedName": "Manhattan Community Board 10",
            "twitterName": "Manhattan CB 10",
            "youtubeChannelName": "Manhattan CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
            "twitterHandle": "@mancb10",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 1,
            "um": 45
        },
        "wordCountFullTranscript": {
            "community": 65,
            "people": 60,
            "lot": 54,
            "meeting": 52,
            "committee": 37,
            "board": 33,
            "questions": 32,
            "things": 31,
            "district": 23,
            "report": 22
        },
        "wordCountSummary": {
            "community": 23,
            "people": 10,
            "committee": 10,
            "things": 7,
            "lot": 6,
            "meeting": 6,
            "issues": 5,
            "streets": 5,
            "distance": 5,
            "organizations": 5
        },
        "fullTranscript": "You hello done and it's Mari mas are you? Is it just the two of us on this call? Yes right now, it's just the two of us. You yeah I, hope everybody is doing well enough and nice very interesting time. Everybody doing alright. Family friends, loved ones, hello! Anybody there I'm here I just was saying is everybody, you know. How are you doing, and this is Mari Maas again HZ, h, 9, so I don't know that I'm doing okay, I just wanted to check in and see how you're doing how other people are doing during this time. I know it hasn't been easy, so you know like a George lost. His brother Karen lost her sister. You know just thinking about what people are going through right now, but I try to stay positive, yeah I know a lot of things that are going on and it hurts my heart and I grieve for people who cannot read their lost loved one or not there, because that's very difficult. You need to have that period that mall. You know that period to believe and I know, there's going to be a lot of people that are going to need a lot of mental health when we come out of this and I hope, yeah. There's a lot of support needed right now, like a lot. I know right now in houses in situations, and they do have some hotlines if you can call, but unfortunately, in our community we tend not want to go to get professional health so and top of everything else. That's going on I feel that's my big spiel, however yeah personally, what I try to do is to have a positive outlook. Meditate exercise go outside and you know when I feel like it so I, don't because it can be very depressing just being in the house, so I do a lot of reading and I don't want to meet at all. So I have no idea what's going on in the news, but that's self-preservation. Oh I hear you on that. So care is a major must in the end times like this, because there is, as you mentioned, there's a lot. Well, you know that's going on in the news and around us, and so many people in our community do need immediate support, so I just got off a conference call, for example, with jimana Williams office how to call on domestic violence. That was really good. So you know just talking about the needs of people within their own homes. Everybody else doing good. Dana I see you are you there you're doing good, I'm Mari I'm good? How are you, how are you yeah, he's good huh, well I, said I'm glad I'm glad you're doing well doing as well as we can during these times. That's your right, the point as well as we can you're right, I'm going muta now, because the meetings gonna start soon, but thank you for asking pretty well all right. Thank you! Hi everybody, hello, hi, -, hi, Sicily, hi, Stephanie, everybody Kevin! You look like a different person. Oh sure, that photo was taken about five years ago, I'm due for a new one. So this is what Kovan will do to you out serious, that's I hope everyone's doing well, okay, we have 12 folks on we're just going to wait for a couple more people and then we'll get started you, okay, we can go ahead and get started. Justice gets meeting going so we're gonna go ahead. I think we have 15 folks on we're still waiting for quorum. We might have form already with if Kevin or Deborah knows, but we're gonna go ahead and get started. Okay, I'm gonna call the leading to order. It is now 6:30, 7:00 p.m. so stretchy. Thank you for sending shot to get Juanita. Thank you for sending the agenda out with that agenda, for today's meeting should have also been the June calendar. So that is just something to keep in mind or I know we're used to being in person and initially that, but if we can just get back to shot eek or Juanita about the dates for the meetings that we want to have, that would be great for the June calendar and we can get those set and put those zoom links in there, so that the community will know that we are still meeting so we'll go ahead and start with my report. Okay, again welcome to our June meeting I just have to say that I went to burrow board meeting, which is something we normally go to. They have it every law, every Thursday, it's been on in a virtual format recently, and with that it's been in a virtual format. Recently and there's been, you know a lot more attendance, it's been open to the general public, but with that a lot of the other councilmen and electives have been able to attend. So we've been here able to hear a lot of their agendas and a lot of what's going on with the other community boards. What I do have to say is I am just so proud to be associated and leading si 10 right now, when we talk about all the other boards, they are still not having all of their meetings. They are still in a place where they're not able to conduct business as usual, and that is a testament to cheek juanita. All of our committee chairs our executive team for getting out there getting the technology getting the technology set up and being dedicated to being there for the Harlem community being dedicated to the issues being dedicated to keeping our meetings when they are scheduled, so I think for the last month and some forms all of the committees met, and we did get a shout out for that and it is going. We are being noticed for that. So Manhattan borough, president Gale Brewer, did recognize for being diligent and being able to support our community. So that's one of the wonderful things that came out of that meeting is to let you all know that we are doing the work people know it. People see us out there and we are continue to be here. For the community and carry on business as usual, so thank you for that. Yeah, ok, and, in addition to that meeting and I'll talk about it later, one of the big things that they spoke about when the main issues is this open streets concept, how it has been successful, the issues that they have seen, Plus, how it will now go and take an Economic Development Avenue as it as other as the open streets start to encompass restaurants. So we talked about that. I'll talk about a little bit more in the transportation report, but I've been attending other meetings, greater harlotry, more comments, always a great meeting with a lot of information. A lot of stakeholders very committed to talking about the issues. I'm brian, benjamin senator brian Benjamin's called that is sponsored by dr. hazel, Dean's and former presidents II Virginia field, always full of great information and I attended. Adriano s Fiats called they have those these calls weekly. They talk about all the health issues that are going on and we talked about testing and we talked about the hospitals and the issues that they are facing. So all of these calls every one of them adds a little bit more knowledge to the community. As you know, we continue to fight and figure out what is the best Avenue really quickly and also other some community other calls I've been on to touch discuss, PPP and PPE. All of those things are really affecting the black and brown community and businesses all over another thing really quickly. I know. Usually June is our last month and I know everyone's usually kind of excited about that, but I think in the middle of a pandemic. It is important for us to stay near and dear to the community to continue to have our committee meetings because there are so many things going on, and so many things are changing in a brief. Second, it's important for us to stay at that forefront and able to get out that information and sometimes just be a sounding board for the community. So it is my wish that through July and August that we will not have general board meetings so you'll have that break from that, but I believe we should still continue to meet in our committees. To still handle the business of Harlem to still be there for constituents because you know, unfortunately, this virus is not going to take the summer off, so we should not be taking the summer off. We should be right there at the forefront, still having the conversations and pushing the envelope to the to the elected officials, letting them know that we are still here so I know that some of the committee chairs might want to discuss that I've talked to a few of you offline and I. Think you all are supportive, so we'll continue to do that. It had that discussion, the new member orientation Stephanie. Thank you so much for heading that up and getting that started. You know I do apologize for being slow to welcome you there's a lot going on and I know. We all are in that same boat, but please forgive me for that. There's a lot going on my job as well, so it's been working a lot lately and so thank you. Stephanie for taking that over there was a I think, a survey that went out to figure out what was the best weekend and we will as soon as everyone's answers that, or at least you know, a majority of people answer that we'll get that date set out for you. So we could do an online new member orientation and have a little fun with it as well. But you will get your documents. So please answer that if you have any new members on please answer that survey, so we can I set that date. And finally, there has been a proposal headed up by the Manhattan borough president's office and the Uptown committee boards to have a forum on social distancing. So you all have you all have seen the neighborhoods knows know what's going on and with everything reopening you know, there's mixed messages in the community about what's actually happening, what's open and when we try to increase these opening, especially with open streets with the restaurants, maybe spilling out into the street. Now we want to make sure that we're able to support our economic development but at the same time social distance and stay safe, so we're doing a forum on that. That's going to be later in June, so we're gonna have some input on that and be a co-sponsor. I know that there were some features from Central Harlem this past weekend that went out that we're kind of disturbing and I know everybody has seen the videotape for Wisconsin or whoever they had Missouri or wherever they had the party. That was extremely disturbing. We cannot fall victim to the summer fun and the people not taking it seriously. So we will do this social distancing forum with the Uptown community boards. Finally, as we go throughout today's meeting, we do have a couple of committees to report. I think it's important for us to have more of a conversation as well with these committees. So if there are issues that are touching on a committee that they might not know about, I think it's important for us to have a conversation in this EC meeting, because we're all on different calls all have different subsets of friends and organizations that will let us know and influence our knowledge of Covid-19 19 and what's going on so it's important for us to have a conversation in this forum to let other committees know different issues that are going on. So we can work toward solving, not the issues that are always just in front of us, but things that we may not know about as well. So with that I'm gonna ask for Joshua Clinton to do the treasurer report so hi everybody. So in terms of the treasurer's appoint report Astor on paying our liabilities, which is the red, are our total operating budget left is sixteen thousand seven hundred twenty three dollars and eighty-five cents, our capital budget, which is on the City Council budget. We have remaining balance, thirty, three thousand nine hundred fourteen dollars and sixty four cent. We've had some saw a few meetings with just the officers of the board and all the district manager to see where we can use on the remaining budget to do some improvements in the office and give our staff some more technology just to this climate, where we're doing everything in a virtual setting, so we've identified some something that we can do on with remaining budget to basically enhance that which is like getting some live streaming cameras new upgrading, our the wireless routers in the office. You know software to transcribe, live zoom meetings. I would hope for a sort of our committee chairs in terms of taking the minutes for the meetings social media CRM. So we can improve our disseminating information out to the community since we won't be having in-person meetings. I can normally do our myriad of different other things. If any of the committee chairs have some ideas of what they think they might need or what the board can use. Please reach out to me, so we can talk about it. We do we will have some. We do still have some funds left in the budget, especially in the capital budget, the City Council budget that we could possibly use for technology upgrades. So please reach out to me. We can talk about that. That's what all I got any questions, no I'll take it on from here: Josh Shattuck, Mitchell, district manager, community boy, 10, so I'll just give a brief district managers report. It's gonna be one second, so I'm going to UM just speak about something that we've talked about in our last Health Committee meeting for those who were there. You may have heard this, but for the greater community I know you seen the news story on that came out about the nursing facility on 138 Street in our community, broad district, where they had a lady video taped, 20 dead, allegedly 20, dead bodies being carried out of this facility on this nursing sensor, it's called the Harlem Center for nursing and rehabilitation. This was already on CB 10 trade off. For some time we had engaged the nursing center in the past. We wanted. You know more transparency at the time, but we weren't given it so in this, when this story broke, it was not a surprise to us. It was just. It was a big story made the front news. You know of The Daily News, dr. Dukes. She was on the chair of our Health Committee. She was on top of the top of it early on where a lady who passed away in December a civil suit, was filed against them, basically stating that they had let her body decay in a storage closet for five days and her daughter, father sue. So they were already things going on with this nursing center before the daily news story broke on. Since that time, on, the community board has drafted a letter. We sent it to Governor Cuomo, as well as our elected officials, I'm, calling for greater oversight, compliance stricter enforce accurate reporting data collection and mandatory kovat 19 testing at all of our senior nursing facilities and rehabilitation centers immediately. Since that time we had divided the administrator and the general counsel of that nursing Center on to Army Health and Human Services Committee meeting, which happened on last Monday, and they you seemed willing to set up an advisory board for the facility. I know that dr. Dukes, our Michelle Booker, the vice chair of the Health Committee and others, are gonna work to set up a plan to see how our community members could reinstate the ward, because from my understanding it was already aboard I'm in place, but that board had been disbanded once of the administration and a staff change. So hopefully we'll get back with the advisory board and we'll have a better relations with them. Going forward. I'm presently up-to-date over 5000 seniors, have died in nursing homes throughout the state. It's really sad that we didn't protect our most vulnerable population and we had to get it to this point. So I think this was really you know a wake-up call for everyone, all not this past Sunday, but the Sunday before I forgot the big. But there was a big fire on 125th Street at the Lazarus. Our children's clothing store I'm. There was a three alarm fire that started on the second and third floors. It was about two to two three hours before the fight fire could be contained. Oh nearly a hundred and forty firefighters worked. The scene and I know that a lot of people were saying you know around the neighborhood. You know there was speculation that you know, people would just burn up their businesses for the insurance money because they weren't doing good and the pandemic, but I'm. The official report from the FDNY said that the cause of the fire was an electrical failure with the motorized gate and that it was not arson. So you just don't want people to go around on with wrong information. If there's any more information we get on it, I can give you updates, but for right now, that's just what it was. It was electrical failure with the motorized gate and it was not an arson and no one was injured at the at the same I'm, just some update on two new sites for Kovac 19 tested that were what added. Let me just get back for you for one second I'm st. Matthews, I'm Church and mother AME Zion, Baptist Church and there I'm gonna be available. Monday through Friday from 11 a.m. to 7 p.m. the old hours were 9:00 a.m. to 5:00 p.m. that's when they had it at Abyssinian and Mount Nebo, but they chose to stagger the hours that make it easier for people who would get off of work late so that they will be able to get the testing so we're just encouraging. You know everyone at this point to go get testing. If you have it. If you have, if you feel like you, don't have any symptoms, it's still not an excuse not to get testing. You absolutely should get testing because you could be a unwilling or unknowing on carrier I'm. Just an update on open streets. I'll. Just give you a few of the street locations that have been open in our district. We have 117 Street between one inside Avenue and 5th Avenue I'm 138th Street between Linux Avenue and Adam Clayton Powell Boulevard. We have Charles young playground, 143rd Street between Malcolm X, Boulevard and 5th Avenue Morningside Park. We have Morningside Avenue between Manhattan Avenue and 116th Street and lastly, Edgecombe Avenue between 140 Fifth and 150 fifth Street, and that concludes my update. Actually there's one other thing: I was on a call today with C Virginia, Fields and Gale Brewer, and they were just advising us that as well as Mark Levine from City Council, he was advising us that the room, the hotel rooms that have been set up for Colbert related illnesses of people, that one is a social distance and there's more than enough rooms. It's just an another. Not enough people are taking advantage of these rooms, so they are urging people. If you know, if you have been affected in any way or you have someone in your home who's affected by coveting, you need to get out that they have about 1200 rooms, secured and they're ramping up to 3,000 by this summer. So if you cannot say safely separate at home, you can contact New, York, City, Health and Hospitals, and they will get you placement in a hotel and also we're doing tests and tres community center a test and tres community advisory board, because we want people to get the jobs from our community as far as testing and tracing the kovat maintained. So any. If anyone needs more information about this, I can put my email in the chat you can see me, you know, send me an email for those who watching on Facebook I'll, give you my email address, and you can email me directly and now. I will send you out flyers and information regarding everything that I just mentioned. My email address is s like Sam, or s like shotty Mitchell, mi, t--, CH e ll at CB nyc.gov, once again, its s Mitchell at CB nyc.gov. Thank you, Thank You fati. Are there any questions per shot at this time in the chat? What are the dates at mother, AME, Zion and also at Mount Nebo? So with my already happened right, shorty, corn- oh yes, money bow has already happen. This is st. Matthews and mother, AME Zion Baptist Church for starting this coming Monday from 11 a.m. to 7 p.m. Monday through Friday. Thank you for that and we do have a quick comment from Charles Powell in the chat. The open streets program on 117th Street between Saint Nicholas and Adam Clayton Powell is not working with cars parts on both sides. The streets are not open. Also, this area is not being policed for cars that are ignoring the barriers. So are there any things we can do to talk to the local precinct about what's going on or have you heard of anything so the local preacher is in charge of the enforcement. I mean I've, seen that in my area as well, I'm around Edgecombe, 145th Street the open streets, it's not blocked at all type of traffic. If people have deliveries, there's emergency vehicles also, it doesn't require that cars are removed off of the streets. So cars will be that a part people will come and go to park their cars, but it's not for through traffic, now, I'm pretty sure people violate. You know the ordinances all the time, but if there's something that's very serious and there's a complaint that needs to be made, I would definitely operate and use the 3-1-1 make everyone call or actually call the 28th precinct. If it's, if it's in that area, 117th Street, it's being enforced by 28%. Thank you. Okay, we're gonna, go ahead and move on Kevin or Debra. Do you can I believe we have qualms, but I, just wanna check can be sure. Yes, I can do a quick roll call, but I don't know if all committees are represented or, if they're sending their vice-chair. So if, when I do roll call and I call the chairs, if their representatives are here, can they just chime in? Does that work? Well, that works okay, so I'll just do a quick roll call, beginning with Cicely Harris. Here sorry great graces, the Harris Marquis Harrison president Charles Powell I saw Charles and I see Charles, so Joshua Clemen pregnant Debra gates present kevin Behrman present Steffi Palmer I saw Stephanie there. She is George, her L is anyone from arts and culture, Jennifer Prince. Anyone I believe okay and Jennifer Prince well I'm Cicely that should be in my Washington Chanel. Yes, Ted of Jennifer Prince I saw hey, I saw Chanel. Are you here? Yes, she's on the call great doctor Dukes anyone else from the health and health committee back good Duke says Lisa downing or anyone from land use, Karen or E? Is he Karen present right and Charles Johnson Charles Johnson, brother, okay, yeah president? Ever so we do have yeah. We have quorum good to go, okay, I, believe Lisa, disjoined, Kevin, I just saw ELISA join and all me seven demean brown, black men, I, don't know as well. Yes great, we do have qualms. Thank you. Kevin we're gonna move on into education, youth in libraries. Yes, we don't have a report. Okay, I did have a question Deborah and I think this is where you know. If there's other folks that have a question for these committees again, it's not. They put the committee's on the spot, but just to have some talking points, then maybe we could follow up for our June and July meetings going forward. Deborah there was and I think it was I was on your call and I heard it. Was there something about 10,000 laptops that are still waiting to be distributed? Have you heard about that and if you have like, what's going on with that? Well, the Blasio stated last week that he had purchased, but there are 280 some and that they still and what they had done. Is they X, since they still had additional laptops, they expanded it from just district schools to private schools. If your student has a disability and you attended the private school, they may would be eligible as well, and so you can call 3-1-1 if your child still needs and laptops, hey, Thank, You Deborah and another quick follow-up question again: Thank You, Deborah and Stephanie for drafting the letter for the summer youth program. Did you have any updates on that because I, you know I heard some positive things about the summer youth program, so I didn't know if you wanted to share that, I did speak to Shattuck and thanks to Shoetique for sending that letter out to all of the elected officials. We understand I understand that it's on the table that there's there are a lot of discussions happening. There haven't been any final decisions made. It looks as if there is going to be a program. We just don't know what that program is going to look like. There was a phone call on Saturday with youth from Delta, Sigma, Theta and SP odd, and a couple of people from Ryan Benjamin was on the call, as well as a couple of things from City Council who all Phil is. This is something that should happen and believe that it is something that will happen. They're just not quite sure what it's going to look like at this time when SP I was on the call, he did invite us there. People like a young person, that's on the call to be a part of his weekly call that he has on Friday to speak about it. I have been in touch with board member meshell Booker. We spoke a couple of times and she's been trying to get something I hammered down with his chief of staff after today about it again and she's trying to see if indeed he will be having that call. Fbi will be having that call on Friday or if he will have to be available for some kind of vote, because what we want to do is we want to be he on. We really want some sort of you know. Everybody says they wanted. Everybody says disagree idea, but we really want some specific. You know today. Double is the city is in debt in back in the neck. You know, in this fiscal year of course, ends on June 30th thing start in July, first this fiscal year, and that the UM, the city will be deeper in debt and I personally, think that education should never be on from the table because, already with we have the largest school system in the country with over a million students- and it already does not- it does not educate our kids in the way that they should so to cut anything would be disastrous. So hopefully there will be some kind of Summer Youth, Employment Program, but they're still it's whatever it is. It's not gonna be for the seventy-five thousand kids that it normally helps Thank You Deborah. Thank you so much for always keeping on top of everything is there? Are there any questions for Deborah, but I do want to say one additional thing. Well, you have given me the floor. I believe that a my Joshua gave it to record I believe that, because there's some use employment, it's not going to employ seventy five thousand kids. It normally does community for back-to-school supplies is going to be even greater and I'm, hoping that this board will support the Education Committee and because we want to have the back school program and a sister see it seems as if we buy two hundred or two hundred and six packs and fill them up and give them out. So thank you Debra. Thank you for that, and we definitely want to have those conversations and I think next week stay on the nest, but next week I did talk to someone so I feel like that's. We should. We should talk and bring that extra party in and just see where it can go. Okay, Debra, okay, appreciate that and I know you'll stay on me. So that's why I said that so stay on me, Health and Human Services Lisa Leslie can I ask a question. Oh yes, Karen go ahead. Hello I just want to Karen. Oh thanks, I just wanted to know. Is there any way we can check to see if our students as a survey or we can check with the schools that can be done to make sure that our students have the laptop start, the appointment that they need? Nobody here, I think we should check in our district to see if our students have the equipment that they need, because in some instances you have multiple families- and you know the kids are all trying to you know on one computer or something I think we would before this you know is given out to another. You know moves on to give to different for other types of distribution. I think we should check what's happening in our district and I'm wondering if the only way to do that. That's a very good question: Karen I am actually on a call. Every Thursday when ship is just fine and Marquis can probably talk about this as well, and they have sent a survey out to all of households asking them what their need is. Of course you know they hope that people have responded. They done follow up the respond. I know at my a committee meeting a couple of weeks ago. Marquis did mention that some students, they didn't, have laptops, but the question is how do or tablets how do we get to them? I know: there's been a lot of outreach done and so I can I can actually I I'm on the call again tomorrow at two o'clock, I can do a follow-up question as to what's going on as far as iPads and what does it look like out to the board? Also I can say that Abyssinian the people on the call or putting together food pantries, it's gonna, be the boys Agora. The three boys and girls clubs and the in the community are going to be doing. Pantries Abyssinian currently does Abyssinian Baptist Church on West 138th Street. Currently, does a pantry they're going to be expanded services they've signed an agreement with New York, pantry and they're, going to give some kind of preference to district nine parents, and so once that's settled, I'll make sure that and the flyer and the sign-up sheet is all together I'll make sure that the board gets that, but I definitely will follow up with them tomorrow, Karen and ask them because they do give an update every third day about what's going on. As for us and I'll, let guys you Thank, You, Deborah and I believe we have one more question for you, Deborah from the chat it's about broadband access for the students in district 5. There's a statistic here that only 40% are and only 40% have the broadband access and are in attendance with virtual schools. Have you heard anything about that? You and again, you know. If Marquis has any additional information you can chime in, but I do know that a lot of their young people are not I'm, not signing in. You know whether they have board van and ah they're, not signing it. I know that a couple of the cable companies that are available are offering free service I'm, not sure how good that service is. That's definitely something that I can follow up. A spectrum is offering free services to students that are at home, that don't have it and can't afford it, and it is. It is an issue again. This is something that marquis talked about at our committee meeting this month about students not finding in, and then there were members in the committee. I think stephanie was one of them. That meant to the fact that you know when students are signing in then there have been an occasion when ACS has been called. So it's a real issue. It's a real issue, you're, something a marquis I would say that, where I've heard more around 60% no I was saying I think we're more at 60% in regards to like involvement, I mean still very much down. So if anything I've heard the revert like four percent of the students, maybe not signing in not only 40 percent signing it, but at any rate we are missing a lot of students who are inconsistent or choosing what to sign like what classes they want to sign in right summer, they've also been told a message to the city of New York. You know that everyone has to pass so there's a lot of reasons why students aren't signing in. In addition to that, I think you know we were talking about surveying parents, it's kind of hard to survey right now, I would say anyone who did you know. Schools were in district, five were conducting surveys, but the surveys are not being filled out in regards to the ones. Who might you know anyone who doesn't have it really right now? It's because somebody is really not letting someone know that they need it, but they also just may not be aware, because the resources were there in some sense. By now you wouldn't have one, but what is what's happening is that if, when we're surveying, if you don't have one that means you're, probably not filling out the survey either because we've done all district five schools were, we had to give very clear surveys to students and to the parents, and then we even had guidance. Counselor's call this. You know they were there. People are signed to just calling school aides using every resource in our buildings to follow and track with parents. So they're still, you know reports across district five that some parents have just never been contacted or have never. You know responded since this whole thing started. So those are probably the people we haven't gotten yet and unfortunately we have a tendency to so we're also doing a lot to try to attract them. But it's not conducive to going to do house business as we used to do and they actually undermine. They keep a spreadsheet of the first percentage of people who have respond and that's something that I can ask. Mauro and I can share. Thank you, Thank You Deborah, and thank you for Americus and I'm Karen and Terry for those great questions, we're gonna, move on to Health and Human Services fatigue they report today. I think Karen might still have our hand up these dog. You Karen, yes, I! Do I just wanted to say that this whole year, I believe, is being explored option first for students from grades 3 to 12 to us to attend the summer school program. So that might be another you to find out who needs, equipment and also I, just want to say I'm here with my grandchildren and I see parents have to go through, it's really intense and you know you have to, and sometimes the parents don't know how to explain and if there's any kind of additional services that could be put in place to I know we have the teachers, but maybe after school hours, tutorial programs, because it's difficult well one thing that I think that it is difficult than one thing that I talked about at my meeting this month was a lot of the services that are available and there are a lot of a services that are available library they have. They have one-on-one tutoring. They offer that and I sent that list out to my entire committee as well as ask anybody else that was on the call if they wanted, that list to put their email in the chat and I sent that out to them as well. So there are, there are things out there that are out there that are free and in our community that are and I agree with you Karen. It is difficult because I know parents who say they have to like you, then teach so that they can then teach their kid out of it. Okay, Thank You, Deborah child, we'll take my last clip time on the battery, so we can move on Charles I know your hand is up. Charles Powell is your hand up I'm good. Thank you. Okay, I see Baris in it. One last quick comment: we have to move on to our next committee, I. Think, there's a voting item, I'm Mari, really quickly. You there's still homework help that is available, that there's an 800 number and I think there is something a resource. That's online, so I just wanted to denote that there is homework, help for students at home, with their parents and needing to you know, get some tutorial services for their homework and according to how angry ignited dial a teacher is available. You Thank, You, Mara and Deborah. If you want to put some of those resources in the chat or make them available for shawty to send out to people on this call, please do so thank you. Health and Human Services sure having a go on the email, so you can, he can send it out. Okay, thank you. Shetty! There's a report from Health and Human Services I. Don't think that I'm Karen Dixon Michelle book or Cheryl Smith on the call okay, so we could just move on I did want to address beg your pardon I just wanted to go ahead and piggyback on what shotty ket said earlier, kudos to the Health and Human Services Committee for getting the reinstatement of the cab for the nursing home I was on one of the original cabs for the nursing home. So I know how important it is for us to have access and to have the conversations with the administration for the nursing home. So thank you for that. Let's go ahead and move on to parks and recreation. Yes, hi everyone! We had a meeting yesterday and did discuss some open streets and there were issues again around a hundred and thirty-eight Street around the fact that social distancing was an issue I'm, sorry, not social distancing, but the fact that there was the parked cars and there's really no structure to it. There's a barricade, but no signage, and so there are questions around that. So the community had wanted to know more about what the format is and then also the issue of the incident with the woman in Central Park, who fortunately accused a black man of what was she saying she threatening her life and that just snacks of you know, through the years of the these serious accusations that can lead to death or just devastation people's lives. And it was mentioned there maybe. But this should be something that should be addressed in public safety, because even though the woman did have some consequences, it should be illegal for someone to do those kinds of things, and we need to go on record for that. So that was discussed during the meeting yesterday as well, and we had been meeting and discussing the central. An exhibit in Central Park around this new impetus with the this new attention is being brought to the exonerated fight. In our October meeting, it was raised that we should have some type of commemoration of permanent commemoration in Central Park to the Central Park five, who are now all known as The Exonerated Fire. So we have been talking discussing a formation of a subcommittee. We did get authorization to do that from the executive committee and we are now at the point where again we have this to stakeholders with mr. stakeholders and community partners, we'd like to have on the subcommittee, so ballistas will be coming out and we would like for the board to send out a letter of invitation to these subcommittee members and there's a lot of interest in it. So, as a committee, we decided it was a good first step to just adopted resolution. George Raft, a resolution so that the community board as a whole could be on board with what we're doing so. There are any questions. That's basically my report. The draft resolution I believe karyn air. The board received the draft resolution. Yes, so this is, we didn't have quorum in committee, but the concern was to go ahead with the draft and we're sent the draft. Okay. There's a voting item for tonight. Yes, okay, thank you. You're welcome. Are there any questions? Are there any questions about the document? Can you tell us a little bit about the document Karen or what exactly it's a proposal? Yes, it's basically, okay. It basically states the background of the incident. It took place in 1989 and it's there's a clause about the exoneration back in 2002 and a settlement that the group was awarded back in 2014. It also addresses and I'd like to Harlem community, because it had long last long last Olympics which even existed today and have affected households in the fact that so many of our young men in this community incarcerated and how that impacts on families and their lives, and it speaks to the fact that it was first voiced on at the October meeting that the pool resolution was voted on that you know that's. When the issue came up, that we should have some commemoration to Central Park to the Central Park. Five. There's been new recognize that I'm sorry, new acknowledgement is involved with the with that issue. Right now around the Netflix movie that has come out and also the Ken Burns and Sarah burns documentary that and it would divert a series on Netflix. So it's something that's long overdue. We also talked about the fact that there should be a social justice center which would be associated with this exhibit the exhibit would be educational and interactive. It would also it would speak to resources around what your rights are in terms of police and arrests and all that sort of thing which you put recourse you have if you've been falsely accused, so it would be, it would be educational as well, and we looked at the model of the Seneca Village, how that started out as a temporary exhibit, but it's hopefully going to lead to a permanent exhibit. So that might be a model we might want to follow. We to have the support of the Central Park Conservancy. They have been attending meetings. The vice-president of planning has been attending Holland Community, Development Corporation is signed on as a partner and they provided a consultant to the group Harry Belafonte. His group is interested and there we've also invited the Innocence Project. So there's a lot a lot of people just in January of this year, the exonerated five were given an award by the President Obama. So there's a lot of interest in this right now and it's just something that is needed, especially when you have an incident like yesterday and everything else that goes on Karen. Thank you for your diligence in this and getting this started. I know that it was a talk at community board meeting that has now come into a committee form and we're excited about where it's going. This is a voting item. We could go ahead while we do how quorum Karen did you have something I just wanted to say? Yes, the question you said so long his mother reached out to Raymond Santana and we're also looking to speak with Don Cory, Raymond and Kevin I'm. Sorry, Cory, Korey, wise Kevin and Antron you're. Welcome. Thank you. So this is a voting item. I hope everyone had a chance to read the document. It is really good Karen. Thank you for that. At this time, I will entertain a motion. I move that we support. The proposed resolution has put forth by Karin and the committee for a second thank you. It's been properly moved and seconded. Is there discussion at this time? Okay, Karen? Is there a timeline for anything right now, I know we had talked about having four arms and getting community input. What is that looking like? Well, we hope to have this the subcommittee solidified by and have actual members by June 10th meeting, so we are working to get that in place, and this is just an impetus from the community board stating that we are in favor of this and we support this project, so the subcommittee would we are facilitating the formation of the subcommittee and just acting as a facilitator, and they will be doing all the work. Thank you for that. Okay hearing. None are we prepared to vote so again? How we are going to vote in this virtual format is it'll, be all in favor. If there's any opposed, then we'll have to go into roll call. If not, then we could just go with the all in favor, okay, all in favor or if everyone, let's do it all right, go ahead, glad to sleep all in favor aye any opposed hearing none the motion passes. Thank you. Thank you. Thank you. Thank you. Okay I know we have some reports that are not actually listed on here, I'm going to go ahead and report for transportation. We really have a report, but again the update of open Street, so I just wanted to talk to all about it. I know that there are a couple of community boards that are doing forums around it right now, so we know that there are issues with open streets, so D-O-T, hopefully, will do a brief free presentation at our general body meeting and then follow up with us at the transportation meeting. But one of the things that the borough president did highlight was that open streets as it is now it's just a time. Sutter Street is open to allow people to social distance and get out of the house, and you know just enjoy the outside. What the next phase of open streets is could be is that as a lot of states are reopening, they are utilizing outdoor space to increase the restaurant area. You know bandwidth so that they can start to serve customers and reopen in a safe environment. So that was a discussion we had at the borough president's meeting the borough board meeting a lot of good points were made from who was making these decisions. Are there people that are actually living the neighborhoods that will be affected by these reopening? Are they on those committees? Are bathing hurt right now? That would probably be no. So we as community boards want to recommend that we are intimately involved in those discussions about what restaurants, what streets and how will that look, as they start to use a lot of our public spaces for this it could be in parks and plazas all over trying to allow like eating areas or open-air cafeterias. So we would have to be. You know discussing it who is going to get those spaces what restaurants will be chosen and if per saying it is the restaurants on Malcolm X? Yes, our sidewalks, we are blessed in Harlem to have wider sidewalks, but that doesn't mean that we want the to be full up to the brim. You know outdoor cafes, leaving nowhere for people to walk people to properly social distance. Also, you know my point in that meeting was now. We have been plagued a lot with sanitation issues. So if we are moving these restaurants into public open spaces, where normally cart services, don't go or sanitation doesn't go who's, gonna clean these spaces places up, you know we're, and we are. We could be inviting a bigger issue by having it and it's hot people day able to so people are not able to social distance. We already have a retronym problem and if we're not continuing to pick up these trailer trash in open spaces, that are, you know traditionally open to the public. We are opening up ourselves, for you know a lot more issues, so they starting to have these discussions because, as upstate reopens, you know they're really looking and trying to push downstate in that way. So we will have a more detailed discussion with more information of what that might look like what streets they're. Looking at what restaurants are looking at. We have a lot of small restaurants that are even inside streets. What does that look like for them? Will they be able to? You know, put their social distancing, you know in order out there and extend into the curb. So there are a lot of issues that come in to reopening that's affecting our small businesses and I'm. Here you know just our public streets, so we will be having that conversation at the Transportation meeting next Tuesday. So after our general body meeting, we will be having that the Tuesday after General Board. Are there any questions about that? Yes, so Lisa is the city expanding the restaurants, outdoor areas? Yes, that's what they're talking about doing so you know. Usually we have our. You know city cafes, on our Cafe licenses, outdoor seating lights in sidewalk. Cafes. Excuse me, so those have that of our been approved. They would be expanded, but they're also trying to open the door for folks who have not had sidewalk cafes in the past. So we don't know what they're gonna have to go through the same regulations as the other ones that you know got an architect came to us, did all that bedding or will they get a pass where this summer am bo to set up ad hoc? So those are questions that were asking yes mari. We will be consulting our block, consulting our block associations, Merchants associations as well as bid I, did talk to the bit about it, and you know, of course, barber asking so she's, definitely on top of it, so she has already started engaging in those conversations. But thank you. So that's it for transportation. Are there any other questions on transportation right now? Hearing none I, believe economic development and technology has a report tonight. First of all, I want to thank Jennifer, Prince I know she was on here earlier for her service. There's a lot of things going on and it's important that we're able to want to take care of the punic community but also engage in self care. So when we are doing that, sometimes we have to you know let others kind of step up and help us out where we are so Jennifer. Thank you for serving as chair of echos EV Chanel, who has been vice chair of echo, dev I, believe for a little bit over two years now has decided that she can step up right now and share echo dev, so I know, because I want to congratulate Chanel for doing that. She had her first meeting last month and it was excellent. So thank you so much for doing that. She'll do you have anything to share tonight? Hello? Yes, my give another important! Yes shanell. Can you hear us hello? Yes, okay, can you guys hear me all right so sees? Are you ready? Yes, okay? So it's going to yes all right, you should be able to do it on your end. Oh you shoulda told me that hold on at the bottom at the bottom is a chef's dream. Yeah I know how to do it, but I didn't know. I had the my screen. Give me a second okay, guys, I'm I hope this is the correct one, so good a good evening. Everyone so I, don't know if you guys know, but I've been appointed chair of echo dev, so I was asked. What is my plan, so this is just a pretty much like an outline. There will be things added every month. There's also things that I requested believe the office staff is working on a excel sheet of city agencies having to do with economic development and technology, as well as organizations in the district. Also a list of small businesses I'm trying to get from the borough president's office to also add to this document, but before, let me just get to the document. So this is just a flyer that will go out for our meeting while we're in a Covid-19 I'll change it up as we come out. So the flyer is interactive, so you would be able to open up. Oh, you would be able to open up hold on sorry guys, but I thought that you know she was sharing his screen. Okay, so this will be the economic development and technology and communications Jack you're a newsletter here. I'm sorry, so they'll be like the paragraph every month about what's happening in the committee. These are the committee members that's listed if I could possibly get a list of the new committee members and if committee members, if you are on this call, if you could possibly fill out that committee member form that was sent out so I can get you guys, information so I can touch base with you. There's also outlined agenda so that I can stay on track with the meetings with time. If you scroll down there's a time allotted for elected officials and their representatives, so they can try to. You know, arrange to come to the meeting during those times because I know they have other meetings. They have to attend. So you can just see the structure there. Also I would like to try and capture some of these issues that come to the committee, because a lot of times people come and we have a lot of discussion and someone will say. Oh this is wrong. Well, this is happening in the community. Something needs to be done about it, but we never put that in right in you. Never capture that. So there is an option for committee members and community members to create the resolution. There's an outline here. You guys can see this hello. Yes, you can see okay, so you'll be able to you'll be able to type in this. Also, as you can see, and you can download it once you download that document I'm sorry once you download that document, you can upload it to a form you can submit it here and it'll be collected here into the resolutions and I'll be able to view it and print out a report for the committee to view then- and we have- we also have community concerns where you can also fill out community certainty on this page. That is also something that will be tracked and I will be able to read those concerns and share those with the committee and then, when you scroll down for liquor, license I've provided the instructions, that's also an option you can do here and you'll be able to type inside of there once you download that, then you can upload it right next to the tab, sorry, and that would be uploaded here to the CB 10 SLA 30 day. Advance notice form on this form. I. Also added. Are you currently partnered with any local community-based organizations in the district? If you are partnered, which one are you interested? If yes, what CBO's, hopefully we'll get that list of CBO's that we can attach that we can add to the newsletter so that they will have an option to see actual community-based organizations in our district. So if they would like to partner with one they have a list that they can partner up with, and that's that then next, oh I hate that it goes back to the same topic. Then, once you do that you can upload it to the liquor license. You can upload your document to the liquor license there and then there's also the CB 10 liquor license I put it in a document so that they can upload those documents. I also put street addresses well ranges: streets ranges between street addresses, so we can get an idea of where these where different liquor license are coming from. And then here are the petitions. You'll be able to get your petitions, someone can print those petitions out and then they can upload them to the document. There's also upload for that right. Next to it then here's my minutes, I know I have a typo here. Things will improve. These are the minutes from our last meeting, so one can just press here and it'll pop up the minutes right there and then choo-choo-choo if they're also the meeting. If you want to watch the full meeting that will pop up also in the facebook from our Facebook page. So here what we did was I acts. I we sent the letter. The staff sent our letters to all the elected officials in the district asking for legislative bills that were introduced from late 2019 and when we came in to 2020 so Elizabeth said, Ober we're still waiting for the Senators list to come, so that particular bill that sent over I believe in era with the bills that came over from my Nan's office. These are the bills from Inez office that she sent over. This is also interactive, so you'll be able to just press on a bill and it'll go straight to that bill. You can explore that website who wrote it who's, supporting it so on and so forth. So I know there's times when we have elected officials that are supporting things in the district and we'll have a lot of pushback from the community and they come into the community board to scream at us. So what I've done is I've tried to create a way for them to vote on the actual bills and allow us to create a report that we can give to the elected officials that show the people who are actively coming to this committee meeting and that are, you know, interested and what's happening in the community. This is how they feel. So that's also a document, and you can scroll down here and it'll have all the bills listed and you can actually you know, click, whether you support or not, and all these forms are collecting data by the way, so we will be able to report that data every meeting, every monthly meeting. So that's the same for this page and the same for this page and then I also have the economic development committees within the City Council, the Congress Assembly in the state, so that our constituents can also know where to reach out that information is also interactive. If you, if you click it they'll be it'll, take you right to that page. So that is an option and we want to know from you know: how do the constituents feel about these like these bills that are in? And lastly, we have a district need, so I know that every year we have to put together district needs statement, so I provided a way for committee and community members to actually go in there and they can actually put their district needs statement in that's I think that's the last one that we have in terms of forms. So if you go scroll down that form, you go ahead and you just write, you know what is it that you feel that the district needs and then at the end it's a thank you there's a summary of who actually came to the meeting and presented at the bottom. There's a summary of you know what was what happened at the meeting and that's pretty much it and the logo sends you to the CBN website now. I do quickly have some questions. Let me get out of here. I do quickly have some questions. Does anyone have any questions while I'm trying to pull this up? I? Don't have a question but I just want to say great job nice little assess. Okay, all right so I do I, have asked the staff to reach out to the horizon and t-mobile, because technology is, you know, is a thing and they may it might actually interface with our economics at some point. So I think that we need to have more of those discussions and I see a lot of Technology committees and our resources. I was on the website for I believe the Economic Development Corp for Harlem, which took me to a link to the Development Corp, which had a link for digital and technology and that we have an initiative I think we should definitely push to make sure that we have that. So is it possible that we can do something like that and I'm just trying to get my other questions that I have up here? Okay, here we go. Is there any way that I can get possibly some hardcopy Flyers that we can give to some of the committee members? Hello? Yes Annelle! We can work on that. We can work on that. Okay and I. Just would like to see if we can also for now get a list together of like just resources of page. If they can just give me the list, I'll create the page to add to it in terms of what how you know where people can go for resources for small businesses. Is that possible? Yes, okay! So at our meeting Charles Powell presented from Harlem chamber around PPP, and also he mentioned that he was a part of the Harlem Renaissance - that was being organized Michelle, reported from SPS office on the heroes act and a few other eggs. I. Don't have the minutes in front of me. I have to leave in a second. Also Charles came from hexagon to do a report on what he was actually experienced and as a small business I'm in trying to see if he can tap into some resources, he did say that he's applied for everything and been denied for everything, so I'm not sure how he deal with that. That's pretty much it are there. Any questions for Chanel I want Gary Johnson from the n-double-a-cp New York State Conference. He did also present about the n-double-a-cp emailing out information for resources for economic stability in the Cole babe Thank, You, Chanel deed, as I said before this newsletter. It's great I love that you are really capitalizing on the economic and technology piece of your committee. I know it's probably everybody's a little bit like how do we get that for our own committee, so you have probably started something, but thank you so much for that. Are there any other questions for Chanel? Yes, this is Mari mas I, really like it I think it's very sleek, designed very professionally done. I would like to say that I think we should include mwbes into somewhere and within that diagram, because MWBE support is something that is really important in our community as well and I'm. Glad that you mentioned the PPP. The PPP situation is very important for businesses. I think I saw today a report. The 75% of employees for one business are coming back so that, in that there were some deficiencies with the PPP. So definitely getting direct support and getting direct influence from the community or way in from the community is gonna. Make a major impact on reaching out and getting to the elected officials and letting them know exactly what is needed. So thank you for this Thank You Mari, so in terms of the W and B I also sent out a link for just the committee members. So in that link is I'm asking you know what exactly is needed and to see how everyone can help. So, if you can fill that out and then possibly if you would like to work on, that would be great yes, one more thing. I would like to say that there should also be constant, like a like a checklist I'd like to see a checklist in there, so that whatever business is me can go directly not just to the elected officials but directly to the agencies in which they can provide support to you. That would be good. Okay, so just make sure you put that cuz I'm gonna forget cuz I'm about to leave this meeting, but make sure you put that in that form, so that we can go ahead and see who's who can help? Who, with what and how we get. Those things add it to the newsletter will do Thank, You Thank, You Chanel. Is there anything else at this time for her go ahead, compliment Chanel on all of her hard work. It looks very organized I just want to ask I heard PPE, but you I think you're talking about the PPP and I'm just wondering. Is there a way to up to Harlem organizations like Carlin, Business, Alliance or Charles, even greater Harlem Chamber of Commerce to find out which businesses in the area have been denied PPP and what the situation is and going forward with? Okay Karen, let me just answer that you're, absolutely right. Actually, in the most recent meeting the Greater Harlem Chamber of Commerce is poured. They have an emergency board meeting every two weeks. They actually asked Greg Bishop, who used to be, as you know, the president of you know, Department of Small Business Services, but now he's moved on to become the advisor to the mayor on all small business. You know and I'm sorry for the noise, but you know, and we've asked it for Central Harlem, so I don't know whether or not you know that then translates into our particular district, but I think if we get Central Harlem we'll be closed, so that data has been requested. Thank You Charles. Thank you any other questions for Chanel. When does she want the committee members to submit that our form I guess fill out this survey? Was there like a deadline or anything as she was looking at her now? Did you have a deadline for the community committee members to fill out the form you may have left the meeting you can hear us? Yes, I, don't know if she can hear so I'll make sure to send that email so did Public Safety have anything for tonight. Yeah I mean so briefly. Are we had a pretty good meeting on this a couple weeks ago? The biggest thing from the from the meeting really was just the uptick in shootings that we noticed from the reports from 28th and 32nd precinct. There's been a seems like it's been about: 6 or 7, shootings, home and 3, each and 3, to 4 and in each of the of the locations and from understanding there was just a recent shooting a couple of nights ago, so we're going to have them report out about that. Karen I'm glad you mentioned this earlier, because what happened with the Amy situation down in Central Park. We actually have what are those follow-up questions for 28 and 32nd precinct, just asking okay? What is the course of action for or what is her guess? What's what would be their response when it comes to false reporting in their particular precinct areas? So that's going to be something that we're going to address the other thing too during the meeting was that arm we had the representative for war, and that was very productive as far as the domestic violence situation, so she can be following up with us on that part, but really she was looking for a lot of support from the local officials. As far as this fundraising, you know just being able to get resources, so it was the biggest thing to is the other. The other agencies were president to just let everyone know that they are still they're still working there so around there. So doing things remotely and there's, like I, said they're available via their phone numbers and email contacts that were listed, but that was pretty much it for Charles I do. Can you hear me Oh concern as I'm sure many other people are with social distancing. This whole thing: some people want to wear masks some choose not to I. Think there's going to be a lot of time this summer, kids out of school and I, just really would love to hear what proactive steps police are taking outside of putting their knee on somebody's neck. I could just feel the heat rising, and it was only been the second date no I totally agree. I think it I think that the variety uptick in shootings also is that indicator for me as well, but that was actually something that was brought up from a community member, a public member, we're asking what are what exactly our 32nd and 28th precinct doing as far as the consistency with policing these activities too, because you know previous reports were that they're over policing, that's in our communities, but then you go down to you, know 59th Street, you see you know Caucasians and other people that are literally, you know, violating the social distancing on restrictions and there's no type of recourse or anything happening towards them. So from our own, from my understanding, mystique was there and other board members. Were there as well to hear this 32nd and 28th precincts responses were that they are there they're encouraged to follow, taught me to issue out summons they're, trying to avoid arrest, but they're encouraged to issue out some. That's what they're doing so. As far as the arrest and the excessive force that we've seen, you know in many annapolis and other locations, we're hearing that that's not the instruction when it comes to 28 or 30. Second Precinct they're trying to avoid as much physical contact you know and that regard as possible, because I believe xxxii had over 50 officers who had tested positive. That is better girl-- that are now back working. So that was the response, but that was one of the ricchan CERN's that even what the public members brought up and also, first of all de Blasio said no more summonses and I want to see police officers giving out mass like they're doing in Central, Park same treatment, same city, same treatment, no I'm definitely will follow up on that too. As far as with it, it's that's an instruction from the mayor. What are they doing to help support that initiative? The mayor's office, if they're, reaching lots of community-based organizations say kebap mass I know that street corner resources as mass on different churches, some have a mass and there's been different. I think the greater Harlem chamber comments as well, but this is what I'm saying it's when you see in Central, Park white police officers, giving out white I mean masks, surgical, masks, so young yuppies. That sends a message of no. Where are we doing the same? Exactly that you know it we're together. You know looking out for your interests that sends a different message is handing out the man. That's my point. Sorry to cut you off. That's okay, I just think they're trying to decrease the interaction period, because sometimes you know all the interaction somehow end up in the dispute. You know for our social distance and so I mean I. That's just my thoughts behind okay. Are there any other questions or comments for Public Safety Karen? Yes, I just wanted to say that's one of the questions we have around these open streets. I mean what is the format that would be an opportunity to distribute, masks and I know that you know and when we are that we do have an open street near Park, Colonel Charles, young Park. So that's something that should be done and I understand. These masks are going to be given out up until June 30th I believe until the soap about their social distancing period, so I think that we're going to have open streets we should that should be something that should be a part of the open streets, and perhaps we can write a letter and or you make a call to request that there should be structured. It should be signage. Just shouldn't be a lot more structure than just closing off the street to traffic to our you know from cars yeah not so much a question more like a comment or observation thing, I want to say things are sore arm for being so on top of this accident following some of these shoes, myself is around where I live and I, just like I think we should all be outraged by the number of shootings that have occurred and the loss of life of young people in our community and what troubles me is because I remember this incident with the college student at Columbia University, who was who was murdered and it was like a whole every Hall and elected officials. Every male raised sounding the alarms was outraged. They was doing a manhunt comment to the building's that I managed like every other week. Download and video footage is random. Video footage trying to get a track of where these kids went. He hunted down these kids like I, don't know how many other, how many blocks away from where their event even happened, but whenever we get a shooting in Harlem and it's a 18 19 year old kid who is dead, there's no suspects, no suspects are ever found and then it just goes away and we forget about it and I think we should be outraged. We need to stand up and say you know nothing's enough like when are the shooting we need? Something like you got to go in I mean we don't ask some people to be stopped and frisked and harassed, and all that stuff, but I think we need a whole Police with standard with actually doing their job actually doing. Investigating I had an incident with the building that I managed, where some guys they were hanging rocket, build and they snuck in the building and they stole every single package. I left from the lobby of the building. It was like a coordinated thing: I contacted the police. I gave the police the video footage of the whole event, but police didn't even want to take the video footage yeah they didn't want to do no investigation, they said well, you can tell you know every individual who lost a package that they can come and file a police report. I'm like this is clearly a coordinated thing. This is a building where seniors live and I'm gonna come down to the to the station. To do all that, but it's just like you know, police and our neighborhood. They just I've asked you where they don't care. It's like we're, not asking you to go and crack people's skulls, but we're asking you to do your job and it's like there's no in-between where they can just do their job in a civil manner. Without abusing and terrorizing people. It's like, there's! No, there's no medium. Can we get to that medium somehow, and it's like what do we have to do to get to that point? Building on that? If I may there are a series of buildings on Frederick Douglass Boulevard that I've been reporting package thefts over three years, both to the management of the 28th precinct they filed for these two ports as well, and investigations are not happening so, just echoing what Joshua was saying, the documented that people are following the UPS and FedEx room and down the streets and gaining access and taking packages and the police department 28 at least, is saying that is a known issue across the city. But you know that's not sufficient yeah. What are they doing? This is no an issue. You would think that there would be some type of collaborative efforts to address it. That makes it worse, it's like they know, and it just kind of turned a blind eye and to follow up on what you all are saying. This is Mari Massa I just wanted to also add that street corner resources warm organizations that have been doing community policing in our community. That goes to show why they are so important, why they're at and why them standing up for what you know to keep the peace and our community is so important. Furthermore, I think it's also important to make sure that people know that warm is having a visual, some I think they're having a visual tomorrow for the incident that you just reported on. Charles, okay, I have to double-check that and make sure that I, if I get the flyer, send it out immediately, but warm is going to be doing a visual regarding that incident. That happened domestic violence. The issues that are happening within our homes also is a major, a major point that we need to continuously look at in making a difference in a change. Thank you, everyone Charles. What thank you for that great report. Thank you for all that you're doing and staying on top of things I'm looking forward to attending your June meeting, because you also had a little bit of just information about smoking and all of that I'm sorry know things that we should be keeping aware of, especially as Kovac is just affecting our population. Even more than others, it was great to have that presentation know, that's been why I was there I mean it was. It was really acted. So I was good to see that the agency presence were there so the in the past. You know, year and past four previous months, we've had issue with representation from 32nd and 28th consistently now they're consistently there and I just notice that it has been way better as far as just communication and getting things out, understanding getting clarity on things but at the end, and why I also was on, but on a call to getting out on. So it's doing some good information, so I'm, hoping that same energy transfers over to a connect for this month coming up, Thank, You, Charles, really quickly, I have one thing and then we're going to move to housing and land use. I think you have one more for port just before I forget or we lose quorum. I did want to present to you all that we have been asked to give an opinion. It's just a letter. Our support but I wanted you all to know about it that we are going to continue to reason why we can have these virtual meetings. This way and vote is because there hasn't been a suspension to the governor's in-person requirement. So because we don't know when Colvin is going to end will in a vaccine what's gonna happen, we want to make sure that we're able to continue to meet and be safe, so they're asking for the governor to extend it until we are, you know, safe, a vaccine or when so appropriate. So we, the chairs of the community boards in Manhattan, are signing a letter asking the governor to extend it and even when we can come back, we still need to social distance. So what does that look like? We want to be able to have virtual or hybrid meetings where some people stay home. Some people come in if it gets at that point and I still be able to vote. So if there are any questions about that, I will be signing on to that and or does anyone have any objections? Is this coming out of a committee, or is this just attached to Health Committee or oh, no I'm? Sorry, it was part of the chairs report and I was looking at my agenda and I just forgot. It I'm sorry I had one last thing: okay, if there's no questions, then we're going to go ahead or objections. We're gonna go ahead and I'm going to go ahead and sign the letter of support. That's just Lee I just had a question. So when would this with it? When would this take place these hybrid meetings? So not until you know we are able to come together in somewhere, so we are going to continue to social distance. However, you know, because we are in this situation, it's best to make plans now or in the chance that we are able to do that. So again, we are trying to stay virtual and we will stay virtual. However, because we have seen the effectiveness of this- and you know sometimes it is not even if we are getting a situation where people can come back out, we don't there are gonna, be some folks that don't want to just to put it. You know point-blank, but they still want to be a part of the community board, a part of society and able to give an opinion so they're going to have hybrid meetings, but that's not until down the road, because, right now we are staying virtual and I think we also should stay on top of the research that shows that the virus is more susceptible to the virus in closed spaces than they are an outdoor spaces. So and I think we need to keep that in mind as well, and you know, and in prolonged instances in our meetings you know can be like two hours. So you know we want to make sure that we're able to you know social distance and not being probes closed spaces for prolonged times. So if anyone has any other questions, let me know if not, then I will be signing on behalf of the board. Okay mari. You had a question about Facebook live, oh no, I did not. I was just saying that I felt like Facebook live is what we've already been incorporating this it's in some ways already we were already kind of proactive about it in those ways. So that's okay, yeah, we have been. We just haven't been able to vote. So that's the piece that this should cure. Oh I understand, let me see, I can turn it around Donna. If you like, I, just got it yesterday from Aldrin yesterday night, so I can't send it around to see where I can see it, but that's the basic gist of it. Okay, I'll send it to the board any questions. Thank you. Charles and Lisa. Did you want to finish tonight with your report? If you have one I will just say that I want to thank most of the people that are actually on. This call was on the joint housing, Land Use Committee meeting this past Thursday. One of the things that we heard loud and clear is that we still don't have answers either from the city government, the state government or the federal government, yet as to exactly how there's going to be some relief for renters and also for landlords. So you know, while we have pending in the state, you know the emergency rent relief act, that's still not final and in the city. You know there really are just talking about things such as you know, extending that 200 million dollar housing fund. You know the one-shot deal fund, two koban 19 related. You know relief efforts on behalf of renters, but that's still not final, and even with the federal government. You know we like the fact that there's a hundred billion dollars in emergency medical assistance and the eviction moratorium that the house has passed, but that's not final, so you know for moving forward into June. We clearly have to have you know some finality to a lot of this and there's still more questions outstanding than answers in the area of housing. So we're going to need to be more proactive and more creative and push our legislative people, which I believe we started to do. Chanel was very vocal in that meeting. Donna Gill was very vocal in that meeting, and a number of others, like Terry wisdom and others, were very vocal in the need for it not just to be discussion, but finality, because that's protecting also, you know the small landlords them. You know the not-for-profit. You know you know landlords and affordable housing landlords as such. So unlike other areas where we had consistent efforts, failures or and successes and P- and you know Idol- that economic disaster relief funds and other you know things that are given direct stimulus to businesses and individuals. We've not had any successes, I think you know, I open it up to anybody else who might feel differently in the area of housing, and that's all I want to report and just to thank everyone for continuing to come onto these calls. I think the creativity that we see from our interaction even tonight is what we need to continue to do so. I'm going to echo Sicilies point: I, don't intend to stop doing any of the CB 10 work over the summer and as long as these, we continue to leave and live in these unprecedented times. I think our effort has to be unprecedented, so I'll turn it over to Lisa I hi. Everyone first I want to publicly thank Charles for facilitating such an excellent meeting and that I too hope that the dialogue continues. What I appreciated most from my perspective is that these conversations have to have multiple stakeholders, so we see where our commonality is and I felt by having the nonprofit developers at the table. It said a different perspective in terms of what, in my opinion, the community understands about developers. So if you think back six months ago, a year ago, these were the same developers that came for us and we knocked down their program or their project, so I think just listening to them and hearing where they are and their concern for tenants and their concern for getting the rent paid and so forth. It sort of shows more commonality, which is important. If we're going to move forward. I heard board members ask questions that I never heard them ask before I'm, really taking a more engaged approach instead of oh, this is the developer and he's a bad person, and we have to support our and BMW ease and we have to support our african-american developers and just listen to what they're up against in their process and I, just really think that were in a restart physician and that all our committees need to be as diverse in terms of population and position and perspective as possible. So we can create a broader agenda. Thank you. Thank you. Lisa and Charles. Are there any questions for either one of those chairs Josh? Did you have your hand up, I didn't, but I read that the state is all for rental assistance arm. Is that different from the city's thing that they just released so Josh? Are you referring to there's a couple of that? You know there's of course, some things that are being dealt with on an executive water level, but help me and educate me on what the states are offering versus what you've heard the city is offering right now: okay, I'll, send you the arm the article of absentee cava sent out to everybody, but I read that the state arm for basically for small businesses that would did not receive federal funding. The state will be giving them loans, but the state is also going to be giving those same loans to armed landlords. Who've had like you know, who's tenants have not been able to pay rent, basically offering you know, relief to the landlords and homeowners I, don't know if that will cancel out the rental or rares that the tenant to my oath. Oh that's interesting, to find out, but then I also saw that I didn't get to read it in depth. I saw something should I believe city sent it out either yesterday or today now I know what you're referring to and you're absolutely right. Currently there is the New York forward loan fund, which I think is what you're referring to and that fund is active. However, right now it is only active for those you know, small companies by the way is it's a it's for companies that have 20 or fewer employees, and it's not in our region yet, so you can't even do a pre application yet for our region, it's all about us and others about reopening right. So we haven't reached the point yet of reopening. So what they're telling you is get prepared and you're also correct when you say that if you had a PPP on you know, you're not eligible to receive relief under this New York forward loan fund, but it is gonna, be available for landlords, as you know, and other small businesses who didn't qualify for PPP or even bother to apply. So that's a good point that you just raised in that one I'll put a link I think I can put a link into the into the chat for that. Let me see if I can copy and paste it I'm not as familiar with this, but yes, that's, active, but now they're saying so people in our region. So in our boroughs- and you know how region hasn't- met the matrices yet for reopening that. Well, you know that is asking you to prepare for what, but you can't do your pre act yet, okay, thank you. I was I. Didn't know about that part. That's good to know: Thank You Charles Karen did you have one last question? Yes, I just wanted to ask what about TPP and landlords? Is there any way since landlords are getting might be eligible for some assistance? Can that be used to help tenants in any ways to offset their costs because Wednesday, you know once they're there? The moratorium is lifted, they're going to be asked to pay all of this back rent. So since some of that money, some of those expenses are being offset for landlords. How can that be? Or can we advocate that tenants be assisted in some kind of way they have they're never introduced, which would be helpful. The pp to loan is only for payroll, so larger landlords could definitely benefit from it because they usually have you know a lot of you know either facility maintenance or they or they have their own managers that manage their properties, but most buildings only have about maybe like one super or and a porter or two Porter's etcetera that work part-time, so the PCC loan that they would get, we wouldn't be really significant and that would only cover arms, the payroll of those employees, so they basically have to just give the payroll know the money that they get to keep the pace to get keep their employees on the payroll. And then you know as long as they do that, then they don't have to all say the money back. So it's not. It doesn't really arm. It doesn't really account for the loss and revenue that they're getting from people not paying rent is basically just to make sure that they keep operating and also there's a time stamp on that period of time and a lot of the PPP funds for the most part in June and the question is for the next 2 min this bill. It will be an extension of that or an opportunity for new support so and also if we have an outbreak in the fall, then what me exactly I was just gonna say what Josh was saying. Ppp is definitely related to the you know. It really should start saying this paycheck protection program, yeah I, think that we need to remember that, because that's what Joshua was really talking about the idea is, you know there are people who should be now returning to work. You know if they're able to and being paid and some people should be paid remote working remotely. That's what I was saying in my reports. Han. Is that there's no connection yet there's no stimulus directly for renters? That's what we're really talking about cuz. Even what Joshua was saying, and even what we heard Michelle Booker say from the congressman for the heroes act that you know the, but you know the support will come to landlords and then it'll be up to the landlords. You know to make sure a Karen that is being filtered down into the tenants and, as you know, that could be a hit or miss proposition. You know whether landlords will now cover some other expenses and not give Tenace. The direct benefit is really the question and that's what I was saying that we have not had that definitive action. Yet you know look worse yet. You know case scenario for landlord would be a rent. You know a national rent strike right, nobody paying rent, but we need rent forgiveness and that's certainly not on anyone's agenda right now and I'm. Putting the link in for the York lending forward piece that you were mentioning Thank You Charles. Is there any other update just two regarding the rent guidelines board. I know I asked that each meeting in terms of well I, you know I'm kind of like following Isaiah Jenkins report. You know, on behalf of the mayor to say, there's a clear recommendation from the mayor and I know: I'll follow up with that, but I do know that you know that the mayor's position would be that there's not going to be any rental increase and maybe some others on the call I know Gregory bagus on the call and others and Donna. Maybe who may be following that, but I know that is the mayor or all election I mean you know, selection. You know on that particular board to say to there his representative that there'll be no increase, but I think that's a TBD Kevin. Yes, okay! Thank you so much for that report and for the follow up Lisa. Thank you. So much for answering the questions in the chat we regarding Linux Terrace and following up on what board went board member wisdom saw recently I believe that it for tonight is there I, don't believe, there's a report from personnel. Thank you for Denis for letting me know the general board agenda. Please look at it and let Shattuck know when you're gonna have your meetings and then let's talk about any resolution so right now we only have one voting item and that will be for the exonerated five out of parks and then we will have hopefully a presentation from open streets at our general board meeting. Is there any old business hearing none we'll move on to new business? Is there any new business, yeah hi Donna, it's more like information and new business I just wanted everyone to know that we're having TV ten and a Phillip Randolph square are having with having a housing tenant forum on 16, June I know right now, there's a lot of forms going on, but there isn't any in our district. So we're trying we're thinking of having this. We are going to be having this in on the 16th of June we're going to have saved as a flyer for the general Board meeting. I'm. Sorry I didn't bring it with me right now and even if I did I wouldn't be able to share it because I don't know how to share on my computer, because I'm technophobic, but I just wanted everyone to know that was come in. It would answer some of the questions regarding the legislations that are out there, the mayor's response, because I don't believe that we actually got a good response from mr. Jenkins and we're gonna have a legal team they're regular. You want to sorta, give us a breakdown of what it would look like on what it would be. If you don't mind, is he still there I love? For my wonder my Gregory Baggett I was a board member. My Florida was aboard at any rate, so the way that the forum is set up is that we're trying to keep it community centered, but we have government officials who have confirmed Gale Brewer s office has confirmed, Ryan's office has confirmed and we're waiting on Scott to confirm, particularly because he has some very compelling proposals that have been put in his reports and Germany has confirmed as well the presenters. What we're trying to do is, rather than have, the elected officials convey the sort of expert information we're trying to go directly to experts with particular institutional affiliation. So we have someone from Manhattan legal, that's going to do the cares, act and all of the legal issues and as well as housing court, and he also will talk about HDFC shareholders who people don't understand or actually tenants, and most of you know, Oxana from community service society min anova she's. A policy expert just came out with a new report today on the two federal bills and the two state bills. So she's going to come and give a discussion on the policy and legal issues. Elisa Ferg ins, Figueroa from the right to counsel campaign, is going to come and talk about council rent the rent strike, as well as the challenges to the new moratorium. The new executive director of tenants and neighbors you Lanka door is also going to talk about organizing during the COBIT moment and as well as provide some first-person narratives about what people are experiencing, and we also have a nice break from the Brooklyn movement. Center who's going to come and talk about the rent assistance program at Nyjah, as well as the need for particular types of reforms amongst the resident association groups and some discussion about mechanisms of community and resident control over nature. That's not necessarily being pursued, we're gonna have to Hana Fernandez. Do a response. Johanna most of you might know, is a WBAI host and a professor and a colleague of mine, she's at Baruch College, and then we'll have the QA and what I've decided to do with this community. And you know the sort of question and answer session is to try to cut down on a lot of the questions, and so what I've done is organized a community panel of subject matter, experts who can manage the chat room and some of the people that have agreed to participate. The community boards Denis Brown Blackman Cordell, clear, Nelly, Bailey, another housing expert and the legal group, Manhattan legal- will probably have their staff attorney sit on the community panel to answer questions, while the supervising attorney does their presentation. So that's the forum it'll probably run about two hours. No, thank you. So we're looking forward to the safety date today, Donna and Gregory, and let us know exactly what you need I know: you're working with Charles in the Housing Committee. But again, let us know all right. Okay, are there any announcements? Okay, hearing none I will entertain that there are a lot of housing forms and you know one of the things that we can do as the community is trying to attend. As many of these forums as possible. The controller's office is having a forum. That's going to be running every week you can find out. The information is web, page they'll, see Nia Glover is doing a legal form, I think tomorrow, or the 28th community board 11:00 along with Gail, is doing the forum as well. So, there's a lot of forums where there will be a lot of information exchange that will allow this community board and this community in general to gain a lot of content, a lot of information to bring to the forum we're doing on the 16th Thank you very. If there are no more announcements, I will entertain a motion to adjourn so motion to adjourn Thanks. Okay, miss Ballou they're properly seconded. Is there any discussion hearing none by common consent, all in favor aye any opposed hearing? None? We are adjourned at 8:45, the nice job. Thank you, hi guys.",
        "summary": "You know just thinking about what people are going through right, now, But I try to stay positive, And I grieve for people who cannot read their lost loved one or not there, because that's very difficult.\nIf you can call, but unfortunately, in our community, we tend not want to go to get professional health You know that's going on in the news and around us, and so many people in our community do need immediate support.\nThat would be great for the June calendar and we can get those set and put those zoom links in there, so that the community will know that we are still meeting so we'll go ahead and start with my report.\nAll of our committee chairs our executive team for getting out there getting the technology getting the technology set up and being dedicated to being there for the Harlem community being dedicated to the issues being dedicated to keeping our meetings when they are scheduled, so I think for the last month and some forms all of the committees met, and we did get a shout out for that.\nIt is important for us to stay near and dear to the community to continue to have our committee meetings because there are so many things going, on, and so many things are changing in a brief.\nSo I know that some of the committee chairs might want to discuss that I've talked to a few of you offline And There's a lot going on my job as well.\nAnd finally, there has been a proposal headed up by the Manhattan borough president's office and the Uptown committee boards to have a forum on social distancing.\nWhat's going on and with everything reopening you know, there's mixed messages in the community about what's actually happening, what's open and when we try to increase these opening, especially with open streets with the restaurants, maybe spilling out into the street.\nWe want to make sure that we're able to support our economic development but at the same time social distance and stay safe, so we're doing a forum on that.\nIf there are issues that are touching on a committee that they might not know, about, I think it's important for us to have a conversation in this EC meeting, because we're all on different calls all have different subsets of friends and organizations that will let us know and influence our knowledge of Covid-19 19 and what's going on So, it's important for us to have a conversation in this forum.\nIt's gonna be one second, so I'm going to UM You may have heard this, but for the greater community I know you seen the news story on that came out about the nursing facility on 138 Street in our community.\nDukes, our Michelle Booker, the vice chair of the Health Committee and others, are gonna work to set up a plan to see how our community members could reinstate the ward, because from my understanding it was already aboard I'm presently up-to-date over 5000 seniors, have died in nursing homes throughout the state.\nIf you cannot say safely separate at home, you can contact New, York, City, Health and Hospitals, and they will get you placement in a hotel and also we're doing tests and tres community center a test and tres community advisory board, because we want people to get the jobs from our community as far as testing and tracing the kovat maintained.\nBecause, already with we have the largest school system in the country, with over a million students- It normally does community for Back-to-school supplies is going to be even greater And I'm, hoping that this board will support the Education Committee and because we want to have the back school program and a sister Of course.\nThey, offer that and I sent that list out to my entire committee as well as ask anybody else that was on the call if they wanted, that list to put their email in the chat So there are, there are things out there that are out there that are free and in our community that are Because I know, parents who say they have to like you, then teach so that they can then teach their kid out of it.\nThe community had wanted to know more about what the format is and then also the issue of the incident with the woman in Central Park, who fortunately accused a black man of what was she saying she threatening her life and that just snacks of you know, through the years of the these serious accusations that can lead to death or just devastation people's lives.\nstakeholders and community partners, we'd like to have on the subcommittee, so ballistas will be coming out and we would like for the board to send out a letter of invitation to these subcommittee members So. As a committee.\nSo we know that there are issues with open streets, so D-O-T, hopefully, will do a brief free presentation at our general body meeting and then follow up with us at the transportation meeting.\nOne of the things that the borough president did highlight was that open streets as it is now Sutter Street, is open to allow people to social distance and get out of the house, and you know just enjoy the outside.\nWe as community boards want to recommend that we are intimately involved in those discussions about what restaurants, what streets and how will that look, as they start to use a lot of our public spaces for this it could be in parks and plazas all over trying to allow like eating areas or open-air cafeterias.\nThere's, a lot of things going on, and it's important that we're able to want to take care of the punic community, but also engage in self care.\nGive me a second Also things that I requested believe the office staff is working on a excel sheet of city agencies having to do with economic development and technology, as well as organizations in the district.\nAlso I would like to try and capture some of these issues that come to the committee, because a lot of times people come, and we have a lot of discussion and someone will say.\nAnd I will be able to read those concerns and share those with the committee and then, when you scroll down for liquor, license I've provided the instructions Are you currently partnered with any local community-based organizations in the district?\nWhat I've done is I've tried to create a way for them to vote on the actual bills and allow us to create a report that we can give to the elected officials that show the people who are actively coming to this committee meeting and that are, you know, interested and what's happening in the community.\nYou can actually you know, click, whether you support or not, and all these forms are collecting data by the way, We will be able to report that data every meeting, every monthly meeting.\nI just want to ask I heard PPE, but you Is there a way to up to Harlem organizations like Carlin, Business, Alliance or Charles, even greater Harlem Chamber of Commerce to find out which businesses in the area have been denied PPP and what the situation is and going forward.\nIf they're, reaching lots of community-based organizations say kebap mass I know that street corner resources as mass on different churches, some have a mass, Park white police officers, giving out white You know for our social distance.\nI believe until the soap about their social, distancing, period, so I think that we're going to have open streets.\nWe want to make sure that we're able to continue to meet and be safe, so they're asking for the governor to extend it until we are, you know, safe, a vaccine or when so appropriate.\nThe chairs of the community boards in Manhattan, are signing a letter asking the governor to extend it, and even when we can come back, we still need to social distance.\nWe want to be able to have virtual or hybrid meetings where some people stay home.\nNot until you know we are able to come together in somewhere, so we are going to continue to social distance.\nYou, know point-blank, but they still want to be a part of the community board, a part of society and able to give an opinion.\nThink you know, I, open it up to anybody else who might feel differently in the area of housing, and that's all I want to report and just to thank everyone for continuing to come onto these calls.\nPlease, look at it and let Shattuck know when you're gonna have your meetings and then let's talk about any resolution, So right now we only have one voting item and that will be for the exonerated five out of parks.\nSo we have someone from Manhattan legal, that's going to do the cares, act and all of the legal issues and as well as housing court, and he also will talk about HDFC shareholders who people don't understand or actually tenants, and most of you know, Oxana from community service society.\nNone I will entertain that there are a lot of housing forms You know one of the things that we can do as the community is trying to attend."
    }
}