{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB6",
            "channelId": "https://www.youtube.com/channel/UCjycPAZuveusvPrk94-ClBw",
            "title": "Manhattan Community Board Six Business Affairs \\u0026 Street Activities- 07/30/20",
            "publishDate": "2020-07-30",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB6",
            "normalizedName": "Manhattan Community Board 6",
            "twitterName": "Manhattan Community Board Six",
            "youtubeChannelName": "Manhattan Community Board Six",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVn0y_oPVdX0vvRFl70YAig",
            "twitterHandle": "@cbsix",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 286,
            "um": 251
        },
        "wordCountFullTranscript": {
            "businesses": 58,
            "people": 56,
            "things": 51,
            "lot": 46,
            "committee": 39,
            "city": 38,
            "business": 37,
            "sanitation": 34,
            "ideas": 33,
            "street": 30
        },
        "wordCountSummary": {
            "people": 13,
            "things": 11,
            "business": 9,
            "businesses": 9,
            "lot": 9,
            "budget": 8,
            "city": 6,
            "committee": 5,
            "office": 5,
            "time": 5
        },
        "fullTranscript": "Are we started recording yep now good evening? Everybody welcome to the July 2020 business affairs and street activities committee meeting for Manhattan community board six. My name is kyla bide and I'm the chair of the committee. It is 6 38 pm and anton malmer will be taking the minute for tonight. I am also joined by assistant district manager, cody, osterman and community associate brendan burke for the members of the public. You can raise any questions or comments that you have through the question and answer feature of zoom. If there's time following the committee's discussion, we will field questions from the public. We will now take attendance by roll call. Cody. Will you conduct a roll call? Please? Okay, great! Let's start with you kyle I'm here, matt bondi, don't see that he's joined dan divine nope, jeanne d'onofrio, I'm here age judge hey, you need to unmute yourself, but I see that you're here, yousef, I'm here john keller, here kathleen kelly anton mallner here, kevin o'keefe president frank, scala, sema shaw here, susan steinberg, here great, that's, nine and you have a corner. The agenda for tonight's meeting was distributed ahead of time by the board office and is on the screen before you. Thank you. If there is no objection to the agenda, we will adopt the agenda, as stated members of the committee. If you object to adopting the agenda, please raise your hand through zoom, okay, seeing no objections. The agenda for tonight's meeting is adopted. The minutes from the June 10th meeting and the June 25th meeting were distributed ahead of time by the board office. If there is no objection, we will adopt these two sets of minutes committee members. If you object to adopting either or both sets of minutes, please raise your hand through zoom, seeing no objections. The minutes from the June, 10th and June 25th meeting are adopted. They will be available on the cb6 website, so just some ground rules for everybody. Before we get into discussion in order to conduct an efficient meeting, I want to share a few ground rules number one. No one may speak until granted the floor committee members. If you have a question about committee business or wish to make a motion, please raise your hand through zoom. If you click the participants icon, the participants panel should appear and you can find the raised hand function there. If you still have technical difficulty, you may click the chat, icon and relay your difficulty through there a reminder that the chat function should not be used for committee business or questions about agenda topics. All such remarks should be made on the record. By raising your hand through zoom chat should only be used to alert us to any technical difficulties you are having or to state in writing information like an email address that was already stated aloud on the record during the meeting. When a committee member is given the floor to speak, I will identify you and you can unmute yourself so that you can speak and last but not least, we are required by executive order to create a verbatim transcript of the meeting. So please keep your questions and comments to sink and germaine to the discussion. The order of the adopted agenda will be followed. We are first joined by council member keith powers. I want to thank you and your office for joining us today and we look forward to the information you're about to share with us. So council member, please take the floor. Thanks, kyle nice to see everybody and I hope- everybody's safe and healthy and doing well even still during a pandemic in a quite a difficult time here in the city and thank you guys for all you're doing to stay connected and keep helping our community at a time where it's so necessary and we just need to kind of continue to be able to see each other talk to each other and work on some of these important challenges before the city. So thanks kyle for the invite you know for folks who saw it or folks who didn't see it. We had my office put out a report on monday that was focused on some very actionable items that the city could take at this very moment to help some of the small businesses and our neighborhood businesses, and whichever is your favorite one. I guarantee you right now. It's probably having a very difficult time, whether it's your favorite, restaurant or retail, or local store, they're, all struggling and facing immense challenges due to Covid-19 some had to shut down. Some are still shut down and capacity limits are not making money the way that they expected to or are used to, but the rents are still due. They still have to pay employees. They still have to do a lot of work and we have seen- and I think there are some really good and important issues at the federal level at the state level. Big ticket items to address things like rent and labor, and things like that. But the reality right now is august 8th is we have well. We have unemployment, that's still up and open, whether we'll expand unemployment. We have ppp at the federal level. That was a big lifeline for these businesses and there's uncertainty about that. Will we get aid to the city, we're still unclear there? Is we have bills that we passed in the city, the city in the state that have expiration dates? We have an eviction moratorium for commercial that is due to expire. So I just want to paint this picture because there are going to be these big things. We need to do, but they're all in living, this lim in limbo right now. So what we try to do is to come up with some new ideas and also collect some of the ideas that are out there. That we think are actionable, need attention and try to highlight them and also try to point the direction in for the city council members and for state legislatures or some of the items that their businesses and those who represent them are asking for and in the council. I just want to start by saying the council. We have done a number of good items. I believe I was on the record as the first outdoor dining proponent back in April, when I did an op-ed in the daily news, and I was really pleased that we did stand up that program which has been critical to giving any lifeline here for the restaurants and bars in our district and throughout the city. But we have to do a lot more and so I'll just go through with a few items that we had highlighted that we think are items that we could sort of do we should be starting to plan for one is this the city I mean this is number one item is rent and being able to pay rent right now, and there are of course, plenty of bills in the council yield other issues around small businesses. But the challenge right now is getting ranked paid because there's lots of landlords who are not negotiating or not are asking for that full rent or not. Delaying we've had, I think, about 3 000 businesses that have gone out of business during the pandemic, so they need they need rent help. I'm hopeful the federal government will step in and do another version or extend the terms of the ppp program, which I think was actually pretty powerful and helpful to these small businesses. Some still can't use it. It's free to expire they're, going to do that. We are still going to need to step in as a city and provide or and likely provide some business assistance either to businesses that can't get ppp, some that still might need it or some that are going to need some other version of assistance beyond that. I'm also not sure we're gonna what we're gonna get in terms of that, so we are asking for direct aid for the federal government. So what I am saying is in whatever version of aid we get indirectly someone's gonna have to go to a plug holes in our social safety net in our budget, but we have to set aside some portion of money to be able to put out together a program to help either do grants low interest loans, maybe convertible to grants or some version of both to make sure we can help these businesses get through the next few months, even if you're, just a restaurant, you're doing outdoor dining, you can't have indoor capacity when you do. It's gonna be still be 25, we're facing a long road ahead for a lot of these businesses. So that's number one: it's just rent relief. We need to take some money that we get or find a new revenue source put that into a program. I would call it the open for business program and make that eligible to businesses. We did a version of this early on, but it was wiped out immediately. We need to do round two of that. We need to get businesses. Maybe I think we should start with businesses that found themselves ineligible for federal assistance and also businesses that are long likely going to be opening at a much later phase here. So that's number one, that's an easy. I mean that's, not that's a hard one because of resources, but it's the most obvious one number two is we introduced a bill into this into the city council on tuesday, with margaret chin and gail brewer, which attacks the commercial rent tax, which is you guys, probably know this? It's a tax that only affects a few community board districts in Manhattan. I think it's only seven community boards in the city- I should say it's all those that are south of 96th street. It just made up an unfair tax. That's been around for some time. We have started to peel away at it, but it essentially represents four percent of your annual rent. That is tens of thousands of dollars for businesses. It can be the difference between being able to pay your rent the next month or not. It's good money to be able to invest in your business. So what we said is we're not doing a full repeal of it for the long term raises a lot of money for the city, but during Covid-19, let's not ask these businesses to pay it anymore. We've narrowed it down. Based on the rent. You pay we're trying to get into the smallest businesses that are paying it. We still may work around some of the terms, but that is a very clear step right now we can take in the city to help businesses that are in our backyard. When you walk out of your house, what there are businesses on your block, probably that are paying it probably from your favorite restaurants based on their size. You might be paying it so we're saying: let's get rid of that! It's one easy step. We can do supermarkets and grocery stores, who have you know, have stayed open so that they would be one of the most easily recognizable entities that were paying it based on their footprint and would be able to be take to be able to afford it. We're not like giving it to goldman sachs, we're not giving it to other renters in the city. It's really we're really trying to aim it towards the smaller and medium-sized businesses. So we put a bill on. It got a good press that we did with this whole report with the chamber of commerce and hospitality alliance. That was a second idea, and the third is the mayor actually put together a program in february that was called fix. It don't find it which was meant to be a program where we say you can fix your fine rather than getting the five fix your issue and then getting a fine except it hasn't done anything we have because of the pandemic. We've seen no outcomes of it. No results. We're calling on the mayor we're putting together a list of fines and fees and calling on him to put that process together, get these agencies together and start and start going through these fines, particularly Covid-19 related ones or some that affect restaurants that are inside it's posting requirements and things like that. We're saying like don't like tell them to fix it, let them fix it, but don't find them right now. Some of these fines are just simply one days of business for these restaurants outdoor dining. Now we can't afford to be charging them and, of course, the one that got the most press, because it's everybody's favorite topic is, we did call to make a permanent outdoor dining program for the future. Some people- I just want to clarify some people, think we're saying like in the middle of winter. We should still have this program, maybe, but what we're really saying is for the future for next spring, maybe in November, when the program's due to expire, if it's still nice out, let's still let these businesses be able to do to do the outdoor dining, I think. Certainly, we should make it eligible for the end of the year or for the months while we're still in a state of emergency, so those who can figure it out or do it can do it and certainly on those nice days, but but also, I think it's been great. I think it's added to the streetscape. I think it has added character to our neighborhood. I think there are some streets where it just makes so much sense. I know it's been bad to little italy, you can shut the whole street down. You can open it up and make it public in a for the restaurants and for people to have walking space and things like that. West village, soho, east village, plenty in my area in midtown too, that would be good streets to sort of like lend and lean into for outdoor dining. So that was the one that got the most attention. We also called for a few other things I just want to highlight. One is one group of people that have been unable to get unemployment is our undocumented workers in new york city that are ineligible. There are some stuff in federal programs for them, the cares act has does not offer them unemployment. The city has stood up a program based on philanthropy to get individuals some money, it's just not enough. It's 500 or a thousand dollars for the whole pandemic. We need to help out those folks who are out of a job right now, just like the rest of us looking to pay their bills looking to feed their families, but have not been able to get funding through that. That's a really important one and we've talked about some other ways to help workers out who have been left out of this economy or are sort of struggling right now as well, but the just I'll just we'll send you the report around as well, but this is a good time for us all to be thinking about strategies to help them to give them a few more months of revenue at times where it's going to be really hard, we also call for expanding the provisions around takeout and delivery. So if you order seamless, you can also get a alcoholic beverage. If you choose to indulge, then you can also get something associated with it. So we're trying to kind of take away some of these laws that we think don't make sense lean into the things that we do make sense, learn some lessons here and call on the city to do it tomorrow. We're called we're actually laying out to the mayor that how he should be doing the finance and fees reform tuesday. We did the introduction of the bill. Yesterday, we did a small business petition to support outdoor dining, so we're trying to take some steps in the days ahead to actually lean into some of the ideas around it, and we are looking for ideas because we're always looking for more good ideas, but how to help these folks. But what would be really sad for me is that we don't have the opportunity to visit our favorite establishments because of Covid-19 and our unwillingness or inability to identify and find those items that we can help them with. So that's where we are that's we're going to keep doing we're going to keep looking for these ways to help them out. We've already gotten collected more ideas from some folks about things we can do, but this is a really tough moment in new york, and I just want to make sure that our especially our neighborhood, like restaurants and small businesses, know that we are trying to help them. We are trying to give them ways out, and I just the last thing I say is it's in our report, but I know you're going to talk about is the business insurance interruption. Initiative is an interruption. Insurance issue is a very real one. That is the thing that would save a lot of the businesses as well, which is, if you allow their business interruption insurance to cover the covent pandemic, which is excluded in many of their contracts with their insurance company. That would give them a big lifeline too. There is a bill in albany, I think, there's a new version of the bill in albany, but for all these businesses that thought they had interrupted insurance and to find out they needed to buy an extra option of pandemic insurance, it's so unfair to them. So we are trying to give them a lot of ideas. I think that's a great idea as well, but we'll take, I think, also some federal resources to back up the insurance companies to do that. So that's it I'll hand it back to you as always good. As a former member chair of this committee, I am always happy to return and and love to see, kyle and all of you in action doing lots for our community awesome. Thank you. So much council member. We actually have a couple of questions that wouldn't mind answering them, so I think kevin raised his hand. First kevin. Please mute and go ahead. Thank you. Kyle keith I've read the report. It's terrific! I think he was great to see the cap on the third-party apps. Oh yeah. Only question I have is. I know I think the DCA has a cap of 10 of price gouging, no more than 10. I think, 30 to 60 days before a state of emergency is declared yeah or any thought. I have her reports outside of cb6 of restaurants, raising prices and giving sticker shock to people once they see a restaurant they've been to before a lot higher prices or at least being more transparent about listing those changes. Yeah, that's a good! That's a good question. I've not seen restaurants doing that, but I certainly I mean, but you should just send them to us. There are we have seen early on and some of the folks, even skytown were sending me examples of where they were going into stores and seeing marked up prices for lysol wipes and spread, and you know disinfectant and other items that were kind of co-ventilated. I see john keller holding up his masks and there was a real issue out there where people you know, had supply or had access and were hiking those items up and I think the price gouging law that was put in effect around clovid was predominantly focused on that stuff. But that's still unacceptable. I mean anybody jacking up their prices at a moment where they think that people are going to be almost harder pressed to pay, but still in higher demand is unacceptable. So I you can always send us examples of that. If you see something and we'll happy to take it up with either the hospitality line to the restaurant or you know, figure out whether it is applicable under the law. I also would be interested in looking at some furthering of the price gauging laws here in the city, particularly around state of emergencies, and maybe looking for ways to either actually solidify, though the things that, like better having to have to pass an executive order on that actually putting that into our law and I'll just mention that you know some years ago when, when surge pricing started on uber, which is one of the third-party apps too, I found that actually, there were a number instances when I remember it was a super bowl night. Actually, it was one year where it was snowing out. It was almost like a little blizzard and the prices were through the roof because they were search pricing at four times. The hike and I actually, with the attorney general's office, went through the price guiding law and found that was price guiding because of a weather event with limited supply, and we actually did get them to actually define it to be. I think, no more than two times the ordinary price, which is still a lot, but four times is extraordinary. I mean you would you would be forcing people to? You know not be able to take it so anyway. So we've done a lot some on that, but you should send me an example. It's unacceptable for people to start charging more prices. I mean it's just a human moral issue to do that, but we'll be happy to look at it. I think we are going to look at more expansions of price catching law all together so but pretend those to me if there's particular instances all good kevin I might have been on you. Thank you. Keith yeah, thanks fantastic! Next up, we have susan he's. I just have a quick data question for you. I was: do you have any idea how many undocumented immigrants we have in this city? I do have that number, because I just I don't have it on me, but it's I mean I could probably pull it up. I just had a call at the mayor's office and of immigrant affairs I'll get you that number, but what I will do is lots have not been able to access the program we're talking about. I actually even went out and tried to find some private dollars to come funding it and that's gonna, be one though it's due to expire up sooner run out, I should say, not expire in august, so we need to get more money for it, meaning private philanthropy, businesses that can afford to contribute individually whatever it might be. I can pull that number up, I'll, get it for you shortly. Okay, thank you, yeah and I just wanted to add kyle, because kevin had raised it. One of the ideas that we had put in so one of the bills we passed earlier this year during cove. It was to put a cap on third-party app services like seamless, if you're like me, and you both a bad cook and lazy. You order some seamless or maybe you're one and use it on both, but if you are both like, maybe you know you rely on it, but but we did find restaurants all have different arrangements and different agreements, and some were paying a lot of money over these third-party services. So we put a cap in for Covid-19. What I think we should be looking at now is two things and the second one I don't think anybody's really talked about. One is extending that past the state of emergency or the period where it's due to expire and give them a little bit more. You know really because take out delivery has been a lifeline as well with outdoor dining into these businesses, and second, is. I do think we should make sure that some of that money goes to the delivery people, if I'm paying for like a delivery free on those apps. I do think many of us probably have the impression that it goes to a delivery person, I'm not so sure it does, and so we can tip on those options, but I pay a deliver like we pay delivery fees and I do sometimes wonder whether it gets to the person who's delivering it. Who, in this particular moment, is braving pandemic craving? You know weather when it's a bad weather and other things and have been really kind of doing a lot to feed us and to get us the food so and I think we should extend it. I also think we should be looking at whether there's anything around you know I'm helping the people that are actually delivering it as well, but anyway, that's what we're talking about I'll go to the next question. Sorry next up is yusuf yeah really quickly. To the previous question, I think the estimates are somewhere between 550 and 600 000 yeah residents, who are undocumented. The comptroller came out with a report on how heavily represented they are in frontline industries like the food service industry and so on. Yeah keith, I read the report. It's great. I'm all in favor of it. The question for me is really around local mobilization so for the local actions that you're proposing is the biggest impediment at this point. The mayor's office is the council kind of behind it, and it's really about getting the mayor's office on board and are there local organizations that you think would be valuable for those on the committee who have connected to mobilize yeah. That's a great question. I thank you. The numbers are right in terms of the undocumented population here and you nailed it. They are essential to our economy and we're leaving them out of our financial assistance right now. It's, I think it's kind of shameful and I'm glad that new york is stepping in, but you know we shouldn't have to provide for like we're relying private philanthropy to fill in a gap. That's this important and I don't, I don't think any of the financial assistance that people got is probably enough at this moment in time, but the extra detection of twelve hundred dollars, that's the unemployment. It's been good, but you know, as I saw as we get deeper this crisis. I think it's gonna we're gonna do more, but I'm just I'm just really. You know concerned about a people that can't access any of that yeah. It's great question, so the couple things I think it's really important- and I was speaking to the former sps creation about this- that there's some way to help pay the rent and albany has a number of bills on it. I just don't get the sense of doing them, so I do try to be a little actionable here versus just waiting for you know, hoping some other form of government will do it. I do think it'd be if you have relationships with other with other council members or you have like organize. You know, organizations that represent workers or businesses are good. Even just passing resolutions saying, like you know, rent is due tomorrow, two days from now, for these guys and it'll be due September, 1st and October 1st and we'll keep going. You know having some version of rem relief and I don't subscribe that it all has to be grants that don't have to ever get paid back like we could do some low interest loans that, like for certain size, businesses that will help them and they can pay back over a long time in a long period of time, but we didn't need something. I think capital is the most important thing to pay, because pvp and the one thing that pvp did, I thought it was it did. It did seem to like have a low barrier of entry in some cases like it wasn't rolled out very well, but it did be something that you could get access to. So I think that you know so that's on that on crt. I think we are gonna build some momentum, it's gonna be the mayor's office around that and we're gonna have to get the cost to be manageable right now we think we have about 20 million dollars for the next quarter, we're going to try to maybe even narrow it down. Maybe just a retail like front like sort of actually like storefronts, to get the price down, but that's definitely going to be the mayor and then, but then, like the fines and fee stuff is just so easy. It's just like the mayor needs to do so we're going to try to do a bill on it. I should be frank, but but I think that we're trying to get the mayor rather than when I was waiting to just pick up the commission he put together and and go out and and actually give these guys more price periods, there's some fines that are discretionary, there's an amount like the low end and a high end like skew low end and some of the some of the restaurant industry, for instance a guy. This is a hard subject. This is a hard one I'll just make, but like have asked for like when you do doh visits for ins, in instance right now. The inspections that you get your letter grade like to make them announce visits in the middle of the day or like a scheduled time to come now. The concern you have is you want them to show up on an ounce, sometimes to catch any bad behavior, but they said for coving like even make our lives a little bit easier. Don't make us shut down our kitchen in the middle of the day so that we are losing all that business for a half an hour an hour or something like that so, but I would say, like look all voices really help here, because what I've learned in the pandemic and outdoor dining was a big part of it like I said something about it early and then, like I know, catherine rivera captain, reynoso, gail brewer everybody just started like jumping in and in this moment, like there's nobody's, got a plan. That's why we're trying to put some form to this. So I do think it's just helpful to like talk to other members. It'd be great if you kept outdoor dining it'd be great. If we did this any local associations on the undocumented one. Obviously any group that's working with folks there's a lot of organizations who are getting the money and then get and then distributing it to them. It'd be helpful to you know to organize any groups or groups that are helping folks to do something more about raising money for this. I've talked to the commissioner moya in the city about maybe trying to drive some like donors to this, because it's a private thing, but but the book, the mayor's gonna, be the biggest impediment here, because he's gonna be do the right thing, which is to worry about the cost of it, but also I found that we just need a lot of pushing from the council and outside people to get him to do the things we want them to do on almost any issue. So but council members are a good start just to get them pushing thanks. Thank you, we'll move on to jeannie and just a reminder to members of the public. If you have questions as well, please use the question and answer function. Genie go ahead: okay, thanks, hi keith! One thing I really just stand on. You mentioned this as well. Is the business interrupted insurance? And you know there was his claws that you know hey. You didn't pay this extra premium whatever. So therefore, we're not you know, you're not covered and exactly what you said. I think this is something that local mobilization like this is something that's like a lobbying issue yeah. So I'm assuming the insurers are in albany right now and where else in this country, you know pushing back on this. Do you know what new york city is doing as far as lobbying to get this legislation through? And when do you think something like this, because this will be a tremendous relief act and this will come from the private sector rather than public sector, and I think it's important, there's so much money in the insurance industry that they hold. They take responsibility for some of this yeah. So there's a new just a couple things there's a noob. There was an old bill by bobby carroll's assembly member of Brooklyn and, I think, was andrew good artist. The state senator that required it retroactively, which people really freaked out about because of all these exists, there's contractual issues and things like that. They have a new bill that says moving forward. You have to start allowing it, which also would limit the scope of money, but would still help these guys out. I would focus on that, though, that bill seems more like doable than the one. That's right, you know retroactive and I would talk to you know. Whichever state senator represent you, I would ask them to sign on to it, because I think it's just a totally new version of the bill. You're right, I don't know what the city is doing per se. We have a big question: that's in before albany, which is about borrowing, money and our financial stuff, and that the mayor has mostly focused around that I I am in full support of it. We have a resolution in the council on it. I believe we, it's not mine, I'm a response, I'm a co-sponsor of it. I believe we passed it as part of our small one of our small business hearings, but I don't think there's no, I think you're right. I think that I think there's like a lot of issues out there right now, and this is the one that would help the most and I think the insurance companies industry is just at least the minimum saying give us the money to so we don't collapse if that's the case, but so I, but I you know, I'm not sure I would be more than willing to work with anybody who wants to do some lobbying around it. I'm kind of talked I've talked to the two sponsors of it. I said if you guys need op-eds or just need support for I'm happy to do it. I don't know if the state, the mayor's state team is up there, you know asking for it or not. I would say that I don't think they are, but but I'm happy to contribute or help. If it's something you want to do and you can reach out to my office, we can figure out how to that's organized. I think it's a huge help for these businesses all right. Thank you. Yeah thanks, seema you're up next hi keith. How are you hey just a quick comment, and I think this has been socialized by this committee before and I'm sorry, if you've already heard of it, but I think in addition to going back to the points around the caps around the platforms, you know one thing that we've seen happen: that's been surfaced to. Our committee has been a lot of platforms. Sorry, a lot of businesses, restaurants like opting to remove themselves off the platform and therefore their status on the platform. For example, seamless changes from you know active restaurant to permanently closed, which then you know the restaurant is actually not closed. They've just opted to not utilize that service or platform, but the you know, there's obviously an incentive from seamless to say that restaurant is closed and now they're. You know these other alternative chinese restaurants, for example in your neighborhood that you could utilize or go to instead, and this a couple of businesses have shared this with us. So you know I just want I'm sure you've heard about it, but you know why not to see if there's any real opportunity to include that. You know I mean I had not heard that issue and if you could send me information on any examples of that I'd be. I talked to I've like talked to these apps in the past. You should send them to me and I think kyle or anybody has them. I haven't heard that issue. We've heard other issues like they you know have created websites, for you know so, they've on their own created websites for the companies, there's been concerns about the charges on phone orders and some other behavior where this is caused, and this is actually some of the cause for some of the legislation we've done is some of these things. Some of these issues and you're, like I think what you're identifying is like at this point in time you probably want to work. You know need to be on at least some of these platforms to make a living at this point in time. It's additive to your to your revenue, for instance, so I think I have not heard that example. I would be more than happy to address that with any of these platforms that we're doing like they should not be saying permanently, they can take them off if they're not having a contract anymore. They shouldn't say, being close. I mean I've seen businesses that say permanently closed. I was like, oh man that place. You know. I mean I've even been there. I used to order from there or something so that would be good to know if that's the exact, if that's actually happening- and maybe I have been fooled by that- but send me examples on that. I would be I will. I will definitely follow up on that. If that's happening, that seems that seems wrong to do. To tell just say that it's one thing to take them off, but you should say they're closed right, so we actually, we actually passed a resolution on it at our last committee meeting. So jim collins had brought the issue up to our committee because he had noticed a local delhi that this had affected and there was actually an article in the new york times where it affected. I believe it was in colorado and other business out there that this was kind of happening, so we wanted to be on the forefront of it. But of course we resolutions can't be brought up to the full board until September, but we can send that to you into your office to see what can be done online. Send it to me, because I've been talking to him on the number issues, just in general, about some of the restaurant issues, so I'd be I'd, be happy to get on that one. That seems wrong all right. Next up, john yeah hi, first of all, just a shout out to the restaurants, the fine couple of the fine, dining restaurants in our area, who actually gave discounts rather on, take out rather than pocketing the money. I think that was really that's great. The question I have and it's a quadri I mean I really was really disappointed to hear that landlords are not doing anything. You know, or some of them are insisting now that the 30 days 90 days is off yeah I mean I was talking to a buddy of mine who happens to be. Fortunately wealthy and he owns buildings and he's giving his tenants 12 months to make up, for you know, to pay off miss rent because the interest rates are low and effectively. He said okay I'll make I'll give you a three or four month interest reload, because is there anything at all? We can do to pressure these landlords. To do this sort of thing I mean in this great environment. It's actually not it's a it's a smart thing. You know I mean, because yeah people aren't lining up to move into these empty spaces. You know great question, I mean look. One would hope that, between the more the sort of like human aspect of having a business, that you are, the landlord for and understand the plate that they're going match with the reality that filling a space in the future is going to be extremely more difficult and you're going to have to lie around that you would lead to sort of natural human behavior would be. I probably should come to the table and negotiate. I have been surprised. I've heard some who said, I created a sublease with my landlord and it goes from you know whatever April to next year January and that just is a lower rent because they want to keep me in there. I've heard some who've renegotiated or some who have had landlords who said we'll, like kind of like you know, figure this out as we go along, but I've heard from a bunch who have not been able, like I talked to one. Actually, I was I'm doing a lot around independent music venues too, and trying to save them, and I talked to one owner who kind of has a couple bars and venues, and he said that, like one negotiated, one, they kind of came to some terms on how to pay and the others he's got to know. This was yesterday, he's got no answer before and I don't understand the economics of it from well. I don't understand the like admit: you might lose his place and then you are in trouble, but one thing we did do is we waived the personal liability provision which says that if you can't pay, the rupture that you independently are then owe the money, and for this was one of the places I talked to was living in fear that they weren't going to be able to pay their rent, their landlord would negotiate and they now would be personally liable. We got rid of that for Covid-19 because we were really concerned about an individual's entire livelihood being put at risk. For that. I thought that was a really good bill. We have to probably extend it further. The eviction moratorium helps too, but both of those things still don't get to the issue of rent it might prevent, and it's this just goes into the presidential sector too. By the way. So I you know, I would like to believe that there's lots of good actors out there, but I don't know that we can rely on that and that's why I do think albany who has the jurisdiction here should be doing. I mean they've done red, they haven't done anything really on commercial, but they have done stuff around renters, but then we need more because this is pain is shared across the board. I recognize that, like we have an ecosystem of land, you know landlords and that down to the business down to the employee, but we need to be intervening to stop to stop this and we, as a city itself, have a limited power in that goal, but I don't understand the strategy of some of these property owners to offer nothing and or to offer minimal, and that goes to the residential side too. I mean I don't want these people to be evicted and we've done moratoriums, but I you are led to believe that they're gonna, the rent's gonna add up and they're gonna have to pay it some time in the near future. There's no reason they can't turn these into interest-free law. I mean it. Just isn't you know yeah. I agree. I agree. No and the point you identify john is a real one which is like we can we'll give them money if we have it. If we have resources, we would be giving it to them, but we're also paying for something that we would like to see. Behavior change on, and you know I did think there are some landlords who early on were waiting to see what the outcome of laws and assistance would be, who I think, maybe somehow change our behavior now, but it's disheartening and I think we just there's our instances here where we need to change the laws just to make the behavior reflect what we actually want. Thank you yeah all right, so there any other questions from anyone else. I actually have a question. So that's my question: if there's anyone else who has last questions, please submit them now. So, regarding the outdoor dining, one of the things that we actually have on our agenda later tonight is about sanitation. So one of the things that we've seen is that outdoor dining has been great. Outdoor dining has had a lot of positive change, but there has also been some negative effects of people dining outside, most notably the sanitation and then the subsequent. You know rats and other vermin. So one of the things that we are going to try and figure out later in the tonight's meeting, but would also love your thoughts on if this is something that's already been considered, is what kind of you know ideas? Has there been as we you know, look to extend outdoor dining? Has there been around? Maybe modifying trans? You know desanitation, whether it's pickup or street cleanings, or things like that yeah. I'm sure that you know we can do both so good great question. No, you know I was hoping the pandemic would solve at least one problem which is rats in new york city, as they had lost lots of options of food here, but we didn't get that so I'll start by saying, like this program, was stood up in very short order. So we didn't have we had some restrictions, but we didn't have lots of guidance to give the restaurants about exactly how they build it, exactly how what materials or how they set it up or anything like that, and so lots did it their own way, and I do think if we do something more long-term. We're gonna have to look at a couple issues: one is just street cleaning and making sure that we have ways to do street cleaning. As we experience in the future. Two is you have to forget. We, you have utilities that still need to get through to the sidewalk that are not able to do their work right now. We have to figure that so we may have to offer this in different places at different times or do limited options or rotate it or something like that is I just you know, or just or just pick some streets and say like you're now at outdoor lightning street, and not it won't be everybody and it's going to be challenging like it is now, but it was stood up very fast. It is a real problem. I think one of the things we can do if you make it permanent, is to come up with even some plan about how you have to build the outdoor or come up with some specs or something like that helps address some sanitation. Also, maybe protocols around cleaning and stuff like that, but street cleaning is still a thing. We need to get happen on our streets, like the actual like with the machine street cleaning, and you know we'll probably at some point in the future, but I think the diff, we'll probably you know, actually do some more enforcement sanitation, but I think the difference is between now and later is now. These businesses really are relying on the revenue. If we do this in the future, it would be closer like what a sidewalk cafe is now and we'll have to figure it out and we'll have to integrate it into the streetscape and do more around it. But right now it's hard to do some of the stuff like enforcement on sanitation, so that, because they are struggling, this is like that fine will could take away the entire days of revenue. So right now it's a little bit an urgent moment. I think, as we do this in the middle of the winter and maybe the fall to figure out like we could come up, we could we could visit. We could do an RFP in the city for a outdoor, dining module or something like that, and maybe it has. I don't make this up like and require a few different models that they have to choose from that maybe have integrate some way to prevent you know trash on the streets or something like that like I think you can be creative, some folks who were talking last week about like, if you have outdoor dining, you should have some in-ground vegetable places to put your trash and stuff like that. Like there's some interesting ideas that just may be hard to actually implement, but we have to do we have to if we're gonna extend, we have to do an actual conversation about how to keep it for the long term. This was a program I think they had applications open on friday by monday, people were open, so there was purposely not a lot of thought put on it, because we wanted to get these guys open and put money into their pockets. So there is a. There is a conversation that needs to be had about that. Thank you and then we have a final question from matt, okay, where's matt. How are you and keith it's matthew bond? I wanted to let you know how wonderful I think it is to see the restaurants coming back to life and how beautiful some of the streets look with the string lights and the tents and the way that they've done it up with planters and everything else. One thing that I came across here the other day that I think that everybody should be mindful of going forward is, was one place and I don't want to necessarily name them, because I'm not out to do that to anybody. But it troubled me that I was directed into the street with my family so that I wouldn't walk down the corridor on the sidewalk, and I think that that's just you know something that should be in any future guidelines. With respect to this, that there should be a corridor, that's maintained for pedestrian use through the sidewalk and that pedestrians shouldn't have to be directed out into the street, because what I found on that particular day was that you know we were being directed into the street and protected by cones, and maybe some caution, tape or something like that, and I really didn't think it was okay, for you know my little girls to be walking hand in hand with me out in the street. So I just wanted to bring that up, but otherwise I think that you know so far from what I can gather. It looks pretty good and it's nice to see it going down so yeah point us to any examples where there might be a real problem and as we do the long-term stuff, we got to think about how to make this like really part of our streets, not just like sort of an add-in and add on. But thanks for the comment and I and kyle I gotta run, I realize I'm 20 minutes late for something. So I have to run but thank, but thank you for giving me time and read our report. It's on our website and we just put out a petition. I tweeted it out yesterday, if you want to add your name to it or circulate it just because we're gonna eventually send an update over the mayor and the city council members hear about. I think we have like 500 signatures already yeah, so we're going to you know we're going to collect a petition and send it over to our to our colleagues. So there it is there you go well. Thank you so much again, council member, I actually I sent out your report and the production to the committee before meeting. I just want to thank you for joining us and providing that inside information and further for clarification on the great plans that you're doing. But you know, obviously your legacy has been felt on the committee. So thank you for continuing that at the at the council level, as well and being you know, a fighter for the communities and for small businesses. Thank you yeah. Thank you thanks guys. Thank you. Everybody all right, so thank you, everybody for participating in that conversation. So before we move on to the next agenda items, I just want to propose to the committee you know. Obviously the council member has put forth a detailed report with some proposals, some that we have supported in the past. Does anyone have any thoughts on putting forth a resolution in support of some or all of the proposals that were mentioned? I see a key kevin. Raise this hand you're on mute. Kevin, can't hear [Applause] yeah it's coming from kevin. Can you speak again? Yes, I'd like to make there you go there. We go in support of the small business and outdoor dining program, including the recommendations in keith's reports all right before. We second that I just want to check. If paige wants a second that or has a question paige I want to, I want to second it. Okay, kevin dining part right. Is that what you said I couldn't hear all of it dining and small business. I didn't hear what you said: kevin the outdoor, dining and small business. The full report, including recommendations. Did you hear me yep? I can hear you yes, okay and that was seconded by paige. So just as a reminder for this too, as we as we vote on this there, we are absolutely allowed to include suggestions that we would like to see, because this is a plan. So for things like outdoor dining, if we have issues with you know- sanitation of course, or even ideas on as the council member just mentioned. If we have ideas for how we want to amend that, to say that you know certain blocks have to rotate so that we have. You know, opportunities for street cleaning and making sure that there is an evaluation that doesn't disrupt with you know: pedestrian space or traffic. We can add those as well kevin something I would like to go back to my point about making sure there's not price gouging, maybe even to be I'd like to make it in line with the DCA says that you can't go over 10 percent of pricing from 30 to 60 days prior to an emergency being stated, I like to think that restaurants can do the same, especially if we're supplying so much support of them. In other, in other ways like keeping a cap on the third-party apps, so I'd like to see that as part of it, certainly any other comments from anyone else. Please raise your hand on the on the panel. I can't see otherwise, so, oh, okay, all right genie, sorry yeah! So for the for the sanitation, I would like to say that they need to look at the sanitation rules and guidelines, but I wouldn't be specific about rotating street closures or anything like that. I would have no idea how that would affect overall revenue. They say you know they have to alternate, and you know to have a street clean to come through, and that means you know it whatever x hour and how much money they lose. I wouldn't do that, but I would recommend that they there has to be a study or some kind of way for them to consider keeping these streets clean. You know sanitation going through, and I lost my train of thought, the other on the other, oh about coming through pedestrian traffic, that they find that they should start looking for ways to organize pedestrian traffic for pedestrian flow without making a specific recommendation. Yeah, we don't have to you, know, put forth a specific plan within this resolution on any of that, we could just say that you know we want to maintain pedestrian safety and space as well as sanitation standards and public health standards, and something like that: okay, good, because they do yeah because they do go hand in hand right, because if we do make it permanent, we also it needs to be accompanied by some kind of plan. Otherwise you know then you're catching up to to another problem, but matt. Thank you, kyle. One thing that I've come to start realizing here with my kids in particular. Are the the potential likelihood that there are going to be a lot of schools coming for open streets as well for a recess and socially distanced drop off and pick up? And I don't think that as much as I you know, support small business, and everybody knows that I do that there should ever come a time when the interests of outdoor dining trump, the interests of socially distancing, kids and giving them a place to play. So if it were, if there were, there, should never be that collision between the two that students should always you know, take precedence and the prospect of open streets for play. Recreation, drop-off and pickup should always take precedence over any commercial use of the sidewalks or the streets. Thank you. Thank you for that matt. Are there any other comments on this, because I you know, I think matt brings up a great point, which is obviously we want to make sure that we're supporting the small businesses, but as we as the work is always included. We want to make sure that the community is also being respected and comfortable at the same time and the hard part about our decision making is we want to you know we have to often threat that line of supporting small business but at the same time supporting community safety and health, and all that so I just want to you- know put that into so. It was seconded by paige and we do have some ideas and of course this isn't a bill that we're talking about. This is a plan that's been put forth and, as the council member even requested, this is an opportunity for feedback as well. So now that we have that secondary footage, we have to do a vocal all right. Yes, I can do that one. Second, all right, kyle, your vote, yep, I'm in favor of supporting council member powers, economic plan, okay, matt in favor genie, favor paige, I'm in favor, john in favor, anton favor kevin in favor seema. I am staying for cause because of the comments around insurance with my job susan in favor. Okay, that's nine! Nine in favor none against not abstained and one not entitled so that motion passes all right. Thank you. So, moving on to the next agenda item brendan, could you pull up the legislation so we'll be discussing what actually the council member mentioned about the business interruption insurance? So there are two bills, as you might have seen from the primer email that I send to all of you that are currently in committee, one at the assembly level, one at the senate state senate level. Would you like me to share the assembly one or the senate one? Let's start with the assembly and just review that quickly and then go to the senate one, and then we can open up for discussion, because I want to make sure that public members have a chance to view it as well yeah. So this was, as I mentioned, passed or introduced back in March. When the you know, quarantine stayed home guidelines first started, which of course affected many businesses and a lot of them didn't have insurance. I covered, or at least business interruption that covered pandemics, and so what this legislation does in partnership with the state senate bill is to include pandemics going forward, as the council member mentioned, that it should be part of business interruption going forward so that businesses can have a layer of protection against what's going on. So I don't know if anyone got to review this before the meeting, but I want to open it up for discussion. Obviously this is an important piece of legislation that we should, you know, send our support to or if we have changes to it, that we should indicate those as well all right, I see. Jeannie has your hand up. Yes, thanks, kyle there's a lot of legalese or you know talking this it's hard to read this document. Is there any way we could get somebody to walk us through this legislation? It's hard for me to be of any opinion, and if I really don't understand the language of it, I mean I understand the concept but to put a foot forward on this. I would be great if we could have somebody kind of walk us through it sure is that is. Does everyone else feel that way as well? Does anyone have any thoughts on this? Initially, what we can do is we can. Actually you know we can call in the state, senator's office and the assembly member's office to see if someone can walk us through what their thinking is, where it is in the process as well. If that is something that the committee would prefer, john, I see your hand up. When are they going to vote on? They probably want to vote on this in the next couple of weeks. Right I mean honestly, I don't know because this was introduced back in March if they hadn't done it initially, I'm not sure you know if they're gonna push it off, but can we also go to the state senate bill as well? George, thank you. Thank you yeah. So, as you can see, it's still in committee both of these, so we do have some time, but obviously our next meeting would be in a month. Susan. You had a comment as well yeah. I think probably the senate and assembly bills are essentially the same, but I also read this new york city bar report, their concerns and objections. It was bad enough, not understanding the bills, but my eyes absolutely crossed and my brain dissolved when I read what the lawyers had to say so frankly, I think, if we're to do anything intelligent with this, I think it's essential we get it explained, so I would encourage having either you know, assembly, member, liaisons or senate liaisons come and make a presentation. Okay, yeah we can do that. Is this co-sponsored by any of our cb6 assembly members or senators like harvey or dan or is it would be the logical people to go to right yeah? So we have coil, we have a senator hoyland there as well. Okay, there we go so that wouldn't be a big ask. Then we could just ask his office to or senator himself and I'm pretty sure, one or more of our of our assembly members must be behind the assembly version. I'm just guessing. Can we check the assembly one again brendan double? This could be easy. I mean this could be relatively simple. Yes, it looked like epstein was one of the sponsors of the assembly version but ordered, or you know either one I'll go back to it so that we can double check rebecca, see, right, she's, epstein's there, he wright is there yeah, I don't see. Abs is I've. Seen that I thought yeah he's the first, the fourth name so yeah we can. We could have ask about someone from senator holman's office and assemblymember epstein's office. Come to our next meeting and see right as well. I think she's pretty good with the community. So are we all fine with having a presentation on this next month? Does anyone feel strongly that we should comment on this or vote on this at all? I'm fine having a presentation at the next meeting. So if anyone genie your hands up? Oh sorry, I didn't take it down. No, oh, okay! So if anyone objects to the plan of adding this to our august agenda as a presentation, if you object to that, please raise your hand all right. Seeing! Oh, I see a question from there. You've got yes, you've got a question, so the question says: will this bill cover the claims beginning in March, or is it just for future claims? So I believe that it covers everything going forward. I think there was a distinction that the council member mentioned, that there was an earlier version that was asking for this to cover prior to the actual shuttle- I guess back in March and the early days, but that there is an amendment to make it going forward, but I think, with the presentation next month we can better clarify what they're thinking and how they've edited the bill since it's been in committee for so long, okay, seema. Oh sorry, I'm curious- and I don't know if this is actually even feasible, but I'm happy to check into it like so you know the dfs, which is the agency. I work for at the state level, is responsible for kind of setting insurance rates and you know kind of commenting more generally on the insurance industry's kind of concerns and challenges and regulating the industry. So you know, if it's possible, I'm happy to see if there's some interest from the dfs to kind of share some thoughts either on or off the record again, I'm not sure that there would be or that there could be, but I'm happy to kind of look into that. If that's helpful, because I know you know we're really concerned about the bankrupting, basically, the insurance industry, which has like you know, obviously a ton of like this would be like really kind of messing with their solvency and not like I'm commenting on either of these bills or even commenting on which direction. I think the committee should go, but you know I think we need to think through who we're thinking about as winners and losers in this fight yeah. I think that's a valid concern, yep, so yeah. If we could, if we could have someone from dsf, that would be great. Yes I'll. Do some research on my end awesome all right. So, let's move on to the next agenda item. Thank you for everyone on your feedback on that. Could you pull up the article brendan just so that we have it in the background? So the next part of the agenda is to discuss the sanitation issues that we've been seeing due to outdoor dining, so to just provide some context to the conversation. Again, we received a number of complaints, and I don't know if anyone has walked around as well. I've done some bike rides up and down second and third avenue just to see how everything's been working out and yes, there's a lot of positives. A lot of people are supporting local businesses. People seem to be enjoying it, but the downpo the downfall to that is that there is increased, garbage, increased sanitation on the streets and then, of course, what sanitation, poor, sanitation attracts and I've seen it myself. I've seen at least you know in our neighborhoods an increase in you know, rats roaches, other types of bugs, and I've also seen a huge amount of trash on the side of streets that is kind of left there for many hours and I've gone late at night, just to see how everything has been has been going on. So I've seen trash stay out till about you know like 2 a.m. You know just sitting down inside the streets and of course you know that's a breeding ground for a lot of different things. So I think- and as many of you know just talking to me, socially sanitation is one of my side interests and how we think about sanitation and how we move forward with it. It's still bizarre to me that we, in the you know, 2020 just throw bags of garbage on the sides of street and it hasn't evolved from that, but I think this is a good time to do something immediate to address the concerns that we're seeing, because I think this also impacts how people feel about outdoor dining. I think it impacts quality of life, of course, and then, as we are, focusing on public health, this impacts that as well, so I sent out some links on department of sanitation on their schedules on their process. Things like pick up and again wanted to open it up to conversation to see if there are any interesting ideas people have as to how this could be addressed in the immediate future. I don't think this is the time for some big systemic change in terms of how we think about sanitation, but how we can address what we're seeing from outdoor dining because, as we initially discussed, outdoor dining sanitation was one of our concerns about you know: food being dropped out the increase in garbage and so we're seeing some of the effects of that. So I don't know if anyone has initial thoughts or experiences on that they'd like to share. I have some as well, but susan feel free to start us off. I scarcely left my apartment, so I don't know what the setup is in the outdoor dining. I mean I've seen some photos, but would it be possible just to have additional garbage bins, not the ugly ones? I some big plastic ones on each end of an outdoor, dining each end of outdoor dining, so that would be a quick place for people to drop trash. So you're talking about like a dumpster, well, that's pretty ugly, maybe like the street ones you see on the street. Is that what you call a dumpster? No, so I was thinking so. The issue that we're seeing is that the amount of garbage is like too immense for the garbage cans that we see itself, whether it's the like solar powered ones or the the canister type ones where they have a garbage can inside another can, as I've walked and biked around there. I've seen that overflow just from pedestrian garbage, but what we're seeing is a lot of commercial garbage so from the restaurants itself and I've even gone a little bit south of of our district and just north of it as well. Just to see you know to appear in other neighborhoods if it's just something unique to us, but it seems to be a city-wide issue. I've seen piles and piles of garbage that are just hey. It's hard to walk around. First of all, I've seen people set up outdoors climbing next to the garbage as well and which is kind of disgusting. To me, I would never sit in a seat next to a big pile of garbage, but things like that so to have a simple canister, I don't think would necessarily solve the solution unless you were suggesting something like a dumpster. But my initial thoughts were something like more structured pickup for department of sanitation and have it earlier, but particularly in highly congested areas of outdoor dining, which could be pretty easily gathered that information and so our district, particularly like third avenue and second avenue. I was actually biking last night. I wanted to grab a picture, but there was traffic. I didn't stop, but there was piles of garbage outside of a residential area that had overflowed from a commercial space on third avenue, and there was obviously smell. I saw a bunch of rats going in and out of it so to have. I don't think the canister would solve the solution, but it would have been great to see at least you know, amending the schedule to have garbage be picked up about an hour after outdoor dining is supposed to close or an hour and a half rather than sticking to these. Like late night schedules, because it's just sitting out there till like two in the morning, that was when I saw it out there, which is pretty bad, because at that point you've already the problem has already existed, so it it's more about swift, pickup and then obviously now I think more pickup, because there's just more garbage accumulating genie, see your hand up. Okay, thanks kyle. I totally agree that more pickups, more frequent pickups will be helpful. I get I just have two questions is: why is there so much trash and buckets on the street from restaurants when they had no problem when people were eating indoors, they have trash receptacles inside. I don't know why. All of a sudden the trash is now being piled up outside in public. You know facing containers, that's number one and number two. I think this there's also this. You know this. It's like a movement, so I think if people are, you know we lost. First of all, we lost the composting program right. The mayor shut that down and that's causing a problem right, and I think that's probably part of it. I mean, I guess if there could be some kind of like movement. Emotion like people need to know that again, sanitation is part of you know, keeping a virus at bay. You know so my two questions is like: why is it so much trash and I think the restaurants are going to push back and say: hey, that's not our trash. You know we still do the same. We have the same practices, it goes into receptacles. So if it's not them, then what is it? Is it just public people congregating and you know- or you know, is it that nobody has some money for a commercial pickup. I mean, I guess again I'd like to know why there's so much stretch and I'm sorry and just to go back to the composting. I think, if they kind of if they can get that going again, that's a huge, that's a huge plus in so many different in so many different directions exactly you know, and it's like we're forgetting about what's happening with climate change, and you know so we're throwing out this whole composting program to save some money. But in the long run it's not so you know, maybe that's a problem too. That's yeah! So that's one of the things that I would be that I would like to see in a potential resolution. If we're doing something on immediate things for sanitation, I think restarting composting would be very beneficial. I think that would actually engage local people as well like there might be community members on their block, who would say hey for the business. If you have you know compostable materials like I'll, take it to the to the compost thing you don't have to do it I'll do it which could reduce the amount of trash. I don't know exactly why I think trash has just always been an issue. I just think it's more apparent right now, because there is so much more outdoor activity. I think with the reopening it's just kind of motivated people to say: hey, you know what I want to spend more time outdoors. I want to support my local businesses and so they're, seeing you know, increases in that, but then, of course that creates trash. I think there needs to be some owners on the businesses themselves as to how they're you know, collecting trash and when they're putting it outside and how long they're leaving it outside for, but that's again open to discussion, how you know how we would like to because again, you know, as I always say like I like to be proactive, so I want you know any potential resolution. If we decide to go that route to have some ideas about how we can balance this and how this can actually serve as a model going forward for anything, that's more substantive on. You know sanitation measures, but right now, I'm just thinking about immediate things, because I've received a lot of complaints about it. I've seen it firsthand and it is an issue anton and I saw your hand up. Yes, I do, I think, there's two issues over here: one, the business garbage and the street garbage businesses have to use private carters where, as a city to picks up their garbage from the corners corner, garbage cans, there was a program on the news, the other night. That said, basically, that, because of cutbacks in monies, the sanitation department was not equipped to pick up as much garbage as it has in the past. So it's a money problem there. On the other hand, the commercial carters, I think, should be incented to go on the schedule such that garbage has not left 8 10 12 hours out on the street. I've seen that in my neighborhood, which is around 56 first, there are some businesses that the garbage is out in an hour or two and other businesses where they just stay there and unfortunately, there's no single carter. You can go to. You have to incent all of them to work with their restaurants and or other commercial establishments to effectuate a schedule that you know you don't leave the garbage out long enough for the rats and other vermin to thrive on it. As far as the city is concerned, it's a budget problem and you know I've seen people are using these corner garbage cans, but if they're not being emptied in a timely manner, well, they just get piled up and piled up. Also, I noticed there are a couple of small commercial businesses that tend to use the corner garbage cans instead of holding it hauling it out with a commercial carter. So I think we have two issues to face over here. One of them is the city's issue in terms of more frequent pickups and the second is incenting commercial corridors to be more efficient in there picking up garbage the last part is you have business improvement districts in our in our cb6 area, and now I used to sit on the business approval district for 14th street and they were very efficient in helping the city, sanitation, keep things clean around that area and we're very proud of that. I think we should reach out to the various partnerships and see if they can help our city sanitation in their job. Great ideas anton. Do you have ideas? You were talking about incentivizing, the commercial pickup. Do you have any ideas on what that could look like just initially, I really don't, but you know there are smarter people in the sanitation department or in this business, who probably can come up with ideas. Okay, kevin. I see your hand up as well. Oh someone who was that was me cody. Oh, I was gonna say that the this board has passed a resolution in support of the commercial waste zones program that the sanitation department you know is scheduled to do. Obviously that was pushed back because of the pandemic, but that will be happening sooner than later and that would allow for what anton has just described if it's a zone and it's one or two carters in a zone that would obviously be more efficient and you know, might allow for the things that he just described perfect and was that the land use committee, ah transportation, because or I don't recall- but you know it's available on our resolutions database, but I can send it to everyone after this meeting as well perfect. Thank you kevin. You got a comment yeah. I was just going to point out that I believe we're getting a sanitation garage on 25th and, first that there might be some opportunities there to experiment with some initiatives: pneumatic tubes into that facility or other things. It might offer us an opportunity to work with them since they're. I guess, do we know they're going to be housed in our district right. Do we know if that's happening cody? Are you aware the brookdale project right there's not been a lot of movement on the brookdale project in the last little while, and I would be very interested to see how the city's budgetary constrictions impact, if and when that moves forward, but even before then we hadn't really heard that was starting up again. I know that they were waiting for the space to be vacated by hunter, so yeah. So actually you know what kevin was mentioning is something that I'm actually I'm really into as a as an instrument, I loved you know, figuring out better ways for sanitation, so this actually exists. This exists on roosevelt island, where they have tubes that actually suck the trash out and send it to a trash collection center. So that's how they actually. If anyone has ever been to roosevelt island, you don't notice any trash outside or on the streets. That's to me sort of like the wish list, bigger idea for for the rest of new york city, but yeah, but that's really that's something I would love to see. And yes, as many people know, there is conversations about the brookdale site, which has been obviously very contentious for for our community. At the same time, from brendan who mentioned, the resolution originated with the transportation committee, this about the commercial waste zone and the resolution passed back in 2018.. So if anyone would like to see what that resolution was about, the link is in the chat box as well. So we can review that. But yes, I do think that there needs to be some immediate action in the future about this trash collection and cleanup, because the corner cans are overflowing from people just being out on the street. The commercial trash has increased because of you know more people going out and then there's also the what anton mentioned. Because there are, we do have budget cuts. There's a budget deficit there's probably not as much pickup as there was before, which has also exacerbated the problem. So does anyone else have any other further comments on this? Does anyone want to put forth a resolution that asks sanitation to modify their schedule to accommodate the increased trash because of outdoor dining and because of the summer months? This doesn't necessarily have to be. You know an increase in the amount of pickups, but just could be a modification of their scheduling and their strategy with everything that's going on genie, I see your hand up. Will this go to the board? Not this will be held hold until September this resolution, because the board is basically on. You know summer break yeah, so the way it works is I can bring it up to the executive board at our next at our next executive board, meeting which it can pass the executive board under advisement that it would be then followed up by a vote in September. Okay, I will be happy to work with you kyle, because I've never done it before this resolution yeah. Let's do it yeah, okay, cool awesome, yeah, and we can we can. We can send you the resolution style template great. So we can. We can do that. Thank you yeah. I have I sent that out, but I can resend it out again. Obviously this will be a little different because we're not voting on an application but yeah. I can work with you on that. I would love for you to take the lead on that and I'd really- and you know, especially because you're passionate about the composting program, I'd love that to be included as well, because I think that is a component of this as well. Is that there's no place to do that anymore? Okay, yeah so is there is that is that a motion genie that you're proposing you're on music? Sorry motions, yes motion to go forward with the resolution on the on the sanitation process is that is that seconded by anybody? Second, all right seconded by susan steinberg cody. Could you do the roll call sure kyle, I'm in paper dad in favor genie in favor paige in favor, yousef come back john yeah, I'm in favor anton favor kevin in favor sima in favor, susan in favor and I'll go back to youssef. I think he might be having some technical difficulties. Okay. Well, you've got you count him as an abstention or a nun. Sorry, I am back I'm back my apologies. I am in favor all right, ten zero. So there you go all right. It's wonderful and I'll follow up with you genie afterwards on moving forward. So thank you for taking taking that on. Thank you. Oh thank you. So the last agenda item is about budget requests. So, as I put an email brendan, could you or cody pull up the air table with previous budget requests? So, of course you know we should be thinking about budget requests going forward, obviously we're in a budget deficit. Obviously the the future is a lot different, now we're in a transition, and so I think this is a great opportunity for us to reevaluate what it is that we're looking for what it is that we could support that would support economic recovery and relief in the past. Basa hasn't really had many budget requests, as you can see from here. It's primarily been on affordable research, space and inc business incubators for the district, which is you know, has worked in some cases hasn't, but I really think this is time for us to be more substantial in what requesting, because, as we've seen from our workload, a lot of the you know future development and future ideas are landing on our laps as the business affairs committee and supporting small businesses, but also community development at the same time. So I wanted to open it up to, and this is obviously the first of many conversations, but I do want us to start thinking about it, because the budget committee is going to be discussing this as well. And, of course, every other committee has a bunch of priorities as well, but I want us to start thinking about things that we could request or modify as we move forward with. This also affects our district needs as we go forward and, of course, that's going to be very comprehensive going forward because there are a lot of needs going on right now, but I wanted to open up the discussion to see what kind of things that people are thinking about, things that we want to see in the district or maybe changes to agencies, priorities or anything else. So jeannie, I see your hand up if you want to start off the conversation yeah thanks kyle, I was thinking of a small allocation to maybe work with the bids on a needs assessment. So you know because this like we're roiling in so many different areas right and maybe we could bring in some. I hate to use the word, but some consultants, or some experts that can kind of go out there and canvas. What's going on so community board, six could be more effective in what we do to help out our businesses and we could. We could come up with some solutions. We could knock on doors, but maybe if we had a small budget we can where we can bring in professionals who can actually look at some. You know actually do a needs assessment. I don't know if it's coming from my world in philanthropy, but it's just that it might just cut to the chase a little bit quicker if we had a little bit of money to do that mm-hmm. So a community needs assessment, exactly okay, perfect. Does anyone else have any other ideas any hands up? So just you know, I can start off with some ideas, some of the things that I've been most interested in and obviously I think this is exacerbated going forward, but I've always been interested in like workforce readiness, making sure that people are prepared for the workforce that businesses are prepared for you know whatever it is, that's coming their way. So really, as I was thinking about, you know, future budget requests and of course this is not a fully formed idea, but really thinking about like entrepreneurs support so like really supporting small businesses. I think you know if you saw the commercial rent control resolution, that we passed a couple of years back, that I sent to everybody via email, one of the big things that needs to be done at the city level. Is that there's no definition of what a small business is, how many employees that is or no are or not and there's a definition at the federal level, there's a definition at the state level, but the city really hasn't defined that, and so I think there needs to be some support for those actual small businesses that we're talking about. So to give you an idea of what we're talking about. There is a, I believe, it's a federal definition of small business is 500 employees or less because in the grand scheme of things, I guess that is pretty small. But when we're thinking about small businesses at the local level, we're thinking about those mom-and-pop shops that are run by the people who are in the store themselves and the owners are their employees as well or they have a couple of you know a handful of other employees that are helping run the place or they're independent companies or bookstores, or things like that, so providing some creating some kind of you know support program for businesses to get back on their feet, whether that is incorporating consultants or you know, accounting or some kind of support that maybe you know, businesses don't have the resources to take on, even though it's important for them to go forward with that, we could do things for individuals, you know creating some kind of like job network or hub for people, because obviously a lot of people have been unemployed, but maybe creating some kind of training program to get people back on their feet that helps them get trained in job placements or workforce readiness- something along those lines. So those are just some ideas that I've been thinking through, obviously they're kind of half-baked, but something along. Those lines because I think this is an opportunity for us to come up with creative ideas to address the problems that we're seeing particularly from a business economic development side. So I don't know if anyone, if that kind of has you know, motivated someone else to think about something, but or if people as they've, you know been preparing for this meeting, have come up with other ideas or just have a gut reaction in this moment to some things that we could put on this budget list any initial thoughts or ideas. If you do, please raise your hand, kyle yep, to genie's suggestion earlier, something like hiring a consultant to help to specifically help us get a better sense of the neighborhood, probably wouldn't make it on the budget request that we submit to the city, but is certainly something that we could. You know the community board with our budget or with the street fair funds could could engage a consultant to help us the kind of budget process that you have here. I wouldn't kind of produce that the funds in any sort of timely fashion for sure if they were even going to fund it right, I'm not sure what the city agency would help fund that, but that is certainly like a good idea, for you know you all of you agreed to that, could pitch it to the broader membership or to the executive committee about using the budget funds that we have for the office or street fair funds if it's outside of what we could pay for on the office level. For that type of consultant work. No, it's a it's a great point, yeah cause. I also want this to be an idea sharing moment. So if anyone like, even if you're, not sure just you know again like myself, I had half baked ideas. Just just throw them out seem, I see your hand raised yeah, just kind of building up one of your ideas. You know, I think, and I think this probably falls in the same category as cody was just referencing, but you know if there is a virtual kind of networking sharing best practices kind of slack community, that we could either launch or start or support the funding for east midtown, restaurants in retail. I think that would be really useful just because I've seen in my own kind of you know as I'm looking around for resources and things for myself and my own consulting practice that I run on the side like I've, been doing a lot of online research and popping on onto a lot of like online networking events, and so you know, if that's already kind of a priority for a bid or something to facilitate virtual networking. I think that it'd be a really. You know good opportunity or investment for us. It's a great idea. Yusuf. I see your hand up as well yep. This may seem, I don't know, sort of minor or maybe obvious, but I think a lot of small businesses- and this gets at some of the issues that have come in front of this committee have struggled with just the basic cost of PPE and other things. So you know I don't know, there's just there'd be interest in having a you know: minimum PPE fund, grant program, etc. To specifically support retailers who have to buy a lot more hand. Sanitizer a lot more masks, a lot more adaptive equipment to make this stuff work. I certainly haven't seen anything aside from the giveaways here and there. I think that could be interesting and would have city-wide application. Oh that's a that's a great idea, and that also brings another point. Is you know I don't want people to think that an idea is too small or too big. I think this is the perfect time to really get all of those to get all of those ideas out there. But that's a great point: if we're asking small businesses to abide by certain rules, we also have to make sure that they that this is in another incurred cost. You know unfairly on them to to abide by rules. You make sure that they're supported in that as well. That's a great point. I think another idea could be something like I mean you know just pulling off our previous conversation, something on sanitation. If we want an increase in the number of garbage cans or compost sites- or you know further, you know more frequent pickups, that's something we could bring up as well. I know how people feel about that, but I think you know there's a blend of that as well. Any other ideas on this. As we talk about it now, one more sorry, I can raise my hand go ahead if we wanted to. Even I don't know again, I'm just thinking out loud, like pre-purchase like square or shopify subscriptions for a number of businesses so that they can transact online. That might be an opportunity to help kind of facilitate. You know: turnkey, ecommerce solutions for small businesses. That's a really great idea too. You know I like that I'll put that on the list as well. Yeah and again, this is an initial conversation, we'll revisit this at our next meeting as well, because as as we have each subsequent meeting, I want us to get sharper in what our exact budget requests are in budget priorities. And then you know we can get more information about what specifically that looks like because then the budget committee then puts the district needs together, and all of that, so I want to make sure that we're providing the best and most information, but I also want to use this as an opportunity. Like you know again, the city is going through transition and obviously our local neighborhoods is our as well, and I think you know a lot of conversations when it comes to reform, or you know, big changes that we need to see often start at the budget level, and so even I think another way to think about these budget requests too, is even if it doesn't, you know, get fulfilled. Does it put the issue on notice? You know, does it put it on people's minds that this is something that we're thinking about that? This is something that's important to us as well. So this is how another way that we can view the the budget requests is not just practical things that we actually want to get done, but also things that we want to show that are important to us and that are important for our elected officials and for the city to be thinking about in their own processes and systems. All right, so I don't see any more. Oh I see, yusuf has to stand up again, yep really quick, and he was inspired by what I said. In a conversation I had with someone that actually grand central tech earlier today, but there's been a lot of thought. There's an existing program called the neighborhood challenge program, which is focused on retail, helping retailers with a lot of their technical needs and so again an opportunity to maybe have a broadly a technology fund. It could be anything from helping small businesses transition to taking more forms of payment. It could frankly be allowing them just to do the most basic things to get discovered online, where you know there's fewer and fewer people. You know walking down the street. Looking for new places, it's oftentimes trying to plan ahead and figure out. You know, what's going to be available demand, so there's a lot of folks who just don't really know how many people they're going to expect and will probably in some cases, be overstaffed or maybe understaffed. So another concept to consider awesome. Thank you for that. That's a really great perspective and provides great context to the to this process. All right. So I don't see anything else on this, but I do want to challenge everybody for our next meeting. If people could come in with a fully baked idea, it doesn't have to get into the weeds on every. You know single detail as to how it comes through, but I'd really love for all of us to engage and really use this as a time to think outside of the box and especially as we are experiencing. You know the economy reopening as we see local businesses operating some of the challenges that we're all facing. I'd really love for us to think more intentionally about thinking outside of the box and using this as an opportunity. So, of course you know I'll follow up by email to make sure that everyone is remembering that, but please I'd love for someone to just you know everyone to come in with an idea for some kind of budget request. I think that would be a great way to start the conversation off, and especially if there are repeat ideas, that's wonderful, because then that shows that this is something that's important. So that's the challenge I extend to the committee for next month, all right so moving on. Let me just get to this and just before moving on. Are there any last comments or anything on budget requests before I move on all right, seeing none so for the chair's report, some of it I've just pretty much put in the agenda. A lot of the concern has been about sanitation and about the repercussions of open dining. I think overall, it has been positive, but as with anything and especially something that was pretty, you know expedited. There are some shortcomings and I think we had a pretty you know substantive discussion. I think our local reps, like councilmember powers, is thinking very intentionally about it in the immediate future, but also the long-term future, and so I'm excited that we took some stances on that today, but other than that, just some of the things that I'm thinking about as well. I don't know if anyone else saw these articles, but about public safety in particular about people, particularly in midtown drug abusers, who are out on the streets, people finding hypodermic needles around. This is an issue that hasn't happened in our district, but has been occurring just you know just outside of our district and of course we have a number of social services hubs within our district itself. So that's just something that I want to put on everyone's notice that this is something that we might have to think about. I know a lot of the in terms of budget things were allocated to social services, so it might start to you know as we're seeing this on the street might be a joint collaboration with the housing, homelessness and human rights committee on things that how we want to see the social services being implemented on our streets and how we want or how we want to see some results from that too. I just wanted to put it on notice, because I saw some articles about it and I saw some received some. You know complaints from people within the neighborhood who said that they had been seeing some stuff, so I just want to put that out there, but with everything that's going on again, you know we want to make sure that we're not making every single issue a police issue, but we also want to make sure that we, you know this is a very simple phrase that people are feel safe and comfortable at home as well again. Another balance that we're trying to achieve so it hasn't occurred directly in the district. Yet it had occurred just outside, but just want to make sure that everyone has that on their forefront as well, because it might force us to have some conversations on that as well, but other than that, I don't have anything else to report. I guess the last thing is the small business workshops that we were doing in collaboration with cba. We completed our series earlier in the month. It was very successful. We had a lot of attendance, we had great guest speakers and the feedback was that it was very helpful for local businesses on reopening expectations, but also on consumer education as well. So I just want to thank everybody for their feedback on. You know each specific workshop that we held, and also for partnership and planning that as well. So thank you. Everybody on that. Does anyone have any older new business? I don't have any on my end, but does anyone else do please raise your hand your hand? Where is kyle, no all right genie. Sorry, I just want to bring something up, because I know you have the executive committee meeting coming up in mid-august, but just an incident report from me earlier this week. I guess it was today thursday, so it must have been yesterday or tuesday. I kind of got in the middle of that what happened on 25th street with the police, where you know I kind of, was heading home from work and I hit this wall of police officers and I thought I thought maybe somebody was in town. It looked like you know they were kind of blocking off the streets and I watched for a while, and I'm like this is a look. It looked different. You know: I've been in the city for 30 years, I've been in so many demonstrations and peaceful marches. I've never seen a setup like this. The demonstrators weren't even anywhere near that and then I put on the citizen app to see what was going on when I got home, and this whole thing about. You know in our district that these police officers and who knew who they were because we've been watching what's going on in portland, took somebody and threw them in the car and just took off and they had some one of them. If he saw the video had his hand on a gun ready to shoot somebody if they came, they approached him and this is an art. This is in our community and I don't you know, I don't know if we want to make a statement about that where we stand on that, but I just thought the whole. It was a mess, it was a hot mess and you know I don't know what we can do about it, but it was scary yeah, I'm watching people around me. There were kids around young children or older people, and you know it was just a clash. It didn't need to be, and I don't know if we should make a statement on it, but it was so it was crazy. It was so surreal to me so yeah thank you for bringing that up so actually kevin. I don't know if you have something to say on this as well, because kevin actually alerted me to this before it went viral. He actually he sent me. He had found a video online. He sent it to me before there were articles before it was in the news discuss. I don't know kevin if you wanna my 13 year old daughter and was with a friend of hers, and she was there as well, and she said that she was not involved in the March. It'd be fine if she was, but she was just walking home to peter cooper village and she said gosh, the the marchers were so peaceful. They weren't really doing anything. To I mean I think we know now. If you saw the follow-up reports, that it was a 19 year old who had been charged or accused of destroying four cameras near city hall, and they said they were after her. That, just you know, that's the facts, but I was very disturbed when my daughter said that not only that had happened with unmarked vehicles which is very concerning, but that there wasn't any instigation at least from her eyesight yeah, and so one of the first things that I did was I connected with corinne, who is the chair of the housing homeless and human rights committee? So any sort of you know, police related matters is really under the jurisdiction of her committee, but, like everybody I was, I was pretty disgusted and horrified by that, because even if this individual is guilty of the things that they said, there was no warrant. There was no reading of their rights. There was no due process. It was basically a kidnapping in an unmarked vehicle by people who are by an agency, a city agency that is supposed to serve and protect our communities not go off on their own on. You know, covert missions to first of all, how did they even know that they were at that March? You know so. I'm like. I have a lot of questions about. You know surveillance and what human rights and privacy might have been violated in this whole matter. But yes, I feel that- and I reached out to corinne already about this, but I'll follow up with her, because I really think it should be her introducing that to the executive committee. But I of course- and I know everyone on this committee too- would back that up- that there needs to be some statement or some kind of action on that. Of course, we already took some budgetary action earlier in the year before reconvene for the summer, but yeah I mean this was just I mean I awful and they tried justifying it, and I don't know how so yeah. So if there's some way for us to partner as a committee with human rights on that, especially on the street activity side, if you know that kind of goes under our jurisdiction, but I would definitely you know, collaborate and bring that back to the committee for further discussion. But yes, as your chair, I'll, absolutely bring that to the full board and I'll work with karin to see what how we can discuss that more in depth, but thank you for bringing that up genie all right. All right is there any other new or old business or any other comments that people would like to make all right. Seeing none. I I'm adjourning the meeting at 8 25 p.m. I want to thank everybody for joining us and I- and I say this all the time, but I really do appreciate this committee and everyone on it and your devotion to this work. We are the only committee right now, I think that's meeting through the summer and obviously the issues that we are facing right now and discussing are very important to not only our neighborhood but through the city as a whole, not just for now, but for years to come. So I really appreciate everyone's engagement and devotion to this work and input and feedback. So please continue to do that and and particularly for next meeting, please prepare again some budget ideas, because I think this is again really important and really a ripe opportunity to get some things done, that we might not have seen in the history of our community board. So let's really maximize that potential and harness that energy and come up with some creative ideas. So thank you. Everybody stay well and yeah. Look forward to seeing everyone on the street on my bike rides if you're out there thanks kyle. Thank you good night, good night good night take care.",
        "summary": "Everybody welcome to the July 2020 business affairs and street activities committee meeting for Manhattan community board six.\nHad my office put out a report on monday that was focused on some very actionable items that the city could take at this very moment to help some of the small businesses and our neighborhood businesses, and whichever is your favorite one.\nThey still have to do a lot of work and we have seen- And I think there are some really good and important issues at the federal level at the state, level.\nThat, we think are actionable, need attention and try to highlight them and also try to point the direction in for the city council members and for state legislatures or some of the items that their businesses and those who represent them are asking for and in the council.\nThe federal government will step in and do another version or extend the terms of the ppp program, which I think was actually pretty powerful and helpful to these small businesses.\nYou can open it up and make it public in a for the restaurants and for people to have walking space and things like that.\nA really important one The just I'll just we'll send you the report around as well, but this is a good time for us all to be thinking about strategies to help them to give them a few more months of revenue at times where it's going to be really hard.\nWe did a small business petition to support outdoor dining, so we're trying to take some steps in the days ahead to actually lean into some of the ideas around it, and we are looking for ideas because we're always looking for more good ideas, but how to help these folks.\nJust want to make sure that our especially our neighborhood, like restaurants and small businesses, know that we are trying to help them.\nWhere people you know, had supply or had access and were hiking those items up, And I think the price gouging law that was put in effect around clovid was predominantly focused on that stuff.\nI also would be interested in looking at some furthering of the price gauging laws here in the city, particularly around state of emergencies, and maybe looking for ways to either actually solidify, though the things that, like better having to have to pass an executive order on that actually putting that into our law Just mention that you know some years ago when, when surge pricing started on uber, which is one of the third-party apps too, I, found that actually, there were a number instances when I remember it was a super bowl, night.\nYou know weather when it's a bad weather and other things and have been really kind of doing a lot to feed us and to get us the food, So You know I'm helping the people that are actually delivering it.\nThe mayor's office is the council kind of behind it, and it's really about getting the mayor's office on board and are there local organizations that you think would be valuable for those on the committee who have connected to mobilize The numbers are right in terms of the undocumented population.\nDon't make us shut down our kitchen in the middle of the day, so that we are losing all that business for a half an hour an hour, But I would say, like look all voices really help here, because what I've learned in the pandemic and outdoor dining was a big part of it.\nI've talked to the commissioner moya in the city about maybe trying to drive some like donors to this, because it's a private thing, But, but the book, the mayor's gonna, be the biggest impediment here, because he's gonna be do the right thing, which is to worry about the cost of it, but also I, found that we just need a lot of pushing from the council and outside people to get him to do the things we want them to do on almost any issue.\nAnd I think the insurance companies industry is just at least the minimum saying give us the money to But I you know, I'm, not sure I would be more than willing to work with anybody who wants to do some lobbying around it.\nDesanitation, whether it's pickup or street cleanings, or things like that The pandemic would solve at least one problem which is rats in new york city, as they had lost lots of options of food here.\nI wanted to let you know how wonderful I think it is to see the restaurants coming back to life and how beautiful some of the streets look with the string lights and the tents and the way that they've done it up with planters and everything else.\nWe, go in support of the small business and outdoor dining program, including the recommendations in keith's reports all right, before.\nWe could just say that you know we want to maintain pedestrian safety and space as well as sanitation standards and public health standards, and something like that: okay, good, because they do Are the the potential likelihood that there are going to be a lot of schools coming for open streets as well for a recess and socially distanced drop off and pick up?\nDon't think that as much as I you know, support small business, and everybody knows that I do that there should ever come a time when the interests of outdoor dining trump, the interests of socially distancing, kids and giving them a place to play.\nAny other comments on this, because I you know, I, think matt brings up a great point, which is obviously we want to make sure that we're supporting the small businesses, but as we as the work is always included.\nAt the same time and the hard part about our decision making is You know, we have to often threat that line of supporting small business but at the same time supporting community safety and health, and All that Second, all right, kyle, your vote, yep, I'm in favor of supporting council member powers, economic plan, okay, matt in favor genie, favor paige, I'm in favor, john in favor, anton favor kevin in favor, seema.\nYou know we can call in the state, senator's office and the assembly member's office to see if someone can walk us through what their thinking is, where it is in the process as well.\nLike a movement, so I think if people are, you know, we lost.\nI think that would actually engage local people as well like there might be community members on their block, who would say hey for the business.\nI think there needs to be some owners on the businesses themselves as to how they're you know, collecting trash and when they're putting it outside and how long they're, leaving it outside for, but that's again open to discussion, so You know sanitation, measures, but right, now, I'm, just thinking about immediate things, because I've received a lot of complaints about it.\nFar as the city is concerned, it's a budget problem You know I've seen, people are using these corner garbage cans, but if they're not being emptied in a timely manner, well, they just get piled up and piled up.\nYou know there are smarter people in the sanitation department or in this business, who probably can come up with ideas.\nOh, I was gonna say that the this board has passed a resolution in support of the commercial waste zones program that the sanitation department you know is scheduled to do.\nAnd you know, might allow for the things that he just described perfect and was that the land use committee, ah transportation, because or I don't recall- I was just going to point out that I believe we're getting a sanitation garage on 25th First, that there might be some opportunities there to experiment with some initiatives: It might offer us an opportunity to work with them since they're.\nThat's to me, sort of like the wish list, bigger idea for for the rest of new york city, As many people know.\nOf course you know we should be thinking about budget requests going forward.\nIt's, primarily been on affordable research, space and inc business incubators for the district, which is you, know, has worked in some cases hasn't, but I really think this is time for us to be more substantial in what requesting, because, as we've seen from our workload, a lot of the you know.\nSo I wanted to open it up to, and this is obviously the first of many conversations, but I do want us to start thinking about it, because the budget committee is going to be discussing this as well.\nAnd, of course, that's going to be very comprehensive going forward because there are a lot of needs going on right, now, but I wanted to open up the discussion to see what kind of things that people are thinking, about, things that we want to see in the district or maybe changes to agencies, priorities or anything else.\nIf you want to start off the conversation Thanks kyle, I was thinking of a small allocation to maybe work with the bids on a needs.\nObviously, I think this is exacerbated going forward, but I've always been interested in, like workforce readiness, making sure that people are prepared for the workforce that businesses are prepared for you know whatever it is, that's coming their way.\nSo really, as I was thinking about, you know, future budget requests and, of course this is not a fully formed idea, but really thinking about like entrepreneurs support so like really supporting small businesses.\nBut or if people as they've, you know been preparing for this meeting, have come up with other ideas or just have a gut reaction in this moment to some things that we could put on this budget list.\nThis may seem, I, don't know, sort of minor or maybe obvious, but I think a lot of small businesses- This gets at some of the issues that have come in front of this committee have struggled with just the basic cost of PPE and other things.\nYou know: I, don't want people to think that an idea is too small or too big.\nAnd, then you know we can get more information about what specifically that looks like because then the budget committee then puts the district needs together, and all of that Like you know again, the city is going through transition and obviously our local neighborhoods is our as well, And I think you know a lot of conversations when it comes to reform, or you know, big changes that we need to see often start at the budget, level, and So even I think another way to think about these budget requests too Does it put the issue on notice?\nWe are the only committee right now , I think that's meeting through the summer, and obviously the issues that we are facing right now and discussing are very important to not only our neighborhood but through the city as a whole, not just for now, but for years to come."
    }
}