{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "title": "Land Use Committee Meeting Jun 2020",
            "publishDate": "2020-06-04",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 1,
            "um": 10
        },
        "wordCountFullTranscript": {
            "building": 48,
            "committee": 44,
            "school": 39,
            "block": 29,
            "lot": 28,
            "members": 27,
            "things": 23,
            "houses": 23,
            "way": 22,
            "district": 20
        },
        "wordCountSummary": {
            "committee": 15,
            "members": 9,
            "school": 7,
            "district": 6,
            "board": 5,
            "building": 5,
            "noise": 5,
            "application": 4,
            "community": 4,
            "youth": 4
        },
        "fullTranscript": "You know at the September general meeting, so we've used, you know July meetings for emergencies or for information or special presentations, but the last regularly scheduled meeting for all committees is the June meeting before we get into the two presentations that we have. I just want to do a bit of land use committee housekeeping, and you know that pertains to follow up on the part of committee members. There has been you know in the past several months when we were still meeting in person. You know a lot of back-and-forth with other committees about what is in meetings and do they accurately represent what was discussed. That has never been an issue with land use because we draft the minutes. We circulate the minutes and we, you know diligently, follow through to ask for responses. But what I have noticed recently is less than half of the committee is actually responding when we send around minutes for review and comment, and so your silence could mean that everything is perfect or it could mean you didn't see it. We have no way of knowing. So, ideally, if you have reviewed the minutes- and you have no comments- acknowledged your seat- and you know say that you know you have no comments. There are a handful that you know regularly provide their comments, but I'm really looking for all committee members to, let me know- or you know, make cases now- it's Chris who is preparing the minutes. I might take an initial look at them, but get back to both of us to let us know if there are additional things that you would like to add, or if there a question so that we can take care of that and I would say. The same thing is true: when I circulate to the committee reference information, there was some information that I circulated to the committee pertaining to both the BSA application that we'll be considering, but also the West 158 Street rowhouse district I think the resolution that the board passed years of I circulated that for reference, so that committee members, who are not committee members at the time, have some background on what we're talking about. When you get things like that, you know respond. Let me know that you got it. I want to make sure I have your proper email address, and you know I want to make sure that you know when I'm in a meeting such as now and I'm, referring to documents that forwarded that, do you actually receive the documents them and so we're all. On the same page, any questions comments on that from my fellow committee members. You have to unmute yourself. If you do I have a quick statement that I wanted to mention. I'm gonna send you my email address that I checked more frequently: okay, I I've sent it to the office, but I. Don't think you guys received the yeah right, they didn't send it to me all right, so I'll send that to you. Thank you not a problem, and so with that, before we begin, let me once again introduce myself I'm Wayne, Benjamin and I chair land use for community board twelve and before we start the presentations. I would like my fellow committee members who are online to introduce themselves I'm, starting with Vivian, to cut Vivian, do cut I'm to your right, depending on how you look at your building well I'm to the left, looking at the screen, and so the next one looking at the screen is mr. Berlin hi I'm, Jim Berlin nice. Seeing all of you, the assistant chair of the committee, is Chris, Ventura, I, say hi Chris. Are you unmuted? Well Chris Ventura is our assistant chair. He is there he may have stepped away. Also. We have Omar Tejada who definitely needs to unmute himself hi everyone. You need to turn up your volume. You can you hear me much better much better: okay, hi everyone Omar here pleasure, thanks Omar and also we have Rosie Perez, who is a fairly new land use company member? My name is Rosie I also have a other board members, including a former committee member OSI, kaminer, say hello, say hi what I'm no longer on the committee you haven't been on the committee for several months. No I think I'm back on a committee. Well, speak to the committee tooks to the community board chair and give me that update, because the attendance list that I have does not include you, okay, so that's why we speak and then I also see a number of literally brand new community board members on line and if you each would like to like unmute and say hello, that would be great hi everyone good evening, Jimenez here, Leo good to see you hi. My name is Mariela Graham, hello, Mario, anyone else, okay. So with that we have two agenda items in addition to whatever items of older new business. The first item is the consideration of a BSA application for the wind community music charter school, and this is an application that was presented to land use in February of this year. We had a detailed conversation about that and I circulated. I think it was last month for reference, the February committee minute, so that everyone who was not at the meeting had some background and also so that the members who were there since it is going back several months, could just refresh this is not you're. Not I was gonna say your typical, but this is not one of the BSA applications that has come before the board in the past, where what is being requested is some kind of a bulk increase. This is for a special permit to allow a school or school use to be placed in a building that has c8 zoning and the CH zoning is, you know, simply put something that it's really more automotive focused and I also mentioned in at that time, and at last month's meeting and then circulated for reference to the committee members. The community board passed a resolution several years ago asking the Department of City Planning to rezone various c8 districts in Washington Heights in wood, because that zoning designation really does not allow for any residential development and a community facility cultural, the things that you know, we say that we need more of see. A zoning doesn't allow- and this is a perfect example where you cannot build a school in a c8 district. So that is the reason why this project needs a BSA special permit. It's a renovation of an existing building at that time, I think both the traffic studies and the environmental studies were not complete, so we recommended that the applicants coordinate with our Health and Environment Committee, our traffic and Transportation Committee and our youth and education committee, so that those committees- although this is really just asking for permission to put a school use in a CA district, those committees- would have interest. In of you know, what's going to be happening with the project, they have the opportunity to discuss it. All of those meetings took place in May, and so we then suggested that the applicants come back to us too, for us to more formally consider that so with that I turn the floor over to Richard LaBelle, who is counsel representing the applicant as well as any of the members of the wind charter school who are present. So mr. LaBelle, you have to unmute yourself and take us forward Thank You Wayne good evening, thanks to the committee for having us here again as we've discussed. This is a special permit. Esa and the applicant team has had what we feel are very thorough and successful meetings with, as Wayne mentioned, other committees in Burke, CB 12. So you know I think we're here to talk about the specifics behind the results of those meetings, the special permit with focus on traffic and environmental issues. I think I would turn it over to Amanda who attended all the meetings and kind of guide some of the various team members and professionals that we have regarding the consideration of the factors than the special permit sure rule, so we're joined by Tom Glock project, architect. Tom. If you want to share your screen, you can show the presentation that we've shown various other committees if it's helpful to walk through the plans of the building again I know. Some of you have already seen this that the other committee meetings, but some of you may not have Tom you're on mute. Can you hear me now? Yes, we can okay I need someone to it says I'm disabled I need someone to allow my screen. Sharing that has already happened. Try it again, okay, so yeah! In the meantime, we had very and productive meetings with the Health and Environment Committee traffic and transportation and youth and education. You know there are many comments and a robust discussion about traffic about loading and unloading, about noise impacts both on the school and on the school in the surrounding area. You know about air quality about you know, all the all the pieces of the environmental assessment statement you know were reviewed and discussed with the various committees we answered. A lot of questions had a very good discussion and really you know all the all of the all of the committee and meetings were generally positive. Everybody seemed to be excited about the school generally coming to this location. The applicant has also taken many of the members community. Many of the community members advise to reach out to neighboring organizations several senior centers, the bid an applicant has reached out to all of those parties to say, hey, we're gonna be a good neighbor. We want to streamline our services with all of your services and we want to make sure everything runs smoothly on the block. I have a quick question about that. Cuz I saw the comment and I believe the chair of our licensing committee, who happens to I, guess be the executive director of the bid mentioned something about coordination. What is it that the charter school is being asked to do visa vie coordination with the bid? Well, what the bid was just to coordinate I. Think more, just generally, that your that we were coming to the street and they were you know, involved with the commercial establishments on the street and to say that you know they're willing to work with whatever the bid needs more specifically with the senior centers. It was more about coordinating unloading and loading on the street because they also have buses, and you know, vehicles for people with special needs or handicapped individuals coming and unloading to the building. I believe two doors down so largely the conversation with them was really coordinating. You know when the school gets in there, timing and safety and things around loading and unloading. So you shall I how much of a presentation should I run through you on me just quickly to run through the bones of the building. I know multiple time. Some committee members have not seen it so I would do a quick presentation of you know what the floor plans and elevations look like. So they know what we're talking about. I mean I did share the plans with everyone, but if you simply would you know walk it through? That might also help, certainly so just I'm gonna just step back for a minute. The location is on 181st Street between Amsterdam and Audubon, just before the bridge that goes out towards the blocks. It is an existing building. It's a four-story, a four-story parking lot. Currently you can see this is the rush ring. Oh you do yeah black all right. Let me try there's something on the bottom. There yeah, sorry guys! Sorry, okay, let me throw me a quick quickly back up. Thank you for letting me know so. The building is here, it's mid block on 181st Street, just before the bridge over to the Bronx. It is an existing building, and this line here is the profile of the existing building. It nice looking building and the intention is to refurbish the state of the brick and obviously replace all the windows, and then the new portion which is added on is setback. So that's not something that will be present from the street. You can see here in the section the shape of the old building and then we're adding on one floor here for four to make it four to four additional classrooms and then a gymnasium, the top and the rest is just mechanical and equipment that to serve the building. This is kind of a more technical. Drawing. I can leave this. We can come back to this if we need to, but this shows- and there may be questions about accessing and transportation. But let me just quickly run through the bones of the building. What's unique about when is that it uses El Sistema system of using music as a way of providing primary education to kids, in this case K through 5, and so all the kids go to have music twice a day and then also the performance they learn instrument starting in kindergarten I mean in first grade, and then it culminates in a series of performances over the course of a year, and so as many charter schools is, we've done. We've never done one at this size that has a little theater, so the organization of the building is based on is sort of based around that on 80, underneath 1st Street you come in past the offices and reception and welcome area, and then on the street level is a 400 person house theater that can house all that can stage a performance with all the kids downstairs are the rest of the music classrooms and then because the rear yard is lower than the street level, you can see Street here, there's two kindergarten classes which give them kind of direct access to the outdoor, which is helpful because they don't have as far to go, to get to the recess space and moving up to the building. You can see the basic strategy classrooms on the perimeters, there's a cafeteria and in another classroom on the second floor and then in the middle is all the core support spaces and offices and, like I, said before the gymnasium on top. So the second kind of is the gymnasium something that was added since the February presentation, because I seem to recall that at the upper floor they were sort of outdoor. You know play space that was partially covered, but I don't recall a fully enclosed gymnasium, so that could be we've done. Several of these. That might be right mean if you will call it that way, that I'm certain be uncertain. That is right. There's nothing objectionable about that. I think it's not add an enclosed gym. No I appreciate you pointing it out because I lost the iterations I lost a little bit of so I'm just going to jump to that top floor. Maybe we worked up plans on the way down, so on the very top floor, you'd still do have an outdoor recreation space, so this is programmed for recess and just kind of the stairs in circulation and shaft space, and then there is a gymnasium up here. Now it's a tight gym, but for K through five school it provides a good space, for you know the active play and the curriculum that goes along with physical education, and that is in the back of the building and then moving down. That's new fourth grade. This is also new space into fourth grade classrooms. To fifth grade classrooms. This is the rear yard setback requires it to be at. This is a compliant zoning. Setback on this floor is a little bit smaller than existing floors, because the existing building was bigger, and here you can see the basic strategy second grade and first grade, there's a science room, dedicated science classroom and then support spaces, counseling spaces offices or in bathroom and that stuff. The second floor has two more classrooms at the street, 181st Street and then a cafeteria and then an additional kind of flex classroom in the back, and then that takes us back down to the main level. The entry level you d'être off the street into a lobby, administration and reception all right in front kids, would go up the stairs and down the stairs to the rest of the building and then during an event, you'd be able to come in and load. The house, which is like I, said 100 seats, so I don't want take up too much time. I'm happy to dive into the more specific questions. I think I just hit the last floor plan, then in the teller the front is occupied by all the services utility rooms, but we do have large windows in the back, so there's a dedicated kind of kindergarten area with its own little vestibule, its own bathrooms and an old outdoors, its own outdoor space. You know they're the ones with the shortest legs, so it's nice to have them not have to travel too far too often during the day and then I'm happy to direct the presentation towards whatever issues are Normandy amber Amanda watt take over some of the other I know. The youth education committee asked- and you know, I mean I, know the answer, but they wanted to make sure the building was accessible to you know: students who have disabilities so as a newly renovated building. This is going to be fully ADA a compliant, fully 88 compliant there's an elevator. You can see it's backed up again so that by and large theirs will be the primary mode of travel for the kids, a fully ADA a compliant and also for service as an elevator. That would be usable and it comes right off. We've tried to create these kind of core areas and both stairs and the elevator access that so, whether it's someone who needs to use a little bit or on a teacher or staff or admin or students, obviously and Steve, Simon who's, the chair of our Health and Environment Committee, but also a member of land use, he's going to be late. So what were some of the things you discussed with the Health and Environment Committee? What were their concerns? These would be the environmental studies. And how did you answer those concerns girl step in here? Yes, so this is the inverter time with equity, environmental and I prepare the environmental assessment statement. So we did the predominant studies that we have in the environmental assessment statement, our air quality noise and hazardous materials and transportation, so health and environment. We really focused on the hazardous materials findings as well as air quality and noise. So why don't I just kind of summarize and go through those one by one? So for the noise and atlases we looked at this a number of ways. We looked at just the existing ambient noise levels. We actually did three different readings. We did a reading at ground level, fronting 181st Street, where the mouse is there. We did another reading on the existing roof which at the rear and then another yep right there and then another ground level of the existing rear yard and those noise readings captured. You know existing ambient noise levels, including noise associated with the FDNY vehicles across the street, and then what we did was we looked at occupancy of each of these terraces and so that noise of the children playing is added on to that ambient noise to determine the level of basically the thickness of the windows and walls and the level of attenuation. That's required to ensure that the inside is attenuated to an acceptable level. So we I did that analysis and we specified that attenuation level, and we also looked at the potential impact of students playing in these areas on adjacent buildings, and we looked at a number of different receptors and actually did a very detailed line-of-sight study to see how high each of these enclosures around the terraces need to be. Is there areas that we would have to restrict access for students, which was the case here and or to ensure that there would be no adverse impact to any of the surrounding? Actually, as of yesterday, DP did get back to us with a letter on that they've reviewed our findings and they, you know, are in concurrence with the results of those findings and then so. The result of those findings from DEP basically say what that they are okay. So it's twofold: it's one being the height of each of the enclosures mm-hmm. They agree with what we've specified in terms of height, so I believe time, 15 at the cellar enclosure, 7 roughly 7, on the fourth floor and then remind me what we have for the I think it's 15 on the top, but only on the side. It doesn't show up in this section right and then, in addition to that, the level of building attenuation which I can pull up right now, it's either 31 or 33 dpi for window wall attenuation as a compositive window, knock combined. Okay, and that's as yesterday that size of yesterday, as well as the areas that you're seeing like on this site, brown and white, those areas would be. You know there would be no access there, so we've restricted access. This is a top floor. The roof top recess. We pulled it back from this hedge so that this wall can provide the block. So we don't negatively impact the building. That's going up now on the corner, mm-hmm and then on the 4th floor. This Terrace is pulled back to the same reason. So noise doesn't and dad there's a courtyard in that plan building in here, and so we won't we'll be far enough away and be able to provide adequate noise levels to their windows and then the other one is the one in the cellar which affects the residential buildings to the south, and there we this is. This wall is 15 and a half feet tall, I, think and that that'll such that kids in here you saw in this section. The line of sight is blocked within 30 I, think it's 30 feet or 34 feet. Any questions on noise, I'm happy to answer otherwise. They'll move on to air quality and hazardous materials, so for hazardous materials. I to date, where we're at is that a phase one was completed, identified some potential vapor intrusion issues that needed to be further investigated. A phase two was conducted. Several months back and that has been reviewed by DDP and now the engineer who was not on here, some speaking to what was done on there and the engineer is putting together a remedial action plan to specify the mitigation measures that would be employed in the building and actually the results of the Phase. Two did not show any exceedences justice, oil, vapors above regulatory thresholds, so the vapor barrier that would be employed is more so and Carlow. Correct me. If I'm wrong on that. But that's that that's. That was my recollection of the findings. Yeah, that the vapor mitigation recommendation is vapor barriers, just as a precaution of any vapors on my mic. It's a passive system which, if they felt like there, was going to be any kind of intrusion they would have. They would have had an active system where you had a fan and things of that nature, but they decided just you know, and we do and I work with schools a lot. So this we kind of take this as a precaution in all schools, okay, and so you use- you mentioned the phase. One is complete and the next step with the phase one is what the phase one actually had already sent over previously after the initial meeting with my muse I sent that over to Steven, you know to help an environment house, an environment and then the next step to that was actually putting together, what's called a remedial investigation, work plan which basically details the level of the investigation, that's going to be conducted for DEP approval prior to going out and actually doing that field, work which would involve taking soil borings, and you know the full scope of the investigation, where are they being taken and what's being conducted at how many locations so that was approved by DEP. The engineering team then went out and did that investigation and then the next step after that was putting together a remedial investigation report summarizing the findings of that Phase. Two field investigation that has been completed, and now the engineering team is coordinating with DEP on the next submittal item, which is a remedial action plan which basically indicates here are the results of this investigation and then based on that. What what's going to be implemented in the building? Okay? Does that? Basically, you know capture the high points of what you discuss with health and environment yeah and, with you know, with traffic and transportation. I think one of the points the chair shared with us and I believe I circulated this to the committee is I, guess they. The interesting thing is since this building is currently used as a garage converting it from a garage to a school actually reduces, not increases the number of vehicular trips, but I know there was still some discussion about. You know the coordination of you know: drop-off center rivals so sort of tell a bit about that sort of the highlights of what TNT was concerned. With sure yeah I mean the general concern was that you know we recognize that this is a relatively busy roadway. I would say that, as you've said, I mean for all schools on how you do traffic analysis. You do not take any kind of offset to say: okay, so because you're, looking at a number and a threshold number, you don't say for a school, we have ad ins-and-outs associated with the garage met it out because we're looking at it from just the raw standpoint of how is what are the traffic conditions going to be at this school? So we had actually, you know, collected data on the existing wind location and looked at where the students are reside and how the modes of travel in order to basically prepare a preliminary model of the number of vehicle trips. The number of school buses, the number of pedestrians and get a general sense of where they're going to be coming from those then get assigned to the local network and that's called a level 1 and level 2 traffic analysis. That's currently under a DDOT review for traffic. This actually gets reviewed by DoD. There's a traffic engineering and planning division as well as D-O-T school safety, also reviews this to make sure that they're weighing in on any kind of recommendations that they have. Regarding you know, student safety and the road network and any geometric modifications pavement, marking signage changes that would be required here. So throughout this whole process on you know we're going to be working very closely with the LT and I think you know. A lot of the questions revolved around the outcome of the analysis and loading and unloading, and you know at this point we have an idea of roughly how many vehicles we have an idea of where we would be proposing. You know any kind of vehicle drop-off and the protocol associated with that, but we're still waiting for do to review and working with them. So you know we don't have any letter in hand or hearts hard findings yet so that process is still ongoing and I'm. Assuming that you will coordinate directly with TNT on that right, we would be coordinating directly with them, and it's important to note that for an application like this as a threshold level, finding the school needs, we need to the environmental studies which support of the legal findings of this special permit. You know needs to determined that students can arrive in depart to the school safe. Yeah, no I mean no I understand it's just that. You know what is being asked of land use is something very specific and the I'm sure Health and Environment would want to be updated on. You know how the environmental studies or environmental work, progresses and TNT would be want to be updated on. You know how the studies and mitigation measures are developed and those are things that you don't need to go land use for. You can coordinate directly with those committees. Well, yeah we're happy to share. You know any kind of letters or correspondence as they come through and provide update as to when we're not with the analysis. That's not a problem and is there anything more visibly the discussion with traffic and transportation I? You know there was some discussion about the catchment area of the school and how we determined some of the travel patterns and the factors that we've used to do transportation, and just because this is considered a little bit more of a specialty school. But you know in geocoding the existing students at the existing one location and Tom I. Don't know if you have that graphic. You know what we found is and then Charlie can speak to this as well. But this is very much a neighborhood. A lot of children walking and I was out there at the existing location, observing you know, arrival and dismissed off, which he'd go back to the previous slide. Maybe pop the screen open, hope we lost it and I observed you know very orderly arrival and dismissal. There was, you know: there's administrative staff stationed outside the door with walkie-talkies there in coordination with both faculty within the building and then also bus arrivals and making sure all of that is or orchestrated in a safe and orderly manner. So I was very happy with what I saw there. Charlie I, don't know if you want to I, saw you on mute itself. Well, no he's gonna say that I did just email, Tom, you're, muted, I, see you talking. Can you hear me now? Yes, okay, can you guys see the map of locations of students? You know we see a Charlie, Ortez, email or letter. Okay. How about now I have two screens here is that is that clear? Can you hear now? Yes, Jamestown? Thank you yes, so there was a lot of things about how traffic conditions would potentially change. Once you know, students the existing students that, when moved to the proposed location as well as once you know, students are go up in grade level and additional students are drawn in, and you know honestly, we feel that, based on where students are currently located, that it's going to be very similar in terms of the number vehicles, pedestrians and modes of travel, I, think about I want to say, 27%, there's of the existing student body is residing in the Bronx somewhere around that number Charlie 27 to 30. It's actually that information is all on the same slide, Tom email. Actually it would be great if you could also send us this information because it looks like it was presented to youth and education, but this would be good reference. Information for land use and TNT as well. Yeah 27% from the Bronx I think with the and it says, 70% reside in Manhattan, but looking at your map, I mean it seems to be heavily concentrated in Upper Manhattan, right yeah, which was you know, that's kind of the point that I'm raising about the fact that we really do feel that this survey that was completed of you know existing with students, is going to be representative of what we wouldn't, but it might be Charlie. It might be helpful if you could just describe it's not an accident right. Can you just describe the house how kids are selected for the school in that process, because it's very much focused on this area? Yeah? Definitely so I mean as a public charter school. We do not screen students for any reason ever we are free public charter school, and so basically the way it works is we accept. Students are sorry. If we have more students than seats available, we do a public lottery, which is you know a digital way of, like you know, pulling numbers in order in the first, like you know, XML get all four deceive, then we just go on through the waitlist, so we offer no screening I. Think the really the reason that we're able to get so many folks in our school that are in the community in our community is because we've set up a lot of great relationships with daycares. So like we go in and we do lots of info such as a daycare, we do private tours for daycare or families from the heights. So, like they'll come into the school, you know when we were in the building and then, though, they'll get like an inside look at everything and then also because all of our historic families are clustered in this area. Also, word of mouth: that's always, you know been the best. You know waited way to share about the work, and so our current families tell other families who also live on the same block, and you know it just kind of grows. Naturally, you know, I can I, can't remember ever really doing recruitment outside of CSD six, so I think it's really the recruitment on relationships for daycares and the current families that start spreading. The word I'm, assuming you shared all of this with the youth and education committee, yeah. Definitely, okay, cuz I mean III, received some feedback from the youth and education committee and from traffic and transportation, and so it wasn't clear from the comments from youth and education. The extent of the conversation, so it's good to hear it from you actually that this slide is the slide is from the present it's from the youth of education presentation. We gave on five eleven mm-hmm and just before we you know sometimes I have to remind myself in the rest of the committee that we are land-use. We are not land-use and everything else, but the school is currently located in Washington, Heights and you're on a hundred and sixty fourth Street. Is it correct and are you currently co-located in a public school building, correct, so you're, actually community-based you're in a existing public school? And that's you know kind of a touchy issue with a number of folks but you're actually with this project moving out of the public school building into your own space. So you you'll be able to continue to provide the school program to local residents, but you will not be occupying space in a public school building correct and you know just as an update, I think it was two weeks ago, although all the days are blurring together anymore, I think was about two weeks ago. Our colocation extension for our current building was approved by the DoD, and so we've been working with the deal we to extend our colocation, which was supposed to at this school year for another two years just so, we could have more time to build the building before we moved out, and you know it was an easy process working with their central team and the school team was really easy and it was great too. They approved that, and so it's really good about that and our partnership with the deal are there any questions. Comments from the committee and I can't see everyone, so you'll just have to unmute yourself and you know be careful not to speak over one another yeah I have a question: Wayne go ahead if I remember correctly, when we spoke about it last month or maybe two months ago or three or maybe three I, don't remember, but in any event there the building the current structure has like two and a half or three and a half story, and only one like a half of the parking on the roof will be enclosed or there will be an envelope around that or something is that correct, yeah I can I. Can yes, that's correct the existing building. It's a little bit strange, but let me zoom in on this. You can see the section I put up now right, I want to make sure not yeah I can see yeah, so the existing building is has parking on the roof up here. It's an exposed group and there's parking on this, but the facade goes all the way up to this point and there's a portion of enclosed here so we're basically its terminated. The four-story building we're basically putting a roof on that four-story and then adding the game. On top of it answer your question. Ah, yes, okay, yeah! Thank you! Anyone else do you imagine this will be finished. Will there be half a school year spent on 164 and then a half there or it's like not this come here? It's the occupancy would be for the September 2022. So you'll begin the year there you will not sort of begin in the middle of it right, correct, and that has a lot to do with this process because we have to get. We have to get PSA approval and then we can apply to the building department and then we can do the physical work. So it's just it's just kind of stepped itself. Back that far we tried to do in a year earlier, but it was just it was new. We were hoping we could do it earlier, but it was just what the popular wasn't that fun. Wayne I have another question: if nobody else have one before me, please go ahead. Okay, in light of local Oh 97 is the heating system, as you presented to us about 2 3, whatever it is a month ago, it was running on the plan is to run it on natural gas in light of LL 97. Is there a plan to go electrification, meaning to electrify the heating system to run on electricity? There is not I mean we're in the process now of complying with the latest energy code, which is the 2020 it's the one that just kicked in and ASHRAE 20, which then maps over to ASHRAE 2016, which is also it has not been in effect yet, and so we will and we're doing quite a bit in order to make the whole thing. It means it's smart designed to begin with, but to comply with all those things so that overall, the efficiency and energy usage of the building is very high. Every new iteration of the codes are getting stricter and stricter. Yes, they are right and by 2040 you're gonna have to be all on electricity, which that's. Why I'm asking I thought? Maybe while now you're planning and thinking about you know renovating the entire building me I thought you may want to be sort of in compliance for 2040. But you know later we could I would say that's an interesting thought and also see b12 is supposed to have, although it has never been active sort of a infrastructure task force, because one of the big questions is what is the capacity of the electrical service in this entire community to support any major? You know, conversion to electrification. My building is a hundred and sixty eight hundred sixty nine thousand square feet. We weren't on gas. We had to pay nearly a quarter of a million dollars to convert to gas I wonder what we'd have to pay to upgrade the surface, to convert to electricity. So I think that's something that the community board should look at and not just let slip by because I don't think we're at all ready when it comes to infrastructure. I would like to comment on that as well, because as Wayne does in fact, as Wayne and OC and I do we all live in co-op. So we have this rubbed in our faces all the time. Yes, we take, it turns out. 2030 is still 10 years away and presumably between now and then there will be improved technology to electrify stuff, so I, wouldn't actually you know we have people in my coop sort of clamoring for that too, but at the moment you know, I think we should just go with what we have, and you know again by 2030 or certainly by 2040. There may be wonderful ways that we haven't thought of yet attorney electricity directly in the heat. You know not by running it through resistors, which everyone knows is not the proper way of doing it, but so I. You know, I, agree that you know we should always keep our eyes so the future, which is OC suggestion but I, think we're not there yet, and we should, for the time being, stick with these technologies very near future. Yeah I would say it's a good point. I we can we'll look at that there are there a number of issues associated with it, so I think it's a at the very relevant and thoughtful and pertinent point. Okay and you know I guess we should actually move to have the committee consider you know its position or this application, but something that we have not discussed. I just want to point out to the commit, because that we might have touched upon it briefly in February and I think it came up at the exec committee meeting in April in preparation, and that is, if you look at the materials that I forward in the last couple days, which were I, guess the applicants response to be essays. Questions on you know, page eight. You know it begins a list of the various sites that were considered in addition to this, and there are six sites that are listed that could not accommodate the school program. There are another four sites that were, you know, not affordable. Basically, they were too expensive and then there were another three sites that were just you know mean that there was a criteria of being within a mile of the existing location, and these three sites were much further away. So I would encourage everyone to take a look at that, because I think someone asked well how come they couldn't go here there or wherever and as you can see from the list there. You know there were 13 14 sites other than this that were considered before they ended up here and, as it turns out, I understand that you did look at space in the building that it's being constructed next door, but the problem is, they could not give you the floor to ceiling heights that you need to accommodate the music program because they would have to have either if they were. If they eliminated floor space that would have increased the rent which would have made it unaffordable. It wasn't a horrible yeah. So having said that from the committee, it would anyone want to make a motion to support the special permit. It will I'd like to make a motion to support the special permit, so it's moved by Vivian. Is there a second I can set I'm actually on the committee. I just spoke to a look-alike. Okay, you never know, and I will start it just in case she's, not okay, so just so everyone, and particularly for the new community board members. The way the voting occurs is the committee members. Ah I can now save one. The committee members vote first and then any other board members who are present who want to vote second, and then members of the public who are participating do not have to vote, but if they wish to vote they can do so. Also, so I will begin. There is a motion supporting the special permit made by Vivian and second by Ossie and Jim I'll. Just say that how it was a double second and we'll do those in favor against an abstaining so can I see everyone, I can't see, Rosie I can't see Omar say. The other thing you can do is simply call the roll that's what I was I was going to do so. Actually Chris, can you hear us now? Yes, I can okay. So how do you vote in favor? Jim? Yes, Rosie, yes, Omar due to my position at the dealy I will be up staining from this vote. Okay, actually he will be not voting on this vote due to conflict right, not a penny. You will not be voting Vivian, yes, OC! Yes, so we have one an aye vote. Yes, one, two, three, four, five, six, seven, yes votes, nothing against one, not go Dean, no abstentions. Do it I have everyone? That's a total of eight one, two, three, four, five, six, seven, eight okay are there so for our new committee members who are present that would like to vote. How do you you'd have to unmute yourself and one at a time? Let me know how you would like to vote. Leo you still there Mariela you still there scenario I'm here, I also work for the deal. Okay, Leo still here, I just don't think a vote, because our affiliates DDC so sure is DDC. What Jim would DDC be a conflict of any kind I, don't believe. Gdc is involved in this project in any way as of right now, the lead environmental review agency is DP and I was not. Dc would not be involved when the agency again was de serie, DC, DD, sorry, but they're not interest, and therefore you are required to vote I'm in favor. Okay, thank you. So we have one in favor, no one in against no one abstaining and one not voting to the conflict again. Are there any members of the public participating who would like to vote? I see two participants have grazed their hands and how do I get to you? Polly all know how do I get two folks with their hands raised? Those participants are considered like public people, so they're, not speaking in your panel, but if they want to vote, you can ask them where they can post a question to your answer through the Q&A. Those are people that are outside. You have exactly outside listening against, be okay so, but that is you know. So if you are an attendee- and you would- you know like to vote for or against abstaining, please do that through chat, and we can pick it up now. Hugh and hey. It's sorry, Q&A questions there if they want right, but as though it's your question to say, I'm in favor of this or I'm opposed to this okay. So to speak, you have a question from Mina. If you want her to speak, let me know I'm sure I mean. If someone has a question you could I see. Jerry culligan has voted in favor. Okay, let me put mean on cuz I guess she wants to ask them. Mrs. Nina is extending okay, perfect Nina. She was on mute, her stuff, yes, yeah, hello, Nina she's. There she's still a mute. She had unmuted herself for a second I'm just first time, I'm twenty CB, twelve on the yeah. You know soon, I'm, abstaining, I, don't feel have enough in front of one to oppose, but I don't feel I have enough information to also vote. Yes, that's fine! Okay! So that closes out the discussion of the special permit for BSA. It clearly passes so just for clarity. The next step is the committee's resolution will be presented to the full board at the general meeting, which I believe is the fourth Tuesday of this month and if the full board adopts that becomes the official position and that resolution will then go out to BSA the when music school team should email the office. You know Ebenezer Paola, to make sure you get the invitation so that you can participate in the general meeting. You know, probably just during public session two to talk about that. I don't know if there would be time necessarily to do a presentation, and normally we don't do that, but during public session you know you or you know, family members, which would probably be you know. Maybe a little more pertinent to the community can speak in favor of the school. The move or you can just each briefly talk about that. So there's another community member named joy that voted the yes I saw that I have it opened I? Have it open? Okay, the one thing is that the recording does not always capture the Q&A. So unless we verbalize that well yeah I know so, I said that we had Jerry culligan, who actually voted yes twice, but it'll only count it once Nina actually was able to get a loin and said she was abstaining and then joy, Gro, Malini I believe it is voted. Yes, okay, so with that I thank you and Steve. Simon has joined us at 8:08, so I guess that's early. The next item on the agenda is an update on the West 158 Street grow house district, something that has been presented to the committee and the community board a couple times over the years and the parties involved. Are you know, Vivienne Dukat? Who is a committee member and Mathews Beatty, who happens to be one of my name and Matthew was one of the many local residents who was. You know actively involved in the research and advocacy that went into advancing the Audubon, Park historic district and as just as a bit of background and I, see Pat Courtney, who is with the historic districts council as well, but also has been active and you know advocating for Historic Preservation in Washington in wood. When the Audubon Park historic district, which is the base the residential buildings just north and west of the Audubon Terrace historic district, when that was being proposed by LPC back in I, think 2008 2009, the Land Use Committee and the community board fully supported that. But one of the things that we noticed is there is a row of row houses. That's going down the hill on a hundred 57th Street that literally abuts the Audubon Park historic district. That is not included and, as you know, Matthew will tell you. If you look at the history of the development of what used to be the Audubon estate, those row houses are actually older development than the apartment buildings that were, in fact included in the historic district and while the apartment buildings are wonderful and they're. Indicative of you know the kind of pre-war apartment buildings that were developed and a representative of the urbanization of Upper Manhattan, driven by the both the extension of the number one train, moving north and Riverside Drive being extended. If you're, looking at the that, you know urbanization above Manhattan we're leaving out an earlier stage in that urbanization and from you know, the perspective of you know capturing the history of it. That just doesn't make sense. So you know the committee and the community board has really. You know, continue to advocate for something to happen with those buildings and if it cannot be an expansion of the Audubon Park District, because LPC says the buildings are architectural II, you know different than they can be their own district. The resolution passed by the board in 2009 specifically asked LPC to work expeditiously to advance the designation of those buildings, and that was in 2009. It is 2020. So at the last month's committee meeting, someone asked about the status of a proposed development there. What's the status of the you know, action to designate the area so we've reached out to Vivian and to Matthew to give us an update and with that I will turn the floor, or maybe the screen over to them and Matthew need to unmute yourself. Yep shall I try, sharing my screen here and see how that goes. Absolutamente. Okay, just a second err share my screen. Ah, the host is disabled. Attendee screen sharing. Also that's Paola. You need to enable Matthew there you go all right. Thank you! Oh yeah, here we go. Let me see I'm going to try to desktop one I'm going to go to slide view, and now are you seeing a slide? Yes number one of 19 Oh. Actually, then, let me let me switch swipe displays now. You just see the slide exactly very great excellent, so Wayne you gave really an overview. We've got a slide deck here that I sent a link so that the committee can view it afterwards. We don't really need to go through every slide in detail, but I'd like to just review a little bit as Wayne just said. One of the our primary objective is to preserve this row of houses, 12 houses that were left out of the original designation back in what was it. Vivian 2015/2016 Vivian noticed that there was some activity on the block and we were quite concerned about what might happen with that block, and so we had been sort of dormant and working on getting it added to the Audubon Park historic district. But we resumed then, and put together a proposal request for evaluation that we sent to Landmarks Preservation Commission, to add to those 12 houses to the existing Audubon Park historic district, and we base that on both of the historical and the architectural elements of a historic district, the historical being that row of houses was on land that had always been part of the Audubon Park neighborhood and the architectural being, as you just said, Wayne, that, although their row houses, they were an anticipation of the coming of the subway. Just as the apartment houses that are in the historic district were a reaction to the coming of the subway. So they were all really a response to be coming and the arrival of rapid transit to northern Manhattan. If you look at that map there, that's on your screen. This is the current Audubon Park historic district and the Audubon Terrace, and over here are the twelve houses and behind them is an undeveloped lot, which has always been a concern because being undeveloped at the moment it is still landlocked that is, there's no direct access to it. But if any one of the houses on the street were bought by a developer, who also bought that lot or owned that lot, then the house could be demolished or somehow used as an entryway to that lot and development on it could rise above any of the existing buildings. And so those are the potential threats. The continued developing interest on the block that other thought a lot and that lot being used with one of the houses for access. The people who live in the center of the block actually I. Think it's only the widow now, and this is Keeling who lives in the center of the block is elderly. She has children who have expressed in the past an interest to sell her home and they also own that lot so that one has sinned. A lot would give a developer about quite a bit of development on square footage. We've had these. Some of these slides are from the past when a developer bought these contiguous houses or non-contiguous houses on either side of the Keeling's. That's been in surrogate court for several years, but it seems to have come out of surrogate court now. So again we have the possibility of these possibility of three houses in the center of the block being owned by one developer. Who could then have access to that undeveloped lot in the rear, LPC's reasons for refusing to add this block to the Audubon Park storage district? The main one has always been that the topology was different between the apartment houses and the row. Houses also that there was this Riverside Drive corridor from 155th to 158 streets. That really was a drew together. The buildings on either side in the Audubon Park historic district we've come back with sort of answers for all of those things. For example, the buildings that are on west hundred fifty-six and hundred fifty seventh streets are off of that corridor. Just as these on a West one 258 are that didn't really fly. We also have pointed out that many of the historic districts and the other boroughs have mixed architectural topologies that they're not necessarily all connected by central corridors, that they have altered, facades some of the row. Houses do have altered facades and that what are the things they also came back with this. They weren't the best examples of row houses. We never knew. If was a real objection, or they were going to object to it for some other reason, and so they keep throwing these sorts of reasons at us, but there could be a more fundamental reason. They don't want it like they don't want to do it exactly I mean, and one of the frustrations is that the people who review requests for evaluation are the research group, the people who were actually the members, the voting members of LPC may or may not. Who really know that we have been submitting this, because if it doesn't get asked the research group, then it doesn't go to them. On the other hand, the research group takes its cue from the commissioner and the commissioner in past really showed absolutely no interest at all. So one of the and Vivian I'll speak to this in a moment, but one of the things that we're hoping is that the newest commissioner, who has now been on the job for more than a year, might be more amenable to this idea than the previous one. Was we had again, here's a slide, I'm not going to spend a lot of time on it, but you can look at it later. Why and what are the compelling reasons? And they really do have to do with what we just mentioned about sitting in them. The footprint that they're distinct a distinct stage in the suburbanization urbanization, good gracious urbanization of Audubon parts neighborhood that their relationship to rapid transit, the architect was man named John, Patrick Leo, who was prolific in northern Manhattan. He did more than 200 buildings. He lived in one of them on the 146th Street. He attended the Church of the intercession that was very active there. He was president of the Builders League Emilie's, also for one term, the head of New York City street cleaning department. Another angle that we are pursuing- and this is a long term pursuit- is the National Register status. Hdc Simeon at HDC suggested that if we got National Register status for the entire footprint of the on Park neighborhood, that could be a compelling reason for LPC, at least to relook, at this idea, and that has been underway now for almost two years. At present, we have a consultant who is doing the architectural descriptions of all the buildings when the National Register folks at Shiva, and always forget what those initials stand for. Wayne I'm sure you know and say it right off the top of your head, but the folks in Albany, who are the coordinators for National Register status when they reviewed the Audubon, Terrace, Ark designation reports and then looked at this row, the immediately symbol. Of course, the group, the grouping that should be included in a historic district, would have Audubon Terrace, Audubon Park and these row houses, but they subtracted a couple of apartment buildings, 158th Street that are actually outside of the original historic over here and say: oh you're, a compass of Suman, Terra I, just let Paulo know the whole conversation was being blasted so Vivian. Why don't you give a take over here and talk about the process and what's happened in the last couple of years in particular? So you have some of this chronology and of you. In terms of I mean it was short that it took from 2003 to 2009 in order to designate the district. Without that Street, there was one letter that we got back from LPC that actually claimed that the reason that they didn't incorporate it was because they thought it was different way back when, but you see, this is how we've gotten so many excuses. Pat Courtney actually is a person who encouraged us to apply to 2hdc for the six to celebrate and with that we we're sort of. We remain very involved actually with send me and Van Gogh and other people and there's actually a booklet. There's a link online that we can send you, where there's they've put together a really nice photograph booklet about the neighborhood, which is something that they do for historic districts, Council, six to celebrate winners. We wrote and request for evaluation to landmarks in April of 2016 and got our first rejection in May of 2016, then I working on the calendars, which I always do discover that there was this whole file in the new Historical Society about Bolton's garden and it included articles from the 20s and 30s from various newspapers. Talking about this is amazing, oasis in the middle of urbanizing New York, and there was also this sort of four page manifesto by Balch in himself and Bolton was the resident of 636 and he was an archaeologist of Upper Manhattan. He was an early historical preservationist. He invented an elevator, a fast elevator that enabled skyscrapers I mean he was a real polymath and his son produced I, think 50 musicals and worked on anything goes. So they were. They looked quite a family and Bolton to this idea of creating a cooperative that actually owned. This. That's now the parking lot and he worked to get everyone to take down their fences and there was a sort of theatrical stage and actually into the late 60s, some of the cement furniture and some of the sort of planted areas existed. We have been working with Mark Levine for a while, and we held a meeting that he spoke at. That shows that Bailey spoke at who, whose family owned six thirty West one to the eighth Street starting in 1967, and this is a picture from when we had a meeting at River Terrace to describe what we were doing and then we also had I guess in November we discovered of that year, 2016 the last of actually not the last, the last frogs to be living in that building passed away and somehow mysteriously it. Even though the operation supposed to own it. It's ended up in the hands of the people who owned the former Corral diner. So they've done a lot of interior renovations like they have not doesn't seem to touch the exterior. This isn't one of these photographs from the collection of the boltons gardening collection. We submitted another, our Effie and because of the concerns from connections, we got the New York Times to write a piece that Matthew was central in about the fact that of this drive to try to landmark this block, we got Gale Brewer on her side and she wrote we've gotten somebody from who was still ongoing, ly helping us if there's such a word as ongoingly from Scott stringers office, who was the head of community affairs, Jessica Silver, I torture, as recently as January was connected with Simeon bankrupt, the executive director who started districts Council to try to two years later to try to go after them again, and then everything hit the fan with the pandemic and I haven't heard back from her. We got one more person on his own more on. They came toward wall-e once it came sort of found to us and said I'm, sorry that I never joined your effort, but I want to join it now. In 2000 and in April 2009, the Bailey family of 630 actually sold their apartment. There's their house it's beginning to be that all the originals are pretty much gone, and we don't. We don't know how people down the west side of the block, we're never that much in favor. So we don't think that we necessarily have owners on our side and now there's you know, there's definitely been a change since December of 2019 in terms of the status of the three houses that were part of an estate that owed taxes and a resident of the block was telling me Richard, Fagan and who's done, a beautiful renovation 634 that they started to clean out everything out of those houses and then mysteriously it all stopped. So I, don't know what that means, and he didn't know what it meant. But they're. You know little by little. Things are moving forward, so we were hoping it suggested that maybe the people who owned those were going to renovate the interiors and that and leave the exteriors alone, but that's pure guesswork on our part. Should we do the next slide? Do you want to go back Matthew sure one of the things that we have been trying to come up with is how to present this again, because if we go back with the same RFP, even if we have a more a friendlier research group there at LPC, they're still going to say well, you've submitted this twice and we've said no twice. Why are you sending it again and one of the things that we have not really fully addressed? Is the cultural history of that particular block in relation to the Audubon, Park, historic district and also in contrast to it, one of the things that we didn't include, and actually we didn't know, and if it's okay for me to plug my book I will I have look on the Audubon Park coming out in September. You can find it on Amazon right now that you stayed ESP ad, why you can pre-order it, but in researching it one of the things I learned was about the modern cultural history of that block. As a continuation of some of its much older history, the first people we know about really from records who owned that land with the Watkins family. Actually the Dyckman zoned it before them. But we don't really know much about what the diamonds were doing with it, but the Watkins family definitely farmed that land as well as about a hundred other acres surrounding it and a huge farm, or that was just south of where the jamel mansion is. They were Watkins. That was actually they were friends with the Morrises. Anyway, they farmed their land with enslaved, labor well into the early 1800s. When New York State had begun a stepwise manumission program, there was law passed at the end of the 1700s that gradually, when enslaved people reached a certain age, they would be free and if we were born into slavery and if they were already enslaved, then they there was a timetable for them to be freed and the Watkins family did have had slaves around 1850 contrast, the Dennis Harris, who was a Methodist minister and as well as a bricklayer, and they should a refiner and an ardent abolitionist bought the property and he bought the sugar refinery at the foot of a hundred and sixtieth Street. His Duane Street refinery was a known stop in the Underground Railroad, so it's quite possible that he used his sugar refinery there at 160th Street, where the river arts apartments now stand as another stop in the Underground Railroad, as it was farther north outside of the city and a step closer to Canada. So you've got that sort of early history having to do with first and slave people and then with an abolitionist who owned the land. Then, if you jump into the early, the middle of the 20th century, Joseph and LaVon Scruggs bought number six 26th in 1954 and as far as I know, they were the first African American property owners on the block. Vivian has a lead that I need to follow up about another person who owned that house. Another african-american, a barber I, believe he told me who owned property farther down the Bosque, but I have to find out when he bought that property by the time that this was happening in the mid 1950s. All of the houses on the block have been converted to multifamily residences, and a couple were even single. Occupancy. Rentals had been, as the decades were, on the area adjacent in the Audubon Park neighborhood or the apartment buildings was undergoing the same sort of urban blight that many cities in the United States were, but something really remarkable began to happen on west under 58th Street, and that was that african-american families began to buy the homes and to convert them back from these multi-family home single occupancy residence, a single room, I couldn't see. Rentals to single family homes chose Joseph Arthur Bailey, whose daughter Josette has worked with us on this project and Sherman Carter both bought in 1967 and what's really interesting about their purchases, and this is where the things that I learned in completing the Audubon Park history was that this was the era of redlining that pernicious practice of denying loans and therefore keeping people of color out of certain neighborhoods. The Audubon Park neighborhood was not the top. It was not a green neighborhood, but it was a blue which was the second tier, which meant that most of the residents were some sort of European extraction and that property values were still very strong and looked like they might stay that way. So you have that new area would have been very difficult for African Americans to buy into, but the way that they did, it was that they got the owners of the homes to finance their mortgages, so they didn't have to go to a bank. This was this was a pretty common way. I say common. It wasn't that he didn't have that much, but it's a way that some what happened? A lot in the african-american community- actually it did yep as well in, but not in the 50s I, wouldn't think it says. Sorry, the 60s, but anyway, back to back to the story. I was in touch with there's a wonderful website about redlining. If you can call it a website about redlining, wonderful, but it's full of information and I was in touch with the professors who run it out of the University of Richmond, and they confirmed that this was such as you the same way, a common practice to have the reseller finance the mortgage. That way you didn't have to deal with the bank. You didn't have to deal with this possibility of redlining and therefore, although you probably had a chance to look at that slide, while I've been talking to see about Mr and Mrs Bailey, who were really quite fascinating people, he was a Republican politician and lawyer who tried to unseat Adam Clayton Powell, and she was an attorney, certainly well ahead of her of her time. She would have been in school in the 1940s or early 50s, becoming an attorney Ruth Johnson also bought onto that block and Wayne did you actually knew Ruth? Didn't you of course? Yes, she was my upstairs neighbor you right exactly Ruth Johnson owned or was an original purchaser at the Grinnell, but she before that had number 634 on this block and she also had a self-financed mortgage whoo that a seller finance mortgage. She and her daughter Robin continued living at the Grinnell, but they owned this home and she rented it out for additional income and, of course, being right around the corner. She could take an active part in the block which had a block association. They had block parties, everyone on the block, really sort of excuse me looked after each other, so excuse me in 1974 the Keeling's, Loretta and Marshall Kealing bought the house in the middle of the block number 638, and that really gave african-americans control. With exception of one has control of the eastern eight houses on the block, then Shirin Carter leveraged his ownership into buying another house, and then he and Ruth Johnson. When number 640 became available, joined together and bought that one by the time they bought that one, the price was much higher than any of the other, the previous ones had been, and they actually did by that time get a bank loan. So it's that said this is a really sort of fascinating part of the cultural history, not just to the block, but in comparison to what was happening: yeah, 70s and 80s just around the corner. Excuse me where there was a great deal of petty crime and major crime. One of the people who gave me an interview for with the Audubon Park book talked about how he looked at 780 and his family. First, the wheels were stolen off of their vehicles and then two vehicles, not one but two vehicles were stolen and they never saw them again. So there was quite a bit of unrest in the adjacent neighborhood, and yet you have these families forging their own community. On this block, it really was, and until the 1990s that things began to change again and sort of go through another cycle, and that was when this first generation the Carters became more elderly, as did the Bailey's and as the second generation took over some of them sold some of them rented. They moved elsewhere and rented, and so the stability of the bloc began to erode a bit a bit. Then, in the last couple of decades, over the last, let's say, 15 years, there's been renewed interest. Viviane mentioned earlier, that Richard Fagan has restored number, which is at six thirty 34 and then Josette before she sold the Bailey house did a lot of work, restoring that the houses there you can see in this particular photo on the far end both had been burnt out in the early 2000s. They were nothing but shells, and both of them have now been reclaimed. The one in is a single family with an apartment in the basement. The one on the far end, which now has that pop up on the top just was renovated and the renters moved in just before Christmas of 2020 is that right, yes, Christmas last Christmas, so around November 7th, the 2019 thank you is when the first renters have moved in I'm, not sure if it's completely occupied now but they're. Now ten apartments means that in that building. So this is the approach that we intend to take with writing a new RFP it'll be built in great deal a great part on the previous one, but it will have a new element of cultural history that we hope will catch the attention of LPC and perhaps caused them to Italy. Look once for this at this block for historic preservation and there's new leadership at LPC, so there's also the chance of her. A new attitude coming from on top actually I have two questions. Is that Steve? That is Steve Simon for first? Let me begin by saying: I was a late in calling into this meeting, because I was attending a meeting of the community board shoe box committee. Yes, I. Let them know that all right, well, okay, well, I, don't think that comment earlier was necessary. Then relevant yours, so I was similarly for the record, pointing that you were joining at 8:08, because Chris is taking the minutes. Okay, you said something after that, I always do yeah. Thank you, anytime, Matthew, in terms of the cultural history, isn't it worth mentioning that Bolton Balkan is a is a significant historical figure? I would think. Isn't it worth mentioning that he lived in 638 he it is. It is Steve that we actually had that we focused quite a bit on Bolton in the original RFP, and we wrote about. One of the things we pointed out was the irony of how Bolton had tried to save Audubon's home at where, of course, where you live in the building which was home and how that failed and how ironic it would be if trying to save his home did as well so yeah we did. We did focus a lot on not just him as a story about him as a as a civic leader, because he was the president of the Washington Heights taxpayers Association. He also his archaeological pursuits, his writing in his video and was saying he's engineering. He was, he really was quite a quite an amazing yeah and in the prior presentations, because this was just a bit of an update and then presentation of new information, but in the prior presentations you know Matthew and Vivian. You know this did in fact emphasize the Bolton connection, alright. So where we're keeping that as part of our presentations I believe, is that correct? Exactly? Could you go back? Could you go back to the early outline showing the site yeah? Okay, very good yeah? Have we looked at whether or not it's possible to develop the vacant lot by using the by using the entryway off the alley instead of having to knock down any of the row houses? Is it legally permissible for them to use the nollie way as an entrance? We previously looked at that? That's, not a legal street called Autobahn lane. Actually it's not it's! The answer. Is it's not a legal Street? So no, they cannot do that and they don't actually the deed to that property, even if it were does not carry the right-of-way on that, but that I think that alley does have an entrance for the beat for the cars that are parking behind there. The alley is, you is usable, but that lot doesn't have a right-of-way to it. In other words, the deed for the lot did not include that right away. We actually had it examined, so we so then, if cars are entering there from the alley, is that is that illegal? But that's a different question. What and when we discuss this with I think both City Planning and City Planning checked out to do B that alley right away. Whatever would not be a legal Street from which you could have a building address. You would have to enter from 158 Street to have a legal address that alley. I, don't know if it was ever properly mapped, but the ability to drive a car in and out doesn't make it a legal Street from which you can then enter a building. Ok well now, I'm wondering whether or not having a parking lot where cars are entering from the alleyway is also a legitimate issues to wait for things to not be not to move quickly enough so that things won't be knocked down. I mean that's. You know, I do know that healings and are entertaining all kinds of brokers and lawyers and I mean and potential buyers. So it seems like with every day, I worry that something is gonna go right. So just in you know, respect of the time we are pushing 9 o'clock and this was a wonderful update. I wonder if any of the committee members particularly committee members who are seeing this for the first time, have any questions or comments, and if you so, you would have to unmute yourself and I would say, hearing none and seeing none Viviane, Matthew I think this was wonderful, as you can tell you know, there is continued. You know interest in what's going on here and I think the research that has led to more information on the cultural significance of the area of certainly you know, builds on the argument for designation. There is the architectural, obviously there's a historical, that's you know the urbanization of what used to be. You know suburban if you can believe it's suburban Manhattan and then there is the you know the cultural which is, you know the link in the links to the african-american, but the african-american homeowners in Upper Manhattan, so I mean it's hitting on all three areas that the New York City, Landmarks law you know, provides for and you can get be designated under anyone oval LP C tends to favor. Have the architectural? That's not a requirement, but this is hitting all three I. Have a quick comment, a question. / comment: yes, I'll see: okay, can you go back to the slide that show all the buildings from it's kind of when you go down that no keep going the older picture, the older picture? Okay, I'm, just curious. If, though, somebody or maybe want some of the owners thought about bringing back the railing I know it's a small detail but I in my view, I feel that it's it looks really uniformed here and it's actually highlight the building's the way it is now. Everyone has their own style of railing and fences or whatever, and it's somewhat like I feel that it kind of take things away from the buildings that that's the comment that totally up to them, though, and - I know it, but I am putting it out because I look at that, and it looks so nice and then I, look at the last photo. You guys show. Ok, you got yeah well, I, wouldn't I, wouldn't stress that too much because landmarks. Oh! Well, that's the reason why we're not designating, but the interesting thing is- and we learned this not to stretch the meeting out too much when landmarks is looking at designation, they're looking at the site or the building in its current condition. So the fact that at one point you had- and it's not even clear to me if those were the original suit, because architectural II the buildings are different, so for them to all have the same style stoop seems questionable. It seems at some point there may have been a deliberate effort to do that. But even so, if this area were designated and LPC were to say that the consistence Dux represents a significant period, when one is doing a major exterior innovation that impacts the porch, that's when they would have to go back and have the porsche design reviewed, but that, but first the first thing would be to get it designated no I get it I just had to say it, because it's like a very early picture. That was when there only were the initial eight buildings that was an 1897. So once again, thank you Matthew! Thank you, Vivian! Is there any old business? Is there any new business summertime? Is there a motion to adjourn so moved motion to adjourn, yes, moved by Steve I? Second, the motion, and that was at 8:50 all those in favor, aye I'm, assuming everyone is so I wish everyone as enjoyable a summer as we can make it and I'm sure we can be creative. I. Of course, look forward to seeing and coordinating with everyone at the general meeting and take care have a good one.",
        "summary": "Looking for all committee members to, let me know- The same thing is true: When I circulate to the committee reference information, there was some information that I circulated to the committee pertaining to both the BSA application that we'll be considering, but also the West 158 Street rowhouse district I think the resolution that the board passed years of I circulated that for reference, so that committee members, who are not committee members at the time, have some background on what we're talking.\nFirst item is the consideration of a BSA application for the wind community music charter school, and this is an application that was presented to land use in February of this year.\nWe had a detailed conversation about that I think it was last month for reference, the February committee minute, so that everyone who was not at the meeting had some background and also so that the members who were there since it is going back several months, could just refresh this is not you're.\nThe community board passed a resolution several years ago asking the Department of City Planning to rezone various c8 districts in Washington Heights in wood, because that zoning designation really does not allow for any residential development and a community facility cultural, the things that you know.\nThink both the traffic studies and the environmental studies were not complete, so we recommended that the applicants coordinate with our Health and Environment Committee, our traffic and Transportation Committee, and our youth and education committee, so that those committees-- although this is really just asking for permission to put a school use in a CA district, those committees-- would have interest.\nAll of those meetings took place in May, and so we then suggested that the applicants come back to us too, for us to more formally consider that so with that I turn the floor over to Richard LaBelle, who is counsel representing the applicant, as well as any of the members of the wind charter school, who are present.\nI think I would turn it over to Amanda who attended all the meetings and kind of guide some of the various team members and professionals that we have regarding the consideration of the factors than the special permit sure rule , so we're joined by Tom Glock project, architect.\nA lot of questions had a very good discussion and really you know all the all of the all of the committee and meetings were generally positive.\nIt was more about coordinating unloading and loading on the street because they also have buses, and you know, vehicles for people with special needs or handicapped individuals coming and unloading to the building.\nYou can see Street here, there's two kindergarten classes which give them kind of direct access to the outdoor, which is helpful because they don't have as far to go, to get to the recess space and moving up to the building.\nNow, it's a tight gym, but for K through five school it provides a good space, for you know the active play and the curriculum that goes along with physical education, and that is in the back of the building and then moving down.\nWe've tried to create these kind of core areas and both stairs and the elevator access that so, whether it's someone who needs to use a little bit or on a teacher or staff or admin or students, obviously, and Statement, our air quality noise and hazardous materials and transportation, so health and environment.\nYou know existing ambient noise levels, including noise associated with the FDNY vehicles across the street, Then what we did was we looked at occupancy of each of these terraces and so that noise of the children playing is added on to that ambient noise to determine the level of basically the thickness of the windows and walls and the level of attenuation.\nI did that analysis and we specified that attenuation level, and we also looked at the potential impact of students playing in these areas on adjacent buildings, and we looked at a number of different receptors and actually did a very detailed line-of-sight study to see how high each of these enclosures around the terraces need to be.\nWe had actually, you know, collected data on the existing wind location and looked at where the students are reside and how the modes of travel in order to basically prepare a preliminary model of the number of vehicle.\nWe would be coordinating directly with them, and it's important to note that for an application like this as a threshold level, finding the school needs, we need to the environmental studies which support of the legal findings of this special permit.\nYeah 27% from the Bronx And it says, 70% reside in Manhattan, but looking at your map , I mean it seems to be heavily concentrated in Upper Manhattan, right Can. You just describe the house how kids are selected for the school in that process, because it's very much focused on this area?\nYou know when we were in the building and then, though, they'll, get like an inside look at everything and then also because all of our historic families are clustered in this area.\nYou know waited way to share about the work, and so our current families tell other families who also live on the same block, and The word I'm, assuming you shared all of this with the youth and education committee, I mean III, received some feedback from the youth and education committee and from traffic and transportation, and so it wasn't clear from the comments from youth and education.\nActually, with this project moving out of the public school building into your own space.\nSo for our new committee members, who are present that would like to vote.\nThe next item on the agenda is an update on the West 158 Street grow house district, something that has been presented to the committee and the community board a couple times over the years and the parties involved.\nWhen the Audubon Park historic district, which is the base, the residential buildings just north and west of the Audubon Terrace historic district, when that was being proposed by LPC back in I, think 2008 2009, the Land Use Committee and the community board fully supported that.\nIndicative of you know the kind of pre-war apartment buildings that were developed and a representative of the urbanization of Upper Manhattan, driven by the both the extension of the number one train, moving north and Riverside Drive being extended.\nLooking at the that, you know urbanization above Manhattan You know the committee and the community board has really.\nIs, the cultural history of that particular block in relation to the Audubon, Park, historic district, and also, in contrast to it, one of the things that we didn't include, and actually we didn't know.\nRentals had been, as the decades were, on the area adjacent in the Audubon Park neighborhood or the apartment buildings was undergoing the same sort of urban blight that many cities in the United States were, but something really remarkable began to happen on west under 58th Street, and that was that african-american families began to buy the homes and to convert them back from these multi-family home single occupancy residence, a single room, I couldn't see.\nI, wonder if any of the committee members particularly committee members who are seeing this for the first time, have any questions or comments, and if you so, you would have to unmute yourself, And I think the research that has led to more information on the cultural significance of the area of certainly you know, builds on the argument for designation."
    }
}