{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "title": "Traffic & TransportationCommittee Meeting",
            "publishDate": "2020-12-08",
            "shortDescription": "",
            "lengthSeconds": "1:50:45"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "tZwlxPuoUJ0",
            "fillerWordCount": {
                "uh": 85,
                "um": 319
            },
            "readTimeFullTranscript": "58 min read",
            "readTimeSummary": "8 min read",
            "wordCountFullTranscript": {
                "school": 75,
                "street": 40,
                "traffic": 36,
                "students": 35,
                "streets": 24,
                "park": 23,
                "building": 22,
                "amber": 19,
                "schools": 15,
                "transportation": 12
            },
            "wordCountSummary": {
                "school": 20,
                "street": 11,
                "traffic": 11,
                "transportation": 5,
                "streets": 4,
                "renaming": 3,
                "mail": 3,
                "park": 3,
                "zone": 3,
                "sign": 3
            },
            "fullTranscript": "12 m: it's December, 7th I just want to do a roll members and I'm gonna say in advance. Sorry, if I missed everybody, any Richard, Allman Mariella Graham, your audio is breaking up. It's almost impossible to understand you at the moment. No, I'm just having internet patchiness. Can people hear me? Yes, I can hear you yep no longer she's frozen. She has the spinning thing. He's done. My iPad look at now that making strange unearthly noises I have suggested that the board get additional copies of zoom. So we don't have to deal with this nonsense. One more license would do it and we could all be at peace and go to all the meetings nicely exactly so, let's rattle somebody's cage. This is ridiculous. It's our time is too important to deal with these glitches that we should not have to deal with when we just get another license. Oh not hearing anything Debbie you're breaking up you might have to connect just via audio. If that's not happening, maybe dial in frozen again. Whoever is to begin. We can't hear you. We have heard nothing. You said every Webex meeting is like this: that I've been on it's crazy and there's no excuse for this. I'm gonna just see if it makes any diff to my router and see if that makes it difficult. Yes sit on top of it. All men who I'll hand off to has better luck. Is this any better now much better, all right so blame that on me and concrete walls. So what I would say is we're going to start off and I'm sorry to repeat myself for those that were able to hear Richard Allman is going to lead us in a conversation about Bennett, Avenue and renaming. While this, the conversations about Bennett Park are further along Richard is suggested. We have kind of an earlier conversation to just examine. Should there you know, could there be? Could there not be a parallel conversation about streets? So it's more of a an early conversation. Our other agenda item relates to Amber Charter school and their expansion into Inwood. That presentation is not likely to start before 8 pm because they are currently presenting at the youth and Education Committee, which is tonight we're. You know we're doing at the same time, so hopefully they'll have wrapped up it's their first agenda item and they'll have wrapped up by 8 p.m, meaning what I'd like to do in between those two items is cover any updates on old business, etc and I'll provide them at that time. So Richard Allman. If you're able to hear me, I'm hoping people can now if you want to just take over now and take us through the conversation about Bennett, Avenue and naming renaming code naming etc. I will do that. Let me just put thanks Debbie. Let me do a little background on where this issue has come from two or three months ago. It came to the attention of a number of people. I know that the fire department was renaming, a long-standing award that had been given in the fire Department's name and was named the James Gordon Bennett award. It's an article in the New York times explaining why that happened, what it had to do with how Mr Bennett had used the platform he had to promote racist ideas, he's a newspaper publisher, and it was particularly at the time of the civil war for people to take a look at now or later. I just put a cop, a link to that article in the chat discussion has happened in a number of places and we have two things named after James Gordon Bennett in the neighborhood Bennett Park and Bennett Avenue. A discussion has been going on with Parks Committee this past month and a little before that, even at the Executive Cb12S executive committee, over where this was an appropriate thing to do, and last month's Park Committee Parks Committee. There was a lot of interest in that he's just feeling that would best reflect our values to pose that to go forward with that I come tonight or I. Guess I'm here as a member just to raise this as a starter issue with the transportation committee over whether we would want to look at proposing a renaming of Bennett, Avenue and I. Think the issue of renaming a street is a bit different than the issue of renaming a park simply because it impacts more people, our accounts, our bills, everything organizations and their identity in ways that may be a little bit different from a park. I think that's one of the things that might be part of this discussion. I, don't know whether Lyle Blackwood from Dod is prepared or not. To speak to that, he certainly would want to hear what D.O.T had to say about street renamings and where how those issues are approached street, renamings, co-namings, etc. I think those are the things that would be worth considering in this discussion. I personally come to this discussion without as strong opposition as I came to the parks, discussion and I think it's time to open up this discussion to see what other thoughts there are over, whether we might want to consider a proposal on the renaming or co-naming thanks Richard. So, first I'm going to ask if anybody from the committee, just if you want to raise the hand if anybody has any feedback on this I will say the we don't know for sure and Lyle should probably pipe in here. But you know, I was curious to know are things like in Adam, Clayton, Powell, Junior, Boulevard or Avenue of the Americas etc? Are those considered from the D.O.T standpoint? Do those are those considered renamings or co-namings? I haven't gotten confirmation, but you know: I spoke to Jennifer today and she said she thought those actually existed as co-namings, obviously in a more turbocharged way than you know, when we do it do a street corner and I guess just my input is just that I'd like to kind of see how this develops in the parks, side and then kind of, and then maybe talk about it in that next step of detail about. Do we want to do anything or not, but again do I. Have anybody from the committee, if you want just actually I will have some information, I'm a former postal worker. Oh thanks, Jay, to the best of my knowledge, 7th, Avenue and 8th Avenue and Lennox Avenue, get you to the same address as at Malcolm, X, Boulevard, etc. Either address gets the mail to the address, and this has been going on for decades with the three major avenues in Harlem I. Don't know. If sixth avenue gets you to Lennox and Malcolm X, which it originally was at all, but to the best of my knowledge, both addresses reach. The apartment and I have a friend who lives on Malcolm, X Boulevard, and she gets mail under both addresses so that that's continuing to the best of mine. Now that's right, whereas if you picked any of the other kind of co-namings that were more traditionally involved in their mail would not come to that address. If one used that alternative so Jay brings an interesting point because there are postal implications, so you can't just change the name of the street because then the people who- and you know the people who write to you, for example- need a difference. So that's part of the complication I think. Consequently, I would like us to now hear from Lyle if he's available and says he probably understands these technicalities better than we do all right. Sorry, Lyle. We can't hear you sorry about picking, hear me now. Yes, okay, sorry I was mentioning just saying: aren't we sure as to the procedure as far as what the request is? That's I'm gonna, you know have to do some research on my own about that. As far as you know, though, usually those tend to go through, I'm not sure if that would be the case in this instance, but I can definitely do some research, I'm pretty curious to see what can be done and the idea to just change the name from Ben Avenue completes a different name or is it a shared street like it would be say, 7th, Avenue and so forth? My thought is that when we talk about renaming or co-naming, however, the parlance that it would mean, in this case, similar to seventh Avenue- that both would still be operative in terms of mail, because I don't think anybody sees it as an option to not to have somebody not be able to receive mail at the address that they've always been able to receive mail at okay. Yeah I can definitely do some research to see what the procedure is and I can get back to you yeah. It's definitely something. Okay. Do we have anybody else from CB Edith? Did you have something yeah? Is there a proposed name? No I mean, and again this isn't as far along I think, there's been a lot of ideas put forth on the park side, so I think that'll be interesting tomorrow, I think there are. You know people have been generating ideas and suggesting things and I think a lot of that will flush out, but not for the street I mean this was. This is much more preliminary, obviously a little more on that, if I may, when the discussion, when Parks Committee had its discussion last month, the representatives from the Parks Department said, if you're going to propose that this park be renamed. Please make a suggestion with that. I think that's probably part of what we all like. If you would just tell us a little more about the Department of Transportation's procedures, because we've gone a bit further at parks, partly because the Parks Department said we'd like you to do this, I mean it's an agency, procedural question also yeah. This is the proof that I've I think in regards to the name of the entire street, not just a corner, but we do have a bro engineering. That's the division within that panel of signage. They might have a few ideas as to what the process is, I'm not sure if it would be solely a deal with teachers, possibly, but those are all questions too I think thank you, I believe what you said was we the about an interest in changing the name not putting up two signs on the street, but removing Bennett from the name of the avenue is that right, no I think my introduction was renaming or co-naming and the phrase shared naming has been introduced in this conversation. I think it's I think the question here is: what's the best way to move on the values we bring to this discussion and I? Don't think there's a clear answer at this point: that's why we should be talking about it. I probably might help if there was a name that you would have the consideration to change it to you know that might get double ruling on our side. If you know, if any talks, progress that might well I think there's a more basic issue. If we are unhappy with the behavior of Mr Bennett, we don't want his name associated with the street anymore. You know just like you, don't want well again, I'll just leave it at that I mean you know the other thing I just thought of by the way, maybe two because again it's difficult to change the name, but maybe, as they are thinking of doing with some monuments, for example in the south, rather than destroying them, they wish to put an additional marker there explaining the context, so it could be. Maybe Bennett Avenue, you know with asterisk, or you know something like that, so that people would know that this is the name and see that may be true with the park too, because if Ben donated the park to the city, he, however much of a terrible person, he was actually donated the park to the city. So that's another complication, I would think in the case of the park, but so that anyway, that's what I wanted to say. Thank you. If I may I like that sensibility but I think that's a lot easier to do with a park or a monument when things are consistently at eye level. Street signs are up above, and it's a little harder to do. Explanation in context not impossible, but more difficult. Well, maybe we could have this the symbol like they do with. You know: flaky baseball scores. You know Bennett Asterisk, Avenue and people go what's with the asterisk. Oh, he was in favor of slavery. You know okay and I. It looks like it seems to me like we're preparing for a discussion either next month or in the next couple of months. There's a list of tasks or information here, I think the one other that we all ought to try to do is to find a way to connect with people who live or run organizations on Bennett and make sure do our best to see that they're at least some part of this discussion may I say something. I'm sorry go ahead, so I what I have noticed and perhaps D.O.T can come back with what choices we have that have worked in other places such as Adam Clayton Powell such as you know, Martin Luther, King Avenue, which is now Lennox, and what I have seen happen down there, since our district office is actually on Adam Clinton Powell, which is seventh Avenue. The signs do not say seventh avenues, the signs say Adam Clayton Powell and what seems to be happening, although, as Jay mentioned before, mail still goes where it needs to go. Even if, on the envelope you say 7th Avenue instead of Adam Clayton Powell as people move and as children come up, there are people who no longer recognize that avenue as Seventh Avenue. So there has been I guess you could say a grace period in which that transition happens, but I think perhaps the ot would be more prepared with examples of where this has happened. I don't think that we should keep this person's name I, think we should phase it out if it's possible to do so, which I think it is it's just a matter of time and just as you know, it's been there a long time. It'll take a little bit longer for it to fade out completely, but I do believe that you know, and yes, there should be a plaque there like. Yes, this used to be names after a racist, but then we learned better, so perhaps there's something that we can do in that way. Okay, where's him raising my hand. Oh yeah rod has hand up and then we'll have angel Vasquez I was thinking. You know again. Context is a great thing to have so maybe with all the technology that's being deployed and it's going to be deployed in things like Google Maps, I know that there are certain things when you call them up on Google or if you're at cultural institutions. You know, there's look, there's actually little note. Notations there could be a paragraph could be three lines. You know, I mean it there's a story here to tell whether you know that can be instructive and informative and to not tell it at all, really doesn't favor moving forward, so I yeah, let's I, would say, let's advocate and bring in context, and if technology can make that happen, certainly as we move forward, why not I mean you can take any street you want and wherever it lives, technologically and map school will match these things. Put that writing in there that provides context and tells the story. We need to hear these stories. We can't just you know close our eyes and you know there's so much to learn or not. This is an opportunity for future people to get the full story and understanding. That's my thought on it. Technology might help you I was just going to echo. Some of the sentiments shared by the previous speaker and I do agree that maybe some type of plaque that explains everything that happens could be placed like at the park, but I would rather go down the path in terms of renaming the street not trying to co-name the street. I know that there's probably some documents or some moment in history where it's happened. I would love to see how that's come about. But if we I agree, we do we need to tell the full story, but that can be done where, like perhaps the current park, is that tells even the story of how the street got renamed, but I would rather go down the path of just simply renaming the street, not co-naming it. That's where I am sorry. This is Debbie. I was muted before and thank you I think this is all good input and what I was saying is you know. Gerard's point was very well stated and I just wanted people to know that I think parks, Liz and the Parks Committee are very focused on that aspect of that context and that I think we can presume that whatever happens on the park side will be robust and that, on the street side, we'll have that to also reference. So, even though we have a more limited way to go about providing that context, we're not in it alone anybody else yeah, I'm concerned about transit in that, as we come down Broadway on a bus, it announces the corner of Bennett and Broadway I, identify myself to accessorize as living on 186th Street between Bennett and overlook, and the fact that we, willy nilly rename buildings something Plaza and Avenue and address that they are not born. It's problematic and I'm a little concerned about the ease in which we are glibly discussing changing a street name, and this really needs to be a community discussion, not a traffic and transportation discussion. It needs a public hearing. It should be something that everyone on Bennett Avenue, which relatively, is a short avenue, but it does. It should be a topic of community conversation. Thank you for that. I think that point should is very well taken and Richard I. Think in being the holder of the plan, I think we should take it a suggestion that if we do decide to take the next step that it doesn't, you know that we situate it with the whole community or the board level and not keep it as close as we might. You know in a normal co-naming through traffic and transportation, that's pretty comfortable to do since that was part of the introduction to this discussion and competence, so sure. Well, thank you for keeping an eye on that. I'm sorry! In the earlier part, I was dealing with my technical difficulties. So I'm sorry that I didn't capture that anyone do we have somebody on the phone 9175, something that wanted to say something: okay, all right, so Richard, you're comfortable with what the next steps will be. I think what we've got coming out of this is all of us, giving some thought to just best course forward for people who have had particular proposals around technology around blacks, anything that can be done to gather more information in the next month or two he's a positive for that discussion. Lyle is going to do some background at D.O.T, I'm glad to do some contacts along Bennett and at least make sure that people down there are brought into the discussion and would encourage Edith or anyone else who wants to be part of that out. Part of that outreach, if you can amplify it great all right, Richard, thanks for taking the lead on this, so I want to go through a few updates now again we're on the flipped order of how we usually are doing things and hopefully amber turtle as I said, join us around eight, so first CitiBike. If people remem may remember the second half of CB12, we were awaiting without early spring 2021, so DOT has contacted us about what that process will be and what that process will be because they will actually be at our January meeting. So that is the opportunity for all of us to see a draft of what they're thinking for the rest of Manhattan above 184th street and like last time we will. You know they'll present what they've come up with. We will have opportunity. Obviously people can give feedback at that meeting, but that will kick off a one-month process for anybody and everybody to provide feedback to DOT and once again the idea would be that we would do as we did last time. That for CB12 will consolidate board member comments in one piece so that way, DOT has again anybody can speak to them directly. We'll have our meeting notes and we'll also have a document that I'll put together that rolls up any feedback that we get from community board members. So I had been mistaken on an aspect of what the process would be in that I thought that when they I understood that there were two phases that we would replicate the entire process, meaning the public workshop etc, but they actually for each community board. They do one round of that. You know the workshop that moment where we could push pins in the interactive map, but that's like that's a one-time step and then so. This will be kind of what we saw. People remember where we were presented with the draft and we had the opportunity to provide feedback, but because we have the benefit of it being December 7th and we have a month to go to that first meeting I would just encourage everybody to you know, do as much outreach as they can to people that you know have something to say about this, so that we can have you know great attendance and great feedback and again also give people the instructions when the time comes of how they can provide that feedback directly if they wish. So that's Citibank Second and I'm kind of leaving the bigger thing for last I. Guess if people remember I, don't know if it was our I think it was our October meeting, but it's possible. It was our November. You know somebody said we had talked about how the work the long work had concluded pretty much at Nagel and Hillside Broadway Bennett that intersection and that there were it seemed like there were some problems and at the time with there was a backup up Broadway during our meeting. You know meaning well past rush hour and we've also gotten we've heard from like a community member who said you know, there's also some issues with the way like the safety of some of the crossing signal, etc. So I just want to say like what to Lyle in particular, that will still be interested to understand from DOT how you know like what you do. Like the you know, you the work got done, but then what's the look back process to make sure it's doing what it was intended to do and not having unintended consequences? Lyle, have you heard anything or do you have any feedback on that point? I, don't have any feedback as far as the specific process. I know that you know, DOT is able to conduct a signal timing study. You know at the request. You know the community board or resident, so you know we will take a look at the intersection to see what can be done. I, don't know. As for the specifics of the protests, Barcelona's division I can give you them to speak with some more information if it is warranted that the signals around there do need to be changed so long. As you know, from a safety perspective, there wouldn't be any negatives. We can definitely consider I mean I, guess my bigger point to put a finer point on it is. You know, community boards resolve on street changes like this that were designed to improve traffic flow or pedestrian safety or all of the above. This one was a very long project. It's a very complicated intersection, so I'm just trying to understand both generally and specifically when the paint dries and you guys wrap up and go on to the next project who looks and what? How does it happen to make sure that everything achieved its objectives? So, let's I, if I didn't send you know what we'd gotten from a resident I will do so, but it's not just a safety issue. It's also like there was that traffic backup it might or might not have related to the changes, but it always it seems like it would make sense that when we do these things that, then you look to see if they worked. So we would like to understand what data is collected and how you show like yeah. We tried to achieve this and we did or we didn't, and so let's see what is that officially done? Well, that's the other question because Con Edison was still over there, but that wasn't part of that project. As I understood it, the base project was done what's happening on Broadway in the bus. Stop what's happening with the fact you can't cross the street what's happening with the fact that the mail trucks are all still throughout the entire intersection obstructing sight lines. This is not changed at all. It's gotten worse, really. You can't cross from the north side of Bennett across Broadway with any safety. Okay. So well, let's can we plan the January meeting we'll follow up on this again and if you can get specifics because then, if you know, Edith is right there and so she's saying the same thing that you know we're hearing in a separate place like let's understand that was an awfully complicated situation. To not have got, you know we need it needs to be right, can not proceed north on Broadway and then cross over Nagel and that little you know little shoulder thing to continue proceeding north on Broadway I. Don't think that's finished, I'm sorry unless you want to just say we're closing the sides of the intersection. Sorry yeah, I'm not sure. If the project is that I know it's a ddc-led project, I think the last update heard I think that they were pictures. They were going to put onto the project and it was going to be wrapped up early next year. I'm not sure if it's the schedule or what's left for them to do like checking their Bbc also to see where they stand on that, but yeah we look at this. We could definitely take a look at the signal timing and you know I can get some more information on the process and I'll see if we can have it in time for January's meeting. Thank you all right, and the next thing is, and I'm gonna Bruce get ready, because I'm gonna call on you is, as people may remember, the implementation on the subject of implementation at 157th, Riverside drive in the 157th 158th area has happened. The speeds by which people are coming off Riverside drive have certainly improved. However, a concrete median kind of across from 800 Riverside drive when we, when everybody you know it was actually implemented. We realized you couldn't pull over and unload you couldn't double park. Without stopping Riverside drive completely a loading zone, I'm sorry a no standing zone was implemented on Friday and Saturday, and so far people are not realizing it's an outstanding zone, and so as of right now, as far as I know, thanks to Bruce's real-time data people are parked there, but the other thing that is true is that the way it's signed and I actually didn't know this, maybe other people did. Is that there's a red, no standing zone sign there now, but so it shows you where it starts so to speak, but the other end of it is not marked by another red sign. That indicates here's the end of the no standing zone, apparently in the world of D.O.T. What you look for is the next sign like that speaks about parking regulation. So the next sign is a. What do you call it? Is it like a regular like alternate side sign? You know, Asp Alternates, Street, Parking, sign yeah, so I mean it's only been a number of hours, I, unfortunately, and I. Think any of us with cars have had this experience. Sometimes we need to learn the hard way by getting a ticket when there's been a change, which certainly happened, which we have seen before happens that the people that get caught in that first few days are quite upset because they don't know that a new sign went into place so, but so I think we'll need to follow up to make sure that traffic enforcement knows about the new change, but so, but Bruce has been at the Bruce has been the he's, been the point of contact for many of the residents in that area and has done an amazing job over the past month of receiving the feedback and keeping things moving and getting questions answered and feeding information back, and so thank you, Bruce is there anything you want to add say well, one thing is that there's a tree: that's blocking this new, no standing sign from really being seen clearly and at some point I would like to go back to the whole process of how this all started and how it was. We approved a plan that was a powerpoint and then all of a sudden it became reality, and then we weren't really happy. We weren't happy with the reality for one part of the project which just so happened to be right in front of my building, where we have elderly people with disabilities. You know trucks coming and going blah and I feel like. We me did personally didn't do a great job of notifying my building, because I had no notice that it was going to happen. My understanding was going to happen in the spring. Why all of a sudden did it happen so quickly? And then you know we were in touch with Kimberly Rancourt, who was the special projects manager? Who would explain things to us? Why? Oh well, you said it was going to be 27 feet. Well, no, it's 21 feet. Well, that's not enough for three cars. Well, that's the way it goes and she did a good job of explaining things. But it's like tough! That's the way it's going to be when we could have stopped it fairly early on before they started cutting when they were drawing lines. In the street, but there was no procedure for doing that. It was like on autopilot, and now we have this no standing thing zone which what else can we do to enforce that I, don't know. Do we get the you know? Do we call the traffic police every day and have somebody come by? Do we paint the curb yellow? Do we put up some cones, it's a real problem, and ironically it's a real problem just for our building, nobody else in the whole block from 155 to 158 right. It was really totally unnecessary that we had to have that median in front of our building. The rest of the project is great people love it. They complement D.O.T, they complement CB12, but so, like Debbie, just said when the paint dries. What's it going to look like down the road? Thank you. I'm done sorry. I was had muted myself, Bruce I do I would say: I do think that the no standing zone will you know we need to it's. It will be in better effect, I think it needs a little time for people to absorb and hopefully we'll get some benefits from that. Okay, I'm here with this, I'm there with this. No I. Take your point. I'm just saying I have seen this. We had this on Fort Washington, where something got installed and then people got caught ensnared in it for like a couple of you know, business days and then it sorted out, but we should all it's a 35 foot zone I believe so once it is more operative, meaning people are not parking there. It's two spots if it needs to be longer, etc. Okay, all right, thank you and happily, while I can't believe, I can finally say this. There are lights on Cabrini that took a long time. There was a mugging. There was a little bit of a car situation of somebody losing their some chunk of their car, but they're up, there's light and there's also trees and tree boxes. So that's exciting and I guess. Last I know we have Allegra Legrand in the chat wanted to bring up a new business item, an Allegra. Let's connect over the next week, because that is something actually I wanted to ask you about as well. So let's connect offline I will get to you or you know how to get to me and I. Think I'm going to give us like a five minute break and then have us come back, but if does anybody from the committee have anything that they wanted to raise or ask about in terms of old business that I might have neglected, Debbie I think just bringing back up the lighting on you know get these highways confused, but it was the lighting on the Harlem river drive just any status. Update on that. Oh right, thank you! So I guess two things. One Lyle do you have any update? As you know, one of our community board colleagues has highlighted this and she uses the roadway a lot in the evening, but also Chanel not to drag you into this. But this is really a district service cabinet meeting, all the more so because it actually involves content and D.O.T and possibly the park, but maybe not, and so I'm just wondering Chanel. If you can help me get that on Ebenezer's like running list for the district service cabinet, because this isn't really you know this is like a perfect thing for them, because it it's cross agency but live. Do you know anything I, don't know anything, but Ebenezer comes back tomorrow, so I'll bring that up to him. Okay, and do you yes, and just if you could just make sure it gets on his list for the next dsc that'll be good. Thank you. Lyle! Do you know any? Do you have any updates over from that last one was quite some time ago. Yeah no updates as of now, but now that you put it back on my reader I'll see if I get some matches for you, okay, we're gonna, do roll call for what well I thought we were going to start roll call before, but I don't think we did, but we're not voting on aiming oh I. Just before someone said we're going to do a roll call, and we never did it. We can do it later. Could I raise an issue? It's Edith: I'm really concerned about Saint Nicholas Avenue from 165th to 168th and the situation of trying to cross Saint Nicholas on the north side of 167. when the okay, if you're, trying to cross Saint Nicholas, say you're running for the bus vehicles are coming across 167 and making the right turn and the buses are sticking far enough back to be covering the crosswalk and the walk signal, and the problem seems to be when there's an m3 laying over at the 168th street end and then so. You have the three the seven and then 100 proceeding up Saint Nicholas to the bus stop and it creates a bit of a problem. Additionally, people backing into parking spaces on the Broadway side of Saint Nicholas are really pretty bad at that, and it creates a lot of traffic issues right there, particularly from 167 to 168. So we're talking about the stretch once again, something that this board did a resolution on that changed. Saint Nicholas to one direction in that stretch and an added parking on that stretch of Saint Nicholas as well, but it's angled parking. So that's what you're, referring to so now, people are coming in angle. Prop parking, that's the problem when you're on St Nicholas, you have to stop and back up into walking right, okay, so this is and I see. We have Amber Carter here, so we're gonna move to that in a moment, but then so Edith. Thank you for again being the eyes on the ground for the feedback so Lyle. This is just another example, something that was implemented and just understanding when there's sometimes like potential. You know how we're looking at it making sure it's working in the way we want it to work, and all of that, so maybe we can connect on that as well and just you know, I think we've talked about three projects where you have those same questions: Richard Allman, unmute Richard. Before we leave this issue, I'd like to see us and I think you pointed towards part of it an overview of what's happening with at street buses. I think there are a couple of additional problems, Edith mentioned in part. What the M3 layover the front end does perhaps there's a better place for him. A more appropriate place for that layover. It creates some boarding problems as well as everything else and I think there are some reasonable questions about how the M2 comes through that intersection and I think it would. We would do well to do a joint review, I think with the Ot and with MTA, because there's some overlapping issues there, that's a good suggestion. Let's I mean I, haven't done a walk through you know, formally with Dft on any of these and I think they all merit it. So thank you for that suggestion, and while we can do that thing, can you work with me on setting that up yeah we can have a conversation offline. You can talk forever. Okay, all right! Thank you all right with that. Welcome team Amber charter I appreciate you being here and youth in education and telling us about plans and the school, and all of that I will preface this by saying we weren't always this sensitive to school buildings and how they were occupied until we had a somewhat disastrous situation with Success Academy in Washington Heights that just the location, the combination of the census of the school and the location and the particular idiosyncrasies of the location. You know just kind of blew up the area, so we now have, you know always want to try to understand. As best we can. You know the plan for the area and what we can expect and head off. You know where we can, if we think there might be an issue. I want to thank Mariella Graham, one of our newer committee members, who took really took the initiative with this issue and making us aware, along with Dave Tom from the community. So what I'd like to do is hand this over to amber charter team and then to present, and then I'm going to ask give Tom from Inwood owners to just take a couple of minutes and share with people what he has shared with us about the area as well and then I, guess, yeah and then I think I would like to hold questions till after Dave. But let's just see where you know, people have very specific things for amber as we're going them. Then we'll do that, but and then whoever starts with amber I. Don't know if that's going to be just if you could introduce your whole team because it looks like we've got quite a few of you hi. Sorry, I'm going to start. My video I did not mean to leave it off this long. Hi miss Babbin, that's right! Nivea! Thank you. I try to be good with names, because clearly mine is also very strange and different. I'm Dr Vastiankostein, I'm the executive director of Amber Charter schools, I'm I! We have a very short presentation that we would like to kind of get through first, you know and then we'll go through any questions that you may have, and hopefully we'll have a lot of answers. Perfect, so I think Christine Gainey, who is our chief communications officer, is going to do the presentation. I, don't know how they're going to share the Powerpoint yeah Debbie can I just hit share and then I can share. My screen. I haven't done that I think so you know this committee has not and I have not been on YouTube before we're. Typically not exactly hear this screen whenever they want to yeah. Thank you just try. It should work and if it doesn't, who knows so as she shares the screen, you will meet Anna Vargas who's, the founding principal of Amber Inwood. You will meet Veronica Medina, who is the chief school officer and we will be the ones presenting tonight. Well, thank you! So much for all being here. Oh it's working! Okay, all right! We'll get started good evening and thank you, members of the traffic and transportation committee for giving amber the opportunity to present today, as Dr Vaspy mentioned, my name is Veronica El Medina, I'm the chief schools officer at Amber, Charter schools and today we are really excited to really share with you all how we look forward to being part of the Inwood community. Alongside me, as panelists and as presenters today, you have our founding principal Miss, Anna Vargas. You have our chiefs Communications Officer Miss, Christine Gainey and of Course Dr Vasya Kosa, our executive director. We're going to proceed on to this, and definitely as Dr Vosti mentioned. Take your questions at the conclusion of the session. So a little bit about myself we'll go to that slide. I've been with amber for 13 years. It is my home away from home and definitely started my career there as an elementary school teacher in fourth grade I served as a administrator at the east Harlem location, both as a dean of students and assistant principal and then I was the founding principal of Amber Washington Heights four years ago. We were truly excited to open and replicate our second school and come to Washington, Heights and I'll share with you in the upcoming slides. Why that truly was a dream? Come true for us, but nevertheless the facility on 187th Street didn't lend itself for us to go to a K-5 school, and so we found our permanent home in Kingsbridge, which is not too far away, and there we serve our students in a k-5 setting, and so now I'll go on to the to talk a little bit about our history, so Amber charter schools was founded 20 years ago. It is the first Latino led charter school in New, York state, and we were founded by a non-profit organization known as Acerep, which is the Community Association of Progressive Dominicans Aceta was founded in 1979 and since then has truly been a non-profit organization. That's provided high quality programs to over 27,000 families in the Washington Heights community. Our schools are located both. It lies, as I mentioned earlier, in Kingsbridge and in east Harlem and in the fall of 2017. We did move into our temporary space in Washington Heights and, given that our founding organization had deep seated roots in Washington Heights, it really brought us joy to replicate and go back to the community that actually opened up amber, and so with that being said, for us to be able to say now in September 2021 that we're coming back to Washington Heights brings us. Joy brings us excitement and we're eager enthusiastic about this and he's 100 students in grades K-5 and that's a picture of our building. That's located on 106th street and in Kingsbridge we serve over 475 students in kindergarten to fifth grade. So a little bit about amber and our mission, definitely Amber has not only created, produces strong academic performance, but more broadly, it really addresses the learning and development developmental needs of the whole child through enrichment offerings, which Ms Anna Vargas will share with you shortly and through a comprehensive range of supports. Overall, we truly take pride in ensuring that our amber stars as we refer them to ensure they get a rigorous and comprehensive core academic experience. We support students in multiple ways and you'll learn more about that in the upcoming slides. You truly create an educational community that celebrates culture, which is truly at the forefront during these shrine times and foster a love for learning. We provide clear pathways to middle school high school in college and there you could just see some pictures of our students enjoying music class along our music teacher and truly enjoying this experience of loving, to learn and loving to come to school, and now I'm going to turn it over to our executive director Dr Bossie Dr Rusty. Now I'm not going to read. What's there that kind of gives my history I just want to jump to the last line to introduce myself I was born and raised in Washington Heights. My Father has pastored her church on 179th Street and Audubon Avenue for over 60 years, I taught at Ps115 I even attended a Ps 115 as a child, and then I showed up and I was teaching a teacher in my own school I've also been a leader at Ps210 and together with my husband, we were community activists in Washington Heights. My husband was a member of the school board when we had school boards, and he also was a member of the community planning board. I also lived in the in Inwood I, actually live on Park Terrace East, so everything that's going to happen is going to impact me directly and therefore I have a special interest in making sure that my school is a good neighbor. Christine. Okay, can you hear me good evening? My name is Christine gamey I started at Amber over 15 years ago. As a second grade teacher and team leader in east Harlem, then I attended with Veronica an emerging leaders program and joined Amber's leadership team as a staff developer. I'm now in my fifth year, serving as Amber's chief communications officer and looking forward to opening amber three in Inwood and I will turn it over to miss Anna Good evening. Everyone first and foremost, thank you so much Christina. If you could just go over to my slide. Thank you first and foremost again. Thank you so much for welcoming us this evening and up and providing us with this opportunity to address all of you and allow you to learn a little bit more about us. I was born and raised in Washington Heights, as you can see on that very first line and I am a product of district 6 schools. I did not attend ps115, because some rezoning occurred years after I actually attended ps173 in the neighborhood and then later on, I attended, Mott Hall, which some of you may or may not recognize. The name. I have nearly two decades of not just teaching and leading experience, but I have founded approximately four different schools and programs across New York City. I've also been a graduate school professor, where which comes in incredibly handy when I'm working to develop teachers at varying levels of experience. But my great pride in opening up our school in Inwood comes from providing families with choice, especially because growing up in district 6 schools, I often wondered you know about which other opportunities or what my life would have been like had I not been afforded the choices that I was and so I see the opening of our school as an integral part of providing the absolute best for our community. Please. So, for those of you who do not know or haven't, are not as familiar with where the school building will be. This is our exact location and during the opening year, which is the coming fall of 2021, we are slated to open with grades K and 1. The building will also serve as an incubator for our Kingsbridge campus middle schoolers, which will bring on board about an additional 200 students in grades five and six. So our very first year we will have approximately 400 students in the building it's okay moving forward. However, we are slated to grow the school one grade per year until we are full capacity k through eight with k-8 students next line, please. So, if you're curious about what our students are doing throughout the sorry at our school, we focus on academic rigor and enrichment, which means that our students have the opportunity to both shine as scholars, but also deepen their interest in other areas. So 90 minutes of their day each day is centered around literacy and math, and we also offer science and social studies content 90 minutes per week. Our students apply their understanding following a station learning approach and to maintain the cultural wealth that many of our students bring with them. We offer spanish classes to all of our learners. Additional classes for enrichment are also music, art, movement and technology to ensure that our students are receiving the support that they need. We also provide them with set classes title one and reading tutoring and English as a new language for students who are still acquiring English, please, and so on this slide, you will see just a few images of our students across our other two schools. Some indulge me as I showcase. What it is that we do at the in the very first image we have our students playing, there's xylophones in music class, some of them in their after school program. In the ballet program, we are triumphant winners at the end of their spelling bee. Our council members are in that last image on the upper right in the bottom left, some of our students showing some class pride and posing for an image, some hands-on science, a celebration at the end of a writing task and then, of course, our basketball team to showcase some of the sports that we offer. However, if we could go to the we couldn't do any of this work without the support of the community, and so we have partnerships both across both of our schools, which assist us with everything from the after-school programming to mental health services to the swim classes that we offer our students and each year we search for new opportunities to further enrich the experience and just the lives over all of our amber stars. Veronica is going to walk to talk through some additional ways in which we partner with the community. Thank you. Miss Anna So, as Miss Anna mentioned, we pride ourselves in community and that is one of the amber traits. So what we do is definitely celebrate being part of the community and teaching our amber stores how to give back to the community this past Tuesday. We suppose we celebrated giving Tuesday and really had our amber stars, showcase ways that they're giving back to the community during these trying times. Not only did they create amazing artwork, but they also showcases some important messages and affirmations to those within their community. Here you're going to see some pictures of our fourth graders. They are, the students are community service trailblazers and they take the lead in teaching the amber stars, the importance of giving back to the community as community members. With that being said, we are excited to partner, as Ms Anna mentioned, with the Inwood and Washington Heights community, and look forward to having our amber stars not only be a part but to give back to the community as well. I'm going to turn it over now back to Dr Vasya Corsa. So we know that you, this is the traffic and transportation committee. So this is what you're really concerned about, though, just a few points that we want to share with you. One of them is that we're going to give priority to community residents that live in our student lottery. That is what we do in all of our schools. To make sure that priority is given when our student lottery and our children are selected, we've decided not to have busting, because we know that the streets are very narrow and therefore to add busing would create even more congestion. We are planning a staggered drop-off schedule, as well as a staggered pickup schedule and we're encouraging families to use public transportation, as well as staff encouraging them to use public transportation. We won't be using the turnaround on the cul-de-sac at all and we will be directing traffic not to go into that cul-de-sac or that the turnaround most of our middle schools travel independently in New York City, because we don't anticipate traffic from them, but once we do have accepted our families and once we have registered the students that will happen in late April or early may, we will survey families in order to understand how they plan to travel to the school. We can also support the community if they choose to advocate for a four-way traffic, stop at the corner of 215th Street in Park Terrace West as a way of being able to help with the traffic. There are two moments of the day. We have managed drop-off and pickup in other locations. We know how to do it and we have a bit successful in them as well to try to do it as quickly as possible, and you know we are willing to work with the community. We want a good neighbor and be able to offer a wonderful education for all community residents and through our school. Thank you for your time, and now we can open to Clinton. Thank you, Dr Bosti and the team for the presentation. I think I'm just gonna ask two specific school clarification or like specific data questions and then I think we'll move on to Dave Tom and then we'll come back for the like the broader questions that have to do with streets. But just what's the projected? What's the split between two through five versus the middle School, six through eight like when you're all in when we're right now we'll be incubating our kings bridge middle School so that the Inwood school that's gonna, start k to one and then every year it will grow into its k to eight right. But I! Guess I'm saying when you get there, this split of what's the census of six through eight versus? What's the number of kids that you anticipate six or eight verses at fully enrolled, we anticipate we might be close to 900 students, 800 and change is what we're looking at okay, so like three ninths, so one third of that being the middle school. That's the number I'm trying to get to you're trying to get to the middle school number yeah. It would be probably more than one-third, definitely more than one-third. Okay, I! Don't have those numbers right in front of me, but I can get them to you yeah and then just don't have them in front of me and then similar question is because I imagine some of the kids at Kingsbridge are in wood or northern Washington Heights kids. Do you have a sense of like how much of the census will be like walking, distance, kids versus arriving by public transportation or not really I know that's a hard one. If I may in our interest right, it would benefit all of us. If you know local children who are interested in a middle school or an elementary school, send them to Inwood because they're within walking distance, and then we wouldn't necessarily have the issue of the additional traffic right now, fair enough, all right, so I'm gonna invite Dave Tom from Inwood owners to just take us for just a couple of minutes on some of the work he's done about. You know the immediate streets. Okay, can you hear me all right? Can everyone hear me okay, and can you see my screen? Yes, okay, thanks so yeah, my name is Dave Thom and some of you know me from other items in the neighborhood I live on 200 West, York, 17th Street, and on behalf of Windward owners coalition. We've had a couple opportunities to talk with amber and it was great to hear about you know their plans for the building that was formerly occupied by Northeastern Academy. There's a few things I'm just going to very quickly walk through for context because for those of you not familiar with the area, I just want to show some of the specific issues that we have to deal with in this neighborhood and we all be very quick. I can get this to work. Okay, so we're talking about the area in the building that was formerly northeastern academy. That's right! Next to action, Park on West 215th street. That's in the very tight hilly section of park terrace- and this is a strange part of town because it is the former estates of you- know the icons and the Siemens and the dikemans- and it's not really on Manhattan street grid. So from the old states there were some. You know, streets that were eventually carved out and that's why we have a bit of a disconnected. You know hilly setup with very narrow streets that don't really do well with a lot of traffic and of course, this property is well known as the former first house, which is the mansion on the corner that then later became a convent in 1929, and then he was demolished or the adjacent property. The original 532 West 215th was demolished to build the school building. That's there today in 1949 that then had a fifth floor, expanded in 1965. and then the corner house today is abandoned. It's not part of Amber's property. It's been mass released by a real estate developer, who intends to subdivide the lot which indicates likely redevelopment, but it's there on the corner today and in the neighborhood. You know. Obviously, lots of people, lots of houses, apartment buildings, but the real issue is the streets. So when talking about the streets, anyone who's ever driven around here knows very well that a single vehicle can sometimes block traffic and whether it's a garbage truck an oil delivery time Warner, whoever so it's quite tricky at the best of times to navigate the loop and in a school situation you often have parents who are you know, don't have the time to sit five minutes behind the garbage truck. The particular corner is a very strange corner. You have the Step street of 215 in park. Terrace, there's no way to actually cross this street as a pedestrian coming up the stairs without stepping into moving traffic. There's no stop sign here. So a car does not need to slow down or stop in any way. They simply come down park. Terrace. We are in the slow zone, so hopefully they're not moving that quickly, but they often come down at 20 miles an hour 25 miles an hour and just to make an immediate turn and for someone across from the steps. The only way to do it without crossing moving traffic in theory would be to walk West to the stone over by Eichen Park. So that's a bit of an issue here: you'd have to go all the way around the ocean. Park Cul-de-sac, if you didn't want to theoretically cross the street and so for an elementary school population. That's a tough crossing. The other tough crossing is when you go down. The hill traffic doesn't stop on 215 as it goes down across park. Terrace and again, you can't cross as a pedestrian at all on park, terrace or sorry across West, 215th people, they're, crossing moving traffic and then the national park. We have the cul-de-sac and the drop-off area or the around the park, which is used as a informal parking area at the best of times, but would obviously be a bit of an attractant for parents waiting to idle cars. So the questions to the community tonight are really. What is the plan for the existing school parking zone on West 215th street? That's already there at the school. Are there any changes planned to that street? How does redevelopment of former first house play into the traffic expectations for the complex? Has there been any disclosure by the developers to their plans to partition the site and redevelop it and by definition, two-thirds of the middle school students will be coming from the two other campuses? Kingsbridge definitely has some good transit options, and my son is in the seventh grade, and he goes to my older son- goes down to Css, seeks to subway so sure middle school students will travel independently, but east Harlem is quite challenging to get to and from Inwood. So in terms of independent travel. What's really realistic to expect and can the so for the committee? Can the committee support a resolution asking Dft to study the stop signs, speed, humps etc, especially at those two corners now, rather than wait two years to improve the safety, pedestrians I.e, wait for the school open experience a year, problems experience a year of developing solutions. You know it's pretty clear what will happen there and then. Finally, the experience with local schools suggests that all the best intentions in the world are maybe not enough when it comes to that parental need to drive to the front door of the school, and the committee will remember the experiences with psms, 780 and ps18, where my other son goes to school and where 219th and 220th streets over a long period of time, we were able to convert those streets to one way to better manage the traffic. The problem here is that trick was already played. 2:15 was long ago. Converted to one way amber is also larger at the 923 students on their charter application than those two skilled schools combined. So it's a very large population. So if there are problems when there are problems, what is the mechanism for reporting those resolving them? How do we avoid? You know three, four years of back and forth with committees and DOT and everything when there's such an obvious issue that is before us? Thank you all right, thanks, Dave, okay, sorry I just want to give it a minute to repopulate so I can see the participant list. Okay, I have some questions. I don't know when it's okay, sorry, okay, so that was Jay. Do you want to start us off start the committee on some background? I believe this is the same location where the good folks of Inwood objected to Luperone High school located 20 years ago. I, don't know whether- and there was a big outcry and complaints that property values would be destroyed by having a public high school located there I don't know if those same objections exist among the same people who are still in inward or not and I, don't know if they should exactly be a factor in our considerations. But I did want that history to be brought out to the committee. Now the other question I have for the Amber charter. School is simply because I believe the last charter school that the board as a whole voted on pulled the fast one on us and didn't explain that five businesses employing many local residents were located in the building which they wished to occupy. So only because of that, I'm asking this question: I probably should have paid attention beforehand, but okay being occupied at present of people being painfully employed there Jay. Let me just jump in because I don't think this is so on the first point you know you've heard the total of public testimony that exists to date and we're going to hear more from the public. So in terms of what might have happened in the past. That's not what's happening here as far as we know, but somebody may pop up and say something right now. The second thing is there will not be the this is not this. The community board has no role, nobody is approving Amber or they that this is no. This is not. We do not need to resolve. We have and I will say that what you described is in the context of a BSA, and we can have a discussion about that offline about what that includes and looks like and what it doesn't look at. But we asked Amber here because you know, because we have seen when things go wrong with a school. That's not the census doesn't match what the streets can support, and so they are here to answer questions to the best of the ability. But this is not there's no BSA. There's no board action, that's required, so they. You know what I'm saying like. There's, not a formal thing we're just. We wanted to ask some questions and they've made themselves available to come to the committee, so we can understand better what might be the streets impact. So I'm sorry just going through in the committee any buddy else, Mariella hi I just wanted to thank Amber for coming. Christina and I have been going back and forth and I also am an educator and so I think it's exciting to have a school. You know in our immediate neighborhood I, just I wanted to ask and I know that you don't have your students yet. But can you explain a little bit more about the staggered entrance and the staggered dismissal and what staff you'll have to supervise that like? Where do you anticipate putting your people to manage safety during those two times, you're? Muted. Thank you. The eternal question right these days. What we've done in the past is that we have a backer schedule for different grades, and so they arrive at different times of the morning. We always have staff situated right in front of the entrances where the children are accepted. We anticipate that we have already asked for crossing guards to be assigned to the 215 at the top of the hill and at the bottom 2:15 at park jerseys and 215 apartments West. We do anticipate that we will have families walking up the hill and walking in through those entrances we until we have the number of children and where they're coming from that will and the travel that way that they're going to be traveling. That will inform a more detailed plan. Until we have that information, we can come with more detailed plan. I'm sharing what we already do in our building. We always have staff at each one of the entrances and we owe- and we always ask for crossing guard to make sure that there is safety, can I just ask a follow-up I. Guess I'm asking staggered like 7:10 7, 15 7:20 or like 7:15 7 30 7:45 with large numbers of students. You know staggered is different, whether it's like a five minute increment or a 15 minute increment. I'm sorry, but I lost connection for a minute, so all I occurred was 15 minutes. Sorry, no I was saying you know, I'm wondering what are those increments when you say staggered so I have seen schools that say staggered and they mean like five minute increments, like 7:15, 7, 20, 7:25, 7 30, or are we saying 15 minute intervals for students? Well here here's the other wrinkle in the planning. Where will we be in this pandemic? Come September right. So what we've already been doing is we have been doing 15 minute intervals? Will it will we need a longer interval to make sure social distancing is in place? So those are some of the unanswerable questions right now that we need to address closely at the time of opening. We might need it to be longer, because we want to maintain social distancing because we haven't gotten the vaccine to everyone. Those are just some of the considerations that we're looking at and those are all new wrinkles that we are looking to accomplish. But right now we will be thinking 15-minute intervals. We are also going to have different a start time for the middle school students compared to the elementary school students. The elementary school students will start earlier in the day than the middle school students. The middle school students will start later in the day, so they won't be all arriving at the same time as well as a different grade. Do you expect to have children with students with disabilities? Is the facility accessible? It is a very old building. It is accessible for some disabilities. Unfortunately, not for all. Can you specify that I? It would not be. It has an elevator, but the elevator does not read all the floors, and you know it would not probably be good for you know. I can't. You know think right now of you know specifics, but I know that it, the elevator, doesn't control the floors and therefore the child or the disabled person would not to reach all the floors we have. Our east Harlem building is also a very old building, and it's not it's as accessible as our kings bridge building, which is much a newer building, and it obviously is ready and accessible Jim Berlin I think you've had your hand up. You I just have a comment. Many of us I think have had the opportunity to walk around that section of Inwood and drive around that section of Inwood and then so. This is a it's a double-edged sword on one hand the building was already a school, so it had some kind of traffic associated with this being a school I believe it was a high school. So that would probably mean all the students came there independently, but on the other hand and I think you know, Dave Tom makes a very significant point. The streets in that section of Inwood are astoundingly narrow and what I think we, as a committee at some point, should call upon the department of transportation to do and it's a twofold thing not only to measure the capacity the actual traffic on the streets now, okay and then see if there are any things that they can improve, but the other piece of it- and this is just maybe aspirational, but what we think, although we have very interesting things going on in 2020, but one would think in 2020 one could actually have software and again, this is aspirational that you put in a street map with the widths of all the streets and everything, and it can come up with some reasonable mathematically, calculated capacity for the streets. Now, maybe such software doesn't exist, maybe it does in DOT. Maybe D.O.T already has it but I think the other question insofar as DOT can give us. This answer is: what is the theoretical capacity of the streets without the rating of the streets which are get street? You know letters like letter grades if the traffic goes too slow without getting the traffic really slow, so those would be the two in for pieces of information. That would be very helpful for us in the future. Thank you thanks, Jim Gerard, I'm sorry did you have your hand up and Lyle? I'm sorry again. Did you have a question? Well more comment, but similar to what Dave had mentioned. Also Jim was totally based on. You know, people that are familiar with that location in those streets. As Jim spoke and Dave spoke. It is they are tremendously narrow and it won't be long before that area has all kinds of congestion and cars and populations that people that live around there are going to have to deal with. At what point could the school consider creating a car free zone? Maybe we're where no parents alike to drive up? Maybe everybody has to maybe from Iceland Street or walk up a hill or something like that to keep traffic out of that really closed. In area around the Park terrace area, because nothing short of that is going to prevent like the perfect storm of cars and traffic, it's not going to move. We all most of us know it's not going to move. We don't even need to study to tell us what's been happening, so maybe the school could be proactive and create a free zone, create a ring that says parent. You know we're all environmentalists now it's time to actually walk the walk, walking from Iceland Street walk up from Seaman Avenue walk up from Broadway with your child, because otherwise that is a very environmentally unsound plan. Thank you, Lyle. I'm gonna, just invite you I know to comment in a moment, but I. Just one thing that I want you to correct me on if I state this incorrectly about a question from Dave's presentation is that the DOE spots are no longer the DOE. No longer does those. So if you, if a building, has them they're grandfathered in but there's no such thing as like teacher parking anymore and so, but to the extent this building has those spots and those spots remain so Lyle. Correct me: if I'm wrong about that and I guess, if you had any reaction to Jim's points, I would just put a finer point on if you could respond to like separate and apart from the school. There is this issue that Dave identified and others have echoed that there's no crosswalk at the top of the stair Step Street and so like. If you could respond to that, like there's some things, potentially a stop sign, and certainly a crosswalk, but probably both that don't really have to do directly with the school they have to do with a need now well. In regards to say the speed bump request: I guess you can bring it individually. The Unt can look, let's see if speed humps, you warranted. You know in this area, independent will bring up the school you know will be in existence. I produce you in the park. You know we can you can do it independently of the school being there in regards to the stop time, that's a little tricky. We would wait until the school is open in this instance in order to make a determination because he wouldn't be able to warrant when the stop signs. If stop signs would be necessary there until we see what the increasing traffic would be once the school is open, so we would have to lean to the school's open. So we could determine that we wouldn't be able to get ahead of before the school opening may be able to look at it from a different perspective, and it may not be around you know: I mean it might meet certain parameters before the school might leave Jim powers after the school and then since it's going to be better tweets after the school opens. Since we know it's coming in order to make those determinations to see if the stop signs are feasible and in regards to the lane markings to the crosswalks, we could take a look at also in the meantime to see if those are feasible. So there are things that we can do you know independent of the school coming in. You know just to see from the general traffic and safety standpoint. If those are things that are necessary- and you know sorry- I'm I just it got a little patchy when you were responding to the issue of the crosswalk, like I'm, not sure why there's no crosswalk there anyway, but like what did you say now, I say we can take a look into seeing if a crosswalk is warranted there also I, don't think we'd have to wait until the school's in session. In order to take a look at it independently, like I said, there are some things that we can do independently. You know prior to the school. Getting there can be one of them that we can take a look at okay, so that do we need to do anything to get you because I mean that's a street. A Stair street is a street, so I was kind of like that. There's not a crosswalk seems strange, yeah, I wouldn't say: if anything we can. You know we can treat it as a separate issue now and yeah I can take a look at that. Independently of you know, what's going on, you know there what's upcoming. As far as you can do that the very least okay do I, have anybody from the board I know we have a few board members who are not on Tnt who had any input before I moved to move to the members of the public. Okay, I'm gonna Sally did you have something? Okay, I'm just gonna hop to Allegra, because I know she's been waiting with a question: Allegra hi, thanks Debbie, so I did have a few questions. I know the DOT says that they haven't studied this quite yet, and yet there are some pretty basic traffic flow models that you can find determine the maximum number of cars that can pass through any given section and if you put a reasonable drop off time to this section, you only get about 200 cars that can pass through. If your drop off time is something on order, 20 seconds, which I think is being pretty reasonable. So I have a question about: do you anticipate there being less than 200 drop-offs per hour, because that would saturate our streets? My other question is respect to special needs like. If will you have a full 20? That's representative of Department of Education in general and for special education, children who already live in the neighborhood and have door-to-door busing. How will your impact on traffic prevent them from getting the transportation services that they are required by federal law? So, for instance, let's say you cause traffic to slow down and cause an extra 45 minutes of transport time for my child, but she has a 60 minute, limited time travel on her Iep. Will you deleteriously impact my child's education by virtue of the additional traffic and I think we should discuss more these ideas for places that don't have such narrow streets being alternative drop-off locations, I? Think in the chat box, my neighbor suggested to 18th street semen might be another one, the bottom of Broadway but other places that don't have these really narrow choke points where it is past possible to pass idling vehicles or parked cars or dropping off cars. Thank you, so I think we definitely consider all of those other options. You know as drop-off we're going to consider them and we'll see what we can do and how we can manage that so yeah. Those are great ideas and we welcome them. Dr Blackwood did you want to comment for our streets? Surely the DOT has a better bottle than this green shells 1935 that I'm using that gave this number that I quoted. Surely you have an estimate for given a particular drop-off time in seconds how many cars per hour can fit through a street? This isn't rocket science, it's just some 101 statistics for freshmen, okay, I can go back and ask if there's anything we can do ahead of time. Like I said it's probably going to be best as the school is coming in, take the combination once we, whatever traffic, would increase or not. No, this is not the question I'm asking you I am asking you specifically given the speed limit for this area 20 miles per hour and given a reasonable range of drop-off times, let's say 10 to 20 seconds. What are the maximum number of vehicles that can pass through this section per hour? It's not rocket science, you don't need a traffic study. You just need a simple model. This will give you something on order two to three hundred and that's the number I'm looking for from you. Well, there are also federal guidelines when it comes to a stop sign inside this could be modeled. So there are certain governments have to be adhered to. I don't have information on me now again, I can take. I can go back to my colleagues and see if I can get the information, but it's much more than just taking a model and making a guest like I said: I can get some information and see if we can do something ahead of time. I don't know if it's doable between the current situation, all right Allegra can I. Just ask you to just monitor the tone. I mean we don't just, let's all just be kind to each other. It doesn't need to be so I'm sorry. This is my science voice. This is how scientists talk to each other. Should I ask successes and yeses and like hedge myself, like women, scientists are at what to do. I mean there's nothing mean about. This is how I would examine one of my co-workers. So there's no hard feelings here: buds I can see. That's how scientists talk to one another, maybe they shouldn't, but they do all right. Do I. Have anybody else. Let me just scan okay, so I think and we'll say a couple things one. You know thanks again to Inwood charter for being here and sharing the plans with us. I mean I. Think a lot really does hinge on that percentage of kids that are arriving by vehicle versus by on foot or coming off public transportation. So by the time they get to the building it's on foot. Thank you to Dave Tom for as usual, having very detailed and complete information about facts on the ground and helping us be as planful as possible. I. You know we can't, or you know it's not my view that we resolve and act on things that are prospective as much as some people would like us to meaning. We can't request a street change for something that hasn't happened. However, I think that some of the things that have been highlighted here tonight you know again as it relates to the intersections on 215th. You know at both Park Terrace East and Park Terrace West, but certainly at the top of the stairs stair portion of the street are things that are situations now so, while I will I do hope that we can have a conversation about why it's not there and what it take you know and what we need to do to look at that to see if it can be there and I guess I would just you know, ask amber that as you get more visibility into the census of the school and that split between walking distance and public transportation and vehicle drop-offs that we always welcome. We welcome data here and we'll be pleased to hear about it because again, as you all know, because it sounds like you're all from the area and certainly Dr Bustie's from right there. You know our narrow streets, and this isn't the place only place that has them, but they are really narrow up there cause us all sorts of heartache and we're all you know everybody's trying to get where they need to go, and we see what happens now at 157th and into Riverside. We have narrow streets and it's certainly something that we need to keep an eye on here, because it's you know this is a lot of little kids and they're not coming on their own yeah I just want to say I mean it sounds like there's a lot of like the initial planning going on with the logistics and I would just say. You know, I hope that one possibility is to create some neighborhood committee or coalition or something to help run by some of these ideas. I think it would be a good move to build community trust and I also think it might help with any blind spots that might happen in moving through, like the general logistics of a school, given the unique nature of this neighborhood, as you know, from living here. So you know, I just want to offer myself to be a part of this committee. I've lived on Par, Terrace East for 15 years. I've also been a principal for 14 years. You know to help go through some of these pieces just to help with some of the possible challenges that you'll see Mariela I. Thank you very much for off that offer. We will take you up on it for sure Mariella, I'm just gonna, say ditto! Thank goodness, and you know, I really appreciate your initiative on this and then offering that all right so with that I. Actually, since we already did updates on new business and old business, I would like to motion to adjourn this meeting. Do I have a second thanks, Gerard all right! Thank you. Everybody I think I'll see everybody from community board quite soon at our general meeting. Please everybody stay safe and healthy, and you know wishing those of you that I don't see next week happy and healthy holidays than a better 2021. All right, bye, everyone all right, bye, hi, bye, Mariah! You.",
            "summary": "And, I'm, sorry to repeat myself for those that were able to hear Richard Allman is going to lead us in a conversation about Bennett, Avenue and renaming.\nI just put a cop, a link to that article in the chat discussion has happened in a number of places and we have two things named after James Gordon Bennett in the neighborhood Bennett Park and Bennett Avenue.\nI'm here as a member just to raise this as a starter issue with the transportation committee over whether we would want to look at proposing a renaming of Bennett, Avenue and I.\nAnd I think it's time to open up this discussion to see what other thoughts there are over, whether we might want to consider a proposal on the renaming or co-naming thanks, Richard.\nMy thought is that when we talk about renaming or co-naming, however, the parlance that it would mean, in this case, similar to seventh Avenue, that both would still be operative in terms of mail, because I don't think anybody sees it as an option to not to have somebody not be able to receive mail at the address that they've always been able to receive mail.\nThis is much more preliminary, obviously a little more on that, if I may, when the discussion, when Parks Committee had its discussion last month, the representatives from the Parks Department said, If you're going to propose that this park be renamed, I think that's probably part of what we all like.\nI mean you know the other thing I just thought of by the way, Maybe two.\nHere, I think the one other that we all ought to try to do is to find a way to connect with people who live or run organizations on Bennett and make sure do our best to see that they're at least some part of this discussion.\nDo agree that maybe some type of plaque that explains everything that happens could be placed like at the park, but I would rather go down the path in terms of renaming the street not trying to co-name the street.\nAnd I just wanted people to know that I think parks, Liz and the Parks Committee are very focused on that aspect of that context and that I think we can presume that whatever happens on the park side will be robust and that, on the street.\nI'm a little concerned about the ease in which we are glibly discussing changing a street name, and this really needs to be a community discussion, not a traffic and transportation.\nSorry that I didn't capture that anyone do we have somebody on the phone 9175, something that wanted to say, something, I, think what we've got coming out of this is all of us, giving some thought to just best course forward for people who have had particular proposals around technology around blacks, anything that can be done to gather more information in the next month or two.\nLyle is going to do some background at D.O.T, I'm glad to do some contacts along Bennett and at least make sure that people down there are brought into the discussion and would encourage Edith or anyone else who wants to be part of that out.\nThat is the opportunity for all of us to see a draft of what they're thinking for the rest of Manhattan above 184th street and like last time, we will.\nAlso gotten we've heard from like a community member who said you know, there's also some issues with the way like the safety of some of the crossing, signal, etc.\nLike the you know, you, the work got done, but then, what's the look back process to make sure it's doing what it was intended to do and not having unintended consequences.\nYou, know, community boards resolve on street changes like this that were designed to improve traffic flow or pedestrian safety or all of the above.\nSorry, a no standing zone was implemented on Friday and Saturday, and so far people are not realizing it's an outstanding zone, and so as of right now, As far as I know, thanks to Bruce's real-time data people are parked there, but the other thing that is true is that the way it's signed.\nWhat you look for is the next sign like that speaks about parking, regulation, You, know, Asp, Alternates, Street, Parking, sign.\nSo, but, So I think we'll need to follow up to make sure that traffic enforcement knows about the new change, but.\nThe he's, been the point of contact for many of the residents in that area and has done an amazing job over the past month of receiving the feedback and keeping things moving and getting questions answered and feeding information, back, and so thank you, Bruce.\nThink I'm going to give us like a five minute break and then have us come back.\nWhen, the okay, If you're, trying to cross Saint Nicholas, say you're running for the bus, vehicles are coming across 167 and making the right turn and the buses are sticking far enough back to be covering the crosswalk and the walk signal, and the problem seems to be when there's an m3 laying over at the 168th street end and then so.\nYou know how we're looking at it making sure it's working in the way we want it to work, and all of that, So maybe we can connect on that as well.\nWe leave this issue, I'd like to see us, And I, think you pointed towards part of it an overview of what's happening with at street buses.\nYou know where we can, if we think there might be an issue.\nI want to thank Mariella Graham, one of our newer committee members, who took really took the initiative with this issue and making us aware, along with Dave Tom from the community.\nWhat I'd like to do is hand this over to amber charter team and then to present, and then I'm going to ask give Tom from Inwood owners to just take a couple of minutes and share with people what he has shared with us about the area as well.\nIf it doesn't, Who knows so as she shares the screen, you will meet Anna Vargas who's, the founding principal of Amber Inwood.\nWe'll get started good evening and thank you, members of the traffic and transportation committee for giving amber the opportunity to present today.\nCome, true for us, but nevertheless the facility on 187th Street didn't lend itself for us to go to a K-5 school, and so we found our permanent home in Kingsbridge, which is not too far away, and there we serve our students in a k-5 setting, and.\nYou could just see some pictures of our students enjoying music class along our music teacher and truly enjoying this experience of loving, to learn and loving to come to school, and now I'm, going to turn it over to our executive director Dr Bossie Dr Rusty.\nInwood I, actually live on Park Terrace East, so everything that's going to happen is going to impact me directly and therefore I have a special interest in making sure that my school is a good neighbor.\nMy great pride in opening up our school in Inwood comes from providing families with choice, especially because growing up in district 6, schools, I often wondered you know about which other opportunities or what my life would have.\nTo make sure that priority is given when our student lottery and our children are selected, We've decided not to have busting, because we know that the streets are very narrow and therefore to add busing would create even more congestion.\nWe can also support the community if they choose to advocate for a four-way traffic, stop at the corner of 215th Street in Park Terrace West as a way of being able to help with the traffic.\nWe, want a good neighbor and be able to offer a wonderful education for all community residents and through our school.\nI. Think I'm, just gonna ask two specific school clarification or like specific data, questions.\nAnd, then I think we'll move on to Dave Tom. The split between two through five versus the middle School, Six through eight like.\nYou know local children who are interested in a middle school or an elementary school, send them to Inwood because they're within walking distance, and then we wouldn't necessarily have the issue of the additional traffic right.\nTerrace, there's no way to actually cross this street as a pedestrian coming up the stairs without stepping into moving traffic.\nPark Cul-de-sac, if you didn't want to theoretically cross the street and so for an elementary school population.\nWhat is the plan for the existing school parking zone on West 215th street.\nSo sure middle school students will travel independently, but east Harlem is quite challenging to get to and from Inwood.\nFinally, The experience with local schools suggests that all the best intentions in the world are maybe not enough when it comes to that parental need to drive to the front door of the school, and the committee will remember the experiences with psms, 780 and ps18, where my other son goes to school and where 219th and 220th streets over a long period of time, we were able to convert those streets to one way to better manage the traffic.\nWe asked Amber here because you know, because we have seen when things go wrong with a school.\nThe streets in that section of Inwood are astoundingly narrow and what I think we, as a committee at some point, should call upon the department of transportation to do.\nEverybody has to maybe from Iceland Street or walk up a hill or something like that to keep traffic out of that.\nYou could respond to that, like there's some things, potentially a stop sign, and certainly a crosswalk, but probably both that don't really have to do directly with the school.\nYou know we can you can do it independently of the school being there in regards to the stop time.\nYou know independent of the school coming in.\nI know the DOT says that they haven't studied this quite yet, and yet there are some pretty basic traffic flow models that you can find determine the maximum number of cars that can pass through any given section, and if you put a reasonable drop off time to this section, you only get about 200 cars that can pass through.\nLike I said it's probably going to be best as the school is coming.\nYou know thanks again to Inwood charter for being here and sharing the plans with us.\nHowever, I think that some of the things that have been highlighted here tonight you know again as it relates to the intersections on 215th.\nAnd, I, guess I would just you know, ask amber that as you get more visibility into the census of the school and that split between walking distance and public transportation and vehicle drop-offs that we always welcome.\nI think it would be a good move to build community trust, And I also think it might help with any blind spots that might happen in moving through, like the general logistics of a school, Given the unique nature of this neighborhood, as you know, from living, here.\nSo, you know, I, just want to offer myself to be a part of this committee."
        }
    }
}