{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "title": "MCBFull Board Meeting",
            "publishDate": "2020-12-03",
            "shortDescription": "",
            "lengthSeconds": "3:10:50"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "u0k0GwbtE0w",
            "fillerWordCount": {
                "uh": 451,
                "um": 415
            },
            "readTimeFullTranscript": "112 min read",
            "readTimeSummary": "16 min read",
            "wordCountFullTranscript": {
                "housing": 42,
                "test": 39,
                "testing": 39,
                "income": 29,
                "street": 28,
                "state": 26,
                "schools": 24,
                "agreement": 23,
                "health": 20,
                "school": 20
            },
            "wordCountSummary": {
                "testing": 13,
                "health": 9,
                "street": 9,
                "test": 7,
                "trace": 6,
                "cases": 6,
                "schools": 6,
                "shelters": 6,
                "income": 6,
                "school": 5
            },
            "fullTranscript": "This hi Martin I feel like a last-minute understudy, might get pulled on stage. I'm not seeing our esteemed chair I have the stage jitters, but I definitely think you should start stretching Rob Walker I got kicked off again. Oh man, I'm sorry rob it seems like every three minutes. I'm getting kicked off again. Jeffrey rehearsed for the future. Exactly Rob. Are you still with us yeah, but every three to four minutes: I'm getting kicked off. I've already been kicked off nine times now. What number are you using? The two? Nine two, the two nine two: okay, the nine two, nine, the nine two, nine okay, there's another New York number. Let me try to get that to you in a second six, four, six, five one, eight. If I get kicked off again I'll try that number yeah try the 646 number. Okay! Thank you all right. So Lola's having some computer issues, we have a quorum. We do have quorum so shall I. Since we have the presentation shall I call the meeting to order yeah hold on one. Second, Lowell is yep. That's what lol just directed me to direct you to do so? Oh man, if I'm gonna, step off and do hair and makeup and I'll be right back I'm just kidding good evening, everybody temporary stand-in, welcome to the December meeting of Manhattan community board 4. My name is Jeffrey Lafranco, I'm the first vice chair standing in at the moment for our chair and with this I'd like to call our meeting to order we'll be starting out tonight with a presentation from the health and hospitals, Corporation's test and tracking team Jesse are the folks on the line they are in the line. Before we go into the presentation I just wanna. Can we just go over the instructions for the members of the public in terms of how to notify you if they would like to ask a question? Absolutely I'm happy to do it. If you want me to that's fine I'll I can just do it very quickly, go ahead and do it. Okay, so folks, who are in the attendees section members of the public, you should be able to raise your virtual hand, that's under participants, you click on participants, and then you should have the ability to raise your. It should be, it's normally a blue hand, but it might be a different color, but that's how you'll notify Jeffrey. If you have a question or anything like that for the presentation after that, we'll be going into a there's a hearing and then after that there's the public session. So if you'd like to speak at the public session, please keep your hand raised, as we do cut off sign up for the public session at 6:45. thanks Jesse, that's it for me! Thank you. Both welcome Mr Chair computer issues. Anyway, Jeffrey, it's your show. Let them get started sure hold on I'm sorry, okay, on the bottom, Jesse all the way over something's, really messy. With my screen all the way over there you go yeah getting close. No, but I want to be able to see. We should be able to watch the whole thing you can make the full screen on the bottom. You got to go to presentation mode, Jesse, I know, but I can't get there. Is it possible to send Chelsea another link she's having a lot of trouble getting in yeah? We seem to be having some major technical difficulties here. Yes, see the icon above the p, for powerpoint on the bottom. That should work she's trying to get in with her email, but it just it won't let her get past the login screen presenter view. Now that's going to give you the notes very bottom up there you go yeah, no I have the same issue. Maybe if she joins as just join meeting instead of logging in with an email, yeah Jesse where you were, but you want to go to not to present your mode but to slideshow yeah, no I get it. I'm sorry just they're gremlins in the air tonight, folks yeah they are I, can't they're, okay hold on one. Second, I'm sorry, folks, I'm sorry Laura, I'm sorry who's having difficulty getting on Chelsea I'm coming yeah, I'm trying! Yes Jesse! I'm gonna make a suggestion. We have a public hearing on a physical culture establishment Betty. Are you doing that well Jesse, while you're messing around with that? Let's do this public hearing, because I don't expect there going to be any speakers. We got Chelsea by the way she's on right all right, so the public here yeah Paul you're, going to do the public hearing. I am and I have Betty on the phone because she can't log into the zoom thing. So all right do the public hearing and then we'll solve zoom problems. Okay, Betty I'm going to do the public hearing I'm going to put on speakerphones. You can hear me so welcome everybody, I'm Paul Devlin Co-chair of the Chelsea land use committee. We have an application for physical cultural enterprise on 217 7th Avenue. It's a basically a gym, a mind body project we Betty and I did a tour of the facility we have then written met with the applicant. Had a hearing public hearing at Chelsea land use and the Chelsea land use has taken a vote to present at this at tonight's meeting. This is the opportunity for a public hearing for anybody who wishes to speak on the application. We did receive two names of people who had registered to speak at this particular public hearing, but I'm not convinced that they were registered for the right part of the meeting. So if there's anybody who does wish to speak on this application, please raise your hand in the chat. Box and Jesse will be able to move you over. So you can speak. I am seeing a lot of raised hands in the attendees list. All those are all public speakers. Many of them excuse me for the standard public session. Many of them are on my list already so I think they're not for this hearing. Okay, if anybody is I see there are a bunch like Chris Stockley I see hands raised if there is a hand raised that you do want to speak on this issue as opposed to the public session. Please put a note in the chat box. If you can and then we'll be able to Jeffrey, do you have those names, I'm going to call I'm going to call the names I have for public session, but just make sure you if you've got the four names here, I'm gonna ask everyone to put their hand down, and then the newest person is Christopher Stockel. Otherwise, I have everybody with who has a hand up at the moment, all right, so everyone, if you've, got your hand raised. Please put your hand down. We've recorded your request to speak all right, Elka David Christopher, please put your hands down the only person. Christopher is the applicant, so I don't know if he wanted to say something at the end. All right, well I, want everyone to put their hands down and then, if you want to speak on this issue, re-raise your hand, if your hand is up now you're speaking on the physical culture establishment, not during the regular public session, so Christopher is here so Chris does want to say something all right: yeah Jesse can you move Chris over I can and then I see somebody logged in with a phone number ending in 290, whoever that person is, if you do wish to speak at this hearing, please lower and raise your hand again so we'll be able to monitor that. Thank you. Chris is being moved over now that might be Rob Walker again, but Chris should be moved over all right. Thanks, Jesse I know you're juggling something Christopher you have to unmute yourself there you go hey everyone. How are you I'm Chris Stockel, I'm the owner of Mindbody project, the applicant for the pce, I'm just here to answer any questions that may come up here. If there aren't any, I'm happy to just sit in and listen very good. Thank you, Keith that looks like a nice robe near spa all right, I'm not seeing any other people that are really wanting to come and speak on this issue, so I am going to close the hearing. That's the end of that. Thank you. We'll present the letter at the full at the business board of the meeting and we'll have more discussion right then. Thank you. Everybody can I just confirm this and confirm the phone number. That's in the attendee section, I believe that's Rob, Walker I just want to bring him over. If that's and make sure David Pincus didn't want to discuss the Pca I believe David, okay, Alex is also on and as attendees you could bring her over. I'm sorry, it's in the attendee section got it I'll bring it over in a second. You know. Folks, we've been with you on the phone is that you rob yeah oh bet, is that Betty dialed in is that your last? Are you 917, no okay, hello, hi? Who is this hi Paul? It's Alan, oh okay, Alan! Thank you! I'm having a pro, no I'm having a problem getting in I'm only on the phone, all right, we'll deal with you in a minute, all right, no I'll wait you're on no you're fine. Okay! Now let me get Sarah mills all right and David. Pinkis is all right. That's good! All right! So that hearing is closed now Jesse. Are you ready to go to the test and trace while you're cleaning, this up, I really hope so correct? Let's see if we can get test and trace up folks, we've been doing these meetings since March remotely, and this is the first night we've ever had any real issues. Okay, that we beg your patience, all right, test and trace good evening. Everyone Chelsea, are you on too unmute yourself, if you're on, say hi, I'm here where you are: oh you're, Masha, okay, I'm Masha! We had a few identity changes in the middle of this, but we're ready now. So thank you so much for having us tonight. You know really important for us to go around. Make sure that folks have good information, there's a lot of really confusing information out there and we want to be a part of making sure that is not the case. So, as you can see, from this little snowman mask wearing is going to be a large part of this presentation and what we talk about and we're ready to go into the okay. You want me to take it away: Laura great, so I'll introduce myself, I'm Chelsea Cipriano, I'm the executive director of intergovernmental affairs for the New, York, City, Department of Health and mental hygiene. Thank you for having us as Laura said. We're really happy just to be here and share information. We'll try to move through this as quickly as possible. Just some simple, slides directing you to our site, showing you how to access things. There's a lot of information out there and trying to figure out where it all lives is sometimes the biggest part of the battle. So this is just to kick us off. Just making sure folks are aware of the Copenhagen zones that were announced by the governor in early October, and this is the city's zone. Finder map it's at myc.gov forward, Slash Covid-19 zone, so easy to find. I'm also link it at the end of the presentation. If you go in here, you can put in your address or where you live, where you learn where you work, where you play and see if it's in a Covid-19 zone, so the zones change pretty frequently so check this often, if you are in one of the areas, that's in a zone within the zones, there are certain restrictions for schools and businesses and if you click on any of these areas, this is a screenshot, but in online it's interactive. You can see all the restrictions for those areas and then it also links to more information about the states how they at from the state about how they determine the zones, what metrics were used and how folks are moving in and out of the zones. So that's, obviously y'. All's community board is not impacted by the zone by the state zone right now, but people do work and go to school in other parts of the city and are so we wanted to make sure you are aware thanks. So this is really why we're here today, I think folks know from the news and from hopefully from the mayor and the governor being out there talking about it. We are really worried. The data for percent positivity for cases for hospitalizations are all going in the wrong direction. Nationwide and I. Think parts of the country are in their second and third waves now and are really seeing the impacts to their hospitals, to family, to friends to loved ones. A lot of what we experienced in March and April others are experiencing for the first time and we don't want to go back there and these numbers are really bothersome and really truly translate to impacting people's lives their livelihoods. We know it's been really rough here for businesses, and so keeping these numbers down is key to keeping New Yorkers healthy and New York City open in general you'll see here. I just want to really flag this for folks, because we've gotten some questions where the line dips down at the end of this graph. It is not actually a downward trend. It is an incomplete week of data so where this trend line goes next is actually heading up, which is the wrong direction and we want to drive it down, but that gray bar is just indicating an incomplete week, but we're doing this in such real time. We want you to have the latest. That's what you're seeing there this map online is on our website at Nyc.Gov, Forward, Slash Health, and it's super interactive. You can see kind of like along all of those points, little pop-ups and interactions. This is again just a boring, screenshot same thing with the map on the right hand, side you can see it's like a heat map and, if you've been on our site to play around, if you're a data nerd like me, you can dive deep into the data that this map is showing in terms of percent positivity and cases and hospitalizations and other metrics, basically from since March, and you can see trends over time. Okay, as I said, hospitalizations are also increasing. This is really why we are here to sound the alarm and raise awareness, and we know a lot has been asked of New Yorkers over the last really 10 months, and we are here to ask more of you really in partnership as community leaders. This is all data on the website. We just wanted to pull it out for ease of viewing tonight. This is what we're seeing in Manhattan. Obviously this is the whole. This is the whole borough. So you know your zip codes are in here and I. Think, just seeing it in more of the context of the borough in general to remember that Covid-19 doesn't res, isn't really respect zip codes. We are in a place of community transmission that just because you know a zip code has a low percent. Positivity right now does not mean it's time to let down our guard. We have seen this spread extremely quickly. This virus is terrible, as we all know, and it really does not respect geographic boundaries. So we really wanted to show you all the data all in one place so that you can really contextualize what's happening around you and obviously take action as necessary. So we can pause here if you want to take a look or go to the thank you Laura, you want to hop in and talk about the testing resources that we've brought to the borough so far, yeah thanks so much Chelsea, so I want to talk about test and trace, is really three programs. It's test, trace and take care, and so I want to talk a little bit about the different pillars of the program and then I'll talk about the specific resources in community board. For so part number one of the test and trace program is just that testing I like to do a little bit of a history lesson. When I talk about this, you may remember back in the dark days of March and April. If you wanted a Covid-19 test, you had to have traveled to one of a very few specific countries and had to have had very specific symptoms. We now know that you know traveling to one part of the world or one zip code or one borough is not indicative of whether you're going to test positive for covalent and that there isn't just a single set of symptoms. We know that Covid-19 can express itself in all different types of physical manifestations, and sometimes it doesn't express itself at all or not for a long time. So what we really chose to do was to pursue a mass testing strategy for a number of reasons. When we are able to test on a mass level, we are actually able to understand what the penetration of virus is in the community. So when we talk about community transmission, you know we want to know. Does that mean that it's widespread, that you know basically all interactions? Sorry, what are you saying? Oh sorry, yes, Jeffrey I will repost it to all attendees and presenters. Sorry keep going! No, it's! Okay, I! It's a bad habit of mine! That I read things as I'm talking. That's okay, Laura I can do it live while you're doing it while you're finished Chelsea. Thank you, my best, wingman, okay. So sorry, so again, mass testing, it's important because we need to know where the virus is. We need to know how high the threshold of transmission is, and we also need to make sure that people who are testing positive have all the resources they need in order to isolate themselves so that we can break the chain of transmission. So that gets me to our second pillar, which is called trace, is the one that I think we hear about all the time. People have a lot of ideas about how it looks what the model is. There are different versions of trace that different countries have chosen to use the one that New York City uses is about identifying a person who tests positive. That's easy to do. They went, they got a test. It came back positive. It comes into our system, they are called by a tracer. The tracer is not necessarily looking to see where they contracted the virus from because it's really hard to know you know, Covid-19 doesn't have. As we said, one set of symptoms. It certainly doesn't have a obvious pattern like, for instance, a chickenpox type of virus does so it's really important that we treat each case as the first case instead of treating it as the second. So when the tracer calls one of the things they want to know about is who you are in contact with, because they want to make sure that anyone who you could have been in contact with when you are infectious is also receiving the suite of services available. So you're, not just testing yourself to understand if you're positive, you're, also testing yourself to understand. If you need to receive services to help you isolate and if people who you are in contact with also need to receive those services. The whole design of the program is to ensure that you have everything you need isolate or you know if you need advanced medical help so get so really. Testing is really where it all begins, but it's certainly not where it ends. The other thing I think we can say about trace that we know at this point is most cases where people know how they receive how they were infected with Covid-19. It happens in a home. It's what we call like dining table transmission. That is, you generally know when somebody in your own home has tested positive. You may not know if you know you went to the office or if you went to do some, you know indoor dining or you went to a gym. You might not know that. That's where you contracted Coved, so in fact you probably won't, and so again it's really important that tracing is forward-facing. It's about figuring out who you, as the first case, were in contact with and then unlocking those resources to support your isolation, both for yourself and for your close contacts, and so that gets me to the third pillar, which is take care, so take care is about and we have those slides coming up a little bit later on. You don't just skip ahead. That's okay, take care is about unless Chelsea do you want to jump in here and then I'll come back to take care just because we have your slide up. Are you back? I'm sorry if we jumped no, that's okay, I, I'm jumping a little too Chelsea, you're, muted, oops! Sorry was I, mute talk about take care and what it is, and then we can talk about it with that context, as we move through the guidance so take care. Is this suite of services that we want to make sure every New Yorker knows they have access to in case they test positive? So when you test positive, you know a lot of scary thoughts can go through your head. You know, certainly we all watch the news we've seen for 10 months. You know in a constant marathon way, all of the worst case scenarios of this. What we want is to assure people that this is not something they're going to do alone, they're going to do it with the help of New York City, and that means helping you to evaluate if you need a place to stay. If you can separate in your house, even if you can separate in your house what are the things that you need in order to never have to leave or not leave for your 14 day quarantine. Is it food delivery? Do you need a dog walker? We've tried to think of just about everything you can possibly need in terms of services to make staying at home or staying in a hotel. Basically seamless on that I will hand it over to Chelsea and then I know, I'm my stuff is coming back yeah. Of course, thanks Laura I tried to drop in I, couldn't copy and paste your link, so I tried to drop in our key highlights if I miss anything, please drop it in I know: I, missed the holiday guidance and the traveling guidance. So if you could pop those in that'd be great, so this is an advisory that was put out yesterday by the health commissioner to older New, Yorkers and people with underlying health conditions. The underlying health conditions are all listed on our website. The slide just looked really crowded with it in there, so I didn't include it, but one of the links that Laura can drop in the chat or I can later is that advisory itself, and this is guidance because of the increases in hospitalizations and cases that we're seeing it's what we really need folks to do right now. It's not the guidance we want to give and not the guidance that people want to hear, and we know that we know it's been a really rough year and so telling people to restrict their activity and other things that are starting to feel normal or felt normal this summer, particularly around the holidays, is very hard and I want to validate that and acknowledge it. But this is what we need to do in order to keep these case and hospitalization rates down. This is the least fun of our guidance, and it pains me to have this be what we need to tell folks to do right now. But basically, this is the holiday guidance for the season. Don't gather with people outside your household and don't travel. Laura talked a lot about testing resources and it's so great that folks are getting tested so frequently and they have access to those resources. What we are hearing about recently is people using tests. Negative tests as like a passport and saying I, have my negative test in hand. I can go, do whatever I want now, and we really want to caution against that, particularly with travel we've heard, I'm maybe you have in your life as well. Anecdotally, you know from folks who are like well I got a negative test on Monday I traveled on Tuesday got a positive test on Thursday, and now I'm quarantining on my vacation and maybe infected others on my way there so I think that a test is a moment in time. It should not be used as your passport to go. Do whatever you want to go, see grandma. This is the year to make the holidays different. That's how we make a difference so that we can have a more normal holidays time next year. It is not what anyone wants to hear like I said this has been a terrible year and everyone acknowledges that, but this is what we need to do: to keep people safe and to protect lives. So we have some holiday guidance. We try to make it colorful and fun, because what we're telling folks to do is not fun, and we know that, but some alternative ideas, we've heard people get really creative I heard someone throughout the idea of bringing like celebrity chefs into people's homes via zoom, doing like virtual crafts fairs. Things like that will really go a long way this holiday season and help keep people safe. Thank you. This is just more of the not so fun guidance about, not traveling. This is all available on our site and I'll make sure that you all have it a link as well. We have a flyer version, and this is also being handed out a little bit more of like a formal looking legal version at airports and at transit hubs, so that folks know as they're leaving and coming to New York what they'll have to do when they return. This is all state requirements, and so, when you come back, you either need to quarantine for 14 days or you can test out of quarantine. I, don't really like to use that terminology, but you can test out using two negative tests at this cadence as listed below and for those on the phone. Sorry that I'm forgetting that folks on the phone I apologize, that's a test within 72 hours, prior to your arrival in New York and a test four days after your arrival to my point earlier, because a test is, you know a moment in time: evaluation! That's why you wait those four days after a potential exposure, I think that's I think should be good. I think this one is okay, so this is, if you've ever seen, Laura or I or colleagues doing any type of communications, or maybe you've seen this on subways and other places. This is what we call our core four, so the core four have not changed since the spring. Really, since we started pushing mask wearing the core, four remain the same stay home if you're sick I want to add to that. If you have been in contact with someone who has Covid-19 or have been diagnosed with cover, 19 or returned from, if you recently returned from travel like, we just talked about two keeping six feet of physical distance, three wearing face covering indoors or outdoors. This includes like, if you're at the office- and you can maintain six feet, you should still be wearing a face covering because we live in New, York City and it's very rare that we can actually maintain six feet with people for a very long time and then, of course, the lesson we all learned as kids, keeping our hands clean with Covid-19, that's more important than ever. I think these four things haven't changed and they're boring for a reason, but they work and then additionally, now with the increase in texting testing infrastructure, we also want all New Yorkers to be getting tested regardless of symptoms. Oh and really quick before Laura launches into testing, you don't have to go back, but on that visual we have that printed in palm cards in multiple languages, if y' all are having any type of like outdoor I stress, lowered outdoor events. For the community board or any type of flu shot drives, as we've been seeing, people have please let us know we can get you those palm cards to pass out, because they're, small and cute go ahead. Laurie want to launch into testing. So one of the critical questions we hear about testing. All the time is when should I get tested? How do I know when to get tested? Who should get tested so I? We think we made the guidance pretty clear at this point. Everyone should be getting tested and everyone should be getting tested pretty regularly. I know that's not an exact time frame, but you know I think the way to approach it is that there is no such thing as under testing at this moment in time. The there are certain folks for whom we recommend monthly testing. These are healthcare, first responders people who live or work in congregate, settings or residential settings and people who are consistently working outside the home and interacting with folks. You know you guys are on the list of people who should be adding this to your monthly routine for everyone else. If you've been in close contact with somebody who you know has Covid-19 or think might have Covid-19 go get a test. If you have attended any kind of large gathering, especially an indoor gathering, please go get a test if you've just returned from New York, City and you're on one of the lists you're on bureau, you came from a state on one of the states lists. Then you know please go get a test. We have tried to make testing access as easy as possible. We've done that through a couple of different means. We have partners all throughout the city who have been able to boost up our testing sites. They are all providing testing. You know completely free to the person seeking testing and no questions asked. Basically, so we have the h sites. We have city partners, we also have. We are running in 25 schools across the city right now, high schools. We have testing teams out testing the general public. We have mobile trucks that are ice cream style, so the team stands in the truck because it's getting cold out and they swab folks. We are expanding testing all the time. This is something we see as like. A core part of test and trace is putting testing in as many places as possible. It doesn't mean that there's going to be testing on everyone's corner, but it does mean that everybody should be able to access a test site without much difficulty. So I think we can go to the I'm mute and I think Laura that graphic on the right is on y'. All's, social media right so folks want to share it and like push that out, we have a bunch of social content, including social content, for not traveling, with, like full social kits, that you can just pull off of our like Google, Drive and use. If anyone is interested yeah and then this is this gets to the conclusion of the test and trace program, which is the take care piece. So when somebody tests positive and they're contact by a tracer one of the things they try to evaluate is if they can safely separate at home, and a person who can safely separate at home might be able to manage the staying in peace. But there's a bunch of other activities and complications that can arise from making that decision, and so we want to be there to support that. So we have a whole host of services that folks can access, whether it's food delivery or telehealth services. We can match them with an HRA coordinator to try to help them out through the services that have already existed in New York City there's help with domestic violence. We want to make sure that people aren't just separating at home but that they are safely separating at home. So I think we can go on to the and Laura there's a question in the chat about it: yep go no I read when I talk. I'm sorry, I know okay. So yes to this Paul Devlin kudos to you, because this is exactly where we're going. So when somebody tests positive for Covid-19 and they just and they can't safely separate from their family or from their roommates, which in New York City, is a very common phenomenon. You know they can receive a access to a hotel room. This is also true of their close contacts. So if somebody is in touch with a tracer and says you know, I share a bathroom, we have all of these shared spaces in my house, I, don't think I can safely separate. We will pick you up. Take you to the hotel. When you, your quarantine, is done. We can pick you up and take you back home. So again, nobody is ever leaving these hotels. This is not like a staycation, you are in the hotel room. All everything is coming to you and then this is also true for the close contacts. So I think we can move on to the okay I. Think the like the. What do we before we move on to questions I? Think the takeaway here and the like? What do we need you all to help us do because you are trusted community voices and folks are tired of hearing from us. That's the truth. People are tired of government this year more than ever they're. You know anxious for a change, obviously in the new year, but it's I think that you all are the best community voices that we have to get our messages across so number. One I think really sharing these alarming. The alarming data is really important. I think people like to feel empowered with the data at their fingertips, and so we've tried to do that for you with our website. We can for folks who are more. You know like into data stuff. You can download the data you can play with it. You can make different depictions of it. If you don't like ours and how to look at it, you can make it specific to your groups of zip codes, and so you can play with all of that on the website, but I think the message is the same. We just need to really encourage folks to understand that things are not good and we need to turn this ship around and improve these numbers, and we can because we did it one time and we can do it again. Two I think the holiday guidance and the travel guidance is more important right now, in this moment, ahead of a new round of winter holidays after Thanksgiving more important than ever. So we have those resources for you. If you would be willing to help amplify them to your networks. We just need to get the information out there, so folks feel empowered to know what to do like. Okay, you told me things are bad. What do I have to do about it? I think three: data guidance: okay, yes, core, four, so really amplification of our core four and remembering to encourage core four plus testing and cooperation with contact tracers. If they call you pick up the phone and then finally for all businesses, we didn't really go over businesses or business reopening yet, and I'm happy to answer questions about that, but for businesses, if you own a business or run a business or manage one that is subject to the reopening requirements for under New York state, there is a requirement for almost every setting at this point, including schools and others that you have to report a case of your employees if anyone tests positive and so what we've done for the city, you have to report to both the city and the state. What we've done is we have this number that you can call and report a case directly as Laura was saying, whenever there's a confirmed case in the city, we find out directly from the labs it gets reported into the you know: public health infrastructure, that's true for any reportable condition, particularly ones that do require contact tracing, and so once we get that you know notification tracing kicks into gear. This is kind of another on-ramp for a different type of investigation that has to do with the workplace to make sure that the workplace is equipped to do all the things that Laura was just saying, identify close contacts and get folks safely separated as quickly as possible. We know a lot of small businesses right now kind of well, particularly restaurants, who are familiar with the health department bristle at the word investigation and we've heard that a lot are really reticent to reporting cases. That's not good. While we do get the direct reports of the cases from the labs directly, we don't want employers or businesses to feel that they're going to get in trouble for having an employee who may be sick. All they need to do is call this number. An investigation does not mean that we're busting in the doors with health department jackets on it, means that we're going to work with the workplace to like I, said, try to stop transmission in its tracks and get folks safely separated as quickly as possible and back to work as quickly as possible. I think that's it. These are all the links that you need and they can get you to other links or we can always share more resources, we're here to help and answer your questions and just one final plug for two and two code. 19 I, think in not mentioning this earlier, but 212 Covid-19 is your one: stop shopping for all Covid-19 questions. If you need a hotel to separate in immediately, if you have concerns about where to get tested or you want to know the best place or the nearest place to get tested. Any number of questions like that they're a 311 exclusively for Covid-19, okay questions, so I see a question in the chat about formerly homeless residents in hotel, temporary shelters, Laura I, don't know about Dhs's testing protocol, but I think that's something that we can definitely follow up on and get back to folks with information about, what's happening for our New York residents in shelter right now, yeah so I know during the summer when we were still scaling up the widespread public testing sites. There was a program to test residents of homeless shelters, I'm not sure if it applied to the hotels as well, but we can look into that. Yeah I can confirm that this is Jesse that the at least as reported by DHS, the temporary shelters in our district and I'm assuming that's for all areas that have the temporary homeless shelters are tested on a monthly basis and that anybody that has a positive test is obviously relocated to an isolation, and anybody exposed to that person has also relocated to a nice isolation. Great yeah and I would just add also that we have seen pretty low rates compared to other settings in the homeless, hotel and shelter population. Great, do you so we have a number of questions lol. Do you want me to start yeah listing or do you well? Do you want to handle that? Or do you want me to hello? Oh I'm, sorry, I'm on mute. Somebody had to tell me to get off me Joe. Where were you I, don't see where the questions are well, we have a number of hand raised. We have a number of out okay and that's what I didn't see all right. You have to move them over, so you can handle it. No, I'm talking you're board members. Oh okay, all right! Oh now, I see it okay. So let's go Leslie you're first and I just want to say, I see one more question in the chat from Dale that I'm happy to address. If you want to do that now or after the we get through hand raising back to that. Okay. Thank you, ladies for the great presentation. I have a few questions. Actually, do you have any insight on schools because I know when schools were set to open? Obviously in September there was a I guess, a scary feeling that kids were either super spreaders or they weren't. No one was sure: do you guys have any specific data or insight on that right now? So you want me to start Chelsea, and then you can go ahead. Okay, so I think schools are actually a huge success story of reopening in general in New, York City. The rate of infection in schools is something like point, sixteen or point seventeen percent when they closed in person learning, because I'm sorry, the regional rate was above three percent. One of the reasons I think that we are seeing such success in schools is because tracing in a school building is actually pretty straightforward. You know where people are six seven, eight hours a day, they're in the school building, and you know exactly who they were around. So we saw that we were able to through the situation, room and the amazing around-the-clock work that they do. We were able to get a report of a positive also because people were being tested regularly, get a report of a positive and very quickly figure out who was around the person who tested positive and figure out. If a decision you know to close a school was necessary, so I would say you know I. Think we've seen really a really amazing story about schools. I also I, know Chelsea wants to say something on this too I see something about increasing testing in schools. I, I'm just gonna, say there's two versions of this question that I'll answer because I don't know which version you mean. So there are the 25 high schools that we have testing in that's open to the public. We are evaluating that on a daily basis, based on two things. One is how much foot traffic they're getting these are teams that were deployed to do in-school testing before and obviously without there being any in-person learning. You know they can be redeployed. So, as schools start to come back online for in-person learning, we may have to move those resources around and the other thing is that cases were still being called into the situation room until maybe a couple days ago. So buildings were still being considered for closure, and so we had to balance all of that. When we looked at which high schools we were going to put additional public testing in, but certainly you know, it seems to be a popular program and so I think you know we want to try to work to make sure that we can keep it going in some form. If you're talking about testing in the schools, then that's a different question, I think Chelsea. Do you want to talk a little bit about the work? That's been done for testing in schools, yes or sorry for yeah I. Think that the and I dropped a link for the school data, which also talks a little bit about the testing scheme, the randomized testing scheme for schools and then there's also additional for pub for non-public schools, additional testing requirements for those in the Covid-19 zones, and so we're also working with non-public schools to ensure that they understand those testing requirements that are from the state, but we're working hand-in-hand to implement them and then get them. The testing resources that they need and connect them with those resources. So I think we've really tried non-public and public to build a robust testing infrastructure for our students and staff and, as Laura was saying, even with the schools, closed we're using schools as testing sites again, which we did during the summer as well. So yeah I, think we have really tried to build that up as much as possible to ensure that books have access to testing I also want to say. Mass compliance in schools is basically perfect and I think this is a success story about wearing your mask. You know: there's a public school on my block when I go outside in the morning to go, grab a coffee or just get a little fresh air I see every day when we had in-person learning like very small children to medium-sized children, all in their masks and their parents and their masks and the teachers and their masks. It was a very like for me heartwarming thing to see, because it means that even our you know, our youngest students in New, York City, were taking this seriously all right. There are a couple other hands raised that I think may have school questions so Dale I'll come back to you, Josephine, I'm assuming this is a school question. How about I have like two more questions can I? Should you let me get one Leslie one: that's it for Covid-19 we're at 20. After seven already Josephine, you have a school related question as well. Yes, so this week the mayor announced that they will be, schools will be randomly tested once a week, and so we have parents that are a little nervous about sending their kids back into blended learning, because the test, at least that's shown on TV, looks very invasive with a long swab. So parents are a little bit worried. Kids are a little bit worried. So what can you say to reassure parents I? Believe it's a separate test that the kids are taking in school. Can you just clarify and confirm what does the test look like in school? So parents will feel less apprehensive about this yeah. So a couple of things and thank you for that question because I know like we just surpassed I, think about this a lot. We just surpassed one million Covid-19 tests being done in New, York City, which means one million times. We convince somebody to get a nasal swab. This is a pretty you know strange thing to be talking about and to be advocating for, but here we are so yes. I know that this is not like going to be a fun conversation for anybody. It's not a fun conversation that I have with my parents and I'm a you know full grown up. We have fully moved to the short swabs, which I think that should be a relief for everybody, because I don't know if anyone here ever got a long swab, but it was not a fun process, so the short swab is definitely much less invasive. You basically are just swirling for a period of time. We ask that the children have the release, forms that get sent home with the parents and in part you know. Obviously we need a consent form, but I think it's also a good moment to talk to kids about why we're asking for people to get tested and why it's important and so again, I know that this is, you know, not a fun conversation and not one that people want to have, but you know I think it's an important one and just like wearing masks and all of these other kind of difficult discussions we've had to have this. Is you know another one of those I think the real message is that this is how we get things closer to reopened. This is how we can have a full five day week of learning. You know in person and that's where we have to focus so beyond that I mean we're, not the school testing specific team. So if there are more granular questions on that, we can certainly ask folks and come back to you, but that would just be my over my eagle's eye view of it right. Thank you thanks Laura Dale back to you now, thanks for the presentation I saw today that the CDC changed the quarantine time. I, don't know if the city will follow suit. What's your take on that yeah I appreciate to appreciate that question and I also just want to acknowledge in the chat. I also agree that I wish that people weren't sick of hearing from government, because we're working really hard and I appreciate your sentiment. There I think we yes, so we also I also saw the CDC announcement, we're thinking, I, think we're thinking through and talking to the state about what that shift would look like here in the city in the state and what it would look like operationally we're reviewing it quickly very quickly. Our folks are very quickly looking at that change that came through today and we hope to have something to share soon about whether that will be an update, okay, yeah, because it seems like it would help with compliance. If the thing wasn't so onerous for a lot of people, but I do we do here, yeah I know we do hear quite frequently that the 14 days is it's rough, it's really hard, and we know that yeah. Thank you, I'll make sure if we do an up. If we do have an update or any news whatsoever I can we can make sure to circle back with Jesse and make sure it's disseminated to y' all, and so you can help us get messaging out all right, thanks, Hector yeah! Thank you, ladies. So it was great presentation. My question is more of a personal nature. Basically, my son came back from Indiana and he was tested before he two days before he arrived tested negative. He waited the customary four days when he arrived back home and tested negative, and yet he was receiving calls from the sheriff's department stating to him directly that hey, you still have to stay in quarantine for the full two weeks, so there's some kind of breakdown somewhere between the information that the state is giving and the people that you know the tracing folks that are basically making these calls, and it was a little disheartening because I actually have to point out that look. Your state website says otherwise, so you're telling me that he has to stay in an official 14 days, even though he tested negative, so there's some misinformation being given out there. No thank you for that feedback. I am just I was texting. While you were talking, I'm going to shoot a note to our folks who are doing the quarantine work to make sure that messaging is hammered out all right. Thank you, and just I'm sorry, just one more thing. I do appreciate that you guys are addressing more testing, so you know putting more testing sites out, but the lines are really insane out there, especially in places like Webmd and 23rd street and very highly populated areas and I really hope you guys are rolling out more locations making it easily accessible for everybody. Yes, let me speak directly to that, so I think, especially at Thanksgiving, and I'm assuming this will happen again at Christmas. We saw enormous lines at every site. You know H sites, city partnered sites anywhere, namely driven I suspect by folks who are doing the test and dine strategy, which again, we would say, is not a foolproof strategy by any stretch. But we understand that it's happening. One of the things that New York, Health and hospitals has done for their sites is they've started to put up there's a dashboard where you can click check, wait times and they're reporting pretty regularly from the permanent sites about how long the weight is. So one of the things we saw is not that there wasn't enough testing or enough capacity, but that people were all storming to one site when there was another site, not that far away, so we're trying to encourage people to distribute in a way that doesn't back up the line, because if 500 people show up anywhere it's going to create, you know a decent wait time. I would also say that I know a lot of people are really drawn in by the rapid test when at h, sites I won't speak for other sites at h sites. We have rapid sites throughout the city. You are given a regular pcr and a rapid test at the same time, and if your rapid test comes back negative, they automatically run your pcr because they want to confirm those results. The rapid test, the antigen test, is not as accurate. So for folks who are just going to city Md, getting a rapid test and taking those results as kind of gospel, you know I would just say: buyer beware: we know that there have been some discrepancies there, and so the other thing is that rapid comes back. You know 15 minutes an hour. The regular test results at this point are coming back 24 to 36 hours later it's not a huge world of difference and it's a I would say much more accurate or a more accurate test. So, given the choice between rapid and regular I would advocate for a regular test and again that's part of the lines you're. Seeing are people who are trying to get those rapid tests because they want to go out that night and see people they want to go to dinner et cetera, totally understand why they're doing it have questions about the methodology, but you know just want to encourage everybody that a regular pcr test is what you have in Penn station and port authority, for instance, is great and Laura I think the pcr test. You know there's a question in the chat about reliability of testing I. Think the pcr test, the lab confirmed diagnostic tests, the molecular diagnostic test. However, you hear it referred to most commonly pcr it. You know it is like a gold standard, it's most reliable, but can you talk a little bit about how great you know, I think the turnaround times have been good on pcr testing and people may have remembered this summer when wait times were 10 days, because, as I like to say, everyone in the country is trying to bake the same cookies at the same time with the same ingredients, and so this summer what we saw was surges in other parts of the city around the of the country for testing resources for reagents and swabs and all of those things so anyway. I just want to give you the opportunity and not, and just as a reminder there isn't a run on those supplies in the same way. You know there was a time when we were running out of nasal swabs. There was a time when we were running low on all of these items we needed in order to be able to test. We started manufacturing a lot of them here, which is how we have the supply security that we have now. The other thing is that we worked through EDC to build a lab that could process. You know 20,000 or more tests a day, so we didn't have all of that in March. We didn't have it in June. We have it now. Okay and finally, Brad Pascarella where'd you go, I'm good. I must have hit the raised chat- my apologies, oh okay, then Laura and Chelsea. Thank you very much for your presentation. Thank you thanks. So much to hear this. If people have additional questions, how do we get in touch with you to get them answered? You want to send them to Jesse and he'll, send them to us. Okay, yeah, all right! Thank oh! You know what else I want to say. Jesse knows this I want to talk also about if you guys have complaints about large parties happening Chelsea. Do you want to just do like one? Second? Before about large gatherings sure, if you have complaints or tips, and you want to send them our way, the large gathering kind of like underground party busting general complaints are all being handled, centralized to the office of special enforcement, with participation from the sheriff and a ton of other city agencies, so anything that you'll need in terms of enforcement needs. Those can also come centrally to us and we can get them to the right folks and but in particular, if you have intel about large parties, we're happy to take anonymous complaints. You can reach always call us directly we're happy to pass on that intel because you know, while that is not where you know, we are not seeing. You know just one-off events as the main problem right now. It is definitely part of the problem and does lead to greater spread. I mean we know how Covid-19 spreads mostly no masks indoors and not being able to maintain six feet of distance and those three things do not have to be mutually exclusive. So I think that anything that you can do to help us crack down on parties like that would be really helpful. Thank you all right. Thank you again, ladies for coming by tonight. Have a great night. Don't forget your mass Jeffrey we're gonna go over to you for the public session now sounds good Mr Chair! Thank you. I am going to start by calling the names I have on my list. So that way, attendees are aware what the full list is going to be, as always in our public session. Members of the public who signed up in advance and before 6:45 will have two minutes to speak on any topic of their choosing. I'll provide a 15 second warning at your minute, 45 mark. So that way you can wrap up and be done within that two minute time frame on the list this evening, I will call everybody's name so they're aware then Jesse I'll go and do our three at a time as we usually do: Ruth Connor, Brian, Webber, Susan, Numeroff, Christine, Gorman, Catherine, Lafferty, Travis, Rogers, Elka fears, Lisa, Wager, David, Pincus and Christopher Stockel. If that is still relevant. So Jesse, let's start with Ruth Connor, Brian, Webber and Susan Numeroff, so I don't have Ruth, no I don't have Ruth and attendees I do have Brian Weber I brought over great and as well Mr Weber. The floor is yours. Two minutes thank you. Jeffrey, I'm Brian Weber resident on West 36th Street, co-chair of the 36th Street Block Association, and I'm here for I think the six month in a row to talk about the ongoing situation with the temporary shelters on West 36th Street and the desperate need to reduce the density of shelter beds in the west. 30S personally I know of five of my neighbors who've been physically assaulted and we've had our second homicide on the streets of the West thirties in I. Think within past three months the last one was in August. It's too many. It's too much and I am tired of hearing from our elected officials that they're having meetings with DHS to discuss increasing security, increasing coordination with the NYPD. That's great. We need to hear that you're having active discussions with DHS in the city to relocate one of the shelters from our street. Until then, we are not going to see any improvement in the West 30s one other point as of 3:45 today, the zip code 10018, which is the Garmin District West 30S, has the highest per capita Covid-19 cases in New York City, once a month is not adequate testing for the shelters in the hotels, the men that are on West 36th Street are regularly out on the street without masks. It's not because the shelters don't provide them it's because they don't. Second, thank you. It's because they don't enforce it, and it's heartbreaking when we see that security from the shelters and shelter staff are not wearing their masks either we're a pandemic, as they constantly tell us. So you must enforce this and they must enforce this. So please help us and elected officials. Please actively seek a reduction of the shelters in the West 30S. Thank you, Susan just put in the comments that she will not be speaking this evening. So with that we move to Christine Gorman, followed by Katherine Lafferty and Travis Rogers. Thank you. My name is Christine Gorman, I'm the president of the West 55th Street Block Association, but I'm speaking tonight about the hell's Kitchen neighborhood coalition. This is a group that has recently come together with block associations, businesses, non-profits and others to address the issue of homelessness in our area, specifically, the understandable need to, on an emergency basis, bring people out of congregate, setting, shelters and into temporary housing in hotels. We, the hknc, believed that was the right thing to do, but we are now you know almost a year into this pandemic and you can't keep using Kovud as an excuse for mismanagement. We would like to see better management. We would like to work with the city to d to move people around so that you don't have as many people in our area I mean we, the even before the pandemic. This area had. This was the third highest in helping supportive and so forth, housing. So I just really wanted to make CB4 aware of the hell's Kitchen neighborhood coalition. We recently had a an op-ed in the daily news on Sunday written by Maria, Ortiz and I. Wanted you to be aware of it, and also to thank you for all your efforts in helping to house to find enough housing and preserve housing for people of all income levels. Thank you, Christine, right on time, too, I had I was timing. It myself thank you. Catherine hi, everyone, I'm Kat, Lafferty. I've lived in hell's kitchen on 48th for 21 years. I just want to thank Christine for Introduct, introducing Hknc and I want to add that we had a press outing in October, and we spoke on the corner of West, 36th and 9th Avenue, and we were joined by long-time business leaders such as the proprietors of Espositos, who are the grandchildren of the founders of Espositos on 9th, and so this is an issue important not just to citizens but to business owners, and it would one thing I wanted to underscore is that hknc members would like a more consistent dialogue with the care providers and department of homeless services about the ongoing impact of our community, and many of us not only have worked in homeless in shelters but also volunteer in food pantries. Currently so I just want to reiterate that dialogue is important with the agencies that are providing services for the people temporarily housed in the hotels, but also we need to know the city's long-term plan in terms of how our neighborhoods have been affected. And, lastly, I just want to say we started as the hell's Kitchen neighborhood coalition, but we now have been joined by people associations in the garment district and farther east, so I hope that you'll check out our press coverage. Thank you. Thanks cap up next Travis Rogers, followed by Elka, Fears, Lisa Wager and then David Pincus Travis. Thank you Jeffrey. My name is Travis Rogers, I'm a resident on 42nd street and also a member of the hell's Kitchen neighborhood coalition and I just want to echo some of the sentiments that were already expressed. I think there's a growing level of frustration within Hell's kitchen that our politicians and our leaders have not been straightforward with us and proposing a plan to alleviate some of the pressure that we feel in our neighborhood, with us being inundated by a number of temporary homeless shelters, as you've heard expressed by Brian. Earlier some of our neighborhoods are really being pushed to the max with the density and the population. Overall, we are a welcoming neighborhood and a welcoming community that is here to support the homeless population, but we feel so. The neighborhood has taken on more than its share for the greater city and we haven't seen the rest of the city take on this burden as much as we have. We just want some communication from DHS and from our political leaders to have a plan that makes sense and Kovia can not be the excuse going forward. We need an actual plan. Thank you, Travis Elka. Are you brought over followed by Lisa hi, I'm elka fierce president of the West 47th 48 street Block Association, so we're changing topics on behalf of my block association I want to support item number one on your agenda tonight. It's 705, 10th avenue, 48 to 49th streets, also known as the DEP project. I want to emphasize that our neighborhood is both ethnically and economically diverse. We have supportive housing as well as many social services. We are in need of more moderate and middle-income housing so that we can have a balance that makes for a thriving community. We would promise this affordable housing in 2009, moderate and middle income, housing that is housing for our teachers, firefighters fighters, police union members. That promise has now been broken. We want HPD to honor the promise made in 2009. Now we understand that 15 of the units will be for formally homeless and we insist that these units be for families with supportive services as needed. We believe the income bans presented at the November 24th Clinton health kitchen land use committee meeting are much too narrow and need to be revised and we ask that community board. Four members vote to approve item number one. The letter addressed to HPD Commissioner Carroll and then on another note, we support item number two as well. The restoration of the Windermere on their storefront is just magnificent and we certainly support that. So thank you for listening. Thank you. Elka, coming in under time appreciate that Lisa Wager. Are you here followed by David Pinkus? Sorry, no, oh hi, Lisa, hi, okay! So I'm Lisa Wager! I'm the director of government and community relations at the Fashion Institute of Technology, the SUNY college, on 27th between 7th and 8th I hope everyone had a tasty and safe thanksgiving I want to share some information about Fit's virtual portfolio day on Saturday December 5th, for students from around the state and the world, and the city, of course, who want to enroll in fit school of art and design. The event runs from one to three and faculty from the school of art and design associate degree program will host webinars on each major and review the portfolio requirements for admission. The majors include communication, design, illustration, film and media footwear and accessories design, interior design, photography, textile surface design, which is textiles, rugs, etc, and, of course, fashion. Design and prospective students will learn tips from for creating a portfolio and have the opportunity to join a live chat with members of admissions in the financial aid teams and also current fit students will be available for live, chat to discuss academic and student life living on campus, etc. Also, even in a pandemic, our students are doing and winning a team of fit. Students took third place out of 1,600 international teams from around the world in this year's Adobe Analytics challenge. This is an annual competition in which undergraduate and graduate students crunch real data from major corporations and then make recommendations to the businesses this year, Nike sponsored the challenge, but past brand challengers, no partners have included Conde, Nas, T-Mobile and major league baseball. This is a real deal real time, real connection event. Our team flash was comprised of three fashion: business, Management, Seniors, Muksan, Aurora Ishikawa from Brooklyn and Sofia Cimanello. They won six thousand dollars. They made a lot of connections. It was very great, so thank you, I hope everyone has as good a holiday season as we can in these times, and I will see you in January thanks Lisa Jesse. If we could bring over Sharon Pope Marshall, she will be our last speaker provided Mr. Pincus is here regarding the ACES item, which he can speak to in committee. As Sarah pointed out, she should be over Sharon. Are you here? Thank you very much. Yes, thank you very much for the opportunity to speak and good evening. Oh I'm sorry, I'm going to is there a way to show my video, oh I, see I'm sorry sure, go ahead. Yes! Good evening, everyone I created a program at bike: New York, my name is Sharon Pope and the name of the program is called street action now and what we do is we work with the cohort we mentor and we work with the cohort of New York City residents, who are interested in looking at their streets and conducting street audits and with the goal of improving their streets that they live on right within their community and we'll work with the transportation committee of community boards and also work with the department of transportation. So it's a collaborative effort. My I would like to put the information in the chat space, but my email address is Spo P-o-p-e at Bikenyc and I end. All of my community board presentations by asking everyone to please wear a mask socially distant and I like to tell people that if you can imagine a bike, a full-size bike, that's about six feet and don't forget to wash your hands as well. Thank you very much. I appreciate the opportunity to speak with you. Thank you Sharon for joining us tonight and with that Mr Chair. The public session has been closed. Thank you, Jeffrey all right I. Will anyone have any questions about the agenda? All right, I'll, entertain a motion to adopt the agenda still moved. Is there a second Christine seconds, all those in favor say aye or raise your hand or high voice vote all right? Thank you. Any questions about last month's minutes. Okay, Jeffrey go ahead. Move to adopt is there a second all right, I see a bunch of hands all those in favor aye all right. Anyone opposed okay. The minutes are adopted. We would next go to the borough president's report. Our borough president, is here Gail. Do you want to hang out and listen to everyone else, or do you want to go next? I can listen to everyone else. Go ahead. Okay, then I'm going to hand this to our assembly member Dick Godfrey after well good evening. Everyone here we are hi good to be with you just to talk quickly about a couple of things: contact tracing for Covid-19. As you may know, I got a bill passed in the legislature this summer to provide well to strengthen contact tracing by guaranteeing a strong level of confidentiality for contact tracing information. So nobody would have to worry about their information being given to law enforcement or to immigration or to almost anybody else. That bill is awaiting action by the governor. We've had some conversations with them about technical amendments that they would want us to agree to if they're going to sign the bill. At this point, those conversations seem to be going well, so I think we will be seeing this legislation enacted, which I think would be something of a landmark nationally, similar to the landmark we created back in 1988 when we enacted the first HIV testing and treatment confidentiality law, which was crucial to getting people to participate in HIV testing and treatment and became a model around the country. Another topic I know, there's been a lot of discussion in the community about helicopters, particularly helicopter traffic on and off the heliport in Hudson River park at about 30th street. A lot of us have been working for I guess: you'd have to say decades now to get rid of that teleport and or were to move the actual landing strip landing pads out in further out into the river, so that there would be less onshore noise and also to crack down both on that heliport and other helicopter traffic in the city to substantially reduce the volume I. Don't think there's any excuse for tourism traffic in and around New York City by helicopter and I think the vast bulk of the supposedly transportation helicopter traffic in the city is really just a luxury for a very small number of super-rich people who, as far as I'm concerned, should get around in their high-priced limousines rather than helicopters. A lot of that. Well, the things dealing with the Hudson River park are heavily controlled by the state and we do not live in a particularly small d, democratically run state. So getting that moved has been very difficult and a lot of the general traffic issues on helicopters. You know are controlled by the federal government and we've been bumping up against that brick wall through several presidents. We'll keep at it last thing on Covid-19 vaccination, we it looks like New York is going to get a relatively small allocation of vaccine fairly quickly. 170,000 doses may sound like a lot, but not when you realize that you know, we've got tens of thousands of people in nursing homes and I, don't know how many people working in our hospitals and other health care providers, etc. We are a state of 20 million people, but fortunately that's beginning to move like almost everything else in state government. Those decisions about priority, etc are being made really exclusively by the governor, who today issued a book length policy statement on how that's going to how vaccines will be allocated I have not begun trying to wade through it. I know it's pretty long, because today I got an email from somebody complaining about an item on page 86, so it's got at least 86 pages, that's about it that I want to talk about today. If you I, don't know, if you want to take questions, if you do I'd, be happy to anyone have any questions for the assembly member, I'm not seeing any hands go. Oh I did your hand whose hand is that hang on Christine Bertay go ahead, hello? How are you hello, Dick? How are you I'm wondering whether we could request that after the nursing homes and the you know, the schools or, and obviously the frontline workers, the homeless could be put on a very high priority for getting a vaccine I? Think if we had? That would maybe help start helping to relieve the pressure we have on the neighborhood. Well, I think, there's pretty widespread agreement that the priorities, at least initially will be a mix of people who are doing what we've come to be calling things like frontline work like healthcare workers and some other essential workers. People like nursing, home residents and I would add the prison and jail population populations that are in congregate, housing that are at very high risk of both being infected and transmitting. Once you get beyond that, you know it's harder to set priorities about who should be getting it first. Hopefully, by the time we get through vaccinating the very top priority groups that there is pretty good consensus about. We will be at a stage where supply is much more extensive and it will be more a question of distribution rather than prioritizing, but there are a lot of people in health, ethics and health policy and others who are wrestling with prioritizing after the first couple of most obvious groups, I'm part of one group of medical ethics, people who've been studying it. You know, but again as I say, once you get beyond the first fairly obvious consensus categories, it becomes a lot harder to say this. One should be online ahead of that one Dick. Do you have time for two more questions? If you do yes sure Brad go ahead, I assume Godfrey thanks for being here, I, just obviously I'm sure you heard the last six months of the neighborhood on 36th street and the block association and how their how it's being handled. Do you want to make a comment towards that and what your office is doing to assist? Well, you know I signed on to Community Board four's letter calling on the city to try to reduce the volume in the 36th street area, which I think is excessive beyond that to work to provide more and better services and more and better security. You know we've seen in any number of situations where programs for people who are homeless or have mental health issues or all sorts of programs start out, often being pretty troublesome. But when the community gets the city to focus on services and security, things improve getting a reduction in volume and an increase in services and security has been especially difficult with these hotels, I and I think our other local elected officials have been working with board 4 on the agenda in board Force letter to try to get some movement there. It's been, it has not been very satisfying, as you well know, all right, we're Brad we're still working on that. We haven't given up yet Mike Noble and then we're gonna move on yeah, hi, Dick I, wonder if you're familiar with the bill that was introduced recently, that would allow NYCHA to have this thing called the housing preservation, trust which is a vehicle that allows for the leverage of yeah. Are you aware of it? And how do you feel about it? How do you feel about it? Well, I'm aware of it. I NYCHA has done a couple of briefing sessions for legislators and I attended, one of them online. Of course, it's you know it's as I understand it. It's not a done deal in terms of what the terms of it would be. The bill that has been introduced is really just a way of kind of announcing to the world that there is this idea out there, Steve Simberwitz, the chair of our housing committee, who's, the sponsor of it I think he intended it. I know he intended it. Basically, just to you know, raise the flag and tell the world it exists right. It involves use using. You know a governmental entity, not a private developer. It has included in the concept a lot of the tenant protections that the Chelsea community has drafted in the context of the of Nycha's proposal for Fulton and Chelsea Elliott, which I think has turned into a terrific model of tenant protection shopping list. So I think it's a concept that may have a lot of very valuable potential. Thank you all right. Thank you very much Mike. Thank you! Assembly member Godfrey. I'm glad I'm going to move on to our borough, President Gail Brewer. Thank you very much and thank you Mr chair and thank you so much Godfrey. So a couple of things. First of all, I want 36th street to know that you are heard loud and clear. The community board elected officials myself. We have been really focused on this. We had one possibility that has not worked out. I do talk to the DHS commissioner regularly and he made a promise to our letter. He is trying to make sure that it is realized. I want to thank you because you know sometimes people bs and say they're working on stuff, and it's not true, but I just want you to know. In this case it really is and I feel very strongly about it. So thank you to board second just on that issue, something because of our my tech background. We are going to ask the technology department of the cities called: do it to digitize their data collection process for street outreach teams, those teams interact, as you know, with both a hotel, shelter and other unhoused people on the street, and we do not have that data now. It should be on the open data portal, which is the law I passed in the city council. It doesn't solve the problem, but it gives us data which we do not have, and so we're working on that number two on the housing front. I agree with the assembly member that I do think. There's I know, I go to hundreds of meetings and I have to say whether it's perfect, no nothing is but the discussion that you know certainly George City of the assembly, the residents put into the Chelsea working group about the developments, both Elliott and Fulton, has been a model of discussion and incredible facts and data and outreach and compromise. So it's not perfect, but I have to say a lot of work has gone into it and it shows just on the housing front. Also, you know I, don't know that this is what you want to hear. But right now, as we speak, there are 700 hotels in the city of New, York I, think it's around 60 that are used for homeless and not many tourists. So there may be some for sale. We are working with groups, we're calling every single hotel that could be for sale, we're working with groups. We have an affordable housing task force and, if it's possible to buy for permanent homes, we would like to do that perhaps for seniors as an example, but I we don't want transitional, we want permanent. So you know we're focused on that. I also want to thank board for the police, tow pound, endless discussion. I did today go take photographs of the two 11th Avenue 12th Avenue buildings. I'm sure you know them well, but I wanted to understand what the city was proposing. The city has to come up with a place to put that toe pound, and you know it's very frustrating to be. You know the states is not their problem. The city says they can't come up with a place and we're stuck trying to figure it out. So the two places you know better, one of course is looks like a vacant. Half vacant car dealership, but I, don't know if it's really vacant and the other one looks like I. Don't know where you would put these big trucks doesn't make any sense to me. Unless you tear down some walls, I, don't know if they're retaining walls or not others can decide. I have the photographs and we will bring it up, but this issue of the city and the state at odds plus the state doesn't want to give up the area near the davits and they don't want to give up the intrepid parking lot. So that's where we're at trying to find a space to move those propane cars in terms of vehicles, helicopters, so I heard you talk about them because they credited April Adams in our office. We have been in touch with. The big problem is New Jersey. Yes, we have some coming from the tourism from downtown heliport, none from the West side, not from the east side. There's a wonderful article in Gotham gazette by Julia Battillo Martin. You can. She did unbelievable research on every helicopter that flies every heliport, New, Jersey, 50 airport right near us and the helicopters are taking off and coming over here. I. Don't know why they're not complaining in New Jersey, but they don't have 311 calls like we do, is off the sky so to speak. In terms of 311 calls on helicopters, so we're going to try to have a New York discussion in December. Certainly board 4 is involved and then have a new Jersey discussion early in 2021 with both of them and the congressman Natalia's office very helpful. Without getting into more details with this Gotham gazette by Julia Vittila Martin I strongly recommend to get updated. The public realm I keep talking about, but today's New York Times editorial is on the same topic, which is who is going to be in charge of our streets, and somebody has to take charge. I've been working with you know: buildings, DOT scaffolding, MTA bus, biplanes, homeless, etc. These four restaurants have to call like six people, but so do you, and so we've got to have a public realm czar and we're proposing that as we speak, the city decided to cut 550 child care slots from the borough. Manhattan makes me angry. They said that there's more poverty in other boroughs, but of course we have plenty here and it doesn't make any sense and so we're working to try to get those 550 back right now. The city says: oh, you could just take the pre-k slot that doesn't help we don't have after school. That's not helpful at all. We have a lot of people who come to Manhattan to work who are low income, they need head start and they need after school in terms of children and students. Yes, school for elementary in and disabled youth is going to start on Monday actually Monday next week. Thursday. The issue is the devices so they're about 500 and 537 students in the borough Manhattan, who have no devices right now. I have money that I allocated a year and a half ago it's still sitting in the bank. It was sitting in the back bank last month and sitting in the bank. This month we have a couple of letters from D.O.E stating we're working on it, we're working on it, not good enough. So just so you know I'm all over that topic, because it makes no sense to have that money sitting there in terms of community boards. The applications for new members and current members are due February 1st 2021 and you probably know, there's a school's information session virtual. As you can imagine, on December 8th and a non-profit information session about the culturals on the 12th 12:10 December 10th. There will be probably less money for the capital this year, because the mayor is spending we get a percentage of whatever his capital allocation is. Thank you very much and on many issues, board 4 is so helpful. I appreciate it. Are there any questions for the borough president? Thank you very much. Gail, I'm going to go to state Senator, Robert Jackson next hi. Everyone. Thank you for inviting me to coming to cv4. Listening to my colleagues, give reports and I wanted to say that I am happy to know that the constituents of the 31st senatorial district, which is 13 miles of Manhattan from marble hill down to 2016 and 9th Avenue reelected me in the general election. So I'm you know now, I'm trying to figure out what are we going to be focusing on, especially when the democratic majority will be meeting December, 7th and 8th in order to look at whether or not we can go back and deal with situations that exist currently, as you know, I don't need to tell you about the whole pandemic and the impact is having on housing and food insecurity in health care. So obviously, I'm part of a group that is pushing for to increase taxes on billionaires and millionaires in order to make sure that the rest of the people of our state survive this pandemic and deal with the fact that landlords are waiting in order to evict people that can not afford to pay their rent. I am one where, when there was a call for council rent and everybody should not pay their rent, I disagree with that I felt if you have not been hurt by the pandemic, and you can afford to pay your rent, you should pay your rent so that those that can not afford to pay because of the pandemic, hurt them, and then hopefully we can juggle like that to keep everybody afloat. I'm glad to announce that about two weeks ago the governor signed into law a bill that I sponsored along with Jeff Denoritz of up in Riverdale a bill, basically that where there are violations and a home, that is a threat to health or safety or life they have 60 days in order to cure that violation. This bill has been pending for almost 20 years. In fact, eight-year-old boy was killed in the electrical fire in 2002 and Jeff Denim, which presented the bill in 2003 and every year thereafter it passed in the assembly but failed to pass. I, don't even know if it was considered in the New York, State Senate and obviously you know why the Republicans were in charge of the New York State Senate I put the bill forward in 2019. It was passed and the governor signed it into law, and so that's a good thing. And basically, what happened before was that some landlords they would constantly go back and ask for an extension and they were granted. This bill would only allow a landlord to go into court and prove they had valid reasons to request an extension in order to complete the work, so I hope that this bill will bring about better conditions for us to live in if you're impacted by a landlord that is not doing their job. Also, I wanted to say that I spent an afternoon on the Upper West side, with the West side campaign against hunger, helping to distribute turkeys and other foods and vegetables to many people. That were lined up there. One afternoon my staff and I have been involved with just trying to make sure that our constituents are having mass and sanitizers that we've been distributing throughout the district. We've also been working with the Ryan Healthcare Center, with flu shots at three or four different locations, and we're going to be doing some more just trying to work to make sure that we do everything we can to help everyone survive this pandemic. That's basically what we're doing we hope to go back as soon as we can up in Albany, but everyone, as you know, you're reading the papers and watching the news and following everything like I, am we're, hoping that the federal government come and see what they have to do. Understanding that January 5th and this special election down there in Georgia is going to decide the faith as far as which way the Senate is going, and so I asked everyone to get involved in that, because what it means is the difference of whether or not the Biden Harris game plan can be put in place to save a lot. What we're doing in our country. So with that, I would stop and I'll be glad to answer any questions overall, with respect to anything that I've just said. Also as far as the 36th street, my deputy chief of staff and I went down there and met with the commanding officer. We actually walked around the area based on what the residents, especially on 36th street, that have been communicating with us and obviously I agree with all of you all that the concentration of the hotels with homeless madness was totally saturated and we need to reduce the saturation. So with that I'll just keep quiet and listen to any questions you may have. For me. We have two questions for you: Senator Jackson Maria. Well, thank you. Lowell Senator Jackson, you just answered my question. I was going to say that sick Gottfried mentioned the letter he signed on with Gail and I know you signed it as well, and I was going to ask you the reason that you did that, but you just shared that so thank you. Well, I mean I've listened to the constituents there and what they have communicated directly to myself and my staff about the situations that they're living in and then, as you all know, just when was it two nights ago or three nights ago, a club with about 400 people with no mass and everything right there on 36th street totally unacceptable. If, in fact, we are going to get over this pandemic and everyone's saying the impact this pandemic is having on small businesses. But if we don't work hand in hand with everyone to try to resolve the situation. Our economic situation in New, York City is not going to get better and we need it, but to get better for everyone to survive. Okay, Hector hi, Senator Jackson a pleasure to see you again. Thank you for mentioning about the assistance given to the tenants and that there are some tenants that actually need more help than others, but also we need to assist the landlords as well, especially small landlords, three to two to three family or even smaller than that. There's a program that you may be aware of the DC. Basically, it's the CARES Act, it's basically to assist tenants and I. Believe Washington DC just passed some program of assistance on the side that will pay directly to the landlords to help them pay. You know to take the place of the tenants, not being you know, able to pay their rent. Is there any plans for that for New, York, City or anywhere? Well sure you, as you may know, there was a hundred million dollars which is very little basically and that the governor had agreed in order to help tenants that are suffering as a result of this pandemic. So if you met certain qualifications you can put in for that particular money. In fact, my understanding is only about forty percent of that hundred million dollars has been given out and the DHCR has been really slow in processing these things. But the bottom line is that we don't need 100 million. We need a billion dollars to help residents survive and that's what we're going to need, and so everyone, even experts, have said that, no matter what the federal government does New York City is going. New York state is going to have to act and I'm willing to stand up and say I'm ready to go back up to Albany tomorrow and stay there until we act on behalf of the people of New York state, and it's not only New York City, but it's everywhere in New York state people are suffering you Hector for the question. Leslie Hi, Senator Jackson I, want to thank you for signing on to the letter to provide relief down on 36th street regarding the temporary shelters, but I do want to make one point that I think it's important people here that what you did was awesome. You went down there and you walked, and you took a look I think it was with some of the police officers of the precinct, or maybe it was with some residents and community affairs. Yes, but what you did was so great when they told you Senator Jackson. This is not your district anymore, we're crossing into a different district. You said: that's: okay, I want to go, and I want to see really what's happening and I just want to make that point, because we're coming down on our elected officials so much. But you did something that I thought is very notable and you went out of your way to really see what the residents were going through and I just want to say. The residents really appreciated that. Thank you I appreciate that, because one block or two blocks doesn't make I mean we're all in this together and in fact, when we walked down there, I saw a security guard gas, a block, watcher security on the corner of 36th street and 8th avenue on the North northeast corner, and so I asked him. I talked to him, and so he said that they've been there about two months. This is a couple weeks ago, and then there was another one on another corner and I asked him so who who's paying? For this? It was this Dh Department of Homeless services. No supposedly it's the small business owners in the area that was paying for this in order to try to keep them safe and the neighborhood, safe and but those security guards with no weapons, of course, but they're just there as a deterrent. In order to keep things in check- and you know that's, let me just say: that's not a good thing, because the most important thing that I say for me: it's the safety and security of the constituents that I represent. If you can't be safe in your home in your neighborhood, then we're in trouble, and obviously this is a bigger problem than just 36th. Street I mean the men and women and children being homeless, and the city has an obligation to house everyone. We need to work on this and that's why I've always said part of the situation is. Education is a key to uplift, our families and it's about family. You know being united and being disciplined and trying to do what's best for our children and our parents and stuff like that, because I tell you I know that, because I grew up poor myself on social services and I know what it is to struggle. We work ethic is very important in the process and I just try to treat everybody with respect and dignity, no matter who it is. Thank you for your question. I want to just point out again because we've been working so hard on this issue. The letter was the letter to commissioner banks asked specifically that a hotel removed off of 36th street. There were four signatories on that letter, one of which was community board, for it has not escaped me that the other three signatories were our three elected officials who spoke tonight meant the borough, President Senator Jackson an assembly member Godfrey. So you know I just want to you know just it doesn't seem like a coincidence to me. In any case, Chris Lebron, you had a question, hi I, hope everybody had a great thanksgiving. Thank you lol. So much thank you, Senator Jackson for taking that walk through 36th street. When I asked my father a few years ago, who you were, he only said the highest things of you when he was an organizer in Harlem. So thank you for going down those blocks. I have a question related to. When do you anticipate leadership to ignore the governor and pull in a session, or at least sit in Albany and begin to idiot on legislation for revenue that it's going to support social services and our small businesses? So well approximately a little more than a week ago, I talked to the majority leader as far as us coming back into session, and it's my opinion. Unless there's money on the table that we not, we will not be going back because I think that everyone, the governor and everyone, is trying to wait to see whether or not a package is going to come through in Washington before they go on the holiday break and then, if not, then obviously we're gonna have to act. And the question is when that's a good question. I do know, and Dick knows this- that the assembly had their retreat I think it was November, 30th and December. 1St and I can't tell you when, but I think that there are groups that are putting pressure on us to get back and do something in order to help relieve the pressure on people and so I ask the groups and individuals to keep the pressure on us to do that. I will be going into this. Retreat on December, 7th and 8th and I will be speaking up as far as the taxes on the wealthiest New Yorkers to help all New Yorkers survive. But if we're going to do something before the end of the year, we're going to have to act pretty fast Joe did you have a question? Yeah senator? No okay! Thank you very much senator. We appreciate your time and your support and Leslie Espion one of my community affairs person. She is in here also yeah Leslie posted in the chat the senator's office phone number is listed in the chat if anyone needs to reach Senator, Jackson or Chris or anyone else from the senator's office. I'm going to go to the reps of the remaining electeds, who are scheduled to speak this month. I usually make poor Luke go last, I'm going to let him go next. Luke Wall from Scott Stringer's office, hi. Everyone and thank you lol, I know it's already getting late, so I'll keep it quick. Just three things: I want to touch upon for recent work out of our office. The first is about our response to pandemic. So at the start of the pandemic, comptroller string will launch an investigation into the city's response so really looking at in those initial months. What happened that led to the result where New York City was really the epicenter of the world for that period of time? So now we're about eight months into that investigation and unfortunately, we have yet to receive a single document from City Hall as a result of it. So two weeks ago, our office took the mayor's office to court to try to get our subpoena enforced and make sure that we can actually fulfill our investigation, because our goal here is really to make sure that, as the second wave comes, which we're now, as the presentation earlier explained, kind of in the middle of that we have a better and more efficient and more equitable response. So we will continue to push to make sure our city has a better public health response, and hopefully this investigation is a key piece of that. The second thing I want to touch upon is around education, especially remote learning. Now that every student has some aspect of remote learning, access to internet is really a key differentiator between students who are and are not able to access their education. So right now in the city, there are a hundred thousand students who don't have access to internet, as well as thirteen thousand students in shelter who also don't have access to internet. So the comptroller laid out two separate plans, the first to close the digital divide by providing internet passports, which would be subsidized for those hundred thousand students without internet and then, secondly, to help support. Students in shelters make sure that they can access their education as well, so they don't fall further behind during the pandemic and I'll drop links to both those plants in the chat and lastly, one other thing which I know this sport is work closely on, especially the social Justice. Working Group is police accountability, so controller stringer drafts in an op-ed laying out a plan for greater transparency with the Ccrb there's three key parts to the plan. The first is granting the Ccrb power to make final disciplinary decisions, because right now their decisions are purely recommendations. The second would be to remove the office of trials from the NYPD and put it elsewhere to make sure that the police department is the one with jurisdiction to actually review it and, lastly, expand the ccrp's jurisdictions to that. A greater number of complaints fall under their jurisdiction. So those are just three of the recommendations that we put forward and also we'll also drop that op-ed in the chat, and that is just some of the work that we've been doing to once again address criminal justice, education and some of the response to the pandemic. All right, thank you. Luke Haley, Burson from Congressman Nadler's office, hi, everyone I hope you all enjoyed Thanksgiving and you've been staying, happy and healthy, despite the current coronavirus climate that we're all, unfortunately living in I'm going to be keeping this as brief as possible. Just on behalf of congressman out there I want to discuss some of the results that the congressman's been pushing for the american people during this Congress, including 90 hearings passing 78 bills, out of the committee shepherding 92 judiciary bills through the house of Reps and passing 30 judiciary bills into law. This Friday, the more act will be on the house floor. For those of you who do not know the more act is the marijuana opportunity, reinvestment and Expungement act of 2019, and it's a bill that decriminalizes marijuana at the federal level. So that's going to be going to the house floor on Friday if anyone wants to tune in to it on C-span anyways I just want to thank you all and wish you all a good evening. Thank you. Hayley Carl Wilson from Speaker Johnson's office Carl, you still with us. I see him I, don't know where he went he's listed here. I, don't know! If he's on I just texted him all right, we'll come back, we'll circle back to Carl. If and when he returns. Let's go to the district manager's report. Next Jesse, oh wait, Carl, says he's here Carl: where are you he needs to use his stage voice I, think Mr Wilson. We can't hear you buddy I, think something is set off. Thank you with yep he's not he's on video and on yeah. Take the headset off try to take, try and plug in the headset. Okay. Let's go to the district manager's report and we'll let Carl sort this out like it's like I said earlier tonight: it's gremlins tonight, yeah, unfortunately yeah so I apologize for everybody. Obviously, that seems to be we're having some technical difficulties, I'm Jesse Bowden District manager for Community Board for I'll try to be as quickly quick as possible. Can you all hear me, though? Yes, we can yeah. That was a long wait. All right, very quickly, decide to so December committee updates and board reminders. So all the committees for December are meeting on their regular time and date in December and just a reminder that CB4, social and racial justice task force continues to meet on the third Tuesday of the month at 6:30, and you can register for that meeting along with all of our standing committee meetings on our calendar page for on our website. The committee dates and meeting links for all of the committees and task force from up to June of 2021 are posted on our website, so those are all up and viewable on our website and then finally, I just want to let folks know so. Mcb4, collaborating with beta NYC to help collect and create a report on the community survey that the budget task force created in November when we were doing our statement of district needs outreach, and hopefully we plan to distribute that information at the executive committee. So it can be discussed at the individual committees in January. It took us a little time to get some folks around it, but Beta NYC has been really great and very responsive and they've already sent us back initial draft of the information, and so I just want to give them a lot of thanks and praise, and then I just want to also thank as always Janine Patente and Nelly Gonzalez from our staff, who do a lot of work behind the scenes to make sure this night and all of the other committees and all of the websites and all of the information in the dropbox folders and all of that stuff gets put up on the in a proper time and then gets fixed when it needs to get fixed, and so I really do appreciate that. So that's about it all right, thanks Jesse Carl! Are you fixed? Yet doesn't sound like it all right, we'll keep moving and Carl figures this out, we'll come back to him. We have an election tonight, believe it or not, we're a month behind everyone else, but we have an election tonight. So I'm going to give this over to the nominating committee chair, Paul, Devlin, hey everybody yep! The time is upon us all. Members now get to choose the officers for the upcoming year. We are following the procedures as set forth by executive order on doing this online. I'm going to ask each of you to now open the email that Jesse sent to you at 6:16 p.m, with a ballot in it pretend we're in a big room and the papers are being circulated, fill out your ballot sit, fill your name in sit, submit right away. These ballots will be counted now and will be able to announce the results at the end of the meeting. If you're one of the smart people who prepared for the meeting and opened up your ballot before the meeting began, please close that ballot go back to the email from Jesse at 6:16 p.m. Click on the link for the ballot and reopen it because of the internet gremlins there was a problem with the ballot that was circulated earlier and it's been corrected, but we need everybody to fill them in now. Cast your votes. Send it in right now, which means fill in the votes put in your name and hit, submit, send it in now and we'll tally up the results and announce at the end of the meeting. Anybody have any questions about sending it in now. All right never received it. Chris Lebron has not received it Jesse. Can you double check? Yes, we'll send it to Chris Lebron two emails, one from 616 and 418? Is it it's the same thing? Yes, it should be. The link should length is the same. You got an email at the beginning of the day and then you email right before the committee started. The full board started with the with both links, the vote sheet standard vote sheet and then the elect, and then the ballot. But if you clicked on the 414 link and opened it on your computer and had that window still open, you need to close it and click on the link. Another time because it's been that site has been refreshed since this meeting started all right. If anybody has any questions put them in the chat box, let's move along to the next item and we'll announce the long-awaited results at the end of the meeting. Thank you, everybody. Okay, thank you Paul. My understanding is that Carl is still having issues Jesse. He needs the meeting. I d number. In the meantime, I'm going to give the chairs report- and I'm going to the first thing I want to announce- is that community board 4 will be hosting a public forum about the work of the NYCHA Chelsea working group. We will be hearing, we will be hosting and hearing about the proposal of the Chelsea NYCHA working group for the renovation and preservation of Chelsea Elliott and Fulton developments. They are. The working group is holding five sessions just for the tenants of the two developments, but this will be open to the public. So if you don't live in NYCHA housing and you are still interested in what is happening, you can attend this session. It will be on zoom on Thursday December 17th at 6:30. Email blast will be going out and I want to particularly thank Joe and Maria and Mike and Elzora for their work on the working group. Were we gonna change that to six o'clock and it was Betty, not Maria? Oh I'm, sorry, I'm so used to working you and Maria working together and I forgot Betty. My apologies Maria does enough. This next thing is about Maria: okay, Community, Board, 4 and Metro. Baptist Church are hosting a coat and sock drive for families and individuals currently living in shelters. The details are on our website and this one was Maria and if you agree questions you can reach out to me, can I just give a quick plug sure please donate new or like new coats and socks, and you can drop off on Friday December 11th from 10 a.m, to 2 P.M or Saturday December 12th. So that's next Friday and Saturday Friday from 10 to 2 Saturday from 1 to 5. over at Metro Baptist on West 40th all right. Thank you Maria! Thank you. Your efforts. Putting this together all right for small meeting report. We are continuing to attend meetings about 36th street me Joe, Maria, about to reduce density and shelter reduction, we're working on that we haven't given up yet Marty Decat attended a meeting on behalf of wpe for the real rebuild by design big U event, which is about coastal resiliency. We held a meeting with the developers of 311 West 42nd Street and we, the Trans and Chelsea land use, held a meeting with the flex bus site at 300, West, 31St, Street and, as Gail alluded to earlier, I have been involved in a ton of meetings about pier 76 and trying to get the toe pound moved. So that's it for the chairs report for right now. Carl did we solve your problems? Yet? Can you hear me? Yes, okay, sorry, Carl Wilson! That was very bizarre. He just wanted a dramatic entrance yeah! That's what I like to do. Sorry about that everybody. So anyway, as I was saying, I hope everybody has a had a really great thanksgiving. I want to just announce two upcoming events that we have coming up. Next week, we will be having a virtual tenant resource fair in partnership with HPD it'll, be on Wednesday, December, 9th from 6 to 8 pm. It's a great opportunity to ask questions related to housing protections during Covid-19, rent protections, the housing lottery process when to use housing, court, Et cetera. So you can I'm going to drop a link in the chat that you can use to rsvp for that event, and we hope that you all will attend. Also, we are in the middle of our annual toy drive. This is the third year we've done this. It's proven to be Pri quite popular. We collect new toys for children ages, three months to 17 years and those will be donated through holy apostles sue kitchen in Chelsea because of Covid-19 safety procedures. We have a designated drop-off day and our next one will be Tuesday December 9th at our district office. Excuse me December, 8th at our district office, which is 224 West, 30th Street and you can come between noon and 5. Pm and I also have some a little bit of breaking news today. So earlier today, the city Council won a legal challenge to several bills that were designated to protect residential and commercial tenants. During the pandemic, the lawsuit was brought on by landlords who had argued that the three bills, which were part of a larger Covid-19 relief package, violated their constitutional rights. The district court for the southern district of New York rejected the property owner's claim by ruling that the actions taken place by the council to combat Covid-19 and help New Yorkers were reasonable to balance the infringement of contractual rights versus public interest needs in the middle of a pandemic, and the speaker thinks this is a really major victory for small business owners who need protection from landlords during a very unprecedented time. I was going to just keep it brief with that. I will obviously put all of my contact information in the link for everybody to have and I hope everybody has a safe and restful holiday season. Thank you, Carl. Thank you for persevering and getting online all right. We're going to move to the business session now and first up is Christine. I just wanted to confirm that Chris got my email. He said he didn't get the vote sheet or the Chris Lebron. Did you get the vote sheet and Jesse? Oh, yes, David Warren put a chat note in there as well about it. I got it sorry all right. Does everyone have the vote sheets now, I'm going to move to the business session. I got it. Thank you very much I, don't think I have it it's great and anyone who does not have the vote sheet to vote for the officer's slate. Please put your name in the chat and Jesse will deal with it in the meantime. I want to keep this moving and I'm going to go to Jd for Clinton health, kitchen land use. We have two letters, including one that was mentioned during the public session. Thank you, Mr chair. Can you hear me all right can I be heard all right? No, yes, hello! Yes, you're, fine! Jimmy! Thank you. We have two letters from the I'm Jd Nolan from the Clinton hills, kitchen, land use and zoning committee. We have two letters before you tonight. The first letter is on it's called the DEP site, it's on 10th avenue between 48th and 49th street. It has come before us many times before. The DEP site is a piece of land just off 10th avenue between 48th and 49th, where the shaft goes down to the third water tunnel. It's going to be an open space, slash park area, that's been something fought for decades by the community. Just to the west of that is a rail cut above that there will be constructed, affordable housing. This affordable housing was the result of a an agreement made in 2009 between the City Council Community Board that affordable housing would be built to compensate for all the low income housing that was being built in as a result of the Hudson yards rezoning. It was felt that there should be some moderate middle income housing. The height of the building went to 77 feet, although there is a restriction in the Clinton special district of 66 feet on those streets. But again this was part of the points of agreement that everybody agreed to Us years went by. We worked with HPD to make sure those income bans went from 80 percent to 165 area means income, AMI and everything seemed to be moving along until last year, when the board was informed that the income bans would be for low and very low income levels, as well as a 15 set aside for formerly homeless. The community board said this was not our understanding of the agreement. We understand about the homeless, set-aside for 15 percent for formerly homeless absolutely, but the income bans need to go up to match what was agreed on last week. Hpd housing preservation, development came before the committee and the income bans were not what the community or the board felt were adequate. Hence the letter the community was angry. They expressed dismay at the city, not living up to what it promised the homeless set aside is fine. Absolutely we request that families take those units. Certainly, families need it and families that are homeless or formerly homeless need support. So that's what the letter is about. We had our land use meeting last week just a day before Thanksgiving, so there was a rush to get these letters out. The writing staff probably made a lot of mistakes Jesse's going to fire them all. That's what I heard anyway, but I want to thank Betty, has pointed out some excellent edits and Paul. Thank you for we wanted to include something about the developer, working with the departments of parks and recreation as they develop the site and the park, and there's going to be a comfort station in the building for the park, which is great for the children and just a wonderful asset. So that's what the letter is about the first letter. All right, you have one question on that letter: Mr Lafrancois, you got a bunch of questions on that letter. Go ahead. First, thank you, Jd, just a wondering. If a nuance is possible here, you know I felt like this would have been a deny on less letter, but then the language was not go forward and I wondered why it's not a deny unless and we don't ask for that accommodation right to me- I read it as we'll absorb some of the lower income as long as we don't have any gaps in the bands, because gaps in the bands exist right now and what's the greater problem, is it the gaps in the bands or that we don't want to absorb the additional extra low income units all right, Jeffrey good point: it was this was a pre-euler presentation, so it wasn't really something that we weighed in. Yet we will weigh in on the Europe, but I'm happy to change the ask for whatever makes a lot of sense. I. Think if we hear from other folks they may have suggestions and I. Thank you for that clarification that it's not we're, not at the phase of formal opinion for city planning that it's development right now. Okay, thank you, Joe! Thank you! Jeffrey yeah Jd! You really did a great job on this letter, like I mean in a short period of time. You got to put it together. Thank you for that. Thank you. I just wanted to note that going for the next couple days we're going to make a few clarifications. One is I want to make sure that we note that the CB4 presentation on this project was included in the RFP and we could put a footnote with a link to it, because we did that and they didn't honor it. That makes it extremely explicit that we accept the 15 homeless, that we recommend the no gaps and moving the income bands below 60 and distributing them up to 165. So all those gaps get are gone and that HPD actually stated in this meeting. It was good to hear them be honest that they would not be honoring. The Hudson yards points of agreement I think it's important to call them out on that, because I've never heard anybody say so flatly we will not honor the points of agreement from a prior administration. I responded and reminded them. What about the next administration when you're gone? Don't you want them to honor the agreements made now like just because you're so I think we should say that, because that was a stark response that I've never heard in my entire work on the board. Sure Joe, we'll put all those points in we did mention that we work with HPD on the RFP, but we can strengthen that and your other points, absolutely thanks. Joe I would second any amendment on there that echoes Joe's point Chris thanks, Dale, yeah, Dale, hey I, agree that the salient points that Joe just iterated should be emphasized. Also, I'm just going to suggest that the paragraph that starts at line number 157 just be removed because I mean it's venting. It's very emotional and I think the meeting got a little emotional and I get it, but I don't think it's constructive. The representative from HPD made it clear that he was articulating their city-wide guidance and I. Don't think it was a condescending lecture or a sermon, I just think it wasn't directed at us. It was. He was just doing his job and answering our questions about Hpd's mindset. So I. Don't think that I think you should just remove that paragraph I, don't think it's helpful I disagree. I have no there's a lot of tone in there. A lot of tone I strongly disagree that paragraph should not be in a letter. I think it's overly emotional. It is not constructive and it's frankly misconstrues the gentleman's intent, and it doesn't help your case to be so overly emotional, okay, Dale. Thank you, J Jd! That's your call whether or not you'll accept that as well sure I didn't. This was directly stated by a committee member. So that's why that was in there. It wasn't my so much my work, but Dale I'm happy to try to address your concerns. I think the quotation marks are in the paragraph above the paragraph that starts with umbrage was also taken and which characterizes the gentleman's remarks as a condescending lecture and a sermon. In the same paragraph, that's also a little redundant, but that's another thing. I just think that is way too editorial and I won't vote for this letter. If that's in there well Dale, that's fine! That was a direct again. A committee member did say that I'm happy to try to make it a little to make it a little more palatable to you. I mean it's, not I, don't I. Just don't think it's constructive to happen. This approach to this problem. With this agency, okay, I, hear you damn good point. Jd you'll, take it to the writing staff Wallace. First of all, Jd I. Just have one word for you and it's masterpiece. It's you know. It's really good I will I do want to associate myself with Dale's remarks to the extent that I don't think the whole paragraph needs to go because really there's in the middle part. It says this community and this community board have been in the forefront of developing affordable housing. That's a factual statement. So that's fine! You know discussing whether we took umbrage as a committee or as a board it that I kind of agree in terms of tone, and we accomplish what Joe was saying in the prior paragraph in the quotes really impactful without you know so. I think we can satisfy both concerns here, but that's all I wanted to say. I wanted. I'm really impressed with this letter. Absolutely no problem. Gotcha I will do that again. The letter was an attempt also to reflect the anger of the committee and the community, but absolutely I hear you we'll change that to satisfy to saw you and Dale about that. No problem, but just as a footnote, it really is a masterpiece and I think it really captured not only the level of betrayal by HPD but the level of outrage from the community so and at the same time acknowledging that you know we know that they're doing the best they can, but they can do better. So I was really good. So thank you. James thanks, James Dolores I actually feel that they're not doing the best they can we're getting a canned answer that the entire city is getting Cb4's edge has always been that we are factual. We work with agencies. We have the backing of our elected officials to move things along in a direction that reflects what the community is. Looking for, what we heard were canned responses from an agency, a developer, who was delivering on exactly what was asked for by that agency. That had to hear a community continue to say that promises were broken and that what we negotiate is meaningless, and so the language that was used in the letter I feel reflects that and where we're saying that it may not help us. This is not the actual Euler process. This is the pre-Euler. This is a message to HPD, who is essentially saying we know better than you do about the community in which you live or which you work, and that is a problem, because that is continually happening from this administration granted. They will be gone by the time this Euler actually happens. But the point is that they are not hearing us when at least 18 times. They said we hear you. Thank you. Dolores Sabrina, hi I just have a question just because I want to understand a little bit of the politics of it when you say that this points of agreements were in 2009, I guess this was with. It was not with the blasios with lagging with Bloomberg right. So that say. Does that mean that every major that runs the agency and to say De Blasio? Has the authority to just change what I was agreeing upon the last administration? Is it really not accountability? In that sense, that's right! That's when I brought problems, Sabrina, that's one of the problems with this all right, so Sabrina, you're, right I, I'm not a politician! I, don't know, but I do think that if you erode the trust between the citizens and their elected officials, it's very bad for government. It certainly is bad for future government. So I think trust is the very foundation of our democracy, and thank you very much. It was a little hard to understand on the point of the politics which again I'm new at this. So thank you for explaining all right, yeah Jd, thanks for your recognition of the waterfront parks comments but I actually sent you two suggested comments, one, the second one that you haven't raised just yet. During the meeting you mentioned that the city has cherry picked, what parts of the agreement they are going to recognize and which ones they are not going to recognize and so I think we need to also point out that part of the Poa from 2009 included, height requirement, movement, light and air easements building over a railroad. There were a lot of other things that this community agreed to in order to get moderate housing or moderate income housing. So I think we might need to just even elicit those salient points about the other parts of the agreement that they're holding us to, while they're neglecting the parts that we really are fighting for. Excellent point. Paul will do. Thank you, Christine. Okay, yes, I! Think all these points I mean the parade, and all these points are really valuable. I would put these points at the beginning and say you know it's. We are not taking what you're saying, and this is what we want again, but what points Christine are you can send them to me, I mean like the high level of points that Joe was making, and the point you make into paragraph 37 I mean I would just move that way up there before the vote. I mean I. Some comments were to not put this before the accounting of the vote. I'm happy to do what Christine I'll work on it and yeah yourself. More impact of you know. This is the 20 20th time we tell you, and here is what we told you and you're still not doing it. Okay will do thanks. Christine Katie, where'd Katie go sorry. I was trying to unmute myself, so I'm just trying to understand so about the numbers so right now, their proposal is that 40 would be middle and moderate income and we want them to respect the agreement that it was eighty percent middle and moderate income. So if it's eighty percent middle and moderate income and then fifteen percent foreign for low income, it would just be five percent. Is that what we're proposing and pushing Katie I, I'm gonna call on our housing experts? The idea from the Hudson yards rezoning was that since Hudson yards rezoning created a lot of low income, there was a need for moderate middle. That's how we arrived at those bands so, but I'm going to turn it over to our housing. People that understand all this Joe. Can you help us out here? Yeah I wanted to also clarify the points of agreement for the newer members. The points of agreement is not an agreement between the mayor and the community board. It's an agreement between the mayor and the city council as part of getting the Euler's approved on West Chelsea, Hudson yards and western rail yards. So it's a document that exists, that's very official and it was signed off by a deputy mayor and the city council speaker. So that's where this flows from the what happens specifically with all the new mandatory inclusionary housing, the city of New, York, HPD itself, said to us. We are producing lowest income housing through inclusionary and the way for your community as its request to get moderate and middle-income housing. We will set aside these certain public sites for moderate middle-income housing, and it was put together as a full package in each sets of points of agreement identifying these privately owned sites for inclusionary. These publicly owned sites for moderate middle, and there was a small cohort Katy of low income on certain sites and as they came to the board, to be developed one by one that was the one on Chelsea on 25th, the 9th 18th between 9th and 10th, and then the Gotham West. They all got adjusted as the developers came through us to Euler and asked. Can they make certain adjustments? And we basically said yes, when it made sense financially that make the projects work. So we knew we got an agreement with, in this case wholesale. The agreement's been thrown out and I. Think. The key point here is the developer, who won the RFP actually submitted a proposal totally in concert with the community board's recommendations and the points of agreement, and it was HPD that, after it was awarded required the developer to change the mix of incomes. I want to add one thing to what you said: Jeff the agreement is between the speaker, the City Council and the mayor yeah, the speaker of the City council at that time represented this district right. So it was our representative who was signing off on it, but does that help Katie? It does I mean I. Think it'd be really helpful to just I assume it would strengthen our argument too I mean not only should we just generally should agreements be respected, but I think we really want to make the argument we're not trying to say we don't want low-income housing. Indeed, we've protected low-income housing, we're also trying to protect this piece of modern income, housing and I think that it would be helpful just to see maybe those numbers, those percentages. Well, we could actually cite Chris Lebron cited the reports that are given at the housing, health and Human Services Committee twice a year that showed production against the points of agreement and he just pulled those numbers out and spouted at HPD, and it was as if they didn't hear them, because the majority of units that have been built are below 60 percent of the AMI and the tiny minority are above are 80 and above so maybe we should just drop those in somehow in this letter. Thank you, less yeah, Leslie you're on mute, sir. What here we go, does this site hi? Did this site have any relationship with the site on Ninth, Avenue and 54th street at once? Yes, they were both in the western rail yards points of agreement. Okay, that's a good question and they were separated out at some point by whom and how did that happen? No, they were always looked at as two sites, but at Hpd's request the community board actually advocated for them to go to the same developer. So there was some economy of scale and instead this version of HPD gave them two separate developers, but that's a very good point: Leslie we're taking them one at a time, I dread when the MTA site, that's the site on 9th when that comes before the committee. So any and I just want to say, oh wonderful comments. This is a pre-euler application. We're writing this letter to say hey when you come back to us. Let's try to work it out, Christine tied all up for us final. Should we also mention the point that Joe made that the developer had made a proposal which was consistent with CB4. So it's not an issue of financing or feasibility of feasibility and say you know, we know it's feasible. We know it's part of the plan that was working. We know there was an agreement. What I mean I would ask the question: what is why isn't it? Don't we proceed with all the parties being in agreement except HPD, sure Christine? We can, let's think about that good idea. Good thought! Okay, Jd! You have a second letter. The second letter is a little happier development. There is a wonderful building on 57th and 9th avenue known as the Windemere Building, and it's got a wonderful history. It was built in the 1880s. It was perhaps the second large apartment building of that nature in New York City, built about a year before the Dakota was built. It became a residence for artists. This is before Greenwich Village. There was the window there. It then went through a period where it ended up in the 1970s and 80s in a terrible state and terrible owners that would send drug dealers and prostitutes down the hallways, brick up doorways. If you were out shopping, so you couldn't get into your apartment, harass them with people having guns a terrible situation. Eventually it went to court and Joe. You know those people were put in jail, I think Joe lived there did you live there? Joe? You were one of those. No but I sat at community board meetings with those people, so the community board has had an interest in this building for years and there was a question in the letter as a result of the imprisonment of these owners. The Clinton cure came about from this board, and that was if you're harassed, the owners of the building are gonna have to make up to that Joe. You remember that how that came about with this community board the cure yeah, there was actually a lawsuit brought by several owners, saying they couldn't develop their buildings, because there was harassment, they couldn't get a permit, and the city of New, York and HPD worked with the board to come up with a cure for harassment in buildings like this, it's 28 of the floor area of the building that's to be renovated or 20 of in terms of the perimeter area of a building of an entire site, that's to be redeveloped, so it's a very serious cure and it's affordable housing in perpetuity as a penalty for having harassed people out. Thank you Joe, and so this building will have a percentage of apartments that will be affordable. They don't know yet what's going to go into the building, but they are renovating it, and what came before us was the storefronts, the former storefronts along 9th Avenue and just around the corner. 57Th street are going to be carefully historically renovated. The committee was quite pleased about the detail that the renovation team was taking to restore the building. It's a beautiful building and I. Think in the letter, but I'll say publicly. We should give a lot of thanks to Ed Kirkland, who was a longtime board member headed up the landmarks task force and was a tireless fighter for preservation, even though he was from Chelsea. He took an interest up here in hell's kitchen, and this beautiful building go look at it. It's quite something thanks ed. Okay, though, any questions on that on the Windermere letter. Okay, let's move on Waterfront Parks, Jeffrey David as he's ahead, oh Dave, how does I'm sorry Gabe right? It's a very minor comment on line 51 of the letter. I think you want to put a an or between six and seven. It says a railing extending six seven feet and I did also want to say that you know this is a fantastic building in hell's kitchen and it's great that Ed Kirkland is credited and wonderful to see his effort to preserve this building coming to fruition. Thank you, David, we'll do we'll correct. Thank you. Did I miss anyone else. No okay! Well now, Brad I just saw Brad sand. Go up. Jd I just got to throw something out there because we're dealing with the park across the street privately is there anything that they could talk to the Sheffield and Park Van Dome to join to keep that park in a better state because they're, I'm just saying they look right at it. Just the thought not for the letter. If you said these developers are that good they were going to want that park in the right shape and yeah. That's a terrific point. Brad well they'll be coming back to us when they're going to decide what they're going to put in the building and that's an excellent point. Excellent, okay, I think! That's it on this one, all right, Jeffrey, WPA sure. One letter this month on pier 76, we were provided a presentation about potential interim uses for the pier, as we know that currently houses on the NYPD tow pound, all of these uses wouldn't be entertained until the tow pound is relocated. So all that is Tbd, but the fact that we were even able to opine on interim uses is kind of exciting. We have a ways to go on this, but wanted to lay out some considerations for what will be close to five acres of potential open space there, and this letter echoes a lot of what we heard from the folks who attended the meeting. We had a really sizable turnout as well and I leave it at that. Any questions, I'm not seeing any hands we keep moving. Lowell can I just jump in one. Second, it's not about the letter. I just want to check it. I mean I, haven't heard from Gwen I sent her the links for everything Gwen. Did you get them Glenn? You need to unmute. No, yes, I know, I did I got them, and now I've lost them. Okay, well, they're in your email, I, okay, I'll go to that: okay they're still there, so that has both the election, the ballot and then the vote sheet. Okay, I'm going to keep moving Paul the letter on the Pca, the physical cultural establishment, as many of you may recall, gyms in this district require special permits in commercial zones. It's a antiquated way of dealing with the gyms so that they're, not massage parlors and, as I said earlier during the public hearing, Betty and I did do a tour of the facility. It's a very quiet gym with body weight resistance. Only straps. We don't anticipate any complaints from any of the neighbors. We've heard that the Condo Association is supported, but we haven't received anything directly from them just yet, but this is just a straightforward letter to grant the approval of a special permit for pce at the site. Does anybody have any questions? Okay, thank you. Blp Bert, I had my hand up. I had my hand up here. I'm sorry, Brad go ahead. I just want to say that these applications need to be reviewed. I just need to say this to the full board. We are approving these facilities after they're done. In most cases, this happens to be a different one. So I just don't understand this process, and then we have everybody come and complain all the time that the gyms there's vibration, the sound the same lawyers come to us and said: oh we're, gonna put the panels in the ceiling, but the reality is I. Don't understand it's like giving someone a license. They get an accident, they come back to us and say now give us a license. I, just I, don't get it I, don't understand the process, it's backwards and it's a waste of time when we're approving something after it's already built. What's the point, Brad I appreciate your consistency and message there and I completely understand I wish we could change the rules, but I think it's rooted in the old days of massage brawlers coming in for applications and getting approvals. And then you know we don't really discover some massage problems after the fact. So this, after the fact issue is a struggle we constantly fight with and in this particular case, I'm glad to know that, because of Covid-19 they haven't been able to open so they're not open yet, and we got to see it at construction completion before operational completion. So I appreciate your comments and, let's maybe work on a way to change it. I've never seen since I've been on the board for 10 years, an actual massage parlor come before us, so I, don't know what we're looking at. Indeed, the point that this was raised by actually the other Land News Committee in for budget request last year, which I think is still last made it into it this year, maybe a little bit lower down on the priority list, but we did request a review by the BSA and DCP as to the reason you know the reworking this process, because you know actually the other land use Committee had the reverse problem, where they were asked to opine on a gym in a building that hadn't even been built. Yet so there was a hole in the ground so either way. There's just seems to be a it doesn't work all right. Thank you, bro all right, BLP, Bert or Frank sure these five items were relatively uncontroversial at committee, so happy to take any questions or describe any of them, but otherwise I think we can just treat them as a group. Any questions on any of the BLP letters, I'm not seeing any hands I'm going to move on ACES. We have three letters. Kit had to leave early and Alan has been having connection problems, so I have been given instructions on number 10 Josephine. Can you explain that to us? Yes, this is the letter requesting a Learning Bridges site in Hell's kitchen. The letter was already passed by the exec board, so it's here for ratification. Basically, we need a Learning Bridges site, so kids have a place extra support. On the remote days of learning, there is currently a site on West, 26th, Street and another one on West 60th Street, but nothing in between. So this would really help be of help to kids at ps51, along with kids in the numerous shelters that we have nearby that are still having internet issues. So this would be a place for them to go and be able to have internet and do their school work there happy to take any questions. Thank you. Okay, number 11 is Sarah, I. Believe right. Yes, hello, everyone I'll, try to be brief. The ACES committee had a presentation from the legislative director for council member James Van Bramer's office and the executive director of the League of Independent theater, asking for support in regards to bills, number 2068 and 2034 that are pending currently before City Council, and that's what prompted the letter of support for these bills. 2068 gives the open street model for cultural organizations and allows access for them to use outdoor public spaces and 2034 puts these cultural organizations into a map style app that would be accessible for communities to find local events in their area and a huge thank you to public member David Pinkis, who was a major part in putting this letter together and happy to facilitate any questions or discussions and if needed, we could bring David over. For that. Thank you very much. Chris has to stand up. Thank you David. Thank you. So much. Thank you Sarah. We have so many independent theater companies and so many opportunities this coming spring I hope to support the arts. This is incredibly important and Jimmy Van Bramer you're, not just president in Queens. You are present all over New York City I love working with you in council. Thank you so much thanks for your comments, Chris anyone else. Okay, number 12 Blake is handling yup. So this is a pretty straightforward letter about the news racks which you know, as you know, can cause both the sanitation issue when they're, unutilized and unmaintained, as well as take up sidewalk space, which is at a particular premium now. So we worked both Trans and ACES had discussions with the department of transportation, which is responsible for the regulations around these unused racks and also looked around the neighborhood at the kinds of news, rack issues that were present and on the basis of committee discussion, we came up with some recommendations to strengthen those DOT regulations, including having requirements for how often these user acts are refilled, as well as encouraging DOT to work with the department of information technology to provide community members. Like us with the information that we would need to see if news racks are registered and submit the 311 requests, which are the course of action when we see a news- rack, that's out of compliance or unsafe, so this is making those recommendations and happy to take any questions. All right, no questions. Thank you. Blake Transportation, three letters, Christine and Dale. Yes, so I attempt 13, 14 and 15 on item 13, on which we had a good exchange with Chelsea land use. I want to correct a sentence which is on line 22 where the numbers were not accurate is we are we're saying the current clearance is four-three and a half and the owner has agreed to expand it to five feet. So that's correcting that and we have one or two thai posts that have been brought up, that we're going to correct any questions. Nope. Is there anything on any of the other two letters? Christine? No, that's it! That was okay and I. Don't see any questions so we're going to go to 16 housing, health and Human Services Joe you're, going to take this one yeah first I want to thank Dolores for drafting this letter out. This is a very complex matter. We have going on and note that Maria Ortiz, the co-chair of the committee, is conflicted out. She has not participated in the discussion nor the voting she's a lives at the Nicole on West 55th street. So there is a pretty complicated matter happening where there is a utility credit or utility allowance which has been revoked by Gotham organization, and it's a very odd thing, because it involves multiple buildings which have multiple different regulatory agreements with the city and or state, and instead of Gotham coming and stating publicly. Their claim is that their prior manager made an error and gave people a utility credit on top of what was in a utility allowance. They just began to renew tenants leases differently and then tell tenants that the way to fix this was to go and make a complaint HCR and to do a petition for administrative review through the rent stabilization system. It has really gotten people crazy housing conservation coordinators is working with many tenants in the Gotham and the Nicole. A number of people spoke at our meeting and it became clear that Gotham just did not handle this properly, first and foremost, and second, that the information was quite muddled. So the committee decided to make the request to have Gotham say: do not take any further action. We re restore these revoked utility credits and then submit to the board all the regulatory agreements and information about this matter. So we can review it, and Katie is one of the people who volunteered so far to start review on that probably two other people, so hopefully by January we can return, but the letter just puts out that there's a loss of trust in Gotham and it's a shame because we've worked with them so closely on a number of projects. That's pretty much. The issue. Paul has a question. Just a minor edit I just noticed that on between lines, 44 and 46, the end of one paragraph and the beginning of the next paragraph is almost identical language. So you might just want to tweak that slightly 44 and 46. yeah. Oh yes, I see that yes Paul! Thank you thanks and Mr Wallace, hey Joe! This is a really good letter to clarify the issue. I was just wondering if between lines, 54 and 62, the utility allowance has a footnote that identifies where that definition comes from. Where is there a source for the utility credit? No, there isn't I looked around, it's just a credit that an owner may give against rent. That's why? No, there isn't no problem. Thank you and Wendy Gonzalez. This is a friendly suggestion. From line 27. I might recommend an improvement. Communication I actually might put okay. Thank you all right. We have two letters coming out of exec they've both been sent already both for ratification item. 17 Bert was the author Bert. You still here, I'm still here. Just one suggestion mentioned that in somehow in getting the letter from exec to here and making some modifications that one paragraph was left out. So the paragraph basically said: there's a health issue about these outdoor dining areas that almost are becoming indoor dining areas and that's one of the reasons. We're writing the letter and we have to coordinate and make statements and coordinated by different agencies and make unambiguous clear statements about what the rules and the rigs and the interpretations are, and the letter says they need to be enforced on a regular scheduled basis, particularly as the winter is coming up. There's going to be a whole new slew of stipulations on how these structures have to be protected from the winter elements and from skidding vehicles running into their spaces and killing or injuring dining. All diners Brett has his hand up. Oh yeah. Thank you. Just one suggestion to add to item number 17, just a provision, something that I think the restaurant should have some provision to ensure that the bike lanes remain uncongested, uncompromised and safe for the bicyclists in the diners that might be crossing the bike path to get to those dining areas. Okay, sure put a sentence in there. This is that one of the referees or of the dining is the department of transportation. It is the primary one. Well, as the winter approaches, Department of sanitation is again getting involved, but it's DOT. That's one of the major overseer organizations agencies thanks Brett Hector, yeah I just was making a recommendation as well. I noticed there's a huge slew of different assorted heating elements being used in these outdoor dining facilities. Now, and I'm wondering if that's going to cause a danger at some point, because I think they need to be inspected or something because I've seen some of them that are literally almost teetering over and I'm kind of surprised, they're, utilizing them. So I think at some point. It's just the recipe for disaster, so maybe some kind of blurb in there concerning the safety of use of equipment, yeah sure and some of those heating lamps actually were prohibited up until a few weeks ago, the propane heaters were prohibited to be used in New York City in this way, but can I just provide a we're right at, but one of the main points of the letter is we need people watching what's going on people from the agencies, not to be reactive, because you call in I just passed by a certain place and the heating lamps don't look like they're, you know and viable right now and then you're complaining. No, we don't want that. We want them to be active and go out and inspect regularly and consistently can I Jeffrey just a point on the heating lamp factor. When you read the guidelines and the regulations as it relates to the heat lamps, it is nearly impossible and when I say nearly it's 99 impossible to actually comply with the guidelines they have set forth for the allowables. For this heat, lamps for outdoor dining I haven't seen a single one. In my work or personal life that actually complies with the law, both from a storage standpoint when it's not in use electrical versus propane, when you read the guidelines, the city has made it nearly impossible. Second to that, they released the guidelines in October when the supply barely existed, for restaurants to even be able to get it. So look it's a really hard line to walk being a business right now and then more so because the business community was asking for guidance on heat lamps, starting back in July and August, and they didn't receive it until October, early November. So I just asked that we'd be sensitive to the fact that there was no guidance until after actually a lot of that went into effect. And when you read the guidance, the city makes it nearly impossible to actually comply when you layer in the DOB, FDNY and DOT guidelines- and it's it sucks because you're here Jeffrey, is it sucks? Yeah, yes, I? Would yeah I see a lot of people chatting with me on that so yeah, I'm in agreement with that I agree with 200 percent that the restaurants have been hard hit and they don't need any more headaches. But when you have some of these lamps that you can see, I hear you you're teetering over I mean that's dangerous, that's a danger, and you know I'm just afraid. Something's gonna happen. That's all right, I think it's something that should be looked at not to nitpick, but just make sure it's safe. At least you know, I mean I, understand, there's no real, solid guidance, but unfortunately we're getting very nitpicky when you have five departments involved with this all right. So are there any other comments, yeah just to interject, I'm wondering if we should make some reference to infrared heating sources, I find them much safer. Look, I'm not a fire or a heating expert, but a lot safer than the propane and more efficient than the electrical. So I'm actually surprised the city hasn't taken a position on the infrared heating that I've seen Brad. Yes, just maybe a note if you're talking about trying to get some of them to be ahead of the curve, I think I've noticed a lot of them have gone out. So now we have empty structures on the street that are being occupied in a different way, and that might be I mean I, don't want to stop it I actually like it, but maybe that's something to put in the letter, because these restaurants are going out, then the structure's sitting there I was at one yesterday on Eighth Avenue, there's a lot of stuff going on inside it yeah that ain't gonna do with the restaurant all right. It's frank, I just wanted to make two points, one this letter's gone out. This is for ratification and two. The impetus for this was very specific. It was concerns that Lowell and others on the community board raised about the perils of these outdoor dining structures becoming de facto indoor dining and the health issues raised, and that was what they'll letter was meant to focus on, and we decided early on not to address a lot of these very valid other problems that are coming up, because there are zillions of issues that you've all raised regarding heating elements and everything else here, frank part of the reason I let the discussion go on is because I think you guys have to draft another letter. I was afraid of that, including the permanency question permanence. No way I can write down. Yeah I mean this is coming. My understanding is this. The topic is coming back to BLP right all right. Yes, so this is going to go back to BLP. Again, I'm going to cut off the discussion here because, as we've said this last Frank said this letter has gone already. I made that clear when he we introduced it. So this will come back to BLP. Frank and Burt have now heard the areas that need to be addressed and it can be taken up at another BLP meeting. So I'm going to move on all right, I'm going to move on here. David I see your hand up, but I'm going to do. We still have to vote on this. Then. Yes, we still have to vote on. It has to be ratified. One more letter to discuss first item: 18 I, don't know who ended up. Drafting I did that Christine, please so. The Bloc Association, the Association for the Ninth Avenue Association, came to see us and wanted to have a special event with intent of bringing some activity to the corridor and to the businesses, and the idea was to install some art in front of the closed businesses and so that people could walk on the sidewalk and you know visit art and they would have advertised it. So we drafted something we send it to DOT and others, and the feedback I got from DOT is that the chances of that happening was nearly zero. So we've already stand it out. We don't think it's going to happen and we need to ratify it. Any questions all right before I'm going to ask Leslie and who's. Are you doing this the same way? You usually do it Mike and Leslie? Yes, that's going to read the names he's going to record. Can ask a quick question. Yes, a comment. Basically I noted in the news a couple days ago that the CB on the west side of Amsterdam was actually allowing artwork to be put inside the windows of closed establishments so that it dressed up that whole Amsterdam avenue between 70s and 80s. That could be an option of some sort that we could use. We have a lot of closed establishments, so could that be done inside of a closed site? We can take it. We can take it back to the organization. Yeah I think the issue is dealing with each individual land landlord and that's an issue obviously, but I think it's a great idea. I mean I. Think we should pursue that. Okay before we go to the roll call vote, we have election results. So I'm going to go to Paul, Devlin First, hello. Everybody I know: we've all been waiting with baited breath. So I'm happy to announce the following results of our election for chair. We have elected Lowell Kern for first vice chair. We have elected Jeffrey Lafrancois for second vice chair. We have elected Jessica Chait for Secretary positions. First secretary will be Mike Noble and the final secretary will be Leslie, Bogasian Murphy, congratulations to all of our officers. Thank you all for playing. Thank you. Paul! All right. Let's go to a roll call vote and get out of here, Mike and Leslie. The show is yours all right, Sarah Appleton, yes Christine! Yes, all Gwen uh-huh, oh I can hear you she's, muted granny. You need to unmute. I can not mute you there. Who did it? Can you hear me? Yes, okay, yes to all! Thank you Leslie, yes to all Myron! You have to all Jessica, yes, Tall Dale Corbino Sorry about that! No on one! Yes to the rest! Okay, Judith! Dahil! Yes, he's not here! Oh he's not here excused okay, Paul Devlin, yes to all Tina, yes to all P Diaz I just thought you Pete was here shaking his head. Yes, okay, red fur, yes to all elzora, yes to all Wendy Chris Lebron I pray for our small businesses in Hell's kitchen, I, abstain on 17 and I vote. Yes on the rest, Jeffrey I and all Elizabeth Betty, yes to all Sarah mills, yes to all myself, yes to all Jd, yes tall, Maria I am present not eligible for number 16 and yes to the rest. Okay, Ellen, Oster, I think Allen was having connection trouble and dropped off. He can raise his hand. If you like, say yes, he's gonna he's on a phone call. He can't raise his hand, oh yeah. No, he can't I'm sorry. He can raise his hand if he has the ability to I'm not sure, well tell him how to do it. Brad Pass Gorilla Allen votes. Yes to all! He texted me great Brad. Yes, the Wall Rhonda's, not here right, nope, twee, Tweet, post, yes to all in the chat: okay, Joe Rastuccia; yes, Paul Sabrina, yes to all Dolores, yes to all Brian Socal Teenage 16. Yesterday, David Solnick David are you here, he's muted all right, David Kaylee stokes, abstaining on number one. Yes to the rest, get Tillerson kid's, not here. It's not here right, Marty, Treaty, yes, Hector Vasquez, yes, Dawg, Rob, Walker, yes to all, but eight James Wallace, he doesn't seem to be here any longer. I think he dropped off. I, don't see him David Warren Yay to all Leslie Williams, abstaining on number one, yes to the rest, Colin Wright, Lowell, yes to all Mr Wallace has resurfaced. Oh okay, hi internet issues, I'm assuming we're voting since you have called on me, yeah, yes to all very good. Do I miss anyone nope we got everybody. Okay, good sounds good done. Thank you all the evening is adjourned. Thank you. Thanks guys, everybody yeah send your voting sheets tonight golden sheets tonight, good night. Everyone.",
            "summary": "I'm, just kidding good evening, everybody, temporary stand-in, welcome to the December meeting of Manhattan community board.\nWe did receive two names of people who had registered to speak at this particular public hearing, but I'm not convinced that they were registered for the right part of the meeting.\nI'm, going to call the names I have for public session, but just make sure you if you've got the four names here, I'm gonna ask everyone to put their hand down, and then the newest person is Christopher.\nI'm, not seeing any other people that are really wanting to come and speak on this issue, So I am going to close the hearing.\nWe'll present the letter at the full at the business board of the meeting and we'll have more discussion right.\nJust, some simple, slides directing you to our site, showing you how to access things, Just, making sure folks are aware of the Copenhagen zones that were announced by the governor in early October, and this is the city's zone.\nAll's community board is not impacted by the zone by the state zone, right now, but people do work and go to school in other parts of the city and are.\nThis is really why we're here, today, I, think folks know from the news and from hopefully from the mayor and the governor being out there talking about it.\nWe can pause here if you want to take a look or go to the thank you Laura, You want to hop in and talk about the testing resources that we've brought to the borough, so far, yeah.\nChelsea, so I want to talk about test and trace, is really three programs.\nIt's test, trace and take care, and so I want to talk a little bit about the different pillars of the program.\nThen I'll talk about the specific resources in community board, For, so part number one of the test and trace program is just that.\nWe now know that you know traveling to one part of the world or one zip code or one borough is not indicative of whether you're going to test positive for covalent and that there isn't just a single set of symptoms.\nSo again, mass testing, it's important, because we need to know where the virus is.\nWe need to know how high the threshold of transmission is, and we also need to make sure that people who are testing positive, have all the resources they need in order to isolate themselves so that we can break the chain of transmission.\nThat gets me to our second pillar, which is called trace, is the one that I think we hear about all the time.\nThere are different versions of trace that different countries have chosen to use the one that New York City uses is about identifying a person who tests positive, The tracer is not necessarily looking to see where they contracted the virus from because it's really hard to know you know.\nOther thing, I think we can say about trace that we know at this point is most cases where people know how they receive how they were infected.\nWhat we call like dining table: transmission, That is, you generally know when somebody in your own home has tested positive.\nIs this suite of services that we want to make sure every New Yorker knows they have access to in case they test.\nAlone, they're going to do it with the help of New York City, and that means helping you to evaluate.\nThe slide, just looked really crowded with it in there, so I didn't include it, but one of the links that Laura can drop in the chat or I can later is that advisory itself, and this is guidance because of the increases in hospitalizations and cases that we're seeing it's what we really need, folks to do, right, now.\nLike I said this has been a terrible year and everyone acknowledges that, But this is what we need to do: to keep people safe and to protect lives.\nThings like that, will really go a long way this holiday season and help keep people safe.\nWe have a flyer version, and this is also being handed out a little bit more of like a formal looking legal version at airports and at transit hubs, so that folks know as they're leaving and coming to New York.\nFor, the community board or any type of flu shot drives, as we've been seeing, people have please let us know we can get you those palm cards to pass out, because they're, small and cute.\nYou know I think the way to approach it is that there is no such thing as under testing.\nYou have attended any kind of large gathering, especially an indoor gathering, Please go get a test if you've just returned from New York, City and.\nI, think three: data, guidance, Okay, yes, core, four, so really amplification of our core four and remembering to encourage core four plus testing and cooperation with contact, tracers.\nBut for businesses, If you own a business or run a business or manage one that is subject to the reopening requirements for under New York state, there is a requirement for almost every setting at this point, including schools and others that you have to report a case of your employees.\nWhat we've done is we have this number that you can call and report a case directly as Laura was saying, Whenever there's a confirmed case in the city, we find out directly from the labs it gets reported into the you know: public health, infrastructure.\nWe know a lot of small businesses right now kind of well, particularly restaurants, who are familiar with the health department bristle at the word investigation and we've heard that a lot are really reticent to reporting cases.\nWe do get the direct reports of the cases from the labs directly, We don't want employers or businesses to feel that they're going to get in trouble for having an employee who may be sick.\nAn investigation does not mean that we're busting in the doors with health department, jackets on it, means that we're going to work with the workplace to like I, said, try to stop transmission in its tracks and get folks safely separated as quickly as possible and back to work as quickly as possible.\nYou need a hotel to separate in immediately, If you have concerns about where to get tested or you want to know the best place or the nearest place to get tested.\nI see a question in the chat about formerly homeless residents in hotel, temporary shelters, Laura I, don't know about Dhs's testing protocol, but I think that's something that we can definitely follow up on and get back to folks with information about, what's happening for our New York residents in shelter, right, now.\nOkay, so I think schools are actually a huge success story of reopening in general in New, York City.\nIf a decision you know to close a school was necessary, so I would say you know, I, also I, know Chelsea wants to say something on this too I see something about increasing testing in schools, I, I'm, just gonna, say: there's two versions of this question that I'll answer because I don't know which version you mean.\nSo, as schools start to come back online for in-person learning, we may have to move those resources around and the other thing is that cases were still being called into the situation room.\nWhen we looked at which high schools we were going to put additional public testing in, but certainly you know, It seems to be a popular program, And. So I think you know we want to try to work to make sure that we can keep it going in some form.\nIf you're talking about testing in the schools, then that's a different question, I think Chelsea.\nI, think we have really tried to build that up as much as possible to ensure that books have access to testing I also want to say.\nIt was a very like for me, heartwarming thing to see, because it means that even our you know, our youngest students in New, York City, were taking this seriously.\nThere are a couple other hands raised that I think may have school, questions.\nSo a couple of things, and thank you for that question because I know like we just surpassed I, think about this.\nWe just surpassed one million Covid-19 tests being done in New, York City, which means one million times.\nWe have fully moved to the short swabs, which I think that should be a relief for everybody, because I don't know if anyone here ever got a long swab, but it was not a fun process.\nWe need a consent, form, but I think it's also a good moment to talk to kids about why we're asking for people to get tested and why it's important and so again, I know that this is, you know, not a fun conversation and not one that people want to have, but.\nYou, know I, think it's an important one and just like wearing masks and all of these other kind of difficult, discussions.\nThere's, some kind of breakdown somewhere between the information that the state is giving and the people that you know the tracing folks that are basically making these calls, and it was a little disheartening because I actually have to point out that look.\nYou were talking, I'm, going to shoot a note to our folks who are doing the quarantine work to make sure that messaging is hammered out.\nI do appreciate that you guys are addressing more testing, so you know putting more testing sites out, but the lines are really insane out there, especially in places like Webmd and 23rd street and very highly populated areas.\nOne of the things that New, York, Health and hospitals has done for their sites is they've started to put up there's a dashboard where you can click check, wait: times, And, they're reporting pretty regularly from the permanent sites about how long the weight is.\nI would also say that I know a lot of people are really drawn in by the rapid test when at h, sites, I won't speak for other sites.\nFor folks who are just going to city Md, getting a rapid test and taking those results as kind of gospel, you know I would just say: buyer beware.\nBut you know just want to encourage everybody that a regular pcr test is what you have in Penn station and port authority, for instance, is great and Laura.\nYou know there's a question in the chat about reliability of testing.\nI. Think the turnaround times have been good on pcr testing and people may have remembered this summer when wait times were 10 days, because, as I like to say, Everyone in the country is trying to bake the same cookies at the same time with the same ingredients, and.\nJesse knows this I want to talk also about.\nIf you guys have complaints about large parties happening, Chelsea, Second, Before about large gatherings sure, if you have complaints or tips, and you want to send them our way, the large gathering kind of like underground party busting general complaints are all being handled, centralized to the office of special enforcement, with participation from the sheriff and a ton of other city, agencies.\nCovid-19 cases in New York City, once a month is not adequate testing for the shelters in the hotels, The men that are on West 36th Street are regularly out on the street without masks.\nThis is a group that has recently come together with block associations, businesses, non-profits and others to address the issue of homelessness in our area, specifically, The understandable need to, on an emergency basis, bring people out of congregate, setting, shelters and into temporary housing in hotels.\nOne thing I wanted to underscore is that hknc members would like a more consistent dialogue with the care providers and department of homeless services about the ongoing impact of our community, and many of us not only have worked in homeless in shelters but also volunteer in food pantries.\nSo I just want to reiterate that dialogue is important with the agencies that are providing services for the people temporarily housed in the hotels, but also we need to know the city's long-term plan in terms of how our neighborhoods have been affected.\nI. Think, there's a growing level of frustration within Hell's kitchen that our politicians and our leaders have not been straightforward with us and proposing a plan to alleviate some of the pressure that we feel in our neighborhood, with us being inundated by a number of temporary homeless shelters, as you've heard expressed by Brian.\nWe, believe the income bans presented at the November 24th Clinton health kitchen land use committee meeting are much too narrow and need to be revised, and we ask that community board.\nI want to share some information about Fit's virtual portfolio day on Saturday December 5th, for students from around the state and the world, and the city, of course, who want to enroll in fit school of art and design.\nWe work with the cohort of New York City residents, who are interested in looking at their streets and conducting street audits and with the goal of improving their streets that they live on right within their community.\nOkay, then I'm going to hand this to our assembly member Dick Godfrey after well, good evening, Contact tracing for Covid-19.\nI know, there's been a lot of discussion in the community about helicopters, particularly helicopter traffic on and off the heliport in Hudson River park at about 30th street.\nKeep at it last thing on Covid-19 vaccination, we it looks like New York is going to get a relatively small allocation of vaccine fairly quickly.\n170,000 doses may sound like a lot, but not when you realize that you know, we've got tens of thousands of people in nursing homes and I.\n, don't know how many people working in our hospitals and other health care, providers, etc.\nWell, I think, there's pretty widespread agreement that the priorities, at least initially will be a mix of people who are doing what we've come to be calling things like frontline work like healthcare workers and some other essential, workers.\nWell, You know I signed on to Community Board four's letter calling on the city to try to reduce the volume in the 36th street area, which I think is excessive.\nYou, know we've seen in any number of situations where programs for people who are homeless or have mental health issues or all sorts of programs start out, often being pretty troublesome.\nThink our other local elected officials have been working with board 4 on the agenda in board Force letter to try to get some movement there.\nFirst of all, I want 36th street to know that you are heard loud and clear.\nWe are going to ask the technology department of the cities called: Do it to digitize their data collection process for street outreach teams, those teams interact, as you know, with both a hotel, shelter and other unhoused people on the street, and we do not have that data now.\nThe discussion that you know certainly George City of the assembly, the residents put into the Chelsea working group about the developments, both Elliott and Fulton, has been a model of discussion and incredible facts and data and outreach and compromise.\nBut right now, as we speak, there are 700 hotels in the city of New. York I, think it's around 60 that are used for homeless and not many tourists.\nI did today go take photographs of the two 11th Avenue 12th Avenue, buildings, I'm sure you know them well, but I wanted to understand what the city was.\nI. Don't know why they're not complaining in New Jersey, but they don't have 311 calls like we do, is off the sky so to speak.\nIn terms of 311 calls on helicopters, so we're going to try to have a New York discussion in December.\nThe public realm I keep talking about, but today's New York Times editorial is on the same topic, which is who is going to be in charge of our streets, and somebody has to take charge.\nAnd, so we're working to try to get those 550 back right, now, The city, says: oh, You could just take the pre-k slot that doesn't help.\nWe have a lot of people who come to Manhattan to work who are low income, They need head start.\nListening to my colleagues, Give reports and I wanted to say that I am happy to know that the constituents of the 31st senatorial district, which is 13 miles of Manhattan from marble hill down to 2016 and 9th Avenue reelected me in the general election.\nI'm, trying to figure out what are we going to be focusing on, especially when the democratic majority will be meeting December, 7th and 8th in order to look at whether or not we can go back and deal with situations that exist, currently.\nAs, you know, I, don't need to tell you about the whole pandemic and the impact is having on housing and food insecurity in health, care.\nObviously, you know why the Republicans were in charge of the New York State Senate.\nUnderstanding, that January 5th, and this special election down there in Georgia is going to decide the faith as far as which way the Senate is going, and so I asked everyone to get involved in that, because what it means is the difference of whether or not the Biden Harris game plan can be put in place to save a lot.\nAnd I know you signed it as well, and I was going to ask you the reason that you did that, but you just shared that so thank you.\nWell, I mean I've, listened to the constituents there and what they have communicated directly to myself and my staff about the situations that they're living in and then, as you all know.\nOur economic situation in New, York City is not going to get better and we need it, but to get better for everyone to survive.\nWell sure you, As you may know, there was a hundred million dollars which is very little basically and that the governor had agreed in order to help tenants that are suffering as a result of this pandemic.\nLeslie Hi, Senator Jackson I, want to thank you for signing on to the letter to provide relief down on 36th street regarding the temporary shelters, but I do want to make one point that I think it's important people, here.\nThere were four signatories on that letter, one of which was community board, for it has not escaped me that the other three signatories were our three elected officials who spoke tonight meant the borough, President Senator Jackson an assembly member Godfrey.\nAnd I'll drop links to both those plants in the chat and lastly, one other thing which I know this sport is work closely on, especially the social Justice.\nOn behalf of congressman out there I want to discuss some of the results that the congressman's been pushing for the american people during this Congress, including 90 hearings, passing 78 bills, out of the committee shepherding 92 judiciary bills through the house of Reps and passing 30 judiciary bills into law.\nEmail blast will be going out and I want to particularly thank Joe and Maria and Mike and Elzora for their work.\nThe district court for the southern district of New York rejected the property owner's claim by ruling that the actions taken place by the council to combat Covid-19 and help New Yorkers were reasonable to balance the infringement of contractual rights versus public interest needs in the middle of a pandemic, and the speaker thinks this is a really major victory for small business owners who need protection from landlords during a very unprecedented time.\nWe worked with HPD to make sure those income bans went from 80 percent to 165 area means income, AMI and everything seemed to be moving along until last year, When the board was informed that the income bans would be for low and very low income levels, As well as a 15 set aside for formerly homeless.\nWe wanted to include something about the developer, working with the departments of parks and recreation as they develop the site and the park, and there's going to be a comfort station in the building for the park, which is great for the children and just a wonderful asset.\nThis is a message to HPD, who is essentially saying we know better than you do about the community in which you live or which you work, and that is a problem, because that is continually happening from this administration.\nThey will be gone by the time this Euler actually happens, Dolores, Sabrina, hi I just have a question just because I want to understand a little bit of the politics of it.\nWell, We could actually cite Chris Lebron cited the reports that are given at the housing, health and Human Services Committee twice a year that showed production against the points of agreement and he just pulled those numbers out and spouted at HPD, and it was as if they didn't hear them, because the majority of units that have been built are below 60 percent of the AMI and the tiny minority are above are 80 and above.\nIt went to court and Joe. You know those people were put in jail, I, think Joe lived, there.\nThe community board has had an interest in this building for years, and there was a question in the letter as a result of the imprisonment of these owners.\nThe Clinton cure came about from this board, and that was if you're harassed, the owners of the building are gonna have to make up to that Joe. Because there was harassment, they couldn't get a permit, and the city of New, York and HPD worked with the board to come up with a cure for harassment in buildings like this.\nYou said these developers are that good they were going to want that park in the right, shape.\nWe have a ways to go on this, but wanted to lay out some considerations for what will be close to five acres of potential open space there, and this letter echoes a lot of what we heard from the folks who attended the meeting.\nIndeed, the point that this was raised by actually the other Land News Committee in for budget request last year, which I think is still last made it into it.\nAny questions on any of the BLP letters, I'm not seeing any hands I'm going to move on, ACES.\nThis would be a place for them to go and be able to have internet and do their school work there happy to take any questions, Yes, hello, everyone I'll, try to be brief.\nSo we're going to go to 16 housing, health and Human Services Joe. I want to thank Dolores for drafting this letter.\nSure and some of those heating lamps actually were prohibited up until a few weeks, ago, the propane heaters were prohibited to be used in New York City in this way, but can I just provide a we're right at, but one of the main points of the letter is we need people watching what's going on people from the agencies, not to be reactive, because you call in.\nAny questions all right before I'm going to ask Leslie."
        }
    }
}