{
    "YoutubeMetadata": {
        "author": "BCB2",
        "channelId": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
        "title": "2020.06.02 - CB2 Economic Development \\u0026 Employment Committee",
        "publishDate": "2020-06-03",
        "shortDescription": "Brooklyn Community Board 2 (CB2) hosted an online meeting of its Economic Development \\u0026 Employment Committee at 6:00 pm on Tuesday, June 02, 2020.\\n\\n00:00:00 - technical error*\\n00:00:52 - Presentation: Regina Lindsey, Talent Acquisition \\u0026 Workforce Development Leader, Brooklyn Navy Yard Development Corporation\\n00:10:00 - Q\\u0026A\\n00:15:30 - CB2 Business Improvement District (BID) updates\\n00:23:45 - Statement of District Needs discussion\\n00:26:00 - Approval: March 03, 2020 Committee Minutes\\n00:27:15 - Motion to Adjourn\\n\\n*As noted by timestamp there is a brief segment where video capture failed. This is due to technical failure alone; this video has not been edited or modified in any way. Thank you for your patience as we operate with reduced capabilities during the COVID-19 pandemic."
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "BCB2",
        "normalizedName": "Brooklyn Community Board 2",
        "twitterName": NaN,
        "youtubeChannelName": "Brooklyn Community Board 2",
        "youtubeChannelURL": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
        "twitterHandle": NaN,
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "So at this time, as of early April here at can't hear you right now, you seem to be muted up now, you're back no, now you're gone am I on it. Now, I, don't know, what's happening, I, don't know how much of that you hurt. I hurt you up until PPP, okay, I'm, sorry about that. I was saying that, as of early April, our estimation was that we were producing 25 percent of the city's PPE the personal protection equipment and have now produced over 1.2 million PPE items and Counting, and this includes donations made to Brooklyn Medical Hospital, which was a donation of ten thousand and ninety five mass of also produced face shields out of bed. Nark and new gow in the DeGraw do Gao green room greenhouse I'm. Sorry that has now donated to or not donated has been sent over to hospitals, including Brooklyn Hospital. We have a flushing Hospital, Medical, Center or Hospital for Special Surgery, Maimonides, Memorial, sloan-kettering, -, Fiore and Mount Sinai -. At last. We counted so face shields and other PPE items produced on the yard have been used at all of those hospitals additionally hand. Sanitizer and face masks have been gowns as well. Both disposable and reusable are being produced on the yard and being used in those hospitals. So we in terms of securing PPE hours, our Pinet PPE PPP partnerships. So this is speaking to the paycheck protection plan. We've been able to focus on helping our business, obtain that funding and have worked several financial partners to secure over a hundred loans to date, and these loans should result in over thousands of local employees receiving what they made it at millions of dollars in wages over the next two months. So we're quite happy about that, and this is an effort, of course, to be able to make sure the businesses, the small businesses that operate on the yard are able to stand back up and be able to start reemployed, new yorkers and so the employment center, which is the area that I lead, wanted to speak a little bit about some of those efforts. So we've maintained operations through kovat 19 and, although operating remotely, we've been able to place over 75 individuals to date through March up until about last week, I think was our last count and are now helping businesses who are preparing to bring back their workforce with HR related needs, as well as working on retooling programs for the summer that focus on like the future workforce. So we have 30 internships for public university students living or studying in Brooklyn today, and a hundred work based learning projects for the Steam Center with the high school students and just to talk about some of the efforts in the community. Briefly, some of the yard tenants have been responsible for helping out with community resource efforts, particularly reaping fruits that operates on the yard, has delivered over a hundred thousand meals to frontline workers and created the restaurant response program, and that's a program that premiered at fifteen restaurants and to food committee areas that are now producing nine thousand meals a day. So I wanted to just name that and as always, we continue to support our partnerships with Myrtle Avenue bid, Fort Greene and Farragut fresh food, pantry and they're delivering they're, currently storing food in the yard, and then they make weekly deliveries who our neighbors around the yard that are in need of food resources, so I just want to share those updates. Was there any questions I can earlier? We were talking about the resource, fair, oh I, believe we got to put that off until later, something that we can look at doing, probably in the spring or summer of 2021. Is there something we can look forward to doing with the yes Denise I'm, not sure he's on the call but had reached out to us, and we were looking forward to that partnership as well. Obviously, for obvious reasons, like you said now, may not be the best time to move forward with that being that a lot of businesses making times to two, you know retool and reopen, and then additionally, the social distancing. But for sure we were thinking that I'm glad to hear you actually say that timeline that that's further out than I thought you might suggest. But yes, we look forward to that and I think you should be able to accommodate that and should give us enough time to be able to have enough employers and neighborhood and businesses be able to participate. It was so good, as I mentioned we had probably about maybe about 40 yard businesses convert trying this time to start producing PPE. So this includes our larger employees like I mentioned Bednar can do gab well, we've also had our fashion designers start making gowns and masks, and you know people who reupholster and make things. So we really try to make sure those that ramped up need for workforce went first to folks in the community, so the face shield at Bednarik, in addition to do gal and bednar having their own staff work on the lines and continue to work through that we had about 30 folks from the community also work on that line and they're working through mid-july. We've had people seamstresses go and start making. Gowns we've had people who are operating. We have a couple of like folks who are doing supply chain fulfillment and we had warehouse workers and folks go through there. So it's been a variety of places that have needed. We have a vitamin. Many folks might have heard of care of the kind of customized vitamin male in order. They have been obviously wellness at the top of mind for a lot of folks, so they've been working through this we've had about 35 or 40 folks work there. So we've been finding pockets where there's opportunity to connect that to the community. Yes, as we are started, we're starting to see a bit of an uptick and business is thinking about reopening, and so we continue to do to make sure the community is aware of those opportunities. We have started a community newsletter that goes out to about 8,000 residents every week, and that has resources both for you know, wellness food, of course, and claimant we're doing a resume workshop tomorrow. We're going to try to do virtually our information sessions that we used to do weekly on Tuesday, so invite new folks to register. In we're going to start doing that, but for right now we're doing that by telephone and registering people in, and then scheduling, one-on-one appointments and to screen them and get them placed I, don't think so to be frank but I'm happy to do that. We just started so I'm trying to find that it's going to Myrtle Avenue. It goes so like Fulton Avenue bid it's going as many places as people tell me. It wants to go so I can I. Have your email now, because you're copied on one of the emails I can definitely make sure it gets in your hands and if there's anyone else that on the board, who needs to be connected, please just include them in a CC and I'll make sure they start to see that as well. Okay, I'm going to do now is opening up to the committee and board members. If anyone has a question, do me a favor? Please, if you go over your name, okay, you'll see a little hand. Click on the hand, raise your hand, and so she her hand raised I'll pick you. If anyone wants to ask a question, please do that you hear. Can you hear me this is Miss Pearson? Yes, you have any questions. I have a couple of questions well comment and a question so I think the community newsletter is great and I would love to see what that looks. Like I'm sure it looks wonderful and in substantive, and certainly it could be an asset to us for our up and coming in the future resource. Fair, I'm, assumin, we'll be able to collaboratively print through that through that newsletter is that is that correct, Regina, something that could happen and, yes, I, think it's built in if we are targeting, sometimes in the spring or summer of 21 yeah, we can definitely, you know having a build up soon to get to that point and use the we found the newsletter. This is our first time communicating directly to candidates in the community this way and we're pretty pleased with the click rate and the responses we've been given the folks signing up for the information sessions and things that we're offering. So certainly we can use that as a platform to advertise mm-hmm either. Second, is that your resume workshop that you're going to be trying out tomorrow virtually is that something I can sign. Also I just wanted see. I have nothing to not to contribute anything but I just don't like to see how it actually works. Sure. As long as you keep in mind, it's our first one but no, yes, sure I'm kidding. Oh of course, I will I. Have your contacts, oh ow after we conclude here, I'll, send you a link register how single the last newsletter so that you can so you know see what else is in there in the resource library that we recently stood up, that kind of houses, all things related to looking for a job, and all of that so I'll send all of that information. There's any questions. Come you know, okay, so this one last question: does the community newsletter? How does it get to the community? Is there a mailing process or how do you get it into the community via email, so we're currently using MailChimp, but basically we anyone who is registered in our database or has registered since we've gone remote automatically, is registered to receive that community newsletter and if they want to opt out, they certainly can. But so far we've only had two people, so that's pretty good I opted out of things every week, so, okay, great, thank you. I was curious of your employment relationship with the Wegmans of continued, so it has not continued, but because it was just the initial agreement was to do it with Nate before they opened and have that kind of advance. For every time we were hiring on for the initial stats weapon is retention is pretty strong, so fortunately they don't really need us that often they've retained a little over 90 percent of their workforce since openings, which is amazing, but they are pretty busy on instacart they actually, this door, not surprisingly in the city, is their highest and instacart sales. So they are. We are in the process of talking about creating an additional warehouse space and then, if that happens, we plan to continue a relationship to make sure that those opportunities are offered as well. Someone trying to get attention Catherine, sorry to interrupt, and you just repeat your question and as my service went out right as you're asking and I heard the answer, but I just want to make sure I get. Your good question was if the employment relationship with Wegman continued beyond be at all. Thank you very much. I appreciate what you have I'm glad to see the Navy Yard is actually very active, still and still employing people. Thank you for having me the agenda I'm, going to basically give you an update on the Business Improvement, Districts and cb2 for the most part, everyone's working from home, so I've sent out a bunch of emails. Looking at right now is most of the Business Improvement Districts are on hold they're, reaching out to different and lawyers in the area, also different properties and finding out what their needs are currently right. Now, one of the things they were doing is also offering help or assistance in PPE start for PPP for those individuals who are looking to get loans for PPE for PPP currently right now, that is a touch-and-go situation. What I've noticed I just having discussions is the larger companies, especially the financial ones, I receive money in the first ones that went out. Some of the smaller ones are being approved but may not have yet received their funds, yet others are still waiting to hear. That's where we are with that. As far as the big managers I'm talking with them, they are all looking at basically trying to keep functioning but they're, trying to function as best they can from working from their home locations. They are still reaching out to the open and are trying to have lists of businesses such as the restaurants that are currently open and available to do. Takeout. Currently don't list like that if you go to the different big web sites. So if you go to the big website, it will list what these were open and which ones are doing, delivery so forth and so on. We're probably I start seeing those openings happen sooner rather than later. Now that we're starting to see opening across the board york city's concern, probably hopefully by big money- you've been in touch with the different web sites and they'll, give you a better update right now how wait and see? As far as the budgets are concerned, the budgets were pretty much fixed. Okay, I was talking to your office. Mr. Paris, mr. Paris explain to me. The assessments are going to be collected by the city then dispersed, though now their budgets are pretty much fixed going forward. I, don't know what the situation there has not been any historic reasons to change. Explorers myself currently give me my chairpersons report right now. What I've noticed currently right now as I've gone to a few meetings, different agencies and different most part people are doing they've, adjusted very well after the first couple weeks, kind of like guys doing right now with his weapons, okay, trial and error. Some mistakes are made, but for the most part, is still business. As usual, people were working from home than when stuck in I noticed. A lot of markets have opened up open for different reasons, mostly for food. Some essential businesses are opened, for instance, hardware stores things along those lines. A lot of the other stores are closed and they're still remaining closed. I, don't know, what's going to happen, but hopefully, when everything opens back up, things go back to some type of normal things are going to change across the board the same as it was, but it's not could be like. It is right now any questions. Yeah I wanted to ask back on the bids. I know that, with the city wide open streets initiative, there was some initial talk about having the bids managed the open streets in the area or to them as a potential manager. For those do we know if there's, if that's happening in our district I'm, going to mention the downtown Brooklyn Partnership is moving forward with some of those initiatives where they are with those initiatives. I, don't know, okay, mr. Paris, do you have any input on that? So the Downtown Partnership had a bit of a head start in that in that they already had the shared streets, certain Ron, J and Lawrence, and Willoughby, essentially just upgraded those from shared streets to the open Street program. I know that there are some other bids that have looked at locations where they might participate in the program. Then some have even submitted plans to be ot, but it seems like the VOT with you can take some time. I also know of a couple of neighborhood associations that have put in proposals that have not moved forward. It seems that the proposals that get approved most quickly or the ones that are proposed by the police, by who I'm sorry policing for the 80 applications for those, so the restaurants can actually expand. I, don't know where we are with that. Mr. Paris I know a lot of a lot of restaurants are trying to do that, but I don't know how many have. Actually there is an introduction at the City Council. It is you know the pariah doors of restaurants and bars are so desperate to improve their income. That I've heard from a number of restaurants that are legal in their space because the space is grandfathered in but they're located in residential districts and from the legislation. It appears that they would not be able to decide well k and said well, Cafe, even under relaxed rules. The only places the only thing that would be able to get sort of some relief from is on sidewalk width and, if you're not eligible, now you wouldn't be able to blow under the new legislation which, as I said, still hasn't- and this is not a question so much as it's just a comment on what was just said: I'm just thinking ahead for the summertime and thinking of that New Yorkers. We're gonna need spaces to be outside as much as possible and I know. You know whatever we can do as far as being community members to support those types of initiatives like the open streets initiative or the sidewalk cafes I, think that would go a long way right now. Genda is a discussion about the statements of community district needs and also the budget request for fiscal year 2022. Let me ask the question I'm pretty sure, because it's a short notice, most of us, have had a chance to really go into depth with that. Based on that, my suggestions, that committee is this I like to have a working group, because this will be the last meeting we have before summer recess. We have today and that's it so with that in mind, I'd like to get together a working group of individuals who would be interested in working on this, so we can have something to present to the exec committee in September I've already reached out to a few committee members and Dave agreed your would Lindsay. Okay, both have already said yes, okay to that mister, anyone else would like to volunteer I'm happy to volunteer as well also be on board also to myself or the co-chair. If anyone has to me a favor, there was an email sent out by the board office that basically gave us information a link to district needs and also request. Please review that if anyone has any comments, they would like to include for us to look over it in the working group by all means. Please do that you can send your information to either the board office or, to me my email is middle C, I, ll, Illinois s, FS and Frank L, o you and Oh Y, gmail.com and I'll make sure that to make the working group actually look it over and include any interested. Please let me know also with that. Okay did we all get an opportunity to look over the minutes of March 3rd 2020 I thought you asked we're asking if we got to look over them and as I did so sorry? Okay, any Corrections changes comments. Okay, hearing, none we'll just get my chair persons report any other business community forum. This is going to be interesting because I mean you have dialed in I. Don't have a name. Okay, do we have anything from the community? Anyone who was like to speak at this moment, hands going up and I seen the one waving with that in mind. Okay, I will now take requests a motion to adjourn. Okay, all in favor, right, beautiful, okay, so 640. It is so good to see all your faces, I'm so happy to see my committee still here and active. That's a wonderful team about a lot of you aren't in this city, but that's okay, but it's all good to see you all! Please stay safe, enjoy your summer, okay and keep in contact. Okay! Thank you! All. Okay, everyone.",
        "summary": "Nark and new gow in the DeGraw do Gao green room greenhouse Hospitals, including Brooklyn Hospital We, have a flushing, Hospital, Medical, Center or Hospital for Special Surgery, Maimonides, Memorial, sloan-kettering, , Fiore and Mount Sinai, , We counted so face shields and other PPE items produced on the yard have been used at all of those hospitals additionally hand So. We in terms of securing PPE hours, our Pinet PPE PPP partnerships We've, been able to focus on helping our business obtain that funding and have worked several financial partners to secure over a hundred loans to date, and these loans should result in over thousands of local employees receiving what they made it at millions of dollars in wages over the next two months.\nSo we've maintained operations through kovat 19 and, although operating remotely, we've been able to place over 75 individuals to date through March up until about last week, I think was our last count and are now helping businesses who are preparing to bring back their workforce with HR related needs, as well as working on retooling programs for the summer that focus on like the future workforce.\nYou actually say that timeline that that's further out than I thought you might suggest Ppe we've also had our fashion designers start making gowns and masks, and you know people who reupholster and make things We really try to make sure those that ramped up need for workforce went first to folks in the community, so the face shield at Bednarik, in addition to do gal and bednar having their own staff work on the lines and continue to work through that we had about 30 folks from the community also work on that line and they're working through mid-july.\nSince openings, which is amazing, but they are pretty busy on instacart, they actually this door, not surprisingly in the city, is their highest and instacart sales We are in the process of talking about creating an additional warehouse space and and you just repeat your question and as my service went out right as you're asking and I heard the answer, but I just want to make sure I get I appreciate what you have The Navy Yard is actually very active still and still employing people Thank you for having me the agenda I'm, going to basically give you an update on the Business Improvement, Districts and cb2 for the most part, everyone's working from home, so I've sent out a bunch of emails."
    }
}