{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB10",
            "channelId": "https://www.youtube.com/channel/UCrlIS7z20CnVaCrMvdkig_g",
            "title": "Community Board 10 Senior Issues",
            "publishDate": "2020-10-23",
            "shortDescription": "",
            "lengthSeconds": "1:05:56"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB10",
            "normalizedName": "Brooklyn Community Board 10",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPueX4MsL5dhnFZ-wqDwvKw",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "UfUUmKip4io",
            "fillerWordCount": {
                "uh": 53,
                "um": 227
            },
            "readTimeFullTranscript": "38 min read",
            "readTimeSummary": "5 min read",
            "wordCountFullTranscript": {
                "village": 18,
                "seniors": 16,
                "bit": 13,
                "information": 13,
                "volunteers": 12,
                "program": 12,
                "technology": 11,
                "clients": 11,
                "work": 10,
                "meals": 10
            },
            "wordCountSummary": {
                "seniors": 5,
                "food": 3,
                "bit": 3,
                "class": 3,
                "reason": 2,
                "organization": 2,
                "work": 2,
                "meals": 2,
                "terms": 2,
                "students": 2
            },
            "fullTranscript": "We could start live on Youtube Yay, it's Saturday live Iris, yes, is that you decided just wanted to say hi. How are you doing? I I'm well good, I'm glad you're here, good, okay, classical music. We are ready to go irish. You can begin the meeting all right, lovely. Thank you for joining us this evening. Oh, let me open this here so today, October 22nd, 7 pm call to order the senior issues Housing health and Welfare Committee. We thank you all for joining us and shall we introduce ourselves or we go straight into the meeting joe? How would you usually we're around a table and it's easy to do this? Let me start off, at least by saying that we do have a new committee member. I do not know if she's joined us yet Marisa Marissa is here. Yes, Marissa Perez! Welcome so good to have you, okay, thank you good to be here so pretty much just for the format. What we'll be doing is we have a number of presentations this evening and what we decided to do, because this is our first committee meeting in a while, and the reason for that you know, is Covid-19, and yet talking about health welfare senior issues really looking around, what's been going on in our community, what people have been doing individually to help and some of our organizations? So we really wanted to hear from some people tonight to get an update of what you've all been doing and be able to share that with the community, particularly people who may be tuning in now- and you know I think we were- we were talking a little bit informally before we started streaming and talking about these last. You know what is at least seven months now. I think one of the things that we've seen or get to sense of is maybe how little we need, how much we have and the importance of human connection. So it is with those connections, with the supports that our wonderful community has. I want to introduce first Karen Tadros Karen is president of Bay. Ridge cares a wonderful volunteer- based organization that has done tremendous work over these months and I actually had given Karen a call very early on thinking about some needs. So you know I've been following everything: you've been doing in the community. It's quite wonderful and I'd like to give you the opportunity tonight to tell us about that. What you've been doing most recently and then just an overview about your organization, because you've been around for quite some time now and I think everybody you know we want to make sure everyone knows about your wonderful agency thanks so much for inviting me. First of all, it's a pleasure to join you all tonight. Many of you may or may not know what Bay Ridge cares is and who we are so I'll. Just give a very brief introduction as to how we began back in 2012 when Superstorm Sandy came barreling through barrage was pretty much left. You know unscathed. We really dodged the bullet there and but everything everyone. All the communities around us really suffered enormous, a loss of life as well as property and other kinds of losses, and mostly the ability to feed themselves, and so I actually got a call from Justin Brannon who said to me: Karen. We need a kitchen and you know justin whenever he wants something. He always that uses the word we, which really means which really means you know, I better find a kitchen and thankfully my church, St Mary's Orthodox church on Ridge, Boulevard and 81St street, opened up their kitchen to us and over 28 days we cooked six days a week and we provided 25,000 meals to the entire tri. You know bar all the boroughs we were out in Queens. We were out in staten island, we covered all of Brooklyn, two shifts a day, lunch and dinner, and it was healthy, nutritious meals and from there you know, we decided that it's not a matter of you know if another storm comes barreling through it's just a matter of when and we want it to be prepared when that happens or if it ever would happen and so Bay rich cares. We formed the 501c3, we got all of our our not- for- profit status, requirements done and we've been acting as the Red Cross, basically for the community for the past eight years and doing all kinds of different things: community cleanups we do a community pancake breakfast much like a small town, would at a firehouse which is such so indicative of a small town to have a community pancake breakfast we've done, you know more most, notably, we did a full renovation of the Fort Hamilton Senior center. We had gone in there one day, just to drop off some stuff, some flyers, and we saw that the place was really in need of a facelift. So with coordinating with the parks, Department and forming you know a nice committee, we were able to renovate that space give them a new lobby. We overhauled the entire kitchen, they got all new appliances, all new countertops, they got. You know a working oven which they had never had, and then we also did some renovations of some of the common rooms. But if you go into the senior center, the work in that kitchen and everything around is the work of Bay, Ridge, carrots, but more importantly, the volunteers that were able to engage for that project, which was well over a hundred people over two weekends. So- and that is that I have to say, is the strength of Bay Ridge cares is the fact that we have in our database about 600 people who have volunteers signed up to be volunteers, for whatever project we might decide to put together, we'll send out an e- blast to all of them, and then they can sign up through sign up genius, which is what we use to wrangle. All our volunteers in when Covid-19 came along. We were really presented with a you know, a problem, because we had a lot of pop- up little pantries in the community, but that did not address the seniors, the homebound, the disabled, who could not go out to grocery shop. Many did not have the ability to order online. They did not know how. So you had this digital divide as well, and then you could not call on the phone. You could not even call like foodtown to get a delivery because they were not accepting them. It was a real problem, and so what we did was what we do best. We mobilized our volunteers. We had 400 people sign up in three days to really put an effort out and, and then we got the word out- and you know the first two days we got. Maybe you know 10 people who said yes, I need a delivery of food over the next 14 weeks. It really exploded, and so we delivered, we put together care packages of food. We partnered with a couple of stores in the community to make sure that what was going into these food packages was also nutritious. So not only did they get dry goods, but they got chicken. They got ground beef, they got fresh fruits and vegetables. They got fresh bread from a local bakery, as well as cereals and other items, so whatever they got was something that was substantial. I mean it's easy to send out pasta, rice and beans, but you can't live on that, especially a senior who needs nutrition and usually sometimes does not even on their own, provide enough nutrition for themselves. So we did that. Like I said, 500 deliveries went out. We also ran errands, we picked up, you know, went to the post office, we went to the drugstore, we picked up a mop and broom for someone I mean one woman's shower Curtain broke and she needed a new shower curtain. So these are the things we did and then for every incoming call we made and everybody that we served. They went on our wellness call list, so once they received a food package from us, they would then were assigned a volunteer who would then call and check in on them every week from that point on, so we made about I'd, say probably about a thousand wellness calls. We also delivered masks to seniors who had no way of getting them. We had a little old lady flora. A little italian lady who was sewing up like sewing masks like nobody's business until her sewing machine needles broke and she could not go out to get them. So we amazoned her. Some new sewing machine needles and she continued to sew. So we were able to do that, but we also and Todd can speak of this. We also partnered up with a lot of other organizations who had seniors, but they had no way of getting food to them, so they would call us. We worked with catholic charities quite a bit. We worked with the Brooklyn center quite a bit the Bay Ridge Center, I'm sorry and a couple of the jewish organizations. Usually our territory is Bay Ridge, that's where we work, but one of the things we wanted to do was in order to get the word out that we were providing this food to people. We wanted to part and make sure we could get that word out. So we spoke with Justin Brennan's office. We spoke with Andrew Gwinardis's office. We spoke with Max rose's office. We spoke with Nicole Mallet Shiaku's office and we wanted to make sure that their constituents knew that this was available and because all of those electives represent parts of Bay Ridge, we also had to include all of their district because it would be terrible for them to get a call for someone and they say. Oh, I live in Garrison Beach, but this is Bay. Ridge cares. So we handled some of staten island. We did Bay Ridge Diker, Benson, Hurst, Garrettson, Sheepshead, Bay, Marine, Park and Manhattan beach. We covered all of those areas for 14 weeks and thankfully I have to say that we're very proud of the volunteers we had they did remarkable work. They were running around all day, and so you know what we have done. Is we've reserved enough of our Covid-19 relief fund on the side so that God forbid? We have to start this whole process all over again. We have the ability to do so, and we have some funding put aside to be able to accomplish if we have to, and then the next big thing coming up is our Thanksgiving meals program, which we do every year. For the past eight years we've fed around 300 people each thanksgiving this year, it's a little bit more challenging only because what we usually do is through a partnership with Shorehill housing. We would take over their community room and 150 of their residents would come down and have dinner, served by beverage, cares and our volunteers and then another additional 150 meals would be delivered out to the community to people who could not afford a meals on thanksgiving or seniors who were alone because of Covid-19. Obviously, gathering 150 people in the community room- and you know 50 volunteers- is going to be impossible. So what we have done is we've spoken with a caterer who is going to package up thanksgiving meals for us, and then they will be delivered directly to the homes of the people in the community who need them and then 150 meals will be dropped off to shore hill. For their distribution within their own building, so that we do not have to send volunteers in potentially exposing any of their residents to Covid-19 or even the flu at this time. So we're very you know clear about how we can accomplish this without putting anyone at risk, and it's going to look a little different. Usually we serve this on thanksgiving now the meals will be delivered on the day before, which, I believe is the 25th of November. We will be putting out information on all our social media and through all the electives office within the next couple of days, so that, if you have people who who are in need of a meal on thanksgiving, you just you know, give us a call and then that we're also adding those people again to the wellness call list. They'll get a call on thanksgiving just to make sure they're. Okay. What I want to mention that one of the great things about our thanksgivings program is: it helps us really identify seniors in the community who are at risk over the last couple of years. I we've really identified close to 30 to 40 seniors in the community who have major food inadequacies are living in practical squalor and it really puts them on our radar so that we can make sure going past the holiday. They have a safety net in place and we do check up on them and make sure that they have you know. Sometimes we just go in and clean their apartment or hire. You know a cleaning company to go in and clean for them because they can't clean or you know it could be simple things like helping them order something online. So you know we bought mattresses for seniors who were sleeping on the floor in their apartments, so the thanksgiving program actually get puts our volunteers put eyes on these seniors and we get a really good sense of who needs help and who needs it quickly. So that's what's going on with Bay Ridge cares. Does anybody have any questions? Thank you. Yeah. I mean we have a great board of directors. I have to tell you. I have an incredible board that we work with, and but our volunteers are our lifeline and they're all residents of Bay, Ridge and they're all remarkable. So if any of you have helped in the past, thank you so much. But you know, if you have not head over to our website, you can become a volunteer right through Bayridgecares.Org. I have a question. I know you say you call up senior citizens. You know I get to help see how they are. I follow up on that. If they do not answer, do you call up the next day you call up later today I mean what kind of follow- up. Do you do? If you do not get a response, we try as best as we can to contact them, so we do not stop after one call there are times and if my board heard this they'd yell at me, there was one instance where I was in charge of calling someone and they were not answering. They were not answering, and so I went and rang the doorbell only because it bothered me that you know I we wanted to make sure we knew where they were and it turned out it was during Covid-19 and it turns out her daughter actually came and picked her up and brought her to westchester county to stay with her so, but we do try and follow up as much as possible. Well, that's great. I wanted to say to Karen that you know the board. We have a very broad- based newsletter now and we've been sharing word about. Bay Ridge cares and will continue to do so and I think you're doing a great job and I'm just so really amazed at your dynamic group of volunteers, your board, you and how much you've done in the community. So I just want to say thank you. Thank you. Thank you for saying that you know what that is the nicest thing that anybody could say to us. People will say: what can we get you? Can we bring you something? No and just say just say. Thank you. That's all, and you know there are two underused words in the entire english language, so you're very welcome and we it we take a lot of pride in what we do, because you know we love our community and you know we want to make sure our seniors especially are so vulnerable. You know people think Bay Ridge is such a rich community. We have, you, know beautiful homes and no, we have we have people living in poverty and in terrible conditions that is hidden. You know we have this whole segment of people who are poor and private. As I say, and it really is it's heartbreaking when you see it and you are motivated to have to do something because you would never want your parent to live like that, yeah absolutely right and I've seen it from the district office level. It's you know right. We've worked together on the other one, a couple things yeah, it's tough. Well, I want to add my thank you as well, and I've learned a lot about. Bay Ridge cares. I do look forward to working with you in probably a number of different capacities. Thank you very much. It's wonderful, the services that you provide, the connection that you have with the community. You know we're just so much richer to have your organization, so thank you very much. You're welcome. Thank you. What I would like to do now is move forward. Unless there's any other comments, we also have a presentation tonight from Bay Ridge Center, specifically on the Bay Ridge village, which is a program designed to help older adults in the Bay Ridge area stay connected, share information resources, and I know that we have Marianne nicolosi Todd is here so, however, you would like to proceed well, Iris. Actually, I'd like to introduce David drain. He joined us about a year ago and he's our director of innovative programming for older adults, and so he rose to the challenge of Covid-19 by finding a way to get our members online and connected so David. Please share with the group sure just to kind of start out to make I'm pretty sure everybody is familiar with Bay Ridge Center, but just a couple of things to talk about in relation to the things that happened is you know the, which is what I wanted to talk a little bit about what we've been doing through the pandemic, and what I want to emphasize is that, even though the centers have been closed, the staff has still been working so just like what Karen was talking about in terms of all the excellent work that Bay Ridge Cares has been doing, we've been working on making you know, fifteen thousand wellness check- in calls checking in and delivering and enrolling people to get food New York City. Over the summer we were able to work with a number of people to get air conditions placed, and this is a number that just boggles my mind but 101,000 home delivered meals were delivered over this seven month period as well as getting a grant to be able to make free. Uber rides to folks. We've got the largest number of social work interns that have been part of our team, 17 that we're working with for this year and then Ruth is online and we've been sending out email messages to as many people as we can, and we recognize that the digital divide that you were talking about earlier is very prevalent among this population. So we're delighted that you know 550 email blasts are able to get out to our population to keep them engaged in all the different programs that we're producing. We, you know basically, once the pandemics hit, we had to change and really pivot from what we were doing. You know in our site to being able to make it go virtual, so very similar to this zoom meeting we've been conducting zoom classroom activities since March. So I'm particularly pleased that, just three days after the center was closed to individuals, we were able to start launching virtual programs. So it's kind of fun that you know. We've done 56 art programs since then, and I'm just going to tell you a little snippet about each kind of category, but we have a local artist. Whitney hamilton, who is teaching a drawing and watercolor class for us, and she figured out a way to do two to have her laptop and then also her iphone connected to the zoom meeting, so that she could have her hand be seen in one of these little boxes so that people could actually see her hand movements as well as when she's talking, and I just thought that was extraordinarily creative and very fun and also seems to be very helpful and she's commented that the students of her class have really appreciated this. Because if you were in a classroom, it would have been harder for each person to be able to see her hand movement. So this is actually an instance when zoom is better than sort of being in real life. We do a you know, 100, and so education and recreation programs and the creativity of our instructors is just really quite remarkable. So the quarantine kitchen is one of the ones that we've been able to do. We've done a whole host of health management programs with students from Liu and Saint Francis. It's really been quite remarkable and one of the social work students that we've been working with is actually lives and from Hawaii, and so when the pandemic hit, she went back home, and so we were able to engage her and collaborate with her time zone differences aside with her from Hawaii. So it's just you know this. The remarkableness of this virtual capability is quite spectacular and Marianne Coughlin, who some of you may know is our exercise. Maven and she's done a phenomenal job with our classes and she moved upstate for the majority of the pandemic and the internet connection up. There was pretty lousy, so she was actually going to different neighbors homes and working in their cellars or on their porches or other places to be able to conduct her exercise class, and so there really was a sort of a time when each of the students would begin the class. Where is Marianne in terms of where she's conducting her class? Today and you know, I've been running a host of technology classes which seemingly have been going pretty well, and it's just been fun and Jeffrey is actually a part of many of those and he's been sort of instrumental in changing his virtual background for most of the classes, and it's become a thing for many of the participants to change their background so that it can be. You know, symbolic of their mood or of just of something that's fun, and it's been really neat to see folks embrace the technology so sort of prevalently. So that's been a great opportunity for us and I think that it's really been rewarding for folks to find this as a mechanism to stay connected yeah. I know I'm, oh sorry, go ahead. No, I was going to say. One thing I do is like on Wednesday. They have at least two of broadway shows where they have different music from different broadway shows, and I love broadway. So I have like 350 playbills. So if they do a song- and I had the playbill- I post a playbook, so I do things like that. It really is wonderful and we have somebody that has the the scene from Sherlock Holmes apartment we've got. You know scenes from the up movie from in many of the broadway shows, and one of our participants does a lot with places that he's been so he takes pictures of lakes and boat rides that he's done so it's just. They just have fun with it, and I think that's really what's so important about it, but let me just quickly unshare for a second, so I can go and share the virtual village. So I can give everybody a little bit of a tour of that and I will be doing what I'm supposed to be doing. So if I go and share this now, so here is the Bay Ridge village, I believe, is what I'm on yep, and this is a similar picture of my background as well, and I'm just I love to show that because it actually before I do that show that, because this was taken by one of the students in earlier digital photography class, but the address to the village is very simply bayridgevillage.org and we have one of our interns from last session with us. Her name is Rachel Rebecca and she does a really excellent video walking people through the village and it's available for anybody who has any questions can walk through that which will be very similar to the what I'm going to show here. So this is our essentially the landing page for the village. We have sort of functionality, areas really over here in the upper right and then in the upper left as well as right here in the middle, where we direct people to specific resources. So we welcome people. We have a community calendar I'll show that to you again, and we also have a number of resources and especially wonderful groups that we collaborate with just wanted to shout out to our friends at the Community board, 10 for all the things that we do, and you know making sure that it's easy for people to be able to find different organizations in the community that they can connect with. What this shows up here is very similar to the way that you can have special friends and be able to direct to them. You know and be able to have an instant chat with them talk with them. There is a tool that is available here, it's very similar to zoom, it's called vc and you can have an instant video chat with any of your friends within the community, just as if you were picking up the phone to make a call with them. This becomes a place to be able to get notifications. We have a series of blogs that we're putting together and people can act and and submit them. So the articles that we create are information that we make available. The blogs are a tool for our community to make available to each other, and we also have forums for folks to be able to use to ask questions of each other and interact with folks. This is always the way you can sort of get back to that home, page that we're talking about. We have a member directory of all the different people that we have a part of the service and we're. You know eagerly working on being able to grow that we have a sort of a my section here in terms of being able to create the profile, we're able to do mail back and forth to people individually and securely access. Our friends be able to go to the calendar, and this is the calendar that we all see in terms of the activities that are happening within our virtual program, which is right now the bulk of our programmatic activities. And so, when you click on an item, it gives you all the details so that if you wanted to go into a class, you can sign in and link directly to that particular class. Making it very easy for folks to run from this program right into run, essentially go right from the village right into that zoom session that we are making available. It is an entire platform- that's developed, let's see! Where am I going to get here in terms of talking about all the library of articles we have, that was really created here for the Bay Ridge Neighborhood. So this is an example of the programs that we're doing. We have poetry that comes out of our virtual classes. We are increasingly doing more programming around different Bay Ridge sort of history that are becoming available from within these articles, and, as I was saying, this is a platform it's available through a company called red string, and we can, you know administrate it very simply in terms of creating more content and engagement for folks in the community. So we're really excited about making this become a real destination for people 60 and over in the Bay Ridge area, and have it be a resource for them to you know just to participate with each other and to build the community and find deeper ways of in engaging with it. So I know I often talk pretty quick, so I hope I was able to give you guys a pretty good sense of things and happy to answer any questions, and I guess I should ask todd. If I did. Okay, you did okay, oh you should have asked me. So if I could just jump into at a point of clarity, the idea of the barrage village is to create a platform that is somewhat insular, so older adults who use it do not have to go to a facebook or youtube or they do not have to try to navigate the entire web. They can go to the village and access their favorite places safely and their favorite people safely. So it's it is somewhat. It makes it easier for us to help people who are not naturally educated in digital programming to get them acrosss that divide, so that so that we do not have to introduce them to a whole internet web browser field. We can, we can have them come into the village, find their friend instantly contact them and have a conversation. The same thing come into the village. Looking for a class look at the calendar get into the class be with the people they want to be with, and I want to. I actually want to give a shout out to Jeffrey, because I think that he's probably a good spokesperson for how effective virtual programming has been in helping with the systemic isolation that comes with with the sheltering in place that we've had to adapt to. Do you remind me putting on the spot Jeffrey? No, basically I'll, tell you what it is. I guess I am ice sort of isolated. I do not have a big family. I have an oh. I have an older sister who's married in Jersey. They have no kids. Both of my parents are dead. My uncle never had any hold on. I want to put this on. You be right. Let back call you back in about 10 minutes, I'm on I'm on the zoom course. I'm going back so, and I really do not have that many. That was my one friend no. I do not have that many that many real friends so Covid-19 affected me that not loneliness, but I found out going to these classes. I have more friends now you know and open up meeting new people and things like that, so I'm not as isolated as I have been so it sort of opened up. You know opened up the world for me, made me less isolated, so I found it very good. You know so I know you have any questions you want to ask me, but if you do ask yes go ahead. I think this is amazi. Yes, I think this is amazing and like everything else with Covid-19, it's just accelerating all problems that we might have had throughout society for many years and it's just being unearthed- and I want to thank so much because this is a very important topic and I appreciate I appreciate how well it's being recepted right, so hope it continues and I'm just a little bit overwhelmed, because it's a very important topic, the elderly and being not having a lot of connection to other people so yeah. Thank you, hey David! Would it be possible for us to put all of this information as part of a link on our website? Oh, that would be great okay, great nice and vice versa. You know maybe put our information up on yours as well. Absolutely okay, thank you. I have to say that we post every single one of their announcements on our mailing list. We have about in our law firm because we're an elder law firm. We have about 3,000 member members of participants, people who either are caregivers or the elders themselves, and we constantly we get such good feedback. Thank you for sending this information. I hope they're signing up for classes, but we keep trying to keep getting the word out. I think any organization, whether the synagogue could post it, whether because it's it'll only build the village, because it is such a special opportunity and resource for older people. I'm I know, Jeffrey took some of the classes I did on the on the marriage, village and right they did. I guess I did about a week or two of classes, which is very good. Yes, so it's a way to keep expanding and thank you for re- sharing. You know I just wanted to ask, because I know we get this at the District Office and Mary. Maybe you could talk a little bit about you know and speaking about the digital divide, do you think there's any way that we can help or apply for grants that help seniors? Who do not have the computer software at home? You know, we've we've had some seniors borrow some of our. You know, ipads tablets, you know as a board. We do not. We do not really have those resources, but there are a few people that I'd like to join, but I do not even know how to open up a computer or I do not have not even a smartphone. So can you talk a little bit? How maybe we can work on helping those seniors? Who would like to learn? And just you know, how did we bridge that gap to get them on the village? Is my question I swear. I did not pay her to say that, yes, you did no in all seriousness. We obviously we we're bumping into that problem all the time we started a loader program ourselves, giving out our ipads and we we connected with t- Mobile, was it that we got the hotspot. So the problem with our seniors is much worse than just not having a device. It's that they do not have the internet hookup. They do not have the actual ability to log on to broadband. They do not have Wi- fi, they do not they just and the cheapest price for doing that is like 40 a month and it becomes a. It really becomes a problem. Additionally, we're looking into we've been writing grants and in trying to get into a pilot program in order to purchase actually not a tablet, because what we're finding and what most individuals will who work in this field will tell us, is that older people as they get older? They really can't handle tablets, and they can't see phones, it's all too small. So you really need a substantial, desktop, yeah or at least a screen, and hopefully a touch screen. So we're looking into it. We're partnering with some folks who did this incredible project in the Uk for holocaust survivors and got 500 people over the age of 80 trained in using these the same things we're talking about using and the only the only the only way that people stop using it for them is when those older adults die it once they give them the machine and give them access and give them the platform they use it as a in a very vital link to their entire social network. So yeah, I would love to. I would love to work with the community and I think it would be great if we could- and I know the city's thinking about trying to somehow get stuff. You know digital stuff for older adults. My fear is that they're going to keep throwing these eight- inch tablets at them and they just can't right. It's just very difficult, and the real issue is, as David will tell you, is that it's a foreign language once you get them everything they need now you have to introduce them to the language of how to get online and how to be able to do things yeah. So I would love anybody who wants to work with this yeah come on we'll. Do it yeah? So there's the theme. Yes. Can I make a suggestion? Yes, so my mom 84 was very reluctant to use any kind of ipad Iphone computer because she did not have anybody to teach her right, and so we were there to teach her, but there's a lot of people that might not have that. So is there any way that we could maybe have a I mean when covered or even with Covid-19 at the Community Board office? Maybe have some classes, for you know elderly people who might be able to get there to like an apple. You know yeah, we did talk about this and we really did yeah. You can explain to how to explain how to use it or maybe, if they can partner. This organization can partner up with the library who has bigger screens that you have a giant smart board. Now the Community Board Office yeah. I know I know I think that would be great to introduce older people to understand how to use these tablets for computers. So that might be an idea yeah, I think, even maybe partnering with even some of the local high schools. We did that at senior tech a few times and those were the longest lines at senior tech where volunteers and students, my daughter, was actually one of them one year who had these really long lines and people just really like here's. My device just teach me, so I think that we should work on that. I think that would be a good committee project. You know a good collaborative effort with the Bay Ridge Center, and certainly you know it's going to be challenging getting off the feet during Covid-19, but as we roll through, I think. Certainly we have a you know. Our office is open and I think that would be a great place and we could talk about how we could actually get that done. Yeah are you Josephine? Are you familiar with Joe Alvear over at Fort Hamilton High school, no yeah, so you so you know him todd. So Joe runs a a volunteer program over at Fort Hamilton High school. They do their kids come and do a lot of our events with them, but they have about 400 of their students who look to do community service, not for any other reason except to they want to help, and these are young kids who are available during the daytime that can meet up with seniors. So that might be I can. I can shoot you over Joe Alvier's information he's got a wonderful group of kids there. Okay, great, I just want to sort of some of what Marianne was saying in terms of David just hold on one second, because I know you'll have more to respond to let Ruth speak briefly and then we'll ask you to talk hi everybody. I just wanted to. I love this conversation. I think it's terrific and I want a high school kid to help me fabulous idea. I just wanted to mention two things. One is that at the Bay Red Jewish center, we closed on March, 4:13 or whatever it was like everyone else around town, and we switched very quickly to online services online meetings online, everything we wound up, giving ipads to a number of people who wanted them, and I have to say that and a lot of seniors who did not want ipads, join in by phone, the services and they're happy with that. So you know like a lot of the organizations, we did the same thing and that worked and we can continuing we will have to continue to get better at also. Something I wanted to add is that I have a friend a fellow in the neighborhood he's a senior and retired, and what he does for a hobby is that he takes old computers and upgrades them, and then he gives them away, gives them to kids who can't afford them or gives them to anybody, and I'm really sure that you know he'd be happy to make a connection with one of your organizations, and I mean I'm speaking for him so generously. You know always easy to give someone else a task right, so he usually gets to his wife works for a very big corporation and they constantly upgrade their computers and that's how he gets them that he fixes them up. So I can speak to him if you're interested in upgraded desktops. I can make that connection either with you David or Karen. I see you shaking your head. David. Is that yeah, okay, I'm putting in my email address within the chat so that you would have it for a way to reach me after you talk to the fellow. I certainly will that's terrific David. Thank you David. This is Judy. Our firm has probably going to have within the next month. 25 full sets of desktop towers because we're converting all to laptops because of people moving back and forth from home to work. They all have to be using laptops. So all the towers are going to become obsolete. So once we get people cleaned up, you know and they'll and they'll come with the screen. So, okay, I'm able to do that. I was trying to figure out what I was going to do with all these towers. Now you know, and you can call them a donut very generous to you. Yes, that's one yeah and we're taking we're contributing to the carbon footprint of taking things and recycling them. You know there's a huge shortage right now for devices, because so many people working from home and kids and stuff. It's really it's a long wait for even all the little tablets. So if we can recycle sure David is there anything else? I know I stopped you before. Is there anything else you want to add? I did want to sort of piggyback on one thing that Marianne was saying, which is that the device is certainly a challenge for people to be able to get, but the I think the real impediment to a number of older adults is the ongoing internet connectivity fees, and there are a couple of programs that Verizon does as well as spectrum to offer a little bit lower cost services, but to enroll in those is fairly cumbersome and they're, not necessarily as cheap as other programs, and not to be saying anything disparaging about the programs that are available for low- income families. But if a child receives a hot meal at school, then they're automatically eligible to be able to receive a low- cost internet at only about ten dollars a month. That same program is and the same eligibility requirements is not available to older adults. It's much more stringent. So if there would be, you know, one way for a sort of a community district or a coalition of folks to sort of speak up is really around how we can advocate for equitable low- cost internet connectivity for seniors. It's a tremendous health issue in terms of being able to see their doctors, because now a lot of that is happening virtually it's a tremendous. You know basic service being able to order food or to be able to communicate with people receive information, so much of it is happening now electronically. To exclude a whole swath of the population is really a detriment, so I just wanted to sort of throw in a comment about that. Thank you. Thank you very much and I think that may be a segue for me to tell you a little bit about my agency before I do. I just want one other clarification. I know I was present when we sort of cut the ribbon and open Bay Ridge connects so the Bay Ridge Village is that is part of Bay Ridge Connects, and this is something that will live on long after Covid-19 correct. So it is a little bit of or a lot of bay ridges, but it sort of starts off with Bay Ridge Center, which is essentially the headquartering headquarters organization, and then the Satellite Office Bay Ridge Connects is actually a natural, a neighborhood naturally occurring retirement community. It's called an end, that's funded by the state and then with some of that funding, we've been able to create the Bay Ridge village to be available to everyone in Bay Ridge community. That's you know essentially because of the funding it's sort of targeted for people who are 60 and over. But you know family members and others will certainly be welcome within the community. Fantastic iris. The concept of developing the village really almost grew out of our home, delivered meals program and recognizing that those folks at least they had our drivers coming every day that they did not really have an opportunity to interact with the larger community. Very well. So we started talking about marriage village for them and then Covid-19 happened and we realized that it needed to be a lot bigger than just that. Little focused program- and you know honestly, you know David during- is he's a master in aging and technology. Yes, he's known nationally for it and we looked out and he walked through marriage center's doors about a year ago, just in time for this whole mess to happen. So so I'm very grateful that you know it's great to have a vision, but visions do not work without someone who can implement them, but enough of us I want to give David a compliment also. He does a lot of technology courses and the thing with the technology courses. Some people are on a pc, some are on iphone some on a tablet. Some are apple, some are android and he knows them all and how they handle it. All very rare, well and that's very hard to do and Juggle. Thank you Jeffrey. Thank you, Marianne. Thank you. Thank you very much. Thank you yeah. So I said this is a natural segue. I also want to give an update about the organization that I'm affiliated with and that's the Bay Ridge Counseling Center, the Bay Ridge Counseling Center, is on 92nd street. It's a program of the Jewish Board I've spoken about it before at this committee meeting and at the board, but I want to also say what we've been doing during this time and I think also what we've been talking about is how we've all utilized technology to get services to people in need and yeah. I think, if there's something good that is coming out of this, you know looking for the good things that have come out of it. I think this has really pushed the use of technology ahead in ways that we will continue to use it going forward and then be able to reach more people, so the Bay Ridge Counseling center. It's an article, 31 omh licensed mental health clinic we sort of mid- sized average about 650 active clients. I personally was actually I'm the director of the clinic and I had a knee replacement in January, and so I was due to return to the clinic the first week of April, and so I you know, I've been you know doing this in place working from another setting for longer than some others with that all of our services were on site, as you would assume, a traditional mental health clinic about a third of our clients are under the age of 18. Many referred from the local schools. We have family counseling, individual counseling groups work with teens work with older adults. So it's really a very broad base need most of our clients are working going to school, doing well in the community. Some of our clients have severe persistent mental illness and are not as independent, but it is for people who can independently live in the community. So what we did- and I was a little bit of a spectator at the time- is, as was said by others, we transitioned to technology in a very short span of time. So I think it was March 20th that we all started working virtually and the clinic never closed, although for a period of time the doors were closed. All of our therapists immediately began working online, primarily using zoom, but as been discussed tonight. Some of our clients did not have access were not familiar with. Therapists became technology, supports and assistance, helping people get on zoom so and some of my therapists needed help getting on zoom, but we all did it and it's really quite remarkable, but also so needed, because I think what we've all seen during this time is an escalation of depression, serious mental health challenges that have come out of more isolation, losses, people who have lost family and friends to Covid-19. Just you know all of our lives being upside down, turned upside down and really it is. It is a trauma. It is a shared trauma that we're all experiencing, so mental health services have been really critically in need and have escalated. I have to say, unfortunately, we're seeing people come to us in greater crisis sicker coming from hospitals, we created our own. What we're calling 911 clients? It's anyone that calls in and seems to have any kind of suicidal ideation. We connect them immediately that day and we have seen a real increase in that. I looked at numbers this morning, just to get a sense because intakes have been extremely busy and you know the month is not over and we've had 59 new clients come on just this month, so there is a great need, and so I do want to put it out there. I want everyone to know that we're there that we're working we also now are physically open. Our clinic is actually open, normally six days a week, so it's Monday through Thursday nine A.M to 00, P.M, Friday, 9 to 5 and Saturday 9 to 5.. Now that we have reopened. We are physically open on Tuesday Wednesday and Thursday Tuesday and Wednesday 9 A.M to 9:00 P.M and Thursday 9 to 5. that will probably expand, but we're just you know, keep taking stock every few weeks see what the needs are. We've got tremendous health and safety protocols, and even our limitation, you know with our cfo we're only able to have half the amount of people so we're not encouraging people to come on site if they can connect with us through technology, as long as their needs are met. That way, we would. We would like to continue that way, but we have staff that are physically. Now more of them are on site, doing some remote work as well as seeing clients face to face. I want to say I'm going to also just kind of give our number in the process by which anyone can reach out for services, but I also want to say that this new use of technology- you know my sense as long as office of Mental Health mental hygiene allows us to continue in this way. Everyone will because we're reaching people that might not have come into the clinic for a wide host of reasons. So you know again, I think that's a good thing and something that we will be able to continue in the future. So what I want to say is that jewish board is a very large organization, even though we are very community based. There is a central point of intake, so anyone who is interested in services does need to make a phone call and our number is one or just eight four and then it's one call o n E C, a l and those numbers will come eight, four, six, three two five and then the connect with someone get some basic information, get a sense of what the need is and then can connect. The client with any of the clinics are, I think, 12 clinics citywide, but we primarily serve Bay Ridge, Diker Heights and the Fort Hamilton community. But if someone is in need and for whatever their convenience is they prefer to be with us? We can work with them and then again now with technology and working remotely, we even have you know greater span. So I did just want to make sure everyone knows that we are there we're working, we're very much available to anyone in need. Anybody have any questions or thoughts. Karen you're muted hate these things. Just is there a cost involved here? Iris you take every insurance. There is. If someone does not have insurance there's, they can pay privately and there's a sliding scale fee. You know we work well with people to make sure it's available to them right, yeah. So pretty much, though, with insurance we do ask them to pay their co- pay. Okay. I just needed to know that, because there are times where we run into some of the case works the individual case worker work that we do with someone going through crisis a lot of times. We will see that there is an underlying depression or something that needs to be addressed so having this information available to us is really wonderful. Thank you thank you and for the reason, can I just finish that sometimes, like everybody has Medicaid and it's lapsed, maybe because of their depression, they did not recertify or some will. Our fiscal office will help them do whatever they'll do it for them. Thank you. You're welcome. Yeah I've been listening. I know there's a lot of a lot of organizations. A lot of things to take in here is anybody who maybe could aggregate this all, and maybe it could be posted at some Bay, Ridge village or something you know as a list of resources yeah, I'm going to be able to do that or hope to try to do that. I do I will do a report from this committee meeting. It will be sent out then, and I will yes and Jeffrey. I will add you to our email blast list, so you will get all of our notifications with all of this information yeah. Thank you, because we've provided so much information. If anyone, if you have a concise piece of information to get out the word best about your organization, if you present it tonight and want to share that with me, I that would, I would really appreciate it. Will you know it's sometimes hard to condense, the material and really do it all justice? Okay, you have Jay gold, a goldfinger from Assembly member Matilda Francis's office. Yes, thank you just a quick question: have you had any issues with reimbursement rates? Has there been any differential between in- person, care and telemedicine? You know it's interesting because no I mean I have an office manager. We have a big fiscal department, so I'm not as directly related to that, but I would say if anything, it's making it easier for clients. There are some. I actually also have a private practice and clinical social worker, so I know with Emblem Beacon sort of the ghi format, not collecting copays. So there may be some additional assistance for clients that way, but it goes by different insurance, so yeah I mean I know that during Covid-19 Medicaid started reimbursing at the same rate. I did not know if all private insurers have been following super. If that's been an issue yeah we are, but I will tell you that it's kind of a month to month that's getting approved through omh. It keeps getting approved and nobody's expecting it to. You know, go away quickly, but I believe so. I was just one to say goodbye. I apologize. Thank you. Thank you. Yes, so yeah, it is not a hindrance and if, in some ways it may actually become more affordable for clients, in that instance, with that copay, but it's by different insurers. Okay, thanks anyone else. Okay, so I think this gives us a little time maybe to have a bite before watching the debate. If I do not know that plan what debate I think I'll watch the giant game, it'll be less stressful. Probably it's the eagles game. Excuse me, Mr, Jake, all right! Thank you! Everyone! Thank you all for joining us this evening. Thanks for having us, I appreciate it. Thank you. Everyone bye, bye-, bye! Thank you all right, hi! Thank you! Stay safe! Everybody yeah! You too, Jeffrey.",
            "summary": "Is we have a number of presentations this evening and what we decided to do, because this is our first committee meeting in a while, and the reason for that you know, is Covid-19, and yet talking about health welfare senior issues really looking around, what's been going on in our community, what people have been doing individually to help and some of our organizations?\nWe really wanted to hear from some people tonight to get an update of what you've all been doing and be able to share that with the community, particularly people who may be tuning in now- One of the things that we've seen or get to sense of is maybe how little we need, how much we have and the importance of human connection.\nI, want to introduce first Karen Tadros Karen is president of Bay. Ridge cares a wonderful volunteer- based organization that has done tremendous work over these months So, you know, I've been following everything, you've been doing in the community.\nWe were really presented with a you know, a problem, because we had a lot of pop- up little pantries in the community, but that did not address the seniors.\nMaybe, you know 10 people who said yes, I need a delivery of food over the next 14 weeks.\nOur territory is Bay Ridge, that's where we work, but one of the things we wanted to do was in order to get the word out that we were providing this food to people.\nWe would take over their community room and 150 of their residents would come down and have dinner, served by beverage, cares and our volunteers and then another additional 150 meals would be delivered out to the community to people who could not afford a meals on thanksgiving or seniors who were alone because of Covid-19.\nYou, know people think Bay Ridge is such a rich community.\nPlease share with the group sure just to kind of start out to make I'm pretty sure everybody is familiar with Bay Ridge Center, but just a couple of things to talk about in relation to the things that happened is you know the, which is what I wanted to talk a little bit about what we've been doing through the pandemic, and what I want to emphasize is that, even though the centers have been closed, the staff has still been working so just like what Karen was talking about in terms of all the excellent work that Bay Ridge Cares has been doing.\nWhitney hamilton, who is teaching a drawing and watercolor class for us, and she figured out a way to do two to have her laptop and then also her iphone connected to the zoom meeting, so that she could have her hand be seen in one of these little boxes so that people could actually see her hand movements as well as when she's talking, and I just thought that was extraordinarily creative and very fun and also seems to be very helpful.\nThere was pretty lousy, so she was actually going to different neighbors homes and working in their cellars or on their porches or other places to be able to conduct her exercise class, and so there really was a sort of a time when each of the students would begin the class.\nI'll show that to you again, and we also have a number of resources and especially wonderful groups that we collaborate with just wanted to shout out to our friends at the Community board, 10, for all the things that we do, and you know making sure that it's easy for people to be able to find different organizations in the community that they can connect.\nYou know eagerly working on being able to grow that we have a sort of a my section here in terms of being able to create the profile, we're able to do mail back and forth to people individually and securely access.\nWe're really excited about making this become a real destination for people 60 and over in the Bay Ridge area, and have it be a resource for them to you know just to participate with each other and to build the community and find deeper ways of in engaging with it.\nI have more friends now you know and open up meeting new people and things like that, so I'm not as isolated as I have been so it sort of opened up.\nYou could talk a little bit about you know and speaking about the digital divide, do you think there's any way that we can help or apply for grants that help seniors?\nDo not really have those resources, but there are a few people that I'd like to join, but I do not even know how to open up a computer Maybe we can work on helping those seniors?\nYou know a good collaborative effort with the Bay Ridge Center, and certainly you know it's going to be challenging getting off the feet during Covid-19, but as we roll through, I think.\nDo their kids come and do a lot of our events with them, but they have about 400 of their students who look to do community service, not for any other reason except to they want to help, and these are young kids who are available during the daytime that can meet up with seniors.\nI did want to sort of piggyback on one thing that Marianne was saying, which is that the device is certainly a challenge for people to be able to get.\nYou know basic service being able to order food or to be able to communicate with people receive information.\nIt is a little bit of or a lot of bay ridges, but it sort of starts off with Bay Ridge Center, which is essentially the headquartering headquarters organization, and then the Satellite Office Bay Ridge Connects is actually a natural, a neighborhood naturally occurring retirement.\nI think this has really pushed the use of technology ahead in ways that we will continue to use it going forward and then be able to reach more people.\nIt's really a very broad base need most of our clients are working going to school, doing well in the community.\nYou know we work well with people to make sure it's available to them."
        }
    }
}