{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "title": "Youth, Education & Libraries",
            "publishDate": "2020-11-20",
            "shortDescription": "",
            "lengthSeconds": "2:25:05"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "Ug1KzYfJ9aM",
            "fillerWordCount": {
                "uh": 318,
                "um": 383
            },
            "readTimeFullTranscript": "92 min read",
            "readTimeSummary": "14 min read",
            "wordCountFullTranscript": {
                "schools": 58,
                "school": 49,
                "parents": 35,
                "data": 33,
                "kids": 32,
                "students": 30,
                "library": 29,
                "services": 29,
                "classes": 26,
                "statement": 26
            },
            "wordCountSummary": {
                "schools": 12,
                "students": 11,
                "school": 11,
                "parents": 9,
                "data": 7,
                "libraries": 6,
                "classes": 6,
                "decision": 6,
                "health": 5,
                "kids": 5
            },
            "fullTranscript": "Okay, good, so let's go back here. Hi everybody I just got a text from Steven that he's helping Blanche log on so he'll, be with us shortly all right, I'm going to start the webinar part of this, which should let the attendees into the attendee part of the zoom right now that appears to be just Paul, whoops, nope, okay, there's Catherine I am here hi. My name is Mark Diller nice to meet you the of course. This thing goes up now. My the co-chairs of the committee are navigating technology. So, if we'll all be patient for a minute, no problem I, don't know about you guys, but I continue to have a landline solely so that the telemarketers have somebody to call I. Guess: Blanche is having her troubles because Steve just texted to say, he's still working on it. Yeah they're working their way through it. They apologize they'll be with us as soon as they can. Blanche is having a little login trouble. I! Guess! I'm here, yay, hey blanche every this is an adventure every meeting with something new. Yes, indeed. Well, we have both of our co-chairs here. Steven's, muted, but he's with us as well so I will now fade into the background and just look for texts, so my apologies I, I'm going to I've joined the Geek squad. You guys should know so. I've gotten quite good I. I've said the day that I'm helping people get onto technology is a it's a different day, but I guess mark that's what we we have right yeah well a year ago, this time I wouldn't have been able to spell zoom. So we all have to come up. It's a new world anyway. Take it away you guys, I'll shut up well, like let's, let's jump in I, think that we've got a little bit of an adjusted group here today for a bunch. A couple different reasons. One to let you know is our second speaker. Unfortunately we're going to be rescheduling. There was some issues. It was a difficult week in education. Long story short we're going to reschedule for another day which makes us as happy as claims for our first speaker and it'll. Give us a lot more time and I did get a couple peppers of a handful of committee members there's just a lot of there's a education meeting with the with the DOE. So a couple people chimed in so I think we'll probably have a little bit of a smaller team which will make it very intimate and we will get to ask lots of questions about the libraries which everyone here is super excited about. So so what we say is it will be quality, not quantity today. So that's the method. So first we want to thank our speaker and I'm going to I guess we were trying to figure out. Is it hammer I, look at the name: I, I'm not floating itself I like a couple more vowels when I see a name, but could you give us some direction? Sure yeah, it's armor! You were super close all right inches there. What's the last name, it's okay, that one's a little harder to say. So the library is good for getting foreign names in strange names. Every year we have a different strange name and they're all charming. That's I'm glad to hear that. Well, I'm going to stick to armor, it's a lot easier for me to say, but we are, we have a great I'm going to. So what I'm going to do is I'm just going to give a little bit of structure of the meeting, I'm going to give it to blanche to introduce you and kind of get into it, her passions, libraries, so I'm going to let her take a little bit more control of that and what I will do is the general process of the meeting is honors. We're going to give you a little time to kind of speak talk about your role, talk about your role and you know various different topics. I think the ones that we're interested very much is whether it's an update but kind of how libraries are working within Covit has always been. You know these times are interesting and again I'll. Let Blanche dive in a little bit more I do have a little I, don't know, Blanche has it, but I do have a little biosol introduce you, and that is you are with the government, relations and community affairs of New York, the New, York, public library and I. Think we put a wrote. We love to hear about the expanded world, libraries and services for the community during Covent and up and I'll. Let bland speak a little more, but we're going to give you some time to speak and then we'll go around and let each each committee member generally ask a couple fabulous questions, we'll let the audience as well or our participants, as we say and I, think. The goal here for us all is to educate ourselves on the work you're doing and in the space itself. I do want to thank Bev today, who's, taking notes and and I guess, I didn't realize it. I did put two and two that Bev takes a lot of notes, so she made it clear to me on her response back so we'll take that into future considerations. Sometimes everything doesn't compute, but we have been rotating around and and but I to thank her and we always give the note taker the first question, so you do get a little bit of a little bit of a good spot. So with that Blanche, do you want to I'm going to hand it to you to introduce him to armor, okay amar? We want to welcome you because I know you've been trying to present to the board for some time and for whatever reason it hasn't worked out, but we certainly welcome you here this evening and I happen to be a big library fan I. Think a lot of people are but I am particularly fond of libraries for whatever reason and I live right around the corner from Bloomingdale. So I have a particular affinity for that library. But what in reading about libraries in various publications and newspaper articles when a lot of our institutions are failing us somewhat, it seems to me that libraries are picking up the slack and doing a lot more things than we traditionally think of libraries. As doing I like to say it's not just books, libraries have gone into areas and are providing services that we never associated with libraries and Amar. We would love to hear from you as you have written about them. Those services expand on it for us and tell us a bit more about what libraries are currently doing and will probably do going forward. So the floor is yours or the Carol. Is yours? Well, thank you very much and thank you for such a welcoming introduction, it's very nice to meet everybody, and I'm very happy to be here virtually tell you a little bit about what we've been up to at the library, the past several challenging months. So obviously these are unusual times and we, you know. The first thing I want to say is from the very beginning. We have taken the threat of the virus to the public and our patrons and our staff very seriously, and that's why we were actually one of the first major you could say. Agencies or institutions to close even before school is closed because we felt the threat was that big. At the same time, we very quickly pivoted to getting a lot of digital offerings out there, and so those digital offerings weren't just about getting people the things that they always got from the library, and so I'm talking about digital collections being available or things like our tech connect classes or career counseling or scan and deliver for research libraries. It was actually also. We were also trying to reach people who had been adversely impacted by the pandemic, and so we also had a community resources page that had things like information and ways, folks who may have been now facing evictions, for example, from their homes or food insecurity or may have lost their jobs and need help with unemployment. We had a whole slew of resources on that front as well, and so that was something we were very happy to be able to do very quickly. One of the things I like the most are two things that I really like the most one was a focus on parents, caregivers and students who are now in distance learning or remote learning. We partnered with a company called brainfuse that offers free tutoring for students k through 12 in both spanish and English, and that was used very heavily. There were forty 000 interactions in brain fuse within the first, a few months of reopening and that's grown to I. Think about a hundred thousand since then. So that's something I like to tell people about the other thing I'd like to tell you about is the tech connect classes, because there were a lot of people who did lose their jobs or looking for jobs during the pandemic, and they were looking for classes that would teach them coding website design, even photoshop Microsoft office talking about advanced Excel classes. All of these sorts of things, Google docs, free classes, on a regular basis and I, can tell you as somebody who was putting the word out about these classes. They were filling up very quickly, so our digital offerings were great and we were happy. We were able to get them out there, and you know: I have a lot of statistics that show that people use them, which is awesome. We're really happy about that. At the same time, though, we know we're familiar with the digital divide. We know a lot of people, don't have internet access still, and so, while it was great that we got these services up and running, we know that there's people in their homes, particularly in underserved communities, that don't have access to these services, and so, while keeping health and safety in mind and prioritizing it and I'll talk about the protocols that we engaged in. We moved to reopen as quickly as possible in a safe manner, and so on. July 13th. We reopened eight branches for grab-and-go service, meaning that folks could. It was kind of like a curbside pickup for library books for researchers were able to do, scan and deliver, which I mentioned earlier, which meant that they could do a virtual, constant consultation with a research librarian who would then based off of that consultation, send over materials that they'd scanned and send them through email, and then that number grew also, as things were going well. We opened more branches and now we're at about 50 grab-and-go branches. But you know we know that that's still not enough, and so we also very worked very diligently to try and get expanded service, and so I'm talking about computer access internet access this thing. So this is what we called phase two and we knew that was particularly important to communities where students want to come in and do their homework or patrons want to come in and fill out. Health care, related paperwork, unemployment, paperwork, Et cetera. So we we got that up and running. But within a few days the spike happened and first it was in Staten Island, which became a yellow zone. And so we rolled that we rolled phase two back right away in Staten, Island and unfortunately, a couple days later, which was this Monday, the 16th. We decided to reverse phase two completely, so we're back to phase one and that's unfortunate, but I share that to make the point that we're just as committed to health and safety and taking care of the public and our staff as we are getting services out there any way we can and we're constantly thinking of new ways to get stuff out there and reassessing our plans. So you know we hope we don't have a date for reinstating phase two, but we are like I, said, constantly re-evaluating and hoping to get that up and running very quickly. Just a last one or two things. I wanted to share that we've been up to too during the pandemic, we've been working with the city and communities directly to play a positive role in the pandemic response and stop the spread. So you know one thing we did: was we partnered with the city to provide Coba testing centers at our closed branches test and trace centers we're currently in talks about learning labs, where parents can bring their students for child care services not provided by our staff, but through partner organizations? And probably the thing? I'm most proud of is our summer reading program over the summer, which we launched was again. It was digital, but my team understanding, the digital divide actually distributed books directly to kids in underserved areas and one of the ways we did that was partnering through elected offices. You know a council person or a state senator already distributing food or PPE, and we would just show up with our books and let them know and get the books out there. So that's a little bit about what we've been up to we're. You know we feel, like Blanche mentioned very kindly. We've played a big role in this city's recovery from a lot of different crises, and we hope to continue being able to do that any way we can moving forward. Okay. Thank you now, I wonder if you could expand a little bit now, you're talking about citywide, yes well across our boroughs of service, so Staten Island, Manhattan right, I'm going to ask you a little bit later. If you could pinpoint our particular area, you know our cluster there in CB7, but right one of the things I found most interesting in reading about what libraries do are the communities you serve and service that we don't associate with libraries, I'm thinking about senior houses, I'm thinking about going into jails, I'm thinking about even giving space in the libraries for pre-k classrooms. I'm thinking about your mobile service. I know you have one mobile van per borough, so you are reaching people that we don't normally associate with the library serving and if you could tell us a little bit about that sure I mean I. Think that some of the tutoring and the career services I mentioned are an excellent example of that. Getting a bit more. You know one area that I didn't cover as much was career counseling right, I'll offer. You know one-on-one career counseling to anybody who needs it. A resume prep resume workshops how to write professional emails. That thing has been huge and the same. We also do financial advisory in the same sense. So that's one area. Other areas include, you know we do ESL classes. We do adult basic education services. You mentioned our program at Rikers island. We have you know we had 17,000 individuals through our drop-in english conversation classes at Rikers island this past year and we also do citizenship classes. So those are some of the examples that are top of mind right now, when you say you do things like career counseling and financial advising is that library, staff or professionals in those areas come in? Are our library staffs geared up to do that? Yeah, it's library, staff who are trained and in providing the service. However, we also do a lot of different events. We've had a lot of zoom events where we may bring in a former business owner or current business owner who will come in and post a class on financial advisory. So it's I guess it's a combination of the two really okay: how are the mobile units working or are they out of commission because of the pandemic yeah, you know the mobile. The bookmobiles would have been fantastic right now, yeah, really saying that a lot from the very beginning, I think if we did stuff like the book distribution initiative I mentioned earlier, we should be able to do the get a bookmobile up and running, but you know, unfortunately, the powers that be have made the decision to have them out of commission right now. But what helps is you know anytime I hear from folks who are asking for it requesting it and Blanchie had done that in the past and I mentioned that to the folks responsible for making these decisions that helps people see the need so I'll definitely do that again. Good. The Covid-19 testing was that on site and who came to do that? Yes, it was on site at our branches and I believe it was healthcare professionals working with the state so the same way, some of the New York state. Well, all the New York state testing, centers that are free and you see different health care professionals working there. It's the same exact thing: it's just happening at one of our closed branches: okay, I, don't want to dominate this, but I said I was a big library fan, maybe some of our other guests and board members have questions for you. If you like, Blanche I could I'll move people around and stuff and we'll get everyone an opportunity. I did have a couple questions myself. Okay I'll go around and let everyone have an opportunity and we also have some audience participation and so a couple of things so of the services on here that you're. Talking about how many of the when the libraries are closed, you know how many of those are available not available. I've heard you allude to somewhere, Digital I just want to get a sense of during it. You know when they're closed and I can you clarify? Are they open? Are they going to be close with the schools? I'm sorry if, if we're being a little repetitive, no, not at all so just wanted to understand services and how you're opening and closing and then the services that are available when you're closed sure. So currently we have 50 branches open across the city across our boroughs of service for grab-and-go, which means that folks can do kind of like a drop-off pick up for now. What I was saying earlier is that we had opened an additional 14 for expanded service last week, which we were very excited about, and expanded service meant photocopying scanning computer access internet access, but then we evaluated the threat on the ground. We had the rising infection rates and first we rolled it back to Staten Island, and then we rolled it back branch-wide yeah, that's what I thought you said: I just wanted to clarify it: yeah no, of course sure, and then our services I think almost I believe that almost all of them are digital. Now I mean everything that we were doing in person, things like ESL classes, things like the career counseling that I mentioned so most of the things we're already doing are still there and then we've added now, we've added stuff that we weren't doing before and we've seen the way people are engaging with this and I. You know to add on this point or expand on it. We're really excited about that. So when we go back to normal or the new normal we're going to keep a lot of these digital offerings, you know stuff, like the book club partnership, we have with Wnyc immensely popular things like we also recorded a studio. Album called missing sounds of New York that for folks who are feeling isolated during the pandemic. You know things like that. We want to keep doing stuff like that and just making digital library cards more accessible for people and digitizing collections. We digitized so many of our research collections. Those are all new things that we weren't doing before that we plan to keep doing even when we're fully up and running again, and so the tutor program that you mentioned about that was digital. That was going on at the end of the year beginning of this year to clarify no, so that's one of the newer. That's one of the newer things we did on-site tutoring before, where a lot of our staff, children's librarians adult librarians, also were providing tutoring services, but when the pandemic happened and we saw distance learning becoming a new phenomenon, we entered a partnership with this company brainfuse, which is a full database of tutors, and that was something we did not. We were not doing before so I guess that thanks for clarifying and I'm sorry, if I'm I'm troubling through this I, don't know teenage kid over here, just walking, and bothering me just so you know so it's almost focused, I'm ignoring him right now, just but he's inches from me. I think he's getting the point as we speak. If I look seem to live long. So the question is how many like how many of these services can we start to move some of these services? Digital I mean to me it would be great to have some of these services, particularly for the tutoring, and the second part was just an idea. So one was: can we move some of these digital because I think that would be wonderful, there's just not a lot of resources from that perspective, as we fight with all the education challenges were happening, I had I mean I had one idea. It just sparked me as you spoke, but one of the is it possible to do a class or to kind of help people educate them on technology, I mean one of the things that has been a problem is helplines. You know how to help people that are having problems getting on I mean I, don't know how you would do it, but if the library can do a tutor course and I mean I think sometimes people are learning how to work with technology. I would just think if there was some resources or ways to do something either an online session on you know how to do a zoom call or how to work devices better. My understanding is that there's still a lot of problems with that and I do not believe the DOE is offering very much in that area and I guess the question is: do you? Could you maybe coordinate with them to maybe help them? If you have those services sure so, on the first question, can we move these things to digital I mean I? My initial thought would be that we have moved a lot of these things already to digital and the there is not a significant gap between what we were providing before and what we are providing now on net. As far as our services are concerned, almost everything that we're providing in person is available in digital and has been enhanced, which is why we are going to keep these enhancements moving forward. This so like the tutoring is a great example. We didn't have brain fuse before we only had in-person tutoring pandemic happens. In-Person tutoring is not possible anymore, but now we have brain fuse. If God willing we get through this. When we get through this, we will have in-person, tutoring and brain fuse, it's kind of how we're thinking about it and with regards to technology, we are doing a lot of that. Actually so we have this whole program called NYPL tech connect and it gets into exactly what you're talking about how to do a zoom call how to I think I was mentioning earlier how to start your own website. If you want to learn coding, if you want to learn how to use photoshop, if you want to make your own podcast, you know stuff, that's more leisurely but stuff, that's also more professional, so yeah that's been super popular. Those classes are always full and we hear from a lot of people asking us to offer even more of them. So that's something we'll be looking at thanks and I guess just to qual to clarify the last part, I mean I just know we had principles here, I, don't know if it was I think it was the last one I just I, don't know if there's a coordination I mean that may be taking and coordinating you know with it with a school in terms of anybody who wants to join this session. I just think we're all going to try and figure out how to do more with not less is the wrong way. I guess I want to say it, but it just seems sometimes we're. Sometimes our roles connect the dots with people in different areas and I would just suggest or think that, if you're doing, if you have these courses somehow connecting with education as a whole and how you can help out, there's just a lot of holes from that perspective, I think we've identified that as the most challenging area and if there's any role you could play again. We have three schools here that were talking about how there was a lot of people who are still struggling. If you did one course and said they and the principal or the PTA shot out and said, they're going to be doing something from the Lo from the library that walk you through an ABC of such and such it may be an easy. Maybe something I thought would be interesting. Sure, no, that's a very good point and I do think. The collaboration could be better. So I appreciate you mentioning that. Remember: I, just quickie, I'm sorry Blanche Quickie question: how do you promote what you do in the various communities sure how many people? Don't know that libraries offer these services, not every library offers everything, but in a community. How do you project yourself and how do you promote yourself, sure your services yeah, so we're working in a sorry about that? Just a second here, so some stuff in the oven, all right. So, yes, we are constantly communicating on several different fronts in the interest of reaching communities directly. There's a couple different ways of mediums where this is happening. The first one is through our wonderful branch staff who have been great resources for their communities and what happens is we? My team will put together talking points on some of the things that we're up to at a high level and we'll connect with the branch staff and let them know what those updates are. And then you know we work with branch staff to make sure, for example, that all the community boards are covered. So over the summer, when we launched phase one of reopening, we, our team tracked to make sure that every single community board was reached and that these updates were shared as you shared Blanche I tried to reach CB7, but we didn't ultimately make it work out. So that's one medium where it's happening another medium is we have a lot of different newsletters that we send out regularly that folks sign up for so there's NYPL connect, which is kind of high level, all the different things that we're up to. We have NYPL kids, which focuses specifically on resources for our students k through 12. We have a newsletter actually for the tech, connect classes that I talked about and we have a research newsletter. So that's another way that we go about it and really we I feel at least that we have a very solid relationship with our branch staff. So we hear from them a lot. They hear from us a lot and you know a lot of times. They forward Us emails of people from the community they're reaching out to them, and we do the same. So I'd say it's a combination of a few different channels: communication, okay! Well, let's go around the horn and, as we said, Bev you have first honors, so jump in yeah. I was interested in how NYPL has been impacted in its services by the budget constraints that the city is experiencing and if you could speak to that, I was very heartened to hear that you feel that most of the services you provided previously are now still being provided in another mode which is good to hear. However, we all know how difficult the year has been for study agencies across the board and would like to hear what you have struggled with there and what has been the impact on you sure. Yeah I mean I think. Obviously our costs have increased and you know one of the biggest areas where we've been spending. More is technology for remote work for staff, environmental consultants, PPE thermometers, cleaning protocols, those are all areas where we're spending a lot more obviously, and the other thing is that our budget for staffing is a little bit lower as well, so we removed 95 full-time positions and 460 hourly staff to match with decreased service levels in FY 21. I'm sorry can you repeat, the numbers, yeah sure, 95, full-time positions and 460 hourly staff to meet decreased service levels in FY, 21. and then we've also reduced our budget for library, materials, security, office, related expenditures, professional services, staff training. So that's those are kind of the areas where we we were hit the hardest. But overall we have been able to maintain the overwhelming majority of our staff and the bulk of our essential services, which is our number one priority. Now we know pain may be coming in upcoming budgets, so we don't know how long we'll be able to do that. But for now that's the that's. A state of affairs question on the staffing reduction: are these furloughs or were the staff actually severed from service? Are they on furlough pending phase? Two and maybe phase three I, don't know or were they released completely furloughed? They were furloughed. Okay, the there was a very small number of full-time non-union staff: five who were not furloughed but placed on hold okay, yeah. Okay, what we're going to do next, I see Shelly your hand up, but we what we want to get it. We have a panelist, that's from a local perspective, so Ashley I think who is from one of our local St Magnus branches. If market, if you could handle that I think we can get some more feedback from a local perspective, so I'm promoting Ashley the panelist and she should be able to unmute and even share camera. If she wishes and I think she's with us, hi I'm with you, I wasn't really preparing to speak, but I can just tell you what we are offering on the branch level to any really anyone we are doing one-on-one computer sessions mainly right now we're focusing on ebooks we're focusing on databases we. If the demand is there, we will definitely offer more, but the demand needs to be there. I know I shared my email in the comments our children's librarians are also making. They have at least one or two weekly virtual class visits scheduled, and they are looking for more. So, if you know of any school principal you can reach out to me and I will share their email addresses and they will get anything scheduled. They can do database classes, they can do basic literacy. How do you like database how to search the internet information literacy classes as I think Amar was saying we might be remote, but we are still there. We are trying to have a very strong presence in the community, we're trying to offer as much programming as we can virtually and we hope to see some people there I mean. Does anyone have any questions for me? Like I, said I wasn't planning on speaking tonight? Well we're going to get you know if you could stay with us, we're going to kind of go around to everyone, and if anybody has any specifics from a local perspective, then we'll make sure that we identify yourself. But we appreciate you, you giving your perspective you're, welcome and I. Think also I think Cindy mentioned that she wanted to give some an update from a recent update. That's relative as well Mark. Can you make that happen? The man behind the screen, I can and I'll just mention, while I'm doing that. Carmen is now on the on with us from West Prep and she may be one of the ones wanting to connect with Ashley. So perhaps Ashley could put her email address in the chat again, but we'll also look forward to hearing from Carmen as well, but meanwhile I'll stop. Where did I go here, we are I, think we were going to promote Cindy, because I think she mentioned that there was something relative to to add great so Cindy. If you could unmute yep, hi, hello, everyone. This is actually very relevant to what you've been talking about. So council member Rosenthal had a hearing of the women joint with youth services committees. Yesterday and at that hearing we learned that DYCD, which runs the K-8 Learning Labs program, will add the Saint Agnes branch to its list of sites. We just found this out yesterday, that'll be adding it to the only two sites that we have now on the Upper West side, the Gertrude Etterly Center for 3-K pre-K has already filled 30 seats and the Ymca, which is for K-8, not sure the status of the seats there and we were told by DOE that it would be set up by the first of the year at St Agnes. So that's the latest information and it kind of relates to libraries. Even that's all I have Stephen I, think you're, muted, sorry about that. I can't figure it all out, but so wha I thought we could get back to some questioning. I know: Shelley, you had your hand up a few times. I see other people up and we'll get make sure we get to everyone. If you want to, if you've got some thoughts. Okay I had a question from an eighth grader who couldn't go on tonight because he's doing his homework, not here next door and I. Guess it's local. He has a research project due and he can't do all online sources. How does he get books and other research material from the library? Do you want to answer that? Yeah I can answer that question too go for it. We are in our grab-and-go locations if he can, if he doesn't know what he's looking for I recommend calling or ask NYPL service, it's just 917 ask NYPL. He can talk to someone either through general information or patron accounts, and they can help him find books specifically to put on hold, and he can pick him up at his nearest grab-and-go location, which would probably be Riverside or it would be Morningside Heights if he also has a subject we're off offering something called shelf, help that he may be able to get help that way too, where they're going to get five books and he could specify I any five non-fiction books according around this grade level. In this subject and the librarians at that branch will do the best they can to help fulfill his request. So and so there's kind of the two options. Yes, it's harder than what it is in the past and it might not be like as instant as it had been, but we are doing our best that we can and if he knows how to use the library catalog, he can place books on hold and again get sent to his nearest branch. Thank you actually. Could you repeat, there is some live person that he could speak with his research is about and that professional can direct him to that. Go ahead that professional! It's our ask. Nypl telephone reference department, yeah, it's actually how I'm spending most of my remote work. He calls and just says, I need one or two books on the civil war. I'm an eighth grader. Can you just put any two books on hold for me? They will be able to help him suppose. The question is broader and he says what books would you recommend this is my topic? Can the person recommend some books? That would be I mean we would do a search in the online database and see what's available. But if he's wanting I mean it's kind of would be the same thing where we would be searching, we would be making recommendations on what we think he should be putting on hold. That would hopefully help in his research project, and it is part of like the reference interview to help narrow down and actually find out kind of what a person's actually asking in their so like the civil war is very broad. We might like ask more qualifying cases to help, get it more specific. Like are you wanting life in the north life in the south? Right? Are you needing primary sources and we would try to go from there? That's a great service yeah. Thank you. You're welcome, Kelly we're going to follow up and want to see the final product on that paper. Just so you know. Okay, I'm doing the editing all right, I'm working telephone reference tomorrow morning. If he calls he might get me at 11. Okay, I know: Courtney. I've seen your hand up. So if you want to jump in yeah, I I just had a question actually about brain fuse, which I is very exciting and interesting and I was not aware of that. A couple of questions for you on that one one is just kind of in terms of bandwidth in terms of assuming there may be if awareness increases and you start getting more requests for that. Do we have enough bandwidth? Is there a need for more bandwidth, for that kind of? Are there some limits or ceilings on that? If the demand goes up and then also do you happen to have any data on who is who has been using it? Those numbers that you quoted on how many calls were pretty impressive: do we have any data on who's using it and on the flip side, what are kind of the communities that maybe aren't taking advantage of it? That really could use greater awareness of it right, yeah. So, on the first question, with demand and bandwidth, I have not heard anything about that being a concern right now. I think that's what been one of our most utilized digital resources right now, and we do talk about limitations here and there, but that has not come up as one so I think we'll be okay there. It's I, don't have information on who's using it, but I could probably find that for you, so I'll look into that and see I'll ask around knock on some doors and try to get you that information yeah cause like I said it's actually, the flip side. That's interesting of who's, not using it who might really benefit from. It is interesting to me totally and that's, and that gets back to folks without internet access, which is the simple answer for the moment. But I will definitely get you something more specific later is underserved communities folks living in housing developments who don't have hotspot access. These are people who could absolutely benefit from this resource, but they don't even have the internet access to get to it, but, like I said I'll get you something more specific. Great okay, Natasha I, see your hand up so the floor is yours. Thank you. I had a few questions. I was hoping that you could elaborate on your offerings for seniors in this time. I know that you were offering like senior fitness classes and the book club I think was also quite popular and also you know. A related point is that now that many of us, many more of us, are on devices from the youngest kids to the oldest adults. I was wondering if you also offer some programming on digital literacy. You know things like cyber bullying or how to recognize financial fraud. Those kinds of things you know just to keep yourself safe in you know the big bad world of the internet out there right, no, of course, so on seniors. We do a lot of one-off events that target seniors. Sometimes their book clubs, sometimes their technical skills, and that thing some of the tech stuff I talked about earlier, and then we have I would say a very high number of seniors attend our book club events, our book discussions. Sometimes we have events where we just say: hey, come and share something that you wrote or read and share it with this group and talk about it for an hour and a half. So we have a lot of seniors registering for those events. I know that we have a lot more targeted programming too. So I'll look into that and get you that information for sure on digital literacy, that's been I would say we address that kind of as a corollary as in it's a lot of our technic classes, touch on it, but I'm not aware of something that really gets to the crosshairs of the issues that you're talking about things like cyber bullying, for example. So I will definitely run that up the flagpole and see if I can get some feedback on it. Thank you. I also had one other question. You were talking about how you made this real effort to digitize a lot of your collection, but are you also partnering with somebody like Google? You know, I know that they have I think they have digitized something like 25 million books, mainly from university libraries. You know, which is something like I, don't know how how rich your collection is in university press books, you know which serve a different target audience and a very different purpose, and I'm wondering if there's any partnership with somebody like Google who's, already done all that work to expand your library digitally. We don't have partnerships with like major companies like Google or but we do have a great deal of partnerships with publishers and database collections and owners, and that's how we've been able to digitize so many of our collections. So we have like, for example, you know our database sessions. There were 219,000 database sessions in 2020, thus far, which is up 25 from 2018. So there is a lot there and a lot of people are using it and yeah. Most of our partnerships are academic in nature or with publishers, but not with companies like Google now great I see our esteemed leader, Mark Giller raised his hand. Well, I want to let her else go first and I see that Julian's got his hand up. So why don't we take the actual student in the room? First and then I'll back clean up I did want to make Jul I wanted to make an announcement for someone we a friend of mine. Has you have competition today, Julian, because we have another high schooler in the panelists our June has joined. If you want to speak later, you can, but you have a fellow high schooler in here and my friend had him join and just wanted to thank him for coming and announce it and give you a little jab. At the same time, Arjuna and I actually went to middle school together and we're in the same polygon program dude. If you want to speak later, I don't know if you can figure out how to raise your hand, we'll be happy to let you speak when we get to panelists so, but thus to Julia yeah. Thank you so much for coming to present. I'm I've heard before about the brain fuse program, and it sounds amazing and I've used the library's digital catalogs for school projects too. So I'm really excited about all the things you're doing. I was wondering last time we had folks from the near public library come present. They talked about how like they tend to get less engagement from teens and from like older, like students, not because of the lack of outreach, mainly because of a lack of interest and I was wondering specifically about like college and career programs that the about the library officers offers and like what the participation in those is like. Maybe you know compared to pre-pandemic if there's more use of those, and maybe what outreach is like to sorry to to students in high school sure, yeah I mean we, so we do provide in the same way we provide career counseling. We do provide counseling and services for college students or high school students entering college. So we do a lot of that. I'm not super familiar so I should have mentioned at the beginning. I started this job at the end of February, so it was great timing for everything that's been going on, so I don't have a lot of information on what it looked like before. I could definitely look into that and get back to you and the same with our outreach efforts. I, don't know if Ashley might have anything to add, but for me that would be something. I would need to look into for you and get back to you. I have a lot to add. We have a whole college and careers pathways for high school students before in the branches. I, don't know the exact number, but they were hubs where they had extra funding to provide career in college assistance. They did sat prep. They did helping figure out what you might want to major in. They did career counseling. They did a lot, it's all moved digitally now, unfortunately, I have not worked in one of these branches and so I don't know the whole details. But if you want more information, the manager of that department is Katrina Ortega. She can give you oh currently 10 hubs, someone just put that in, but we offer a ton and it's all gone virtual for so outreach to teens I am actually a former Ya librarian. It's always been hard to get. Teens engaged and I do have to say that during the pandemic, that is one thing: that's suffered, pre pandemic. We did a lot of fun programs, Gamings art, manga programs and, unfortunately, that's just not something we're able to offer right now. A lot of branches are doing like team booked discussions, but again it's really hard to get them and get to get teens engaged. But again, if, like any high school any school, no matter the grade, we are more than willing to do information literacy sessions. It doesn't matter the grade. Like I, said: I used to be a y, a librarian, so I've done these type of class visits before and in a way it might actually go better virtually where you can have command of everyone's screen, but it's but actual programming right now for the pandemic for the teens it's hard at least that's what I'm hearing from my colleagues who are team librarians, but one of the strengths is the college and careers pathways and there's there should be a whole page for it. On mypl.org, too or again, the manager is Katrina Ortega. Her email is just first name. Last name Katrina, with the k at Nypl.Org, I'm sure she's more than willing to ask any answer. Any questions you guys might have on that and I saw in the comments. Someone corrected me on the number of hubs, so she may have more information on it too, but we're definitely trying, at least in that aspect, to offer the same level pre-pandemic as we are now post-pandemic. Thank you, okay, we'll go! You can keep yours even though Doug raised his hand mark we're going to keep your spotlight so we'll go mark then Doug, I'm sure he'd be happy to wait for it for you to go first, very good! Thank you and there may be some more folks in the attendees as well. So armor I wanted to thank you for the wide, ranging topics that you're able to help us with and Ashley as well. One of the things I was. There was a somewhat emergency meeting last Friday with the mayor's community affairs unit, joined with the test and trace folks, and they were picking the brains of everybody that they could get a hold of, including the Manhattan delegation of community boards. District managers and chairs and what they were looking for, among other things, were places to have test and trace sites going on, one of which was or one type of which I should probably say was these self-test sites. So you go to a site, but they don't actually there's no health professional there to actually administer the test to you and bring it back to the lab. They give you a kit where you can do it yourself. If our district office were open and sanitized, we were, we would have done it ourselves, but unfortunately, there's no budget for the sanitizing. So we're a little bit behind the eight ball there. They actually cut our budget by twelve thousand dollars in the last whatever so I. Don't know. If that's something that you can take back and see if they would be interested in using libraries to do. But it does seem like a timely thing, especially considering that today is the first day of classes. In-Person classes being suspended. I will assume most politics here and just say that it caught a lot of parents off guard and was not as well received as it might have been if there had been previews or a more detailed and more ranging long-ranging plan in place. So anyway, that that's something that's more to take back and the only other thing I wanted to make sure is that, because, in a in an uncharacteristic moment, it's me not Blanche. That's just bringing back to your attention. The basement of the Bloomingdale branch library closed captioning not available is to take this moribund space. That's been reclaimed from ridiculous, dead storage in prime real estate and to push for it to be used as the kind of community center and flexible programming space that could facilitate a lot of the kinds of socially distant in-person grab-and-go things that we're hearing about from Ashley and from you, and also the kind of test and trace thing that we just referenced and so forth. That basement is a star waiting to be born, and so I would be remiss if I didn't at least give a quick shout out to that budget. That recurring budget priority of ours, I, don't I, know it's probably coming out of left field. So I won't ask for a response, but I do ask you to keep that in mind when you bring stuff back and other than that, we're grateful for your being here and for all the different ways in which the public library system is trying to soften a little bit the blow of this isolation. So thanks very much sure, absolutely and just quickly on the basement that there is a 3.6 million dollar project to create a dedicated team room in that basement, and it was originally on target for completion for June 2020. It got delayed because of the obvious, but construction did resume, so it should be wrapping up in the coming months. So I'll check in on that again, but Amar if I could just add to that. The teen space is on the first floor level, okay basement level, okay, 3.6 is already budgeted and the design is in and everything is there. What mark is talking about and I was hesitant to bring it up for the thousandth time was the basement, the actual basement, which is the footprint pretty much the entire footprint of the building. It's just there. So many of the things that you're talking about and have talked about could be accommodated and should be accommodated right. So if you could look into that, that's different to the team space got it apologize for that misunderstanding. I will absolutely run that back. Okay, no reason why you would know well I, I'm skeptical that Blanche didn't bribe mark to bring that up, and the story for this is I've since I've been I've joined here, I'm not a lifer, but I've been here a while. My first meeting I ever went to from hell about eight years ago. Blair started talking about this space, so there's quite an award in it for you. If you can figure out how to make this happen, this is her passion, project and I, see. Mark knows what I'm talking about. Maybe Shelley is okay: let's go to Doug I think you are up Sir, hi Amer! Thank you. So much for being here and I'm learning so much just about the connection and the synergy between the sister agencies at this city and I and to mark's point I just happened to be speaking to someone from New York, City, Health and hospitals on a real estate matter. Who then said to me that they were partnering with their sister agencies, including the libraries and that was pertaining to potential testing, maybe down the road, vaccination and things like that. So I'm happy to hear that physical space is being used. So I just had two real quick questions. One was a real, simple question, which you mentioned: that the bookmobiles were out of service and I was curious to know how many of these vehicles exist. What type of vehicles are they and are they being repurposed for anything such as besides books and literacy, but also you know, food PPE, whatever the city might need, so are those vans or trucks or buses just being mothballed. So that was my first and then I have a follow-up sure. The short answer is yes: they are, which is rather unfortunate. I, don't have all the insights into why that decision was made, but I have expressed it on various community boards. Behalf the utility that the bookmobiles could play so I will absolutely do that again. I think you know with issues like this, the more they hear it from different places, the better chance there is that they'll re-examine it. How many vehicles are they and what type of vehicles are they so Ashley or Elizabeth may have a better idea, but I think it's less than five? Actually, it is three there's one per borough. I have personally never seen one, but I've been told they're about the size of an accessory van, so they have like room for I. Think a couple carts, two people, usually staff them and I know the bookmobile staff is working in the branches right now too so they're not out like they haven't been furloughed they're working back in the branches doesn't sound like a huge fleet but to the extent that they could be repurposed, for whatever needs are coming up in our city, with food and PPE etc. And the other question was I. Guess you perhaps already covered it, but I'm through other meetings that we've had here. I'm hearing a need for the for people to understand how to get their setups. I've heard there's a lot of tech, videos and tech classes that you have so are they somewhat rudimentary because someone, you know who really may literally need to know here's your router, here's how you set it up, and this is what you have to do. Do you have those very basic classes and do they live online somewhere so that at any given time that is convenient for parents and students that they can go on and my into it and to add on to that like on a local level, when the city distributes well, there were iPads, but then computers do they know the city is distributing it. Do they know exactly that? This is what you should go to: New York, City, libraries, here's all this information you can use with in access through your new computer and also the possibility of private partnership with. If you go into your local best, buyer pc, Richards, hey here's what's available at libraries right so on the first question with tech connect classes, yeah many of them are very rudimentary, but as I'm as I may have shared I, don't remember a lot of them focus more on programs and software than they do. Here's how to set up your router, for example, and again, Ashley and Elizabeth, can correct me if I'm wrong on that, but I think the majority of them are for developing skill sets for using different programs and software. So that's a good point for me to bring back as for what's loaded on the devices that we hand out through DOE partnerships and so on. I, don't know that is included, I! Think it's typically, you know we'll. We put. We had some challenges at first, but we were ultimately able to get simply e on a lot of devices, for example, which is our digital checkout service. But we don't have much beyond that as like here's how to use this, for example. So that's something we could probably do more of I wasn't even thinking of loading it, which is even probably better but I was thinking of literally like hey here's, your device and by the way, here's the website for New York, City libraries- and this is all that's available to you in case. They didn't know it, especially if it's coming from the city but yeah that we do so through the simply e-page and the remote resources you can find that stuff, and there was a little glitch with that at first, but we did get it resolved as of two weeks ish ago. I think, thank you thanks very much I wanna just add I think this is where you were asking about students being able to reach out to New York public library resources. This is when it's most important, the school librarian relationship. If the relationship existed pre-pandemic and it was strong you're like ours- was- we have our children's librarian, Sarah and Doug, who are awesome, librarians they're out they were out doing class visits last spring and summer and now that if the relationship existed before where we are trying is hard to continue on we're trying to offer the same information, literacy type classes. And if the relationship didn't exist, we can do as much emailing as we want. Like I said, I was previously a young adult librarian, but it's sometimes if schools aren't responding or teachers aren't responding. It's hard to get your in sometimes with the school. So once we're in then it's very easy to spread like this is our web page. This is how you request a book. I can do that in a 15 minute class, but some of it's just based on relationships and I worked over at Aguilar for about 15 months and they had a lot of very strong relationships with the schools. So I'm assuming they're very active over Nc Community Board 10, because the relationships existed already thanks, but and just not to belabor this point, but it really is one of the things that I think could really came out of. It would make me happy, even if it was done on see if you have a kid in the school, you have a DOE account. You get a lot of updates, even if one update was. You know that your public library has resources to educate your kids and you on technology I. Just think it would be a good idea again. We had a meeting last week, I mean last month, and what we you constantly hear from us is one of the biggest problems is around people, the lack of devices to kids and trying to fill that gap, but also very disappointed that the DOE hasn't done a better job, creating more infrastructure for this and as much as you can plug in play or help out or even just say, hey if you're having problems with it, you know reach out to your local library and perhaps they can help you I just think it would be a great idea because I that's one of the common themes we've been hearing over and so and and again that's one way to do it. We get these emails. When you have a student and perhaps you could offer these services and even that way they could do it and again as they were as Ashley was saying as Lo the more local you can get that's great, but any follow-up on that area, I, really think, would be helpful. Doug I know I, don't want to put you on the spot, Doug Mcgowan, but any questions because we're going to move to the the participants- and you know none for me- I just your last point I think- is the right point. There's been conversation about demand in conversation about understanding, what's available, connecting the dots as a parent I wasn't even aware that there were the grab-and-go's available, so I learned today, something that I could now pass back to my wife and kids, who used to use the library you know two to three times per week, so the demand piece and the connecting the dots to ensure folks know the that you're open for business in the way that you are I, think it's a appropriate follow-up great, so mark I, sometimes give it to you to I. Think you've already promoted some people, but perhaps you can help me with the part, the panelists or to see so Carmen Reyes from West Prep Academy, which was of course the focus of one of our more recent previous meetings is with us. I'm not sure if she has a question: I promoted Arjun, just in case he has a question and why don't I just complete the pox and and promote our one remaining attendee so now everybody's in the same the same boat with us here. If you want to unmute and and ask a question, if you need me to help you do that, I'm glad to do that so Carmen, June or Allison yeah I, don't have a question but I just wanted to say I'm happy to be here and I'm very thankful to be listening in on these conversations thanks, Arjun Carmen. Do you have anything for us or are we have we covered it in the chat and Allison sellers? I'm not sure if you had a question I just want to make sure that we don't miss out on you here, no nothing from me, but thank you very much for the conversation. It was really interesting, excellent and I'm not sure if we Carmen so I guess we'll move it back to Steven Elizabeth on the panel now did we give her an opportunity. Elizabeth Palladina of Eldino was Elizabeth sure if you want to unmute. Please join us that way. Otherwise, Elizabeth was helping us with information in the chat. Oh I got it. One final thing: you know to Doug Mcgowan's most recent point if I could jump in for a quick second, if there is a flyer or a couple of flyers for the offerings that the that either the branches or the central system would like us to promote, we have an e-blast of a couple thousand folks, I'm going to wager that there's a parent or two in there, and maybe that would be a useful thing for us to do it's most effective. If you have a flyer, that's in either a pdf or a word document format, but even if you have a photograph or just a text, we can slam that together and get it out. I'll leave it to you to decide whether it should be done before thanksgiving or after, but that's something that we would be happy to make available to you and Ashley, especially on an ongoing basis. If there's, if there are things that we should be promoting, please don't hesitate to. Let us know I, know you're, very good about coming to full board and sharing thoughts about what our our local offerings are. But if we can reinforce them in email and print, perhaps they would have better penetration still thanks. That would be wonderful, when's. The next e-blast going out whenever I'd love to say whenever I decide, but truthfully it's whenever the department of Information technology and telecommunications decides that it's our turn. But so we can do one. We can do one tomorrow. We can do one on Monday I. Think that I'll try to get you a list of programs tomorrow, because I'm off next week but I'll get you a list of what's coming up through the end of December that at least that what I know of is scheduled and on their calendar, that's great, and if, if I'm not responsive, that is your cue to get back to me. Okay sounds good great and armor. For yourself, I mean we always leave as besides. Maybe the suggestions that mark made I mean is there anything that we can do to help you this year or to advocate for you and the things that you're doing that's very kind of you to ask I, don't think so, I think it's you know I really enjoy having a relationship with the communities that we're serving. So you know it's, you know to keep things going. I'll put my email in the chat, have a nice back and forth with everybody here and make sure I get back to folks, and you know things like the bookmobiles that stuff I want to make sure I can be. You know, I can advocate for as much as possible and no that's about it. Just making sure folks know what we've got out there for them, and you know we're still out here doing everything we can great well, we first of all thank you for your time and all the information you shared I also think that perhaps you know we let's stay in contact, I mean I, think you know whether it's every six months or every certain amount of time. I think you know it would make sense to get get updates, particularly in a year like we have this year. So I wanted to thank you for coming. I appreciate your time, our cyber claps for you and thank you as well Ashley for coming as well. So we're going to move on to some other things. We'd love to have you you're welcome to stay, but we appreciate your time. Thank you very much, thanks, okay. Well, what I thought to do is I know that, as I said, we were going to we rescheduled. Our next visitor speaker, I, should say so. I thought maybe I was going to bring this up a new business. Maybe it gives us a little bit more time to speak about it. I think we're all aware of the. As mark said, the updates in the school live teaching has now been paused. I have lots of mixed emotions about it. I also sent over I. Don't know how many particularly everyone on the committee just some data points to guide some of my thoughts and I thought. Maybe to have a conversation about it, but I feel pretty strongly about this and may want to think about what type of action we may be able to take. I'll read off these facts for the people that don't have it and I'll see as I know it and then I'll offer anybody to speak about it, but look the in person and in person has been paused at the very least. The number, if everyone doesn't know, is that they chose back I, don't know if it was June early on that. If the schools exceeded a three percent rolling day average the positivity the schools are going to shut down to give some context, I think some, maybe at the time that was a good I could say good thinking. Maybe that was a time, but I do think. There has been some guidance that has been out there. That's been a little bit different and I thought that number personally was I was a little taken back at it, for instance, the World Health Associate organization, the who their recommendation is five percent for the world. You know it should be closing under five percent and I think if people are aware, our governor Cuomo has gone on fairly public to say that perhaps that number should be reevaluated at the very least or perhaps how they do that. Another data point I think worth it worth discussing is that our schools have proven to be extremely safe. The data that I have is of a random testing of 71,000 students, 42,000 staff, 30,000, plus schools. Only 189 came back positive, which is a 0.18 percentage and I the New York Times. Reporter said one of this, it's clear that one of the city's top health officials has declared the public schools are among some of the safest public places to be so. The data itself is coming in that the schools are very safe and if you just look in contrast to others, you know Europe, which we don't necessarily have to model, but Europe actually has very similar things going on they're, not closing their schools up spoke to my friend in Canada before this just to kind of understand, because we all think of Canada, none of their schools are closed down. Matter of fact, all of their schools have been op have been all open, so there's really no hybrid up. There they've been opening to schools, so I just thought to add these data. These data points my perspective is I was disappointed to school I. I'm a big believer in the hybrid approach of choice and I was surprised, disappointed that the schools are closing and that's where we're at the other point that mark brought up is just the continuing transparency and communication issue that we spoke to. This is all being done very last minute. We, you don't have to have kids to know how challenging that is, but when you do, it makes it a little bit worse. The impact that this has on people is very challenging, so you know my feeling is to make some type of statement about it. I have some ideas, but I did want to open it up to other people. I just continued to feel just you know. Disappointed is the least way I'll say it about. What's going on, so I'm just going to go a little bit in order. I saw Doug first, we could have mark anybody who wants to speak, but, but maybe we'll just go around and talk about this topic thanks so I echo, a lot of your points and feelings, I think the data that you presented as some good data points for consideration in terms of what we would do about it before discussing that piece of do. We know I. Think two questions did the last resolution that we passed supporting the principles in their participation in these decision. These types of decisions do we know if the principles in any way were involved in the decision, this specific decision, I'll answer and I'll, let mark if you look ahead. My belief is no. This decision was made back I think it could have been as early as May and based on our conversations with our principals last week, they weren't even being asked any questions as late as September I would be shocked and I certainly don't think they were in the room the other day down at the mayor offices. I could be wrong if somebody knows me to be otherwise, but I'm pretty confident, that's the case, then assuming that's right, which I think we all think is probably the case, then in terms of a response- and you may have you probably already have a obviously an idea of what it would be, but picky backing off of our last resolution and the lack of involvement of individuals like principles and these type of decisions to me would be a potential way forward. If we were to think through and look to make some statement, we made a pretty direct one in the last resolution that I thought was very valuable from a community perspective. So just a suggestion thanks mark did, you want to say something. Yeah I have a couple of thoughts here and I'm going to distinguish that distinguish them as process thoughts rather than substantive thoughts. First of all, there was a little bit of feedback on our resolution that we in calling for principles to be part of the loop. There was a reaction saying well what about parents? What about other educators, you know, obviously Uft is at the table in some fashion, but superintendents and so forth, and the Cec's themselves, so a teeny bit of pushback, but the larger process point that I would say is that this is something on which I would think we would want to engage the community. My takeaway, by the way, from our meeting with principals, there was an undercurrent that was not expressed. That I may be the only one that Mis interpreted or misinterpreted it, but I got the sense that they were saying that if they had been asked that they would not have endorsed in-person schooling because of the risks that it posed both to their faculty and to their students at a time in which everyone was certain that what did happen today would happen and not being so I. That's a surmise on my part. That's not a reason to do or not do anything, but I think that if we want to make a statement about this, we need to do this in something other than new business. We need to put it on an agenda, invite people to come and say yes or no, maybe even line up a speaker, and obviously we can't couldn't do that in the you know, half an hour that the mayor and the governor finally figured out how to talk to each other and decided that they would go forward with the mayor's decision. So that's my process problem with this I think that I would endorse the substance of the thoughts that you were you're giving. But I'm not sure that we're in a good position right now to make a statement that really does speak for the community. Okay, well, I see other hands we're going to get to them. Two thoughts to clarify I do number one. Let's we can we'll at the end, we'll discuss that I understand your point. I may have a different perspective on that, but we could talk about it and I would clarify principal Washington. I think took a position that you had mentioned. I, don't know if the other two advocated that way and I believe principal Washington took that position, not necessarily out of safety out of the fact that there was these series of decisions that put him in a position that this is where he was at, but we couldn't read into his mind. I don't mean to, but I'm just saying, I'm not sure if this was a safety issue or I've got this many teachers I don't want to bring substitute teachers in it's. You know there could be a bevy of reasons, but I understand your point. I may have a different point, but why don't we go around I'll? Let everyone speak and we can talk about it and see if we can find something, let's go Shelly and then let's go Julian: okay, sorry, New, York, City, school principal assistant, superintendent, teacher, I, understood why the principals had hesitation because they're responsible for all the management of things they didn't feel that they were ready. Okay, but it happened, and when it happened to the extent that it worked well, it was working well closing it now is a whole other piece and I think the biggest demographic that's missing in the whole picture are the parents and the parents are the consumers and the children of the consumers, but the parents represent them, and the fact that there is no to my knowledge, parent body advising this group or as a part of this group, is horrendous in 2020 as it would have been in 1990 or 1950. Parents have to are most concerned about their children and have the responsibility primary responsible for the children and if they, every parent, that I know knowing about the 1.9 1.8 in the schools and happy with the hybrid model or whatever model they were using. No one is anything but upset or outraged that schools were closed today and are likely to be closed for a while now, so I think that there isn't some parent body represented among the group making decisions is just so bad. So thank you. Shelly I mean a couple things I'd, say: I. Think Julian would take umbrage that he's not the client, but I saw him smiling when you said that so perhaps we're the advocates too, look anything that we can only have meetings and hopefully invite everyone. You have your own committee. You hope as many people come up, so we hope that parents come in parent associations. I believe Carmen who joined was an outreach. Who is one of the parent Association, so we're doing our best, but you do have some parents, I'm a parent, there's other parents that have kids I do think there is some representation, but we're always open to how to get more parents or right pardon me. I, wasn't talking about this committee. You were talking before. To the contrary, there are many parents here, yeah and grandparents. I'm talking about the decision. The mayor and the union made: maybe what about? Where are the parents there well, I will violently agree and I would say mark and we did add a last-minute e-line in there. That said, ask for a more transparent process for kids parents, everyone, and perhaps it wasn't a strong enough statement, but I know we did add that and perhaps, if we decide to do something we'll make that a stronger statement, let's go to Julian and then we'll go to bed just responding to Shelley a bit. I know, there's I mentioned there's a few apparent organizations that do exist. I do agree with you that they haven't been involved properly, but the Cpac, the Chancellor's parent advisory council is an advisory board. That's I think it's meant to assume that role. There's a student equivalent of that and I think both of the bodies aren't really I, don't know taken as seriously as they should be, but I know there are also parents who sit on the panel for educational policy, but I don't know how involved they are with these decisions so I my and then responding one more point before I get to the point I was planning to make about. You know why you know we had the three principles on the call last time and why you know I think it's important to understand. I think that one of the reasons that principals may have preferred to go full remote or would have wanted more advanced notice or all of this isn't so much about safety. But it's more about logistics and scheduling, and my school is very fortunate. Over the summer we thought this through. We thought this out and the majority of students at my school wanted to learn remotely and we could, because we were high school students, it's a lot easier than other schools, but we set up a system in which we take all of our classes on zoom. So, even when we come to the school building, we still take our classes on zoom in the auditorium, with our teachers in separate places in the building, which is a very it's a unique plan. I think there's actually more and more schools who are doing that plan, but what it basically means is that there was no effect for us when we switched on today, like I, just attended all my same classes. The way I normally do, students who were in the building yesterday just attended all the same classes as they did in school from home, which they had been doing because they weren't coming to school every day. In the first place they were already doing days from home so like that, allowed the transition to be very easy, and that wasn't the case for other schools and I also know for other schools when they have remote learning, they don't get sticker and synchronous when they have sorry when they have remote learning, they don't get synchronous instruction every single day, especially and that's I. Think that's one of the big downsides is that if for a lot of these schools going full remote, it means that students might not actually have like actual interactions with the teacher for days out of time, perhaps and it's all just assignments posted through Google classroom or whatever, and so I yeah, so I think that I just want to bring that up as a point in terms of this issue, specifically, oh one more thing: I want to bring up about that about remote. Sorry, my thoughts are all over the place here. But the point, the other point I want to bring up about school closure is that you know the rates have been really low in schools, as as Steven said, but we are entering winter and I. There have been lots of concerns, there's been a lot of articles about, and what's it going to be, like with ventilation within schools, a lot of schools. Don't have you know MERV 13 filters, the Martin Luther King campus, you know down. The block is a great example of that and what are they going to do when they need to have their heating on and they need to? You know, keep their classrooms warm, but they also need to like keep windows open to have proper ventilation and they've already there's already been classrooms where students are all wearing their coats like now in November. So what's that going to be like in January, so I just want to put that out there too, my to be brief here on my in terms of what we should take action with, as a committee I agree with mark that it might be better to postpone until a future meeting I. Think right now the decision's been made to shut down schools, I'm off to my head, I. Think I, remember it being for one to two weeks: I think like there's a they're not going to reopen, there's not going to have an opportunity to reopen until after Thanksgiving, so I, don't think, there's I, don't think an immediate action taken by us tonight will have an impact on things. I think the action that we take, we I think there's like two paths and we could pursue both of them. I think one path of action would be to go along the lines of communication and talking about the fact that you know decision was made incredibly last minute with very little. You know advanced notice and also like we didn't even know if the mayor and the governor were on the same page about the decision being made and I think that's the point that relates to the previous letter that we wrote and we might not even have to pass. Another resolution to you know, write another letter about that and another point to bring up, which I think would involve a lot more. You know necessary input from you know: stakeholders, people with experience on this is if we wanted to make a statement about. You know this three percent threshold at which schools are closing I know, there's been a lot of discussion about how it feels unfair that well not unfair. It just feels it feels from a public health standpoint wrong that indoor, restaurants and gyms are open, but schools are not, especially when schools have such a low transmission rate, and so but I understand that writing a resolution saying that percent change should be moved or should be altered is something that should probably involve some input from public health experts in some way or another, but I think that's another type of action that we could take as a committee, and we could take that maybe at the next meeting and then maybe that would have an impact for future potential school closings. Sorry I talked for a while there. Those are all my options, no problem, yep, yeah I, agree a lot with what Julian has said. I think you know I'm not sure who said it, but the summary of it was you can have the gyms open or you can have the schools open, but you can't have both and it seems to me that our public officials have weighted a pro adult rather than a pro child regime here by essentially choosing to close all of the schools. I think the one thing I would like to know more about. I have heard that the in many, if not most, schools, the testing regime for students has been extremely frequent and effective at locating who folks were infected. If that is true, it would seem to me and I think that the governor has in fact suggested something like this. There might be a more nuanced way of looking at a threshold which, of course, would be important, but to have it for the entire city, as a blanket doesn't seem to me to be aligned with the whole regional approach that our health folks have taken here in terms of different regions being treated differently. The red zones, the Orange Zones, the yellow zones- I mean for schools. It was everything and I just think that is totally out of kilter and I do think. An information session that brought together perhaps public health people and school people, and had some sense of trying to come up with a and parents of course, and as well as educators, would come up with some kind of way of talking about this. That had a more kind of sense of reality to it in terms of what the schools are actually experiencing. Thanks Bev and your point I mean I didn't get to it, but I completely agree. You know a number across this entire system seems you know at this point count intuitive we've learned to think Micro. We've learned to think local I took the I went on the map today. There's an area that I'll tell you, schools, close there's, no schools closed on the Upper West side, I, don't think in our district. Most of the ones that are like red are in certain clusters, so I didn't even want to get into the next layers of the things that I think but I think taking a different approach to my problem and then I'll let go on it's like and I'd like to we'll talk about the statement and I. Don't need to I, don't want to comment on the statement and I don't want to say this is wrong, but we have one number- and we just learned a lot since then to literally close an entire school system based on one number to me is a flaw. We've learned too much and that's my major issue, not necessarily the number which I'm not necessarily crazy about either, but we just have so much more data and we're evolving this system, and that would maybe be something that maybe we can to agree upon. But we'll continue the conversation Courtney did you want to say something: yeah I just want to. Second, a lot of or third, a lot of what's been said, I that three percent number was set back to summer as part of the agreement and the contract and I acknowledge that. But one of the hallmarks of our Covid-19 era is having to constantly reassess our policies based on the new data and the new science. That's coming in and I just failed to see why this wouldn't also require reassessment and so I. Think part of what we could be doing is encouraging that reassessment I also think that's kind of the micro targeting it's confusing to me. Why, when the numbers first started to go up, we accepted that we could micro target it a bit and, while I understand that there is going to be some threshold at which that's no longer possible, I do think getting some health officials to weigh in on. That would be helpful and then lastly, I would just say that I read something that in which the mayor said that any reopening would probably involve an increase in testing in our schools in order to make sure that we keep tabs on this and keep it under control. And if that's the case, that feels like something that can be discussed but should be being discussed to keep it back, because this is both a kid issue. But I actually would also edit is an adult issue for parents who can't work, and we've spent a lot of time. This fall and summer talking about equity. I would also point out that there's a real difference between the people who can afford to to throw some money at this problem and the many people who can not and the impact on the adults and the workforce for this kind of last-minute closure and the scrambling that it's going to require of the parents is really unacceptable and to have it have no end and no ability to plan around this is really untenable for working parents, and so I do think there is some and should be some impetus and I understand the need to have it be open, but I do think, there's a time sensitivity for the families that are really struggling and scrambling on this one. So thank you thanks. So I don't see anyone else actively speaking you could join in, but I will pick on what Courtney said and start mark, and that is mark. I think you know that I've been one of the bigger due diligence. We've got to you know: I, I'm not the big fan of it's an emergency and we need to do it now, but I would just disagree in the sense of and I think I'm hoping we can find a middle ground. But I think timing is an issue this just closed today. There is no guarantee that this doesn't go on three months two weeks and so for that reason, I put it in the category of I think there's a sense of urgency and if you're a parent, I guaran may be a kid too, but I guarantee you have a sense of urgency. So this would be one of the few times that I believe making a statement is important and I think you know mark that. I'm very much do not go that way. Very often, my feeling is I would like to make a resolution and a statement and I think what, if that resolution, but I also agree that we should do a meeting next month and I would like to get more data. But I think timing is of extreme importance and my feeling is if a statement is somewhat about continuing to talk to pick up as Doug said about a better process like we said last week last month, buddy, but bring that into the bring that a little bit more and I do see some more hands up. So I'm going to get to Katherine I, see you and Arjun I see you as well, but perhaps the statement is more along. What Cuomo has basically been saying, which is and I and again, I'm speaking a little unfocused. But one of the things that was said is that I watched it I watched the press conference. De Blasio said now that we're closed, we're going to have to figure out what's the new process, what's the new methodology and it opens up the door for my feeling. Is that saying we would that I would like them to be taking in more of these data points and as they look to reopen schools and as they look to evolve this process that we have grown and educate grown in and there's other data points that should be taking in I. Don't need to condem a number a three point, but I do feel that some I feel strongly personally. That I would want them to know that I feel this way that this is not one number blanketed across the entire thing is wrong. We should evolve. That process evolve, that data. We have new data, we have new understanding and encourage everyone to work together to find something else, which is basically what kind of Cuomo is saying: I'll pause there I'll, let some other people speak and we'll kind of go back to Catherine. Did you want to add something? I thought I saw your hand up, and now it's down I feel like. We definitely need more information and I also agree from public health experts and I. Also agree and I agree with Mark's point about process. I also agree with Steve about the urgency: it's really dangerous for kids to be out of school, it's especially difficult for low-income families or kids, who don't have parents or for kids who are in unsafe situations for kids who don't have technology. So what if we were to write some statement to the effect of kind of asking for what the administration should be doing to to improve the process for schools and families and those who support kids I, don't think we should make claims about the numbers I. Just don't think we have enough information about what's safe or not, but I think we could right now make a statement about process. Our process is so small, but the city should be doing that right now, so I think we could make an argument about process right now to try to encourage the city to to be better and protect kids who, because being out of school, is dangerous for a lot of kids and it's as Courtney said it's like really chaotic right now. So could we make a statement? Would people feel comfortable writing a resolution or making some statement about process in the next two weeks? I mean I. Certainly that's what I'm advocating and that's and just to be clear. I'm not advocating saying three point is wrong and five point, because I'm not educated enough, so that's I think we're saying the same thing, which is you know, I I'd like to see their process and decision making evolve and, however, we articulate that I would want to try and get a compromise. I'm not advocating telling anybody anything, but I am advocating making a statement so I see Arjuna. Did you want to speak now? You could just beat yourself because you're here, yeah I, just want to second what everyone else has been saying: I feel like the general goal is to get the most amount of kids in front of like a synchronous class in one way or another, and whether it's through getting people to actually go to school or at home learning I feel like. There also needs to be a side of this that, like that talks about at-home learning too, because, like I, have a little brother at home and he's in second grade. He goes to ps199 and what I see him at today was a synchronous day and I'm working full synchronous too. The amount of zoom time he has is nothing close to the amount of time he has when he goes to school and going back to the equity point like the more time that I feel a kid is in front of a camera, even though, like a lot like screen time- and all of that is bad on eyesight- whatever I think there's also accountability, less the amount there's less work, the parents have to do too and I feel like we should be encouraging schools to move towards more synchronous activities on virtual days, because, like one of the like correct me, if I'm wrong, but what are teachers doing all day other than being a teacher, it's not like they have other things that they're supposed to be doing. I feel like there is definitely a way for us to have more synchronous. Zoom time when kids are at home great well, thank you Arjun Mark did you want to say something or well I? Think probably I should wait to the end, but the thought that while the goal of having more synchronous time is absolutely correct and I would endorse that the environment, the natural result of the problems that we identified last month is that teachers are preparing for three different lessons, only one of which they're going to deliver that they are preparing for to at least two different environments. Maybe three, then the one that they'll actually be employed with, so the disruption that everyone feels is, in my view, as equally visited upon classroom teachers as it is on anybody else, and when you add to that the notion that they are also being asked, you know it's often lost in the shuffle about you know. Infection rates among children what's often lost in is that there are vulnerable populations. Who are our teachers who are being drawn into those buildings? And we heard from our principals how many at least one of those buildings had a huge number of faculty that had to opt out because of concerns for their own health. So, while I have the floor, I'll just throw in my two cents worth what I think might be a fair statement that we could extrapolate from previous statements and also get out relatively quickly, as opposed to a resolution that has to go through full board, would be something to say that now that you've closed the schools and maybe make some maybe advert indirectly to based on criteria that very few people had visibility to until it was decided. But now that you've done it, the process of deciding what to do Next ought to incorporate all the voices that need to be in that room. We've already, we've already advocated for the role of principles to be a more meaningful part of that conversation. I think it would not be a stretch from our previous statements to say that parents, or some recognized representative of parents and I, know that that's a dangerous thing, because there are parents on every side of every issue. When I was a boy, we used to talk about college students protesting, and you know, half of them protested, one thing and half of them protested the other side. So with that acknowledgment that parents in some formal way need to be a part of this process and that administrators need to be a part of that process, both principals and superintendents, and to bring it back to that I think is a fair comment on previous statements we've made and one that we could get out relatively quickly, going on to talk about as I think I was hearing going on to talk about whether three is the right number or whether they ever should have agreed to three or how we got to where we are now is something that I think that we would need to hear a whole lot more about from at least from our community and probably from somebody with who's a lot smarter about this than me. So that's kind of where I hear that's what I think I can pull out of what I'm hearing in terms of a safe process or an appropriate process. That's my that's! Where I'll stop talking I did want to clarify, because what you're saying because I do want to do, resolution and I think what you're saying at the end is not what I want to do. We I do not want to say. The three point is wrong. I do not want to say that what I think is what I would like to do is create a resolution, because I, don't think it's I'd like to do is create a resolution that talks about process that can incorporate the first part of what you said. But I would like to encourage the DOE and the mayor to include to evolve their process of how they're evaluating closing schools, and that would include new data points that have been discovered such as. We now know these rates that are in schools, new thinking around micro areas, as opposed to a one large area, but I, don't need to say what that number should be, but I think evolving. The decision making process pass a singular number and now that they're closed in order to reopen them in which they open the door to say we're going to have to look at this in a new way, encouraging them to be looking at other data points to bring in, and that's what I'd like to say. But I'm not I am not trying to say that they're. What they've done is wrong and I'm not trying to say what those numbers should be. I'm just trying to say that they're, we have learned a lot since this number has come forward and they should be applying those learnings to reopening the schools and for the year, and that was what I'd like to do and sure Shelley you're, muted buddy. We might say that if, since we don't think children should be evaluated on one criteria that closing schools shouldn't be close, perhaps based on one criteria, I'd be happy to add any of that. I'll keep I, see some more hands going up. Doug go ahead, I, just I'm not on your committee, but I. Just I. I've been giving this a lot of thought. I! Think we all have just about you know, I'm just seeing that Los Angeles is shutting down now and has the mayor or the governor or the DOE made any specific. Were there any specific medical epidemiology epidemiological justifications for this, because you know, even if the like this is in my non-medical professional thinking about this, even at the nicest Courtney Sander. Is he thinking that the numbers are lower in school, but I read what I read is that he called this in some interview at part of the social contract that he'd made back this summer. This is a social comment. I will just factually say that there's because I've listened to everything on it, that there has been no other correlating data other than this is the number, and this is the number we decided back in May, so there there's no other data. That is like end and stuff. I know Julian brought up concerns in the future, and that's all true, but I'm just I can factually say that the schools are closing because this three-point number is hit. This was a number that was decided back in May. My feeling is: there's a tremendous amount of other ways and data that have evolved and that should be evolved. I'm not saying what it should be and I'd like to have a meeting to educate myself, but I do I. There is more data out there. Now we've learned a lot and I want to take that into consideration. My what I was just thinking this through was that if the general population in the New York local area, if the rates are higher than three percent, and then you know it's because it's obviously not compartmentalized, if the school's numbers are low, which is great they, you know, the kids are not separate from the general public right they're going to come back out into the general public through the transportation in their homes and families, and is it something that everybody kind of looked at and they don't want to panic the city and went look. This is this can't happen because it's going to it's bilateral, it's not just I'm just these are just open questions that I'm just thinking and just logically so in order to use this time, there's a I could, if we want to go offline, I can give you tons of my perspective and to mark's point. I'm not even saying what data points should be so maybe they're all those data points should be in I just want to encourage them to move past one number to close the school for a million kids and it was I believe in Arbit. You know whether it's the right number or not, isn't even my point, I just think when you were there. You know we we're always saying: oh we're evolving, we're learning revolving, we're learning we're evolving. You have to evolve. This was this to me is an obsolete process, and this is what Cuomo said multiple times. So I'm just saying that because maybe he carries more weight than Steve Brown, but he has said this. He has. That was his signal. Is you guys should be looking at the multiple numbers? We've learned quite a bit and as you evaluate it, but my feeling is that shutting the school system down and doing the things we're doing for what the 300,000 that are in and the parents that are involved should evolve. We've learned, if we're sitting here in April and we're closing it down again. It would be ridiculous. I mean we. It must be a year later and we have all these ways of looking at things and that's the way that what I want to do. I'm sorry Julian did you want to speak again. Katherine's had her hand up for a long time, so Katherine. If you want to go first you're up, you mean Catherine will speak again. If you want to speak Julian, that's so considerate and sweet. Thank you, but it would have been fine if you spoke first too. I think that we have to have I think we could I think there is urgency that we shouldn't I think that we should have a robust meeting next month and invite schools and principals and teachers, and definitely experts in public health, to have a conversation before we make a statement about the technical aspects of what the criteria is that shuts down schools, but I think there is urgency to to kids being kept out of school and I think we could argue for I think we could make a process argument to advocate, for what we think would would improve the process from input to research to communication with families. The other point, though, that's really important, is that we don't know what their what the Department of Education and the mayor's office is working on in terms of changes to the criteria. I know I saw the mayor speak about this and he said that they're going to have much higher standards. Courtney mentioned testing, we don't know what they're doing and so I think we should try to find out or just be mindful of that and I think if we were to write something and advocate for something we should advocate for more communication or understanding about what's happening for kids, the only notice, the only thing that I hear is that meals are still available, but but I'm really worried about kids that are in unsafe situations or where families who don't have child care and or don't have technology. I'm really worried about that. I around 80 percent of kids in the New York City Public school system qualify for free or reduce price lunch, and that means that they're, very poor, and so I'm worried about kids out of school and so I think we should address that. The Dewey hasn't communicated about what's happening for them and then three mark you mentioned the importance of admit of the DOE, including administrators and parents. Two additions to that one is that teachers have to be included because they're, the ones that are actually doing the work principals are managing them. But it's teachers that are interfacing with kids and are actually doing the educating or they're really important on the ground, so they should definitely be included and I think that, as a committee, we have to be careful to change, adjust our language to account for the fact that a lot of kids in the school system don't have parents that they live with. So we can say parents and families, or parents and guardians, but a lot of kids in the system. Don't have parents, but there are people that care for them and take care of them. So I think we should use like the word families and guardians as much as possible, so I support taking some action as long as we account for what we don't know and we're advocating for kind of improved process and communication about what the city is doing for the kids and families. Okay, why don't we my muted, no okay, so let's have Julian and then we'll figure this out and we'll figure what the what role we'll take so Julian yeah I, agree with Katherine on a lot of what she said. I think definitely a process argument should be made, I, think and I think we can make that at this meeting. My concern with the resolution is not that I disagree with you Steven, because I actually completely agree with you on everything. It's just that I think we could make a stronger resolution if we waited a meeting and I would I wouldn't want us to. You know, pass a res like past resolution in committee and then bring it to full board and then, by the time we pass it like. The resolution ends up being very wishy-washy and vague about using other data points and doesn't actually make a point and then, by the time that it gets past or full board, like maybe we'll have the information that we need to make a more concrete resolution and I just feel like a resolution might be able to be more impactful. If we could, you know, as Catherine said, have people giving feedback and it doesn't mean necessarily. We have to propose a percentage I. Don't think we need to do that, but I think like just knowing like the options on the table, could be useful in knowing like what the other situations are and I also think like. If we were able to in a resolution basically say we don't think it should be a city-wide number. We think it should be a local number. I think that's a position we could take I, don't think suspicion. We can't take tonight because I don't think we have enough like knowledge for that, but I think. If we waited a month, we could eventually take that position. I, think that would be a stronger position that could more easily lend to advocacy efforts. So that was my only point and just one more. This is definitely a feudal point for me to make, but I am a very strong proponent of student voice and I really advocate for including students in this process when I think of the school system and I think about the entities involved. You know that there's teachers there's other school staff and there's students who are involved and parents are amazing resources but they're. They experience the education from a secondary standpoint and so the experiences that they're advocating for our experiences that their children are hearing and I've. Actually you know I it's a little crazy, but I would totally advocate for elementary school students being on school leadership teams and like being involved in all of this. I am for student boys all the way and there are and I think student voice is taken seriously. There are advisory members on pep if you've been following the news. You know, members of a student group just take charge, filed a federal lawsuit against the DOE recently, so there's I think student voice should be taken seriously and if we're going to advocate for more inclusion of different stakeholders in the process, I think we should advocate for more student inclusion, maybe not from a like a necessary like input or vote perspective, but more from a gathering feedback perspective which I think the DOE has done in the past and could continue to do. But for this you know specific issue. I think Arjun is getting motivating Julian to speak more today, you know he's very verbose. So no thank you for your thoughts always trying to make the meeting a little later. So please take my little teasing look. Lastly, I'm going to leave and let's I mean I'm going to add a point and then move forward. Listen in a perfect world like Julian I, read everything you're saying, but I'm looking, you got to look at the you got to look at the timeline, today's the 19th. So if we are going to talk about doing this next month, you're talking about the 16th by the time we would vote to get speakers on the 16th we're our next meeting I think is on the 5th or maybe even the 12th of January. So the first time we will make a statement about this is the middle of January. That is a problem for that. Just that's way off. Do we have a committee meeting in December yeah, but if we have a committee meeting in December that will pass a resolution, then it has to go to full board which will be voted on in the beginning of January yeah and by the time it all comes. Your January and trust me from my perspective. That's a decade away, I mean and whatever's going to happen is going to be well done. I mean any statement. We're going to make is, in my mind, is going to be obsolete at that point, because, whatever they're going to do, they're going to do I think whatever they're going to do is going to do over the next two weeks, I believe the next two weeks and I've spoken to other people that I think are relatively in the room. The next two weeks are the most crucial to what is going to happen for these kids, and that is why I'm being I mean if anyone knows me for less, I'm usually pretty pliable. I'm very adamant. The next two weeks, in my mind, are crucial to what is going to happen, and I'm very concerned that somehow this is going to be converted to a we're going we're just closing it down for the year. I have deep concerns that are happening and I hear. There's many advocates that are trying to make that case that are going to use the temporary closing of this. To basically say: oh, let's just close for the year, it's the best thing and we can manage ourselves and I don't want to close for the year I. Don't believe that should happen. So that's why I'm advocating if I could have thrown together experts. You want to know I tried, calling some up over the last couple days to try and get into this meeting. I would have loved to have them, but the idea you know I know we're going to move on. I know where people are saying what we can vote on it and we'll just let the votes go. I would like to do a resolution. That resolution will be about the process of the decision making. It can be. It would be a twofold conversation, the process of the involvement of kids and students and all the things that we said, but I would like to include that the decision-making process in terms of evaluating schools should be brought in to take in the newer data, the newer understanding, the evolution of the way that we're looking at Covid-19. I'm not asking to make any I just want to be clear, because I've heard this multiple times, I'm not advocating that any data point is wrong. I'm not advocating of what it should be just that there is new data and there's new ways of looking at things and we should be taking into consideration. Look for all I know they can raise everything but I. You know it could they could say it's higher, but the way that we look at this is evolved and I want to encourage the people to understand that the community wants to see them all of this. What we want the scientists to make a decision, we want the data to dictate the decision. We want all the things we keep hearing and that's all I'm advocating for I'm not advocating for any number. So I, don't know what the process is mark normally they've gone a little smoother. This is a resolution. I would like to move forward on and vote it on, and you just you know, you need to educate me a little and do I just vote or what's the process does it need to be second or you tell me so you've proposed a resolution I take it. I've got to tell you that I'm troubled by it, because you only get to do this once so. If there's data that you think you need in order to have a more informed opinion, you're not going to have that. Second chance, you can hold another meeting, but if you bring a motion or a resolution to full board in December and again in January on basically the same facts, you know the second one is not going to be taken seriously, which is why I was advocating for a letter that expanded upon something that we've already said, which doesn't preclude the possibility of a second I, am very troubled that there's only 16 of us in the room when we're talking about this and that there was nothing on the agenda that gave anybody a clue that they should weigh in. On that no fault. No retermination, it's just the reality of this happened this morning and I have a different take on. You know, I think that the fast action that one can take is a letter that emphasizes the things we've already said, as opposed to trying to raise too many new points. I think that calling for calling for more voices in the room and that those voices need to be taken seriously and Catherine is correct. The teachers should be a part of that the Uft is kind of their representative, that's the one person they are talking to, but maybe they should do it again. Julian is right, I'm not sure I'm going to go with the the first graders, but certainly the high school students I would trust to be responsible. Calling for those voices to be in is what I think is something I think we can say, but if you, if you're the chair of the committee, if you think that what we should be doing is doing a resolution, then propose it. Take a vote and it'll be discussed at Full. Board Steve can I. Add can I just add something to what mark just said: yeah the Uft doesn't I mean I, realize it's. The teachers union I taught for years in New, York, City, Public schools I never had any contact with them at all and they didn't represent my point of view, and so we can't just say: okay, the Ut Uft is involved. We don't you know. Teachers have a voice, it's just not true. I had zero contact with them and they didn't represent me. So we can't just like the mayor, just like the chancellor doesn't represent all schools and if the chancellor speaks principles are covered, you know the teachers aren't covered just because Uft says something. That's just my perspective. As a former New York City Public school teacher. The other thing that I think we could call for is more information about what's happening for these kids that are now no longer in that are now no longer in school. That are missing, going to be missing instruction. Don't the technology issue hasn't been resolved and care for them, because schools are the conduit for all social services. So we have zero information on that right or what the plan is so I think we could act now. Steve, I'm curious what you think about Mark's suggestion to write and publicize a letter like. Can you explain why you prefer to do a resolution and then my final comment is that we absolutely can do resolution twice. We can do one and then we could do another. It doesn't have to be one or the other. So that's just my thoughts but Steve. Can you explain why you want to do a resolution? A and I think Julian's comments are correct. Students have to be involved and student voices they're, the ones that are experienced that are in school, right, schools for them and then the other piece. What was the other piece hold on the other thing? I, don't have it it's oh Julian brother point was that was concern about being vague, but I think we could be very explicit about what how the process needs to be improved from the perspective of the public of people that are invested in education, including the primary stakeholders, students and and the teachers and families, and we could do another, a more specific resolution when we have more information and when policy changes, because in two months it's going to be totally in January, it's going to be totally different situation. As Steve said, thanks Catherine I'm going to Doug I'm going to let you speak left, I'm just going to I know: Paul's been listening, Paul wrote in the chat that he would want a resolution to include all students who have equal access to education and technology. So I didn't want to acknowledge his point. I'll, let Doug speak and then I'll answer your questions and then we'll figure this out it just after listening to everyone, talk about resolution or I think we're calling it a letter or a statement. It appears to me when we think of timelines, that if we want to get the best bang for a buck, we shouldn't make the perfect the enemy of the good, and we would want to communicate a clear message in line with what we've discussed in the form of a resolution, if for no other reason than the timeline that Steve Steven discussed. If we don't come out with a resolution today, we're not going to have a chance to come out with a resolution until January and by that point we're done with the semester and I think Stephen to your point. We are likely already past the decision-making cycle for the next semester, so it just so happens that the decision was made today. It just so happens that we have our Yell committee today and because of the timeline, if we want to make a significant statement, this was, from my perspective, the opportunity to make a statement and not let the perfect be the enemy of the good thanks and so Courtney I mean Catherine to your question. I mean Doug advocated my position. I feel strongly about a resolution from a timing perspective. I, if we had to write if there was multiple resolutions, so be it and if that's something we didn't but I would rather do a resolution now and follow up with a letter in January, but I feel pat I feel a super sense of urgency about what's going on and I think it and I think it's going to happen over the next couple weeks and I mean if you want to know I'd like to make the resolution stronger and I'm trying to find a ground that everyone's comfortable with I would be taking a more active resolution. But I'm tempering that down but I know we've been talking about this a while and I appreciate it. Natasha did you want to I know you didn't have a chance to say something: I see your hand up at a much your first yeah. Let's let you speak and then we'll figure this out. I've said it a couple times, but I think we're all starting to repeat ourselves a little bit. You know I just wanted to briefly say that I'm also in favor of a resolution. I think timing is very important here and if we go into December and then January the holidays in December I, don't really think it'll have much impact, so I would be in favor of a resolution tonight. Great thanks. So does it need to be second mark or does it just move forward or how does that work? I mean technically yes, but I think you just heard a second, so go ahead. Okay, so what I would like to do is to put a resolution. It is a I would call it a process resolution that would then reiterate, including all the voices that we wanted, which are students which are parents which are teachers. You know everyone that we feel has not been included and talk about how that occlusion process has to increase, and the second part is that, as we decide to open up schools that we expand, what are the dis? What are the decision makers to new data? That's been proposed new understandings, new ways of looking at things, whether they be those numbers that are coming out of the schools, whether it be things about Micro, Section Micro areas, but to expand the process to opening ups to evaluating it, but not give direction in what that is. As a it's a compromise to be candid, you know I I'd be a little more strong, but I'm trying to find a middle ground. That's what I'm proposing so do we just you tell me okay, so I guess we'll take a vote so those in favor I guess we do committee members first, who want to vote, who want to support that and let's vote. So are we voting in support of your statement? Sorry I didn't understand we're voting for. Do you want to vote for the resolution that I just described okay and Steve you're going to pass this around, so we have a chance to look at it and give feedback and you'll be open to that feedback. Of course, aren't we always we're a very collaborative group here? This is the first one, the first little back and forth. We've ever had in the yellow- maybe it's a little fun but yeah. Of course we would let everyone be involved. Okay, so I see Doug I, see Courtney I, see we're asking for yeses. Yeah my hand is up as well. Okay, so that's one two three four five yeses I think we've been and six and Rosa so I see. Six yeses am I right, I may be even under it now, there's seven, including yes, that's seven Yeses, Natasha, Rosa, Bev, Catherine, Courtney, Doug and me okay and those against oh and I. Don't know a Paul I, don't know if you're still here and you want to put where you stand. If you were yes, you could be wherever it wants, but why don't you just put okay got it so, against from the committee looks like it's just Paul. Okay, then Julian, were you a yes or are you or then there's abstaining? Okay, so join's going to abstain? Okay, so it's 7-1-1 and then non-committee members? Yes, so I see! That's one knows that's one and abstaining. That's one! Well we're across the board. Okay! Well, I! It was a spirited discussion. I! Listen mark I would say that we'll be aboard, so there will be an opportunity for everyone to speak more at board and candidly, perhaps there'll be new I, don't know new data points and new things that evolve, but I'm very pleased that we were able to do this. So the only thing I'll tell you is that next week is a short week and the full board comes right after the holiday, so this does need to get circulated and done and two penny, because we are under a significant pressure from now on to have all of our resolutions on our website before the meeting. So just please keep that timing in mind as we move forward Catherine. Do you want to say something? Can we can we write this really fast and share it with schools or students? Julian? Do you have any ideas how we can get more student input on this? Do you have any thoughts specifically like Upper, West side like Community, Board, 7 area feedback? Maybe you could go to the model c C3, that's the only designated location-based youth group, but I, then I think we have a really quick timeline. I think it just might be better if we run through this as a as I as a committee. First and I can try to provide I. Think I'm sorry to interrupt you Julie go ahead. I think we could reach out to schools, though local schools that were in communication with Steve just to get their thoughts ask them. They know they probably know more than we do and get people to call and get people to come to full board to share their thoughts. All right. Well, let's get this together quickly. I may reach out to you to a couple of those because I know: Mark normally writes these and I'm not going to as mark to write something that he didn't really support. It would be a process, don't you thank you. So I may be needing to reach out to a couple people and sue. What I've always said is I'm a really good editor, but a terrible writer- and maybe Mark- will support me on that. But but I'll think through the next day or so how to figure this out, but yeah I understand the timeline and we'll get something out so with that I mean any other newer old business. Generally, we talk about next meeting I. Think the next meeting, hopefully will be more in depth about this, and and if anybody has ideas or guest speakers, we're always looking I know Catherine, you and Shelly, you know may know some health people to speak about it. I'm going to do it, but perhaps my idea is to have this to have the meeting anyway that we want to have, even though this is where we're at and I would certainly appreciate any thoughts or any ideas and who would be about relevant people. But let's get as many people as we can, including you know, health officials. That may be able to speak about this. You might want to have a person from the mayor's office liaison to explain what they're doing and what I think we're going to reach out to all the regular folks, I've found and mark and clarify just I. Don't think we've gotten any luck from the DOE to show up for anything that we've asked about candidly, so I'm open to any thoughts, but yeah I mean it would be great to have someone from the DOE be great to have some of them. Teachers are great to have parents and anybody who has any ideas about people that can help us everyone kind of knows. I'm always asking for help. Well, I think you also want someone from that group. That's making the con that's discussing it, making decisions without us to share what they're thinking is at that point. If we can get them in the room, I would be ecstatic we'll lasso on Doug. Did you have an idea? I just wanted to say how I just how big this is the largest public school system in the United States? This is national news. Absolutely this is not. This is being discussed all over the country and questioned whether you know so. I just wanted to echo how important and how huge this is. I couldn't agree enough. I mean I think what happens here out in New York will have a ripple impact on all the major school systems and the fact that we paused it I think will just have an impact either way. Natasha. Is there something you wanted to say before we close up yeah I did I, don't know if Blanche is still on the call he's not on okay, but I thought I remembered her saying that the December agenda would be something it would have something to do with community organizations serving the youth and how they've been impacted by the diversion of funds to them from you know the NYPD etc. Is that am I completely wrong and no you're not complying I think it was more of the way that we've been doing. Our meetings is to kind of start to visualize them and say maybe this will be this and we're trying to always divide between our mandates, youth, education, libraries, but it's there's been no speakers reached out to there's been no and I do know it's a passion of yours and one we've talked about in the past I. My plan probably is that this may usurp that and push it off and I. Don't think that Blanche is going to have a problem with that and if it's something that you're you know that upsets you or you want to talk about, then why don't we speak offline and maybe there was a way to accomplish it, but I do acknowledge that this is a topic that you have wanted to talk about in the past yeah. No, that's okay, I mean it is an important topic and also very timely in its own way so understood and had this not kind of came up, I think that was like how we were thinking about doing it, but it might be amended. Please forgive me for jumping in I just happen to have the television on in the background and Anderson Cooper is interviewing Bill gates and it's right over the television bill gates, shutting New York City school systems is a wise move and I'm curious to know what he's saying. It's literally right this moment all right. Well, you can fill us in okay, I'm starving so I didn't eat yet, and it's nine. So I'm going to go to eat, I appreciate everyone's dialogue and I wish. This is such a great committee, because I love it that we have a little conflict, but we always seem to come to an end and everyone's got a smiling face in the sense of I. You know we may not all get exactly where we want to get and I think we figure out a path going through and I. Hopefully, I'd love to see that some other committees that are a little push and pull and I think that sometimes the even the board can be so I'm just very proud of the way that we work through conflict in this committee and I want to thank everyone for their voices. Well, it comes from the top. So thank you. Okay have a great night. Everyone.",
            "summary": "Let's jump in I, think that we've got a little bit of an adjusted group here today for a bunch.\nSo I think we'll probably have a little bit of a smaller team which will make it very intimate and we will get to ask lots of questions about the libraries which everyone here is super excited about.\nAnd, then we'll go around and let each each committee member generally ask a couple: fabulous questions, we'll let the audience as well or our participants, as we say, and I, think.\nWe want to welcome you because I know you've been trying to present to the board for some time and for whatever reason it hasn't worked out, but we certainly welcome you here.\nSo I'm talking about digital collections being available or things like our tech connect classes or career counseling or scan and deliver for research.\nWe were also trying to reach people who had been adversely impacted by the pandemic, and so we also had a community resources page that had things like information and ways, folks, who may have been now facing evictions, for example, from their homes or food insecurity or may have lost their jobs and need help with unemployment.\nWhile it was great that we got these services up and running, we know that there's people in their homes, particularly in underserved communities, that don't have access to these services, and so, while keeping health and safety in mind and prioritizing it.\nBut I share that to make the point that we're just as committed to health and safety and taking care of the public and our staff as we are getting services out there any way we can.\nWe're, currently in talks about learning labs, where parents can bring their students for child care services not provided by our staff, but through partner, organizations.\nYou know our cluster there in CB7, but right one of the things I found most interesting in reading about what libraries do are the communities you serve and service that we don't associate with libraries, I'm thinking about senior houses, I'm thinking about going into jails, I'm thinking about even giving space in the libraries for pre-k, classrooms.\nThose are some of the examples that are top of mind right now, when you say you do things like career counseling and financial advising is that library, staff or professionals in those areas come in.\nNow, yeah, really saying that a lot from the very beginning, I think if we did stuff like the book distribution initiative, I mentioned earlier, we should be able to do the get a bookmobile up and running, but you know, unfortunately, the powers that be have made.\nSo, currently we have 50 branches open across the city across our boroughs of service for grab-and-go, which means that folks can do kind of like a drop-off pick up for now.\nIt just sparked me as you spoke, but one of the is it possible to do a class or to kind of help people educate them on technology, I mean one of the things that has been a problem is helplines.\nAnd I mean I think sometimes people are learning how to work with technology.\nI would just think if there was some resources or ways to do something either an online session on you know how to do a zoom call or how to work devices.\nWe will have in-person, tutoring and brain fuse, it's kind of how we're thinking about it and with regards to technology, we are doing a lot of that.\nI mean that may be taking and coordinating you know with it with a school in terms of anybody who wants to join this session.\nI just think we're all going to try and figure out how to do more with not less is the wrong way.\nThen you know we work with branch staff to make sure, for example, that all the community boards are covered.\nWe all know how difficult the year has been for study agencies across the board and would like to hear what you have struggled with there and what has been the impact on you.\nDo you like database how to search the internet information literacy classes as I think Amar was saying we might be remote, but we are still there.\nYou know if you could stay with us, we're going to kind of go around to everyone, and if anybody has any specifics from a local perspective, then we'll make sure that we identify yourself.\nI mean it's kind of would be the same thing where we would be searching, we would be making recommendations on what we think he should be putting on hold.\nI know that you were offering like senior fitness classes and the book club.\nI would say we address that kind of, as a corollary, as in it's a lot of our technic classes, touch on it, but I'm, not aware of something that really gets to the crosshairs of the issues that you're talking about things like cyber bullying, for example.\nI think they have digitized something like 25 million books, mainly from university libraries.\nYou know which serve a different target audience and a very different purpose, and I'm wondering if there's any partnership with somebody like Google who's, already done all that work to expand your library, digitally.\nYou want to speak, later, I, don't know if you can figure out how to raise your hand, we'll be happy to let you speak when we get to panelists.\nYou know compared to pre-pandemic if there's more use of those, and maybe what outreach is like to sorry to to students in high school.\nBut, it does seem like a timely thing, especially considering that today is the first day of classes.\nWho then said to me that they were partnering with their sister agencies, including the libraries and that was pertaining to potential testing, maybe down the road, vaccination and things like that.\nI think you know with issues like this, the more they hear it from different places, the better chance there is that they'll re-examine it.\nDo, you have those very basic classes and do they live online somewhere so that at any given time that is convenient for parents and students that they can go on and my into it and to add on to that like on a local level, when the city distributes well.\nI think this is where you were asking about students being able to reach out to New York public library.\nWe had a meeting last week, I mean last month, and what we you constantly hear from us is one of the biggest problems is around people, the lack of devices to kids and trying to fill that gap, but also very disappointed that the DOE hasn't done a better job, creating more infrastructure for this and as much as you can plug in play or help out or even just say, hey.\nI know, I, don't want to put you on the spot, Doug Mcgowan, but any questions because we're going to move to the the participants.\nThe demand piece and the connecting the dots to ensure folks know the that you're open for business in the way that you are I, think it's a appropriate follow-up great, so mark.\nI, know you're, very good about coming to full board and sharing thoughts about what our our local offerings are.\nI'll put my email in the chat, have a nice back and forth with everybody here and make sure I get back to folks, and you know things like the bookmobiles that stuff.\nMaybe, to have a conversation about it, but I feel pretty strongly about this and may want to think about what type of action we may be able to.\nThe data itself is coming in that the schools are very safe and if you just look in contrast to others, you know Europe, which we don't necessarily have to model, but Europe actually has very similar things.\nYou probably already have a obviously an idea of what it would be, but picky backing off of our last resolution and the lack of involvement of individuals like principles, and these type of decisions to me would be a potential way forward.\nObviously, Uft is at the table in some fashion, but superintendents and so forth, and the Cec's themselves, so a teeny bit of pushback, but the larger process point that I would say is that this is something on which I would think we would want to engage the community.\nThat I may be the only one that Mis interpreted or misinterpreted it, but I got the sense that they were saying that if they had been asked that they would not have endorsed in-person schooling because of the risks that it posed both to their faculty and to their students at a time in which everyone was certain that what did happen today would happen and not being so, I.\nThat's, not a reason to do or not do anything, but I think that if we want to make a statement about this, we need to do this in something other than new business.\nWe need to put it on an agenda, invite people to come and say yes or no, maybe even line up a speaker, and obviously we can't couldn't do that in the you know, half an hour that the mayor and the governor finally figured out how to talk to each other and decided that they would go forward with the mayor's decision.\nOkay, sorry, New, York, City, school principal assistant, superintendent, teacher, I, understood why the principals had hesitation because they're responsible for all the management of things they didn't feel that they were ready.\nI. Think, that's one of the big downsides is that if for a lot of these schools going full remote, it means that students might not actually have like actual interactions with the teacher for days out of time, perhaps.\nSo I think that I just want to bring that up as a point in terms of this issue, specifically, oh one, more thing.\nThe other point I want to bring up about school closure is that you know the rates have been really low in schools, as as Steven said, but we are entering winter and I.\nWhat's that going to be like in January, so I just want to put that out there too.\nThink right now the decision's been made to shut down schools, I'm off to my head, I.\nI, think one path of action would be to go along the lines of communication and talking about the fact that you know decision was made incredibly last minute with very little.\nKnow, write another letter about that and another point to bring up, which I think would involve a lot.\nI understand that writing a resolution saying that percent change should be moved or should be altered is something that should probably involve some input from public health experts in some way or another, but I think that's another type of action that we could take as a committee, and we could take that.\nI think you know I'm, not sure who said it, but the summary of it was.\nI. Think the one thing I would like to know.\nAn information session that brought together perhaps public health people and school people, and had some sense of trying to come up with a and parents of course, and as well as educators, would come up with some kind of way of talking about.\nMost of the ones that are like red are in certain clusters, so I didn't even want to get into the next layers of the things that I think.\nWhen the numbers first started to go up, we accepted that we could micro target it a bit and, while I understand that there is going to be some threshold at which that's no longer possible, I do think getting some health officials to weigh in on.\nI would also point out that there's a real difference between the people who can afford to to throw some money at this problem and the many people who can not and the impact on the adults and the workforce for this kind of last-minute closure and the scrambling that it's going to require of the parents is really unacceptable and to have it have no end and no ability to plan around this is really untenable for working parents, and so I do think there is some and should be some impetus.\nAnd I think you know, mark that.\nThat saying we would that I would like them to be taking in more of these data points and as they look to reopen schools and as they look to evolve this process that we have grown and educate, grown in.\nThat I would want them to know that I feel this way that this is not one number blanketed across the entire thing is wrong.\nIf we were to write some statement to the effect of kind of asking for what the administration should be doing to to improve the process for schools and families and those who support kids I, don't think we should make claims about the numbers.\nI think we're saying the same thing, which is you know, I I'd like to see their process and decision making evolve.\nI feel like the general goal is to get the most amount of kids in front of like a synchronous class in one way or another, and whether it's through getting people to actually go to school or at home.\nThe amount of zoom time he has is nothing close to the amount of time he has when he goes to school and going back to the equity point like the more time that I feel a kid is in front of a camera, even though, like a lot like screen time, and all of that is bad on eyesight.\nWhat I think might be a fair statement that we could extrapolate from previous statements and also get out relatively quickly, as opposed to a resolution that has to go through full board, would be something to say that now that you've closed the schools and maybe make some maybe advert indirectly to based on criteria that very few people had visibility to until it was decided.\nI think it would not be a stretch from our previous statements to say that parents, or some recognized representative of parents and I, know that that's a dangerous thing, because there are parents on every side of every issue.\nAnd I, think what you're saying at the end is not what I want to do.\nI. Do not want to say that what I think is what I would like to do.\nIs create a resolution, because I, don't think it's I'd like to do is create a resolution that talks about process that can incorporate the first part of what you said.\nBut I would like to encourage the DOE and the mayor to include to evolve their process of how they're evaluating closing schools, and that would include new data points that have been discovered.\nWe now know these rates that are in schools, new thinking around micro areas, as opposed to a one large area, but I, don't need to say what that number should be, but I.\nThe decision making process pass a singular number, and now that they're closed in order to reopen them in which they open the door to say we're going to have to look at this in a new way, encouraging them to be looking at other data points to bring in, and that's what I'd like to say.\nJust trying to say that they're, we have learned a lot since this number has come forward and they should be applying those learnings to reopening the schools and for the year, and that was what I'd like to do.\nWere there, any specific medical epidemiology epidemiological justifications for this, because you know, even if the like this, is in my non-medical professional thinking about this, even at the nicest Courtney Sander.\nWhat I was just thinking this through was that if the general population in the New York local area, if the rates are higher than three percent, and then you know it's because it's obviously not compartmentalized, if the school's numbers are low, which is great.\nYou know whether it's the right number or not, isn't even my point, I, just think when you were there.\nSo I think we should use like the word families and guardians as much as possible, so I support taking some action as long as we account for what we don't know.\nYou know, pass a res like past resolution in committee and then bring it to full board and then, by the time we pass it.\nIf we were able to in a resolution basically say we don't think it should be a city-wide number.\nThis is definitely a feudal point for me to make, but I am a very strong proponent of student voice and I really advocate for including students in this process when I think of the school system.\nYou want to know I tried, calling some up over the last couple days to try and get into this meeting.\nThe process of the involvement of kids and students and all the things that we said, but I would like to include that the decision-making process in terms of evaluating schools should be brought in to take in the newer data, the newer understanding, the evolution of the way that we're looking at.\nI'm, not asking to make any I just want to be clear, because I've heard this multiple times, I'm not advocating that any data point is wrong.\nI would like to move forward on and vote it on, and you just you know.\nIf, there's data that you think you need in order to have a more informed, opinion, you're not going to have that.\nSecond chance, you can hold another meeting, but if you bring a motion or a resolution to full board in December and again in January on basically the same facts, you know the second one is not going to be taken seriously, which is why I was advocating for a letter that expanded upon something that we've already said, which doesn't preclude the possibility of a second I, am very troubled that there's only 16 of us in the room when we're talking about this and that there was nothing on the agenda that gave anybody a clue that they should weigh in.\nYou, know, I think that the fast action that one can take is a letter that emphasizes the things we've already said, as opposed to trying to raise too many new points.\nJulian is right, I'm, not sure I'm going to go with the the first graders, but certainly the high school students I would trust to be responsible.\nOther thing that I think we could call for is more information about what's happening for these kids that are now no longer in that.\nJulian brother point was that was concern about being vague, but I think we could be very explicit about what how the process needs to be improved from the perspective of the public of people that are invested in education, including the primary stakeholders, students and and the teachers and families, and we could do another, a more specific resolution when we have more information and when policy changes, because in two months it's going to be totally in January, it's going to be totally different.\nAnd I think it's going to happen over the next couple.\nAnd I mean, if you want to know I'd like to make the resolution stronger.\nYou know I just wanted to briefly say that I'm also in favor of a resolution.\nIt is a I would call it a process resolution that would then reiterate, including all the voices that we wanted, which are students which are parents which are teachers.\nYou, know everyone that we feel has not been included and talk about how that occlusion process has to increase, and the second part is that, as we decide to open up schools that we expand.\nI mean I think what happens here out in New York will have a ripple impact on all the major school systems and the fact that we paused it.\nAnd I think that sometimes the even the board can be so I'm just very proud of the way that we work through conflict in this committee."
        }
    }
}