{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "title": "Top chat replay",
            "publishDate": "2020-11-05",
            "shortDescription": "",
            "lengthSeconds": "2:39:25"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "um9yXdu7Ris",
            "fillerWordCount": {
                "uh": 195,
                "um": 374
            },
            "readTimeFullTranscript": "91 min read",
            "readTimeSummary": "11 min read",
            "wordCountFullTranscript": {
                "street": 94,
                "program": 89,
                "restaurants": 86,
                "bike": 65,
                "lanes": 46,
                "traffic": 46,
                "lane": 45,
                "streets": 43,
                "restaurant": 34,
                "snow": 34
            },
            "wordCountSummary": {
                "program": 34,
                "restaurants": 22,
                "street": 21,
                "bike": 13,
                "lanes": 8,
                "order": 7,
                "streets": 7,
                "restaurant": 7,
                "neighborhood": 7,
                "zoning": 7
            },
            "fullTranscript": "Hey Craig hi good evening. I do not see chuck yet yeah. He hopefully will be hearing me. I just saw your email, so you said we have DOT sanitation and consumer affairs. Dot sanitation, consumer affairs will be here and maybe one of the others, but they did never respond okay, so we could always ask if there's city agency representatives just raise their hand, so they could be unmuted, I'm guessing that people are probably exhausted physically and mentally, and I am so. The short agenda is going to allow people to get some rest. Hopefully tonight, yes, I hope so. I know that my two hours of sleep does not do me well. Are we ready to start the meeting? Have we started whenever you're ready? I have not given my spiel for anybody who's new. So if you want me to give that okay, so if anybody has not attended one of our community board, eight virtual meetings, we you'll notice that everybody is muted and you're not able to unmute yourselves. The only way that you'll be able to be recognized during the meeting is to use the raise hand button that you can find if you open up the participants menu at the bottom of your screen. Actually, here I'll stop sharing my screen, so it'll be a little bit more convenient for you guys to look at what it'll actually look at look like. So, if you look at the bottom of your screen, you'll notice that there is a button that says participants has a image of two little people standing next to each other and a number next to it. Right now that number is 37. You pop that open and you'll see a box pop up on your screen. You'll go into that box and you'll just hit the raise hand button once you do that, you only need to hit it once then chuck and craig will be able to see you and I'll be able to see you and we'll be able to unmute you whenever you're called on, if you're on the phone, it's star nine to raise your hand good turn that down. Why do not we call a meeting to order then, like this I'd like to welcome everyone to the November meeting of community Board, eight, I'm Chuck Warren, the co- chair and craig later, my other co- chair glad to have everyone here. We have a couple of items on the agenda and we're going to have a hopefully a good discussion and then any other things that people want to raise. One is really the I guess, the open stores program and we're also going to discuss with that the open streets program before we before we do that. I just want to call everyone's attention to the fact and I went and looked, and there are two executive orders actually that that do this there's you know the open restaurants program, there's an executive order, number 126, which was signed on June, 18 2020 and then there's a recent executive order, which is for the newest one, the stores and that was executive order. 157 signed on October 28 2020, and I know that in some one of our previous meetings there had been some issues as to how zoning was affected by these programs in the executive order and the one thing that both of these executive orders do. Is it suspends a number of things under city law and it also suspends parts of the zoning resolution and that's why they're allowed to have restaurants and places where they you know in the street in places where they cafes, where they would not normally have them and that's the same thing with the stores. So that's that was a question it was raised, and I think this answers that if anyone wants these executive orders, I think I've. Given you the numbers, you can get them easily online, or will you may want to post them on our website? For anyone who wants to go to Cbam.Com? Do we have some people here craig? Do we have anybody here from the city that can answer questions on the on these programs? Essentially, yes, and anyone who is here to participate on this item from a city agency, if you could just raise your hand, so you can get will's attention and this way we can unmute you for the discussion all right great. I see Jennifer St Enus from D.O.T Marissa Yani from the department of Sanitation and emily wydenhoff. If you each can just introduce yourselves, then we could start the discussion, sure Craig, hi and hi everybody. If it's all right, I'd like to give some opening remarks and then hand it off to the other agencies as well, just to give some general introductions. If that sounds fine with you and chuck. Yes, that's fine go ahead! Jennifer yeah thanks all good evening. Everybody hope you're all doing well. I know it's trying times for those of you who I have not met. Yet I'm Jennifer Santana's dot's Manhattan deputy borough, commissioner, I wanted to thank Community, Board 8 will craig Chuck and the committee members for inviting us to join you all tonight. I'm joined by my colleagues colleen chattergun from the Manhattan office and Emily Weidenhof, who is the director of dots public space unit. Last week the mayor announced the open storefronts program, which is a city initiative and Covid-19 recovery program that allows for ground floor storefront businesses to temporarily conduct retail activity on sidewalks that are directly in front of their businesses or on roadways that are participating in the open streets. Restaurants program, the Department of Transportation, is working in tandem with small business services, the Department of Sanitation Department of buildings and the economic Development corporation, along with the mayor's Office of Nightlife. To administer this program from now through December 31st DOT is hosting the program content and online application on the website. Nyc.Gov slash open, storefronts, I'm going to plug that into the chat. When I have a second, you can find the open storefront, citing criteria and faqs on that site, along with the application link at D.O.T and our partner agencies. We wanted to build on the success of our open restaurants program, so businesses are allowed to self- certify that they need these program requirements in order for them to participate and the DOT team emily, and I were happy, you know to help answer any questions that folks may have about program criteria or outdoor setups, and thank you again to Community Board 8, for the invitation and for having a fun. Is there anyone else who wanted to comment from the city at all Jennifer before we get take questions I'm happy to see if our partner agencies also want to share some introductions as well hi, I'm Merciani from the department of sanitation just want to say thank you will and everybody for inviting me here tonight, happy to help answer any questions. You may have related to garbage. Okay, anyone else from the city, okay, so the way we like to do it at our committee is that we ask the public first for any questions or comments, and so, if people can indicate by, as will said in the participant thing, raising your hand, press the raised hand and someone will spot you and then we'll call on you and unmute you so do we have any anyone from the public will? Do you see anybody from the public here? I do not see anything. That's you have you have a few people? Actually you have somebody named Susan somebody named Ken and somebody named Evelyn. Okay, we got you, I do see them, yes, okay, so why do not we? Why do not we call on Susan? First, if you can tell us who you are Susan and your question or comment so whenever he calls on you I'll unmute you, but you just often need to confirm on your screen. I'm unmuted! Yes, okay! Thank you for calling on me. I am resident here in Manhattan and I understand that you're looking to expand the bike lanes, I find them very dangerous hold on one second susan, we're not going to discuss those right now we can oh. This is this is about the restaurants program or if you want to talk about well, I'm very supportive of the restaurant program. I think the restaurant program is a is a excellent alternative to keep our city restaurants, at least in business they're struggling very badly. Will there be heating allowed those heating stands allowed in the areas of the outdoor restaurants want to answer that Jennifer or somebody are you? Are you unmuted? You should be done, mute yourself. Yeah thanks will sorry I muted myself again. I wanted to see emily if you were able or if you wanted to jump in and help clarify some of the heating questions for Susan yeah absolutely so we did just release some heating guidelines for the winter weather. We worked closely with the fire department. There are electric heaters that are allowed in the spaces and there is some allowance for propane heaters, but only on the sidewalk space, and we can also share a link to make sure that you can connect to the fdny website and see all of the details related to outdoor heating. Okay, is there anything else? Susan on this there's also the store program, the that's the new one too. Yes, I do not. I do not. Unfortunately, there are not too many stores left in the area, so they're all pretty empty. So it's unfortunate what's happened. What about the safety factor is what is the city doing about that, especially to protect the vendors, the stores and the storefronts so that they do not get robbed? It's very difficult. You know I mean I do not have a store, I'm just a regular ordinary citizen that lives in the city and has for 30 years, and I appreciate the quality of life, and I see it. You know in a different way today and I just think that the city needs to address that. I think Susan for your point. You know that the agencies are working closely with the mayor's office on this. You know city- wide initiative, and so the mayor's office is helping with support complaints, including you know, security and safety, the ones that you've just mentioned you know a minute ago, and what are they doing? To give incentives to the stores to reopen their doors? I mean they need to have incentives or consideration. You know in a small neighborhood and every in a city is built on neighborhoods. You do not want to lose your neighborhood services, your you know, green grocer, your little restaurants, your dry cleaners. You do not want to lose those people, but I do not see the city doing anything to help protect them. I would like to add that you know, as part of the announcement that the mayor made last week, you'll find that there is a number of different businesses. You know small businesses in particular that are able to self- certify that they meet program requirements for this new open storefronts program, and you know just to reiterate a kind of where exactly they're able to set up these businesses will be able to set up on the sidewalk that is directly outside of their business or in the road bed and on the street of you, know the streets where we have open streets, restaurants, corridors. So the city is working. You know, night and day to ensure that we can try to. You know like just you know, put together and offer you know, recovery programs that now not only can help restaurants and you know schools, but we also wanted to also give this helping hand out to our small businesses now through the end of the year and see where it takes us. Many restaurants also installed this new filtration system. So I would think that, if a restaurant, that is, it has done that and gone to the expense of having the new filtration system that they should be allowed to have more than 25 percent of occupancy within the restaurant as well, because they've gone out of their way to try and consider what's necessary and the city needs to meet them halfway too. Thanks for your comments, thank you. Let me let me take Ken who's, our next member of the public ken are you there I see Ken. Would you want to unmute Ken? Well, yeah he's unmuted. Now yeah unmute yourself cannon. No, he just muted himself again. Try that again, Ken unmute yourself! There is that okay, Ken you're unmuted go ahead. Ken, hello, Ken did chat me and say he was having audio problems, so we may come back to him. Okay, why do not we go to Evelyn David then whose hand I see Evelyn, it's Star, six, sound mute yourself, hi good evening. You know what I have no comments about this. I thought we were doing something else. I will speak later all right. Okay, thank you. Everyone! Thank you. Very much all right, thank you, yep is does. Can we does Ken? Had he corrected his problems yet? Well, do we know or is he did you unmute me evelyn you're still unmuted. If you're done, oh, you get back. Okay, great! Yes! Thank you! Yes, Ken! Try speaking Ken, can you talk to us here, something I guess he's having a problem with the sound? Can anyone hear me yeah? Oh okay, thank you. I can't hear you so I'm going to have to just get across. Please excuse me, I'm a resident of 337 e 62nd and I missed most of the discussion about the bike lanes, which is extreme interest to us. We are not happy with it, particularly the way it was put in and then readjusted and then put back again. We had no input on it. There is a issue that we have primarily with the crossing guards. They do a totally insufficient and inept job. So that would be our comments and I'd love to hear anyone else's. If I can hear it, okay, ken yeah we're going to get we're going to get to that later. But thank you. I do not know if you can hear me, but thanks: why do not we are there? Any more public comments will do you see anyone else? I do not see anyone myself here, but no only board members at this point. Okay, why do not we go to the board then and Sherry Weiner had her has had her hand up sherry? Why do not you unmute yourself? Thank you. Thanks chuck, I'm supportive of both of these programs. We know how well retail sales go. That's why we have sidewalk sales, but I do have a practical problem. We know many of our restaurants in order to find the space to open up outside on the street kind of go off from in front of their stores and then what if we have a situation that we have a retail store, so I'm asking a practical question: who mediates who has the space in front of the store or the restaurant? If you know both of them want to take advantage of this, you know great program emily. Would you like to kick off yeah? So that's a really fantastic question and something we've thought a lot about and spoken to. Folks in the industry. We have kind of two advantages here. The first is that in many cases, restaurant hours end up being later into the evening when retailers close so there's a little bit of an advantage there. But we've been working really closely with the Office of Nightlife, who does a lot of work to mediate? Conflicts on the street with you know, a variety of different stakeholder groups, and so they have offered to provide services. Should there be any issues? And you know if there are a retailer and a restaurant who are not able to kind of work out sharing of the space. The Office of Nightlife will have support services and mediation services to step in. So that's something that you can contact. You know contact the city and want to make sure that everybody has the SBS hotline. The department of small business services has a five day a week, nine to five hotline where they are taking calls from small businesses across the city to try to help provide resources and guides and translations to all the different city, programs and state health guidance. So that is something that is also available and could be a great resource and a great place to send people should they have questions or issues. So the number is 888 SBS for NYC. We can put it in the chat and it's also on all of the the open restaurant pages and our open store front pages. It's 888-, 727- 4692, just a just a quick follow- up are there hours? In other words, can the retail stores stay open as long as they want, so the retailers that the their use of the outdoor space is in line with the open restaurant hours, so folks have to be closed up by 11 pm yeah, because I would think that yeah, the people living in the neighborhood may have a problem with stores and restaurants opening up to all hours a night. Thank you so much. It sounds like a great program, I'm home bit, hoping it's successful. Thank you. I think billy Friedland was next billy. You could unmute yourself great thanks and thanks to DOT for presenting tonight. I think this is a really important program and I'm you know I want to applaud you for getting it started. My question is about street vendors, which I understand are not included in the program. I know this is a bit of a touchy subject, but from my perspective, street vendors, you know play an important role in the fabric of New York City and we've got a lot of people who have been suffering. Who are street vendors who've been suffering over these last. You know eight months or so. My question is what would it take and I guess what sort of considerations DOT given to expanding this program to street vendors and one consideration that came to mind, because I know we want to certainly support. You know all of our businesses, restaurants, retailers etc, but where we have storefront vacancies, has there been any consideration given to using that storefront space to street vendors to allow them to set up? Perhaps in a with a permit, I know: there's a council bill to grant permits to street vendors. Has there been any consideration for doing that, so that street vendors can have a place to set up shop and benefit from the open storefront program thanks yeah? So it's a great a great question, something we were careful to do when both creating the open restaurants program and the open storefront program was to make sure that vendors could continue to vend. So not you know not take up the spaces for mobile and food vendors along the curb. This is kind of the one situation where vendors have a little bit of an advantage because their sales are on the street outdoors and people do not have to go inside, but I think your questions about potentially pairing vendors with open storefronts is sounds like a very creative idea and something again maybe to coordinate with and talk to the department of small business services, who has and does a lot of outreach and contact with property owners and retailers and may be able to provide thoughts and guidance on that anything else. Billy! No! Thank you. That's that's helpful appreciate it next is class, vanilla, cass, are you there yeah, I'm here I'll just put the camera on too. What is the definition of Indefinite? I mean you know these. This is being indefinite. What is the definition of Indefinite so just to clarify the open storefronts program is not indefinite. It's running from it began the first day that retailers could put out goods on the sidewalk was October 30th and it will run through December 31st of this year and what about the restaurants so the restaurant program? It has been announced that it will be a permanent program and multiple city agencies are, you know, currently kind of looking and in discussions about what that will mean what the process will be all of those things, so there's kind of little to report yet because we're still at the very beginning stages. Okay. So if a restaurant, a restaurant spends thousands of dollars and I'm sure, you've seen these structures that are being built, they're permanent, they're kind of more stable than the some of the outside cafes. That used to be so they're going to be there forever, not necessarily. Certainly the city will look to kind of re- tool and re-. Imagine the parameters of what a permanent program will be much of what you're seeing on the ground. You know was an immediate response to the pandemic, and you know the struggles of restaurants and businesses. So certainly there will be a lot of things to reconsider for a permanent program and that will certainly include the design of the spaces that are on the street. So most of these permanent structures that are being built now will kind of be there for quite a while. I think it's hard to say I would draw your attention to a couple different things. One, our open restaurant guidelines requires everything to not be permanent, so while things might be constructed, it is a regulation that nothing can be permanently affixed to the roadway or the sidewalk. We also as the city and as the Department of Transportation reserve the right for these structures to be moved for any reason that could be everything from utility work that needs to happen as well as weather events. So already, since the start of the open restaurant program, we've had a series of high wind events and we do, as the city send a notification to all of our all of the applicants in the program advising them on how to manage their structures in these types of events. So there are that there's a there's, definitely a you know a conversation and circumstances that you know we consider. Okay. Thank you. Thank you. Guys next is Peter. Barack Peter Young meet yourself great thanks, so much for for joining us this evening very quickly. One quick comment, a suggestion and a question. The comment is from the beginning of the pandemic. I thought that we've needed to reimagine our streets. It seems like the city's doing a really good job of doing that on a continuous basis. So I'd like to just thank you for your efforts and being here with us this evening, quick suggestion. I know that a lot of small business owners, especially on the east side, are having trouble actually sourcing, the heat lamps that are clearly needed now, as we go into winter. I do not know if the city has put any thought into trying to help restaurants and now retail stores acquire either it's actually. I think the gas that's running short, either through a mass purchasing process or some or some other sort of process, and then just a very quick question when restaurants stay open. Excuse me when restaurants are operating outside, are they permitted to stay open outside the previous? If the community board granted a consent to operate that and the restaurant had agreed to an hour's limitation? Do that? Does that hour's limitation pre pandemic still apply now that some of the rules have been changed, and hopefully that question was clear: if not, I'm happy to to explain it again, yeah, no, a great question: all sidewalk cafe, rules kind of pre- pandemic were suspended as part of the executive order for open restaurants. So the new time that restaurants may remain open is for the program across the board and so you'll see that 11 P.M maximum time did you have anything on the peter talked about the probe. Getting supplies of. I guess propane gas is the city able to help in that? If that's a problem, I do not know yeah. No, that's a that's a really good point. We are our colleagues at the Economic Development Corporation have started a series of resources both to connect designers to restaurant or store owners to kind of help, build out some of the these things and they have worked to put together like a marketplace. That is a sourcing resource for restaurants, so I'm not sure about the propane and the heaters specifically, but I do not have it on me, but we can make sure you get a link to both the marketplace and the design core effort. That EDC is heading up thanks so much I just have a very quick follow- up question. So I understand this. So all restaurants that operate outdoor cafes have an 11 P.M curfew and is that 11 P.M to stop seeding or to actually close up shop, so the 11 P.M is to actually close up shop. Restaurants can not operate outdoors beyond 11 P.M. Okay, thank you. Peter next is felice farber police. You can mute yourself thanks. I appreciate the efforts, the city's doing, to really try to make sure that these restaurants and small businesses are able to stay in business. I've noticed with a lot of the restaurants, and perhaps the storefronts will be doing this as well- are building structures that they're now pretty much enclosing on three sides: almost creating an indoor environment but you're outside are there regulations or guidance on required ventilation. Certain openings you can have for both restaurants and storefronts yeah fantastic question. So I think it's important to note that New York City is really following the state's lead on all of the health guidance related to to restaurants, and so we've been working very closely with our colleagues at the Department of Health. They continue to provide resources and kind of update these tools, as the state guidance is updated, as we understand at this point in time. In order to be considered outdoor dining, the area needs to have at least 50 percent or two sides of the space open. As the space becomes enclosed. It then counts as indoor dining and that 25 occupancy rule kicks into place. So I've noticed that most restaurants seem to be having three sides enclosed. So that's not. They have to keep 50 open, so maybe the 50 is all of one wall or how does that work, and I apologize for my dog in the background? No worries so I mean I think, that's something that if you would like to give us like some specific locations that we can look at, then we can kind of look on a on a case- by- case basis, but like yeah, very generally, as I understand it's 50 and two sides open all right. Thank you very much. Thank you. Thank you. Next is Michelle Birnbaum Michelle and mute yourself. Yes, thank you. I just wanted a couple of points I wanted to answer. Billy's question about Vendors Street vendors when the pandemic started the mayor actually canceled all enforcement of vendor law. So at the moment there are no controls over vendors, and that includes licensing. So you may see new street vendors who either get a table and product not necessarily food. It should not be food because I'm hoping he did not abolish the board of Health rules, I mean that should not be, but for general merchandise. I you'll see people springing up that just have a table and whatever and by product and there they are vending without a license. So basically all those laws are sort of in suspension. The other thing is when you use the word permanent. My understanding with the restaurant program was that it was to be in effect until the pandemic subsided, recognizing. Of course, we do not expect that to be any time very soon, but I'm assuming that there will be an end point, especially if we get a vaccine. So that's my first question: what is the real plan for dissembling the restaurants program? Should we get a vaccine and things return to relatively normal? Let me combine it with another question, so you can answer them together and that is the store sales. Now, that's a different situation to me, because stores can put their merchandise and, according to this order out front, I my understanding it's within three feet. Is that correct three feet outside of the storefront? Is that a correct number so, as part of this program, it's up to five feet as long as an eight- foot, clear path is maintained, okay, so or an obstruction, so like a tree guard, but it has to be eight feet. Clearance. Okay, I ask that, because to me the stores do not pose the same. Do not have the same problems as the restaurants. Do the restaurants really can not function unless they can put groups of people together? You know because typically, people come in groups, twos fours, whatever the stores, however, are not really. You can't call them overcrowded people are not flocking to stores, maybe the big Box stores, but not the little stores, and I would rarely I imagine that there would be more than one or two customers in any store at the same time. So I'm a little concerned about that with the crowding and the visual blight on the on the street. I think, if you have a line of retail stores, that could really look like quite the mess which might be acceptable if it provided any real benefit and relief for the store owner, but in the case of merchandise, I'm not so sure it does. So that's those are really my questions. So if you can address the permanent structures with you know, when you say the program for restaurants is permanent or even the store, the merchandise stores. Are they permanent when it like when the pandemic is over? Can we assume that we'll attempt to go back to inside activity thanks for those questions, so just to start with storefronts? You were mentioning that the three feet, width and that's clarified, there's five feet yep, but there are, as you probably know, there are locations around the city where retailers can already as of right, display goods up to three feet. So the open, storefront program was kind of building upon this, and one of the biggest kind of considerations was yes. Maybe there would not be a lot of people in the store, but there's still a threshold of shoppers who may not feel comfortable going indoors at all. So the open, storefront program allows for people to actually have a transaction on the street, so you could call up. You could look at something displayed on the sidewalk and then you know make a touchless transaction with your credit card, and that can all happen outdoors, and so the hope is that would give folks a level of comfort that they maybe did not have previously. The open storefront program is currently running from, like I mentioned before, October 30th, through December 31st, really understanding that the holiday time is a huge season for for retailers and for their business. The open restaurant program, the mayor announced that it will be permanent. It will be something that continues post pandemic and into the future. I think what that program looks like what the what allowable structures there are, who can participate, how they participate on? All of those details need to be thought through and worked out, and I think it is very fair to say that those you know the considerations for a permanent non-, coveted program are very different from the considerations that created the open restaurant program. As you know it today. So if I may have a follow- up since we recognize that zoning regulations are being put aside for this program as well as other regulations, what is the rationale for that once it's not needed for business and how and will it be, then acceptable for it to be in violation of zoning code. In other words, what is why are we creating this permanent program when it was created for a specific reason, and now that reason won't will be eliminated and yet we're encouraging the program to continue, because, after all, there's a lot of repercussions to having such a program permanently on the street, not to mention the visual blight, the structure, the traffic they're in bike lanes they're in you know there could be a bike lane on the other side of the restaurant, I mean I do not have to go through them. You all know, but what's the rationale for doing this and breaching the zoning yeah, so they should not be in bike lanes. So if you see a open restaurant in a bike lane, let us no but they're either within the curb in the bike lane or on the other side of the bike lane you know and there have been accidents. There have been bikes and stuff that have rammed into them. But let's put that aside for the moment, we're in very special circumstances, but going forward. What is the rationale for permanency once the pandemic is over? So a couple things all very good questions. The first about zoning is that zoning will need to be reassessed, and so you know, I think, all all associated processes that come along with rethinking zoning you know are would be expected. I think what we are hearing is one. The city did have a sidewalk cafe program and two DOT did have did have a a street seat program, so we did already have a mechanism for restaurants or others to create which they paid for they paid for that DOT actually provided a reimbursement for most of our partners, and we have. We have, over the past couple of years, started to offer support in terms of materials and markings and gravel for those types of of treatments. I think you're, absolutely right and again. I do not want to gloss over the fact that a permanent program really needs some serious thinking about process and design and how all of these spaces interact both with the street. As you mentioned, with bicycle lanes, vehicle lanes certainly parking loading delivery. You know those are all kind of critical uses on our streets that we certainly need to preserve and maintain and figure out how we coexist. I think what we're seeing and what we're hearing is just that having people out on the street enlivening our sidewalks and our streetscapes has been not only in terms of covered times where it feels you know like a breath of fresh air and to see like life and our neighbors on our streets, but that it really does have you know a quality of life kind of public space benefit to to our streets, and so I think it's taking a program which was envisioned to kind of bring the parisian sidewalk cafe environment, to New York City through the through the zoning, it's to kind of, take it to that next level and offer more neighborhoods and more streets. The ability to work with restaurants to bring public seating and restaurants heating onto the. So I understand all that. Let me just one more follow- up question: our streets are pretty busy and pretty vibrant when things are normal, so I do not think we're worried that we do not have enough people on our streets. However, such a program, I would think it would have, it would have been a good idea for this to be presented to each community so that the community would have some say as to whether or not they wanted this program or part of the program or where they wanted the program, because you're bending an awful lot of rules to do this. Zoning and otherwise, and the only rationale you've given me for it- is that the city somehow thinks that it'd be really nice to have the streets livelier and busier, etc. That may or may not be true, but it would seem to me that would vary from community to community, and I think that the community should be a partner with this and that the city should not just say this is permanent everybody out there now who does not have a license. Everything has been you know put aside when we had sidewalk cafes this. They people were granted liquor licenses. Sidewalk cafe license. It was in consideration of the zoning some places you can have food on the streets, some places you can. It has to be worth giving everything up and since the rationale that you have is not really of necessity but of pleasure, which has some value, but for that effort I think it you should come to the community and the locations should be discussed and decided in conjunction with the community and not just making a statement that this whole restaurant thing is going to be permanent and so that everybody who's self- certified who's on the street now can just be assumed to stay there indefinitely. I do not. I do not see that as as the most productive way or the best way to go about this yep. So I just want to be super clear. While the mayor announced that open restaurants will be a permanent program, the details have not been have not been discussed. There will need to be a lot of conversations with the community. As you mentioned, there will need to be a lot of processes and laws that need to be considered and re- thought and kind of taken through a public process. No one is saying that what is on the street now is going to stay. We just do not have a clear timeline yet, given you know the pandemic and recovery, and things like that, but I do just want to be very clear that a permanent program will look different than what you see on the street now yeah. I think I think going to Michelle's point. I think I assume and Jennifer I'll direct this to you too, as the deputy borough, commissioner, that obviously you'll come back to the board and talk about any kind of a permanent program, and I assume that's what Emily was referring to before we currently permanent program implemented and check. That's correct. I do just want to underscore Emily's point that you know these discussions are still ongoing. The guidelines are still under development, and so our office, really, you know, will look forward to coming back when we have more to share to all of the community boards to. You know, as always, continue the discussion that would be great just to be sure that it's in advance of any permanent decisions, in other words, rather than coming back to inform us that the which decisions have been made, we would love to be part of the process if you could come to us during the decision making process so that we really do have input understood thanks Michelle for your comments. Thank you very much. Thank you. Michelle Marco is next marco Tamayo marco. If you can unmute yourself. Thank you. First of all, I do not want to vote for this topic that just initially raised. The point is when you said the parisian concept versus New York City. You can not do that because you have to remember that tradition is a low density city with a very small building, slow many less people versus the Upper East side, high density buildings. Difference concept you can not apply is limited for that. Indeed, I mean one of my points that I would like to raise. Is you said that any a business outside has to have five feet as long as you live eight feet? For circulation, Lexington avenue, you can not apply nothing at all. It's ten feet wide is Lexington avenue. If you put five feet for the restaurant and then you are knowing compliance, I think you have to be very careful. Each neighborhood and each location require a deeper analysis. You kind of in general terms. You have to be very careful and one more thing. You said it will take a lot of time. Yes, we have to have the small business. Yes remember, the mayor will be leaving next year at the end of the next year. So, basically, if the mayor taking that direction, I think it will be wrong. It will be the new administration, basically who go in that direction. Discussing this point now, I would like to raise the point that I hear is the street vendor these street vendors in reality have the most advantage and they hold. This Covid-19 try situation because they can be in any part of the city without no regulations at all and they compete unfairly with those small businesses more restaurants. They spend hundreds of thousands of dollars in their business and they completely come completely unfairly and yes, I support these as a street vendor. Yes, they should be that because they serve on a specific population of income. That is fine, but it's not a major issue. Now, let me go in another direction. The direction is in the closing. I was approached with one of the business and second avenue. They told me that the enforcement is it's 11 o'clock, the closing. However, the inspector they are in those places, probably around 10:20 10 o'clock, hurry up to close the business and those business. They do not have an opportunity to come a couple of minutes more so this business. They asked me to request, probably to stay a little bit longer, probably in 1912, so they can have an opportunity to make more income. Why? I support the is the small business, the restaurants, because I learned in this process that this business they create one trillion of dollars in this economy, so it's crucial for our economy to recovery after hobby to help this small business. Definitely I will strongly support them and in that direction now the cyber cafes, the issue. I found that some of them they follow your recommendation and your joints, which are worth great, but most of them they do not. For instance, there are problems of the storm on a stone water run off, they are actually they're impeded apart. I do not know. What's going to happen when it's known and when it's known all this destruction is going to collapse, so many of them others, after all, they create a very sound structure, some of them even they anchor the structure to the road. So I think we have the D.O.T has to create. Now a policy had to help this business to avoid do errors or mistakes or violations. So this business, what they need is the D.O.T, stand up and said: listen, let's go in that direction. Let's go and prove our recommendations at the beginning, because not only this problem is going to create. The problem is the text that you do not recommend. You do not put it at the beginning, and then you said yes, it is recommendable, but now what I see this is a nest for rats under that because after they close the rods coming out to the neighborhood, so this kind of situation this D.O.T has to step ahead rather to wait that is happening, and then you make a decision. You should step up. First, so listen, that's what's going on and we would like to hear that you are the leadership in our community and especially to help those business that do not do mistakes. That is the problem, so I think pretty much. I cover the whole issue that I would like to comment. Thank you. Thank you. Marco has that maybe somebody from sanitation has the issue of you know garbage and waste from these restaurants. I know the restaurant garbage is picked up by the private cars, but has that proved to be a problem and an issue in terms of these restaurants: hey everybody marissa from sanitation, so we have gotten a few complaints about garbage piling up, most notably actually of people sitting down at outdoor restaurants, specifically in the summer and having a pile of garbage not too far away from them. So the department of sanitation does not right pick up commercial waste, that's through the private carters, so it's up to the restaurants and any commercial business to put their waste out as close to their pickup time as possible. So that's one of just a few things that we've heard specifically over the summer, just large amount of garbage being outside what people are trying to eat. Hey thanks next is Elita Camp our board, chair Lita, welcome and you can unmute yourself. I am thank you chuck and thank you to DSNY and D.O.T for coming tonight. Cba has asked about retail space being open as restaurants are for a while. So I'm glad and hope it helps the restaurants. So I have three questions. One is that- and I know that this is not this really is not your domain, but since you are interested in helping retail, we've also asked about eliminating the real estate tax that only businesses below 96th street face. So while this is not the small committee, I thought maybe you might take it back. Second of all, are there any parameters for what happens there? The hospitalizations are getting higher. Numbers are increasing for cases of the virus. Do you have any restrictions, any requirements about whether businesses might be required to close or cut back in the event of a certain percentage of infections and last scaffolding, a scourge on the sidewalks and unfairly affecting businesses? We know that restaurants who are in front of bus stops or bike lanes, do not have the same ability to expand as other better located. Restaurants do this will obviously impact stores as well? Is there any coordination with with the DOB and the owners of these buildings who keep scaffolding up for years to get rid of them to help the businesses that are underneath the scaffolding? And thank you again for coming thanks, chuck and Craig hi Elita good evening thanks so much for your comments and questions, so I think I'll try to just kick it off with tr. You know answering. I think it was your second question. You know we, the city and the administration is really following. You know the state health guidelines in terms of social distancing and allowing businesses to only operate in zones that are currently not marked as red zones, and I do not know emily if you want to give a little bit more detail in that for our new open store french program yeah, I think we can expect kind of similar type requirements, as neighborhood cases may go up again. This is a very multi- agency effort, a lot of kind of real- time coordination, a lot of folks watching the numbers talking with health professionals to make sure that all of the programs that are in play are being safe and responsive to conditions on the ground. And again I will just quickly say that one of the benefits of the open, retail or open restaurants and open storefronts program is that folks apply to us and we have contact information. So we are able to get updates and information to this group of folks very quickly, which has been a really effective tool in communication and trying to get the latest to these folks. Thank you. Thank you. Anything about that anything about scaffolding, maybe, and also well, I, for I, oh and Cba- is working on a program on attracting and retaining small businesses, so this will obviously be part of that, at least for the time being, while there's a virus anyway. The scaffolding, if you have an answer, and if not that's fine too, and then I'm muting myself, so you know we really try to coordinate with all of our agencies. As Emily said on this multi- agency effort, scaffolding is one of those particular items that makes it a bit more challenging for certain locations to participate, but helena, if you or the board and the committee have specific locations for us to maybe help. You know confirm if the certain site conditions will allow for any type of our open recovery programs. We're happy to take a closer look and I invite emily to add a bit more color. If there's some sad, you know, we've had a scaffolding going to elitist questions. We've had a scaffolding issue in our area for a long time and part of the problem is that the building department does not go out and really on a periodic basis, and if there's scaffolding that's been up there a long time they you know, do not go out and really police that, and I know that then Kayla's had a bill where he was going to limit how long scaffolding could be up. But I do not know that anything's happened with that and it's tricky it's a tricky situation, but it's something that I think we probably have to address on a more global basis. You know with the building department and see if we can come up with some kind of rationale when they get a permit to do scaffolding, maybe it has to be renewed at a you know on a certain basis and it has to be looked at and in some kind of process, but I think that some, that is, an issue in our area, clearly agreed and colleen, and I can take that back because we do know it has been. You know a long- standing issue across the board, so noted you're, absolutely right with the the local law that the council member had put together about scaffolding and how long it's taken buildings to remove them, and I'm I myself do not know whatever happened to that. But I know it's a serious issue city- wide. Just so you know yeah we have we've had a. We had a scaffolding and a private thing here, not too up in this area. Yeah in the in the 80s and stuff it was there for like six years, something like that. I mean you know and it was blocking part of the street and it was a real problem. We do have that issue with the scaffolding. I know in one particular area where it's obstructing a street light that needs to be repaired, so we're working with that building on that site. So that's something we ought to look at a little bit further. Lori Boris is next laurie. If you can mute yourself, you there laurie. Yes, here I am okay. Thank you chuck and thank you to the D.O.T people who came to answer our questions. I really I support these programs. I think that it's it's an excellent way. It's kind of like I do not know. The point I wanted to make is that before, if you guys can think back to before the pandemic- which I know a lot of us particularly myself- have a hard time thinking that far back but empty storefronts were not an unheard of phenomenon before the pandemic, and so a lot of businesses were going out and landlords were just kind of if they were able to sit on the properties. Until you know a big, a big box or a big, you know, corporate thing came along to pay the rent, and that was not a new pro. It's not a new problem now, but it's been exacerbated by this pandemic, so my question is: are there any incentives being considered whether it's I mean? I do not know what the what the incentives I mean. I do like the idea of rent regulation. You know for commercial properties is one getting rid of the extra real estate tax is another one I think Alita mentioned. That is there anything being seriously considered. That would just help small businesses like forget about the pandemic, just in general, so that the whole city does not become a series of Big Box stores and I'm just taking a look lori thanks. So much for your question, I'm not sure if our colleagues from small business services were able to join us tonight. I do not believe so. They never responded to my invitation, but lori. We can certainly take those comments back and then see you know as a as a cohort of city agencies. What information we can share with the board to see what other resources there are and clarify the resources that already exist now and before the pandemic to the committee members. Okay, thank you. Thank you. Elaine Walsh I'll finish up with some of the board members. Then I know we have some yeah elaine hi. I thought my hand was up sooner and luckily I went back and noticed my hand was not up a couple of questions. I want to confirm and build on something Michelle said, but the question is: are you saying, as of December 31st, all these regulations will sunset as relates to the outdoor dining hi elaine, just to clarify, so the December 31st date is what we're saying right now is the final date for the open, storefront friends program. That's a diamond correct! So we'll sunset, so we will not be seeing this unless you have a new program. That's established, that's correct! If the administration- and you know, city agencies feel that there is a possibility to extend, I think you know we'll cross that bridge when we get there, but open storefronts right now is looking to run just from now until the end of the year and then outdoor dining program. The open restaurants program that was announced by the mayor last month that we are looking for a way to create a permanent program for outdoor dining and that's what we'll be returning to the board with updates. You know later down the road when we have those further developed. Okay. Now you also said those restaurants that have had outdoor dining and have paid hefty fees are now being reimbursed, so they're no longer having to pay a fee, so the reimbursement line, and I think there might have been a misunderstanding there. The reimbursement that emily had mentioned before was for our D.O.T street seats program, and that is separate and apart from our outdoor dining open restaurants program well in the open restaurant are the restaurants paying a fee similar to those who have been paying all along. So the open restaurants program, there is no associated fee to participate. You know, restaurants, have to self- certify and guarantee that they need certain requirements to set up their outdoor dining on the sidewalk or road bed directly in front of their establishment. Okay, so there is no fee to participate. Okay. Well, then, I'm asking that those existing restaurants prior to the pandemic, who have been paying fees to have outdoor dining, should be forgiven and reimbursed so they're on equal footing with these new restaurants that are using the street. I think it's really unfair. We have a number of restaurants that have been overwhelmed by the fees that are charged and I really do think it's not fair to have two classes of restaurants. So I would appreciate your looking at this absolutely we'll. Take that back elaine. Thank you, great segment, bonds back as to why you would not reduce and eliminate the fees on those restaurants, two in reference to state liquor authority. How are you working with them because for restaurants to have- and this is a state authority outdoor space- they have to have a separate license to serve liquor? Have you worked with the state liquor authority to do this because again, the existing restaurants pay a fee, but the new ones? What has been done to certify this and monitor this? Yes, so we worked in close partnership with the SLA on the open restaurant program when restaurants go to Dot's website to self- certify. Essentially, it acts as a one- stop shop to extend their SLA license both on the sidewalk, but then also in the roadway, so part of the information that we require. Restaurants, to give us about the size of the area and the location of the area as well as their existing SLA license number all of that information that then gets batched and sent to the state for essentially the extension of their existing license. Okay, the other thing is you talk about service self- certification. We have DOB that does self- certification and we have major problems with this. So how are you doing self- certification here? What is the license or the guarantee that who is out? Whoever is self- satisfied? Self- certifying has some kind of a legal authority that, if they are in violation as in DOB, we could move to have an architect lose their license. So what are we doing here so I'll? Go ahead? And oh, I was just going to mention to Elaine and the committee that you know we do have inspectors that are going out. Checking our open restaurant setups and we'll also have inspections for open storefronts with the mayor's office as well, ensuring that they meet all of the siting requirements and criteria. Ensuring there's that you know we mentioned that eight foot, pedestrian clearance- we just want to make sure all of them are safe and so DOT may suspend or revoke operation of any of the recovery programs at any location if they find that you know they need to in order to preserve safety and public health. So we do have inspection teams out so you're saying that those that are self- certifying are now being inspected by your agency. That's nothing I have DOB does not do that. No, so we're here with the Department of Transportation and for the open restaurants and open storefronts programs. We have DOT inspectors and other city inspectors that are ensuring that these outdoor setups meet the requirements that are set forth in on our website. Okay, fine one final question: we've talked about zoning: we have a number of streets and avenues in our community that have restrictions regarding outdoor dining. Yet, under this there are a number of them now that have opened restaurants on the restricted streets, our residents, when they moved here, understood that there was no outdoor dining or the bar situation on their streets. What is going on with the zoning related to our restricted streets and they're, mostly the wide streets so- and this is throughout the Manhattan, by the way, because I'm dealing with Manhattan, but I can talk about 72nd, 79th 86th they can go on and on and on. What is the process here that allows any outside dining elaine. I do not think I understand what you're saying, but you did not hear me before. I do not think when this meeting started in the in the executive order in the executive order signed by the mayor, he waived the zoning requirements specifically related to sidewalk cafes, okay. But this is my question. Yes, it's sunset, you can't have zoning and then all of a sudden somebody waves, a magic wand, no matter what the situation is, there's got to be a process. Is this going to go on forever that all of a sudden all zoning is eliminated and we do not have rules and regulations anymore? That's my concern and I've had a lot of complaints from people who live on blocks that have problems with the outdoor dining noise that goes on. The mayor can waive whatever he wants. We as a community need to ask the question: is this sun setting or are we going to give away all zoning and forget that we have any in the city? He can't just wave it away? It's a process chuck. So I'd like a response from the city agencies on what's going on here and what other communities are raising zoning issues sure so maybe just quickly say that the Department of City planning was a strong partner in developing the open restaurant program. Our executive order is posted on the open restaurants page to see it. That is the mechanism that is lifting zoning and no one takes the zoning law lightly, and should the city con in the future can city consider any zoning changes? It would need to go through the same processes, both public and legal, as any zoning change would. So I think all we can say at this point is that, because we are in the middle of a pandemic, that is the justification for the mayor to issue this executive order under a state of emergency. It's we will not be under a state of emergency forever and no one expects that the executive order would go beyond a state of emergency okay. So what I'm asking is, from a zoning perspective that any change has to come to us, but the excuse of a pandemic and that's what it's being used now to wave. You know bicycles, what do you call them? E-, bikes, etc. I can't tell you the motorcycles and all that are on the sidewalk at this point with no enforcement. Okay, D.O.T. But let me let me say that, in order for our city to function, we need to communicate. The city needs to communicate with its community. Every community is different and I've had lots of calls around the issue of the violation of zoning, and so I'm asking any change in zoning does have to come through us and there has to be a discussion. The mayor can not just wave the magic wand, and you know if you live in the community you're getting asked the questions, and so I'm asking what's going on with the zoning. There was no thing. No, I hear you that you've got it on your website, but the people in the neighborhood are not all connected to whatever electronic system you're using and so people are saying, and we have an elderly population and they're saying what's going on all of a sudden, so I'm asking for you to work with us. You should come to zoning and have a discussion. Thank you for your comments, because you know at this point. We certainly need to take them back to our colleagues. You know the program guidelines for making open restaurants permanent is still under development, and so I'm sure I can coordinate with will craig and chuck on when we can return. When we have more well for zoning, you could come to the zoning and Development Committee noted. Thank you for that for the suggestion we'll certainly take that one back. Okay, thank you! Elaine Craig. I know you wanted to make some comments or questions. Yes, thanks, Jack hi everyone. I have a number of questions, but just following up on what elaine was just asking? Has the city received many complaints regarding the program and I'm not talking about complaints against individual restaurants, where people may have reported issues in terms of overcrowding, social distancing or other violations of that matter? I'm talking about complaints regarding the way that the program has been operating and lawyer was implemented, whether it be zoning or otherwise hi. Craig. Thanks for the question you know I'll start off and emily can add a few more details. If she'd like, I would like to say that we're hearing from folks that they are actually wanting us to do more, we had to, as you know, implement the open restaurants program very quickly and we had to create. You know like a nimble set of rules where we could try to help as many establishments you know, apply self-, certify and then set up their outdoor dining as quickly as they could and, as you know, not every single one establishment was able to participate right. This is not a one-. Size- fits-, all kind of or one size serves all kind of program. Unfortunately, but you know, as of today, there's over ten thousand participating restaurants in our outdoor dining program, and so we really see this as a kind of successful kind of toolkit that we're able to build upon and see where we can also take open storefronts over the next couple of months. Right, that's great to hear- and I know you were talking about- obviously you're going to the city is going to be coming back with a more permanent program in place. I'm curious what metrics you're using you're looking at now or developing, to assess the program in its current form to help inform how a permanent program may be implemented. Obviously, I'm making more from a transportation side, given your area of expertise, but just in general as well. Are you looking? Is this going to be and how is it going to strike a balance not only in terms of accommodating the needs of the businesses that would participate, but in terms of the overall street network and the part in the way we're all thinking about how streets may be re- envisioned and going forward essentially utilized in a new way, given all the changes that have been taken place and the permanent changes that people may be seeking, after all, these months of lockdown realizing how the streets can be used differently? Absolutely, and I think I'll, take that phrase that you just mentioned. Like striking a balance, there are a lot of competing uses for curbside space, sidewalk space and you know even pre- pandemic. That was something that you know. D.O.T was trying to kind of think through and come up with creative ways to make it livable and safe for all seat street and sidewalk users. That set of criteria is still under development, and you know at this point we can't share more, but there is certainly a lot of factors to consider here all right and then a few more specific questions. So we have a restaurant near where I live, that seemed to have gone out of business overnight. Yet it's open restaurants. Infrastructure is still in place. Who is responsible for clearing out that space, because, right now, it's just taking up what would otherwise be parking spaces emily? Can you help clarify that yeah? So it is that businesses responsibility. So if you actually want to send us that location and we can contact that business directly and do some follow- up to make sure that those elements are removed all right, great and then just looking forward, I know you touched upon how restaurants are notified. I thought you were talking about notification in terms of potential weather implications. I'm curious what has been what is going to be the process for when we potentially have major snow events, where there's going to be plowing activity to ensure that, obviously the restaurants are not going to be put in danger by snowplow activity if they have not had a chance to put away their thing, their infrastructure, but also to ensure that it does not create snow banks or other things that will inhibit or interfere with pedestrian sight lines and the ability for automobiles to see pedestrians and cyclists and other street users, and just to ensure safety. If we ever have a snowstorm again, yeah, no fantastic questions, ones that we are all asking that many restaurants are asking us and so we're actively coordinating again with our colleagues at department of Sanitation Department of buildings when it comes to snow loads. Things like that and plan to issue some updates based on kind of winterization guidance, all right, great and then finally, has there been any consideration from at least to dot's knowledge about any open restaurant streets within community district AIDS. I get the sense we're one of the few community districts that does not have any, and I do not know if that's because the Department of Transportation was not considering it or if it was just that we have not had any groups of restaurants or partner organizations that have proposed it, but I know we are lacking it. So a lot of the open, storefronts opportunities do not really exist here, so we can take a closer look to craig. I do not have the you know the application list in front of me, but what we're really doing here for open streets, restaurants corridors is relying on our local partners to help ensure that you know osr corridors run effectively and safely. So, if you know for the open streets, restaurants program, we need a minimum of three restaurants to apply on that block or along that corridor and there's a lead applicant of a restaurant. Our lead restaurant applicant that you know hosts that application process and coordinates all of the different establishments on the block. If you're thinking about any certain locations that you think might have applied, that did not make it through our process. Please go ahead and contact me and colleen. We can take a closer look, but that's where I'm at and emily. If you'd like to add more, please feel free to do something great. Thank you all right, great thanks, Rita popper who has not. I know you have not spoken before Rita. You want to mute yourself right craig really quickly. Before we move on. I think DSNY wanted to respond to your comment about the snowplows. Oh great, oh yeah Marissa wanted to respond. Okay, hey I'm sorry about that. I had some background noise. Yeah, I'm sorry! I did not want to let make D.O.T answer that question about snow, because that's DSNY so yeah. So when the, if there is a snowstorm and judging by the way 2020 is we're most likely going to get a snowstorm. We are asking restaurants and other commercial businesses to assist us and if they receive any snow alerts, sorry from us to remove any of their outdoor dining chairs tables any structures that they have. But we have been looking at our roots and seeing if any changes need to be made and working with Deot as far as parameters and making sure that all the restaurants are within those guidelines as well great I was, I was just thinking that perhaps some sort of blanket policy or guidance would be great where, if there's a prediction for X amounts of snow, that obviously sometimes predictions do not always hold true, but if there is the expectation that it will automatically trigger something in which restaurants can do the advanced work to allow the snow removal activity to more easily occur. Yeah yeah, I mean, as normal, all property owners need to clean the front of their property, including removing any snow and clearing a four feet bath. But if we, when we have to pull out the snow plows, we definitely want to make sure we do not damage any of the outdoor seating structures that are there. So definitely people can bring any of that in. If there is a chance of snow, you know greatly appreciated they can clean their area around the structure as well. It's helpful all right. Great. Thank you Rita. I had. I know you have not spoken before, so you could unmute yourself. I think I'm certainly not going to repeat what everybody said, because it was all very poignant. The other thing is, I have talked to several restauranters and this is really saving their lives. However, have you any experience with any country that has people going out and eating in 20 degree weather? Is this going to pay for it? And the other question is when people shovel the snow on the sidewalk as stores are responsible for where do they put that snow? Is it going to go into the crosswalk so that people can not cross or how do you plan to handle? That is that yeah is that for me, Rita Dsm, yeah, anybody, okay! I just want to make sure that I got you so regarding your second question, so no you can't throw snow that you shovel back into the street. I can't go back into the roadway, even though that's where we'll be plowing, you can't do that. No one can do that. I know property owner residence, commercial does not matter. You can't throw the snow back into the street. I do see a lot of folks. I mean in the past, be pandemic, pushing the snow up against their storefront or anything like that, but it is on the responsibility of the property owner to remove that smell, how they do that is up to them. What do we expect them to do with the snow? You know we're talking, I'm talking about a six- inch snowfall it piles up at a certain point. I know that perhaps you had not considered it, but it is something. Do you have people who will shovel the crosswalk so that people can cross? So we do have emergency snow, plow, laborers, snow laborers, I should say they're, not plows, they're people, snow laborers that can assist us with removing snow. We can do that in the crosswalk on any city streets, but if it's in front of a property that is up to the property owner to clean that I mean if they are pushing the snow to the curb line, and sometimes we see that, where we're kind of sneaking through the street and through the sidewalk with walls of snow next to us. Obviously that means no one's going to be sitting in the outdoor structures, but I'm not sure how many people are going to want to eat dinner outside with six feet of snow around them. Thank you. Now we have a couple of board members left and then I think we probably should move on and they've already talked before, but if they have further comments, Michelle Burn bomb first and then cost next yeah. Thank you. I want to follow up with emily. If you do not mind with the zoning to me, I mean you may not know, I'm not blaming you, but it has not been a very satisfactory answer. I'll tell you why the zoning has been suspended. As you said for the duration of the pandemic, you explain that it's been suspended because we're in an emergency. However, you use the same reasoning while informing us that it was going to become permanent, so it can't be that the reason the zoning will be suspended is because it does not matter that it's becoming permanent. So in fact the zoning has not been addressed now. The zoning is the only thing that comes between us and Chaos, and there's really lots of chaos in the city with the zoning, because it's a constant struggle to enforce it to build in accordance with it, to follow all the rules and regulations, and now, with this program it is being suspended because the program will become permanent and the reason that you're using is because of an emergency in a pandemic. So clearly those two really do not mesh. I'm not happy that the zoning is going to be suspended. I'm not happy that when the time comes that we do not have a need that the restaurants can hopefully sustain themselves the way they have over the past many years. I'm not happy that there's going to be an infringement and such a serious one on the zoning and not to mention the song and dance that the agencies have to do to make it work anyway. You have to have the design. Commission has to come up with a uniform design plan. Sanitation has to come up with a snow removal plan. Emergency emergencies have to be called. If there are high winds, I mean there's a whole series of things. You know in this city. It's not easy to just say: oh well, you know now we're going to do this from now on the repercussions just go on and on and on and so I'm concerned. I do not think the city has thought this through. I think and look we all want to help the small business, but now businesses, but now we're not talking about them during difficult times. We're now talking about the word permanent and I do not think not your fault. Maybe you have not been briefed. Maybe there is no answer yet within the agencies, but to come up with a program and then to say you're going to go back and figure out the details. It'd be a good idea to figure them out first and to see if the whole thing is plausible and to see whether or not it's beneficial enough to go through all this. So the zoning for me remains a real concern and I hope you can- and you do come back to our zoning committee, because this requires a real discussion and if you can take it back to the agencies, to let them know that we're taking that very seriously and off the top of my head. I can see how you can easily accommodate this program without seriously impacting the quality of life of everybody and everything. So I think you know thank you for being here and I hope you can take that back and have a serious conversation about it. Absolutely michelle we'll certainly take that back. We've heard you loud and clear: we've heard Board Members, Committee members loud and clear that quality of life- and you know the zoning resolutions free pandemic and pre- executive order- are something that's important to the board and to the community. There's still a lot of discussions to be had so, please, you know we're working through them and we will be back okay. Thank you. Thank you. Jennifer Coss are you there yeah just yeah here I am okay, one question to the DSNY: they said that when there's a snow emergency that they would expect the restaurants to take in their outdoor tables and chairs and that what happens to the permanent structure that stays there, I assume. So if I'm DOT, please correct me, none of those structures are supposed to be permanent. Anyway, they all have to be able to be removed. I know they look pretty permanent. A lot of them are just made of wood. Some cinder blocks, at least the ones in my neighborhood, so they do not have to remove them. It is highly suggested if they do. If we get a snow alert and Dsmi sends that alert- and it says it's going to be six feet of snow and we're going to have the plows going if they do not Wanna move their outdoor structure they do not have to, but they do run the risk of that structure being damaged not only by our plows but by the snow and ice well to a certain extent. I agree with that, but it takes them a week to put up and you're going to give out a snow alert two three hours before it is or five six hours whatever it is. It's going to take them a week to take it down. They have to store all the wood, all the aluminum, all the plexiglass and everything else. It seems like a real hassle does not it yeah agreed. It probably will be a bit of a hassle, and we would only say it because of an emergency because of a lot of snow but agreed. It is a lot of responsibility on the property owner on the commercial business on the restaurant it is, but in order for them to stay open in general, they had to put out these structures and it's the only thing. The only update that we can get. We try to get as much update as possible and when snow is coming, everyone has a weather app and can see if snow is in the forecast, but agree it's not a lot of lead time. It's not a lot of wiggle room, but it's the best that we can do again. They do not have to remove them, but then the risk is on them. Yeah. Okay, thanks last word to our board: Chair Alita Gillita Camp go ahead. China myself! Thank you chuck. I just wanted to to. I guess, affirm and underline coming back to the Zoning Committee and maybe just to a joint discussion, because these issues are really important. I know that borough president Gail Brewer is talking about some kind of streetscape, czar or public realms are, and the restaurants in the streets would seem to fall within that category of how do you manage everything I mean even in this? I guess it's not that short, sorry chuck our and a half of listening. There are so many questions raised, and obviously we have different issues than those that are chalk, a block with restaurants and bars. So please come back and join us and as well done as this meeting was transportation. Sidewalks are one issue. There are sanitation and snow and many others that have been touched on. So I just wanted to highlight that and say we really appreciate you coming, and I know that in the pandemic, people have been depressed and people are stuck at home and having a safe place to go for a meal or a cup of coffee is enlivening and enriching. I was thinking about that earlier today and it's an it's a nice thing and it certainly makes the city colorful, but as a forever prospect, keeping it the way it is- and I know that you're not but having communities involved and having input which is not always accepted by various city agencies, is critical to having programs accepted. So thank you again very much. Thank you chuck and please we welcome. We welcome an opportunity to work with the city to provide our advice and to have input into these decisions that affect not just the immediate ones like the restaurants or the stores, but the people who live around them and- and I second that I've seen motorcycles on the street. So I would ask if you've noticed any impact from having restaurants in the in this motorcycles on the sidewalk and if you've noticed any impact on bicycle riding on sidewalks because of restaurants in the streets, but that could be another discussion, so I won't take up more time with this. I just wanted to give you a very big wide open invite to a future zoning meeting. Thank you. Thank you. Doc. Thanks Craig, thank you thanks. We appreciate that Jennifer and Emily and also marissa from sanitation, and I think we finished with that topic. We wanted to mention something in Jennifer if you could stay for a little bit too. I know Colleen's here also, but so I know some people are here because they wanted to. I do not know if they're still here, but they wanted to discuss the crosstown bike lanes. You know in the 60s there that are temporary now, but they're going to be made permanent and we had. We had a meeting, and I know some people said they had not heard about it, but we did have a meeting an extensive meeting before the temporary lanes went in and we had a big discussion. Not everyone obviously knew about it or heard about it, and I know there are number of concerns that people have about them when, and I know that the department has also said before anything becomes permanent, you'll come back and discuss. You know the program and you know in more detail with us, but I, if there's anyone here who wants to comment or talk about that from the public, they should raise their hand, and we have you know the D.O.T folks here who can talk about that and just a friendly reminder to everyone. We, when we say raise your hand, open the participants box at the bottom of your screen. You see a box pop open use, the raise hand button and if you're on the phone, it's star nine- and I see I see a few hands in the public here- Josh Rubinder. Why do not you mute yourself josh if you're great? Thank you so much chuck and craig for the time I'm the president of the co- op at 301, east 62nd street. This lane has severely impacted us, as well as many of the residents in my building the paladin, the dialysis center and up and down the block. I've had conversations with commissioner pinkar and kimberly as well. They directed me to your committee and there's just a lot of things about how this was rolled out and you know the whole process which I find deeply unsettling before we get into the specifics about the actual lane. I think you got to ask yourself: why would you put a lane on the street that has the exit for the FDR all the bridge traffic, thousands upon thousands of cars every day now I know it could inconvenience the bikers and, I believe in bike lanes. I'm really glad we have bike lanes, but why do not you go across fifth avenue? Take a left take a right on 2Nd avenue where we have a dedicated bike lane and go across 60th street, where you already have a bike lane, and you could, you know- have to make some modifications, but nothing happens on New, York and 62nd street. That says that this bike lane should be on 62nd street. I mean we just have tons of traffic with the bridge, as I mentioned, and the FDR. If I'm going to lose that battle, then I think there really has to be modifications for the existing lane. First off we have a dialysis center on the western half of 62nd, from where 62nd hits the bridge. We have elderly people coming in and out of that center. The ambulance blocks the bike lanes. So what happens? Is it's not serving the bikes because their lane is blocked? It's not serving drivers because there's double parking and it's not serving you know the residents and there just has not been a lot of thought into this. It's quote a temporary lane. I asked Commissioner Pimkar and I was told it's temporary to permanent. So it's not temporary. You know to you, know more discussion and the rollout really leaves a lot to be desired. A lot of people might say, for you know, quality of life or noise reasons. They do not want a bike lane on their street, and you know I think it's important to have bike lanes. But for the reasons I mentioned, namely thousands of cars dumped on us from the Queensborough bridge, thousands of cars going to the FDR and this dialysis center. It just is not the right block and it backs up into the second avenue intersection and it backed up into First Avenue. The commissioner told me they were going to make a modification on our block to move the delineated line instead of taking up a whole lane, move it right on the bike lane like they did on first to York, and that still has not happened. So you know I've spoken with Jennifer years ago about other issues. I've spoken to the commissioner, but we really need some advocacy on behalf of the community Board, because if you poll the people on this call, you know, I think, 90. Some odd percent of them share my views and there's been other comments earlier from the board members about having community feedback before restaurants and things like that are imposed upon us. I think we need something similar to take place here, so I'm really pleading with the board to be our advocates on this topic. Thank you, Jennifer. You want to comment on that sure Josh good evening good to see you. You know I colleen and I can check on timelines for the modifications that borough commissioner Pinkar had mentioned to you before we hear you- and you know your neighbors loud and clear- that there are some. You know concerns that all of the residents are raising here, so we're taking a look and pursuing additional modifications to the design to help sort through. You know the issues that we're seeing and I think we're going to come back to us for further discussion right, Jennifer that that's correct and we'll and we'll make sure that people should follow our website to make sure that they know when a meeting is scheduled, and that ought to be some. It could be some. I do not know if it'll be in December or when D.O.T is ready to come back correct right. We have not yet decided on our return, but craig and chuck. We will certainly you know myself or either kimberly or commissioner pinker will be reaching out when we're ready to you know continue our discussion. Thank you. Next is Evelyn David. If you can unmute yourself everyone or if you're on the phone was it star? Six will yes good evening: yeah, it's terrifying to hear that it's not real! It's not temporary! You guys are going to stick this on us and I this. I totally agree with the gentleman that talked before he voiced it beautifully the lanes going to the FDR. By the time you try, the FDR going northbound and Southbound 62nd street leads into North northbound, FDR and Southbound to get to the southbound. You have to get on the left lane and then make turns from there. We can't do that anymore. So now, all the traffic is bunched. In together the traffic coming off the 59th street bridge, which is tons of cars in the morning, go on to 62nd street eastbound. It's a colossal mess. It was a traffic nightmare before it is just unbelievable. Now, okay and the pandemic is still going on so who's. I once again, whose idea was to choose these streets makes complete no sense. Okay, 61st street is an exit off the FDR. Now the FDR is getting backed up down the FDR, because the traffic on 61st street now has been funneled into one lane and now so all the traffic to get off the exit. You can't get off the exit because now you're backed up down the FDR, and I started thinking to myself. Somebody joked to me: oh they're, going to put bike lanes on the FDR. Now. Oh that's hilarious, and I thought that's not so hilarious. I do not know who makes these decisions, but you know I mean I it's ridiculous, so this neighborhood basically is used to be, on average, a thriving except accessible section of New York City plenty of parking commercial parking for people who had to come and make deliveries, etc. That does not no longer exist. That is completely gone. Okay, you have ruined. That is completely gone. All right, there's barely any parking after certain hours, for there are three spots left three spots left for non- commercial vehicles after one o'clock on Lexington avenue, but we're not talking about lex. We are talking about 62 and 61.. They were sort of like sacred streets and never touched, and now they're, annihilated, okay. So anyway, as for the bikers, you see maybe two or three bikers within a couple of days within a couple of days. You do not there's it's not and a lot of the times, they're going the wrong way. But having said that, having said that does not justify having bike lanes on the two streets. Okay, that does not and based on the traffic problems you have created and the fact that there's incredibly low bike usage, bike, Lane usage and when winter comes there won't be any at all. Okay. So now you've got this mess when the when the snowplows come. Where are they putting the snow? Exactly? Oh, they could put them on the bike lanes. Now they got a perfect space, but I'm sure that was not your intention. So the other problem we've got on 62nd street is the signage change. It's an hourly change. It used to be no parking from 8 am to 7 pm. You have changed it to 7 A.M to 7 P.M. Why? You did that and then you slammed us with the bike lanes. We just all went completely stressed out crazy. Okay, the pandemic is hard enough to deal with. Business is closing commercial people who now, if they have a delivery, if they can't find a spot, they just stop in the middle of the street. Oh well or they pull into the bike lane. Oh well, it does not matter and they go right over these white things. I mean there's no place to do anything, people that need come in to do work in the buildings. Where are they supposed to park? It used to be verizon all these different companies. Anybody had a problem, they could just come and park in the neighborhood. They can't do that anymore. So you know you need to really rethink. Not just rethink get stick to your temporary idea. It was a nice idea during the pandemic, when there was no traffic and everything was completely silent. It's in fact like today because of the election and the insanity going on and the counting Manhattan was completely quiet. Okay, I went downtown. There was no traffic on lex no traffic on the side streets, no, nobody anywhere. So, but that's you know, so you really need to rethink this, and not only the residents are suffering and this gentleman on 62nd street, where and this medical building, it's kind of like what were you thinking? You know like you really have to go back and look at this actually. Thank you very much. Okay. I do not know if anyone wants to respond on that. I did. I did want to thank Evelyn for her comments. You know D.O.T did work to change some of the signs to increase curb access, and you know I had mentioned that we are working to change the design by the bridge. We're still trying to do that, I'm not quite sure exactly when the work is scheduled to happen. I think we were trying to do that today, but you know we absolutely hear you and your neighbors loud and clear that you know there are some issues that you'd like us to take a closer look at Julian. Thank you, hello, okay, yeah Chuck, I'm going to first have my husband speak because he's a regular biker and a resident of the neighborhood and then I'll just quickly speak afterwards. So thanks, I'm Bob Burt Wagner. I live out 32nd with my wife. We've lived here for about 24 years. I will say similar to josh in concept. I think Bike bicycle lanes make a lot of sense and we actually have the bike lane right in front of our house. I was one of those two or three people today that actually used the bike lane. So in concept. It makes a lot of sense, but the implementation here was extremely poor. Essentially you've taken one lane out of what was a two- lane street for all intents and purposes, and so you know now: we've basically got as people talked about access to the FDR and 62nd street with one lane, people have no curb out access and traffic is backing up. So the implementation here frankly was not well thought out, so the concept may make a lot of sense to have but to bike lanes, but you can't just take basically one lane out and and not have sufficient room for traffic, and that's basically what's happened here, so hopefully Jennifer and Emily. I appreciate you coming to talk to us and you listen to this constructively, because at this point it does it just does not work. You can't just put a bike lane in and not make any substantial changes to the barking situation, and I'm just going to add to that and if emily or colleen or Jennifer have anything to add afterwards. I did also want to mention you know, I'm, president of the Neighborhood association for East, 61St and east 62nd for treadwell farm between second and third avenues, and we primarily have always had traffic problems, as other people had mentioned, and we were in a yearly conversation with D.O.T about how to eliminate some of this traffic, how to work with the traffic flow. Now that we essentially have one lane of moving traffic, which does not move each afternoon just to be very clear each afternoon, 62nd street is absolutely backed up from Park Avenue, all the way to the bridge second Avenue and even going to the FDR. So each afternoon we have numerous schools in the neighborhood that, where we have children crossing at 3:30 to get home from school and these blocks each of the cross sections are actually blocked. Blocking the box is a daily thing on 62nd street in the mornings on 61st street, when traffic is coming off the FDR and coming off the queensboro bridge. These blocks again are completely backed up for two or three blocks. This is a daily occurrence. These blocks before the bike lanes, could not handle the traffic now with one less lane of moving traffic in the morning on 61st street and in the afternoon of 62nd street. Just do not work. It's like the bubble has burst. We can not handle what is coming through here and to the woman who spoke earlier. I'm a biker as well my husband's a daily biker, and I could tell you there are not many bikers on these bike lanes. What is happening is you are having delivery guys on electric bikes going faster if and when they come they're, not and they're, on the sidewalks and they're on the street and they're going opposite. So until there's enforcement over biking, especially these electronic bikes, you know there is going to be a problem like, unfortunately, I know low is on the phone. You know there was just the accident on 97th street with the you know: pizza delivery, guy that was killed two days ago because he was going the wrong way too fast on Second avenue. These will happen in this neighborhood. We have a ton of traffic and the other thing I just want to put for the record. Is I'd really like to have chuck and if it's possible to actually have a real discussion over 61st, Street and 62nd street, it's very late. We know you've all spent a lot of time on this, but there was no study that was shared with the community that people who live here on a daily basis know what traffic was before and is now, and I really think you need to hear it in full spectrum on just a discussion over 62nd and 61st street, and I hope that's something that both craig and chuck that you could maybe set up in one of these upcoming meetings. We've never seen the study. I've talked to Colleen and I'm on a daily on a weekly call with Ed Pinkar about this. We've made some few tweaks. These tweaks are helping a little bit, but the impact is just so huge that even a little change is not at all benefiting our neighborhood. At this point, it's really impossible in so many ways, especially the afternoons on 62nd and the morning of 61st. These blocks are backed up two and three avenues for at least an hour or two each day, it's unbearable for most tent residents, and I know there's other people who want to speak. I'm happy to hear anything. Dot would like to say now, but I hope that you would honor the ability for us to go through this in greater detail specifically with these two blocks at another time, yeah go ahead. I just wanted to thank Bob and Julian for their comments. I know that we have been discussing. You know some suggested tweaks and modifications to the design with both of you, and you know, I'm taking notes to bring back to my team and borough. Commissioner pink Carl, though I know that we've heard from many of you about these concerns and some questions too. So I just want to add that to you know, I just want to clear. You know like clarify that we are taking back the feedback to further discuss with the team and we'll look at it. Julianna will Craig and I will talk about seeing about if we can do something specifically for those streets. I know that's an issue, obviously with the bridge traffic and everything that's around there right. This was bad before and it's just unbearable now, and you know, as we've spoken with DOT, there's, probably a better solution. I'd love to see the studies. I know it's a temporary thing, but it does need to be looked at a lot closer. It is, you know, really not working. Thank you. Thank you. Julian Next is todd soloway todd if you can mute yourself. Thank you very much. This is my first foray into the Community Board world. I'm the vice president of the board at 200, E, 62Nd street and I've also worked with Juliana in connection with the Treadwell Farms Association, putting my law firm behind some zoning issues that we've had over time as well, and I just want to say that I appreciate we're a complex city. That's definitely trying to move itself in the direction of increased bicycle usage across the city, and you see the usage of bikes lanes all across the city. I do not think anyone here is saying we're patently against bike lanes. I just think that this decision was not well thought out. I do not think you would find a single person in our community who's in support of these bike lanes and the traffic and noise that they're engendering in the in the area. They also want to point out, as to our community board, that in reviewing and doing some preparation for this meeting, I did take note that a few years back, the Community board voted down the wholesale implementation of bike lanes in the 70s as well, and that's part of the history of this community board being aware of the quality of life issues that the installation of these bike lanes actually create on the ground. For the people who are the residents. It is absolutely true that I do not know if the members from the department of transportation live in our neighborhood, but if you, if you're in our neighborhood any time after four o'clock, particularly right now during the pandemic, when everyone's driving, you would see what it's like, and it is not good. I also had this notion that when it first went in- and I have to confess that when I first went- and I thought okay- maybe I just dropped the ball and did not see. You know how this was being done and did not hear anything about it. And there was some. You know full open discussion about it and it happens, and basically you roll out of bed one day and see these bike lanes out in front of you and see the traffic start piling up, and I just made the assumption that it was done because peop the administration figured that during Covid-19 we'd have people coming back to work in Manhattan and that people would not be wanting to take the subways, and so therefore they would be getting on their bikes and going to work. Well, I have to say, that's not transpired, because people are not back at work in Manhattan and when people do come back to work in Manhattan, they're driving into the city. People in Manhattan are not biking their way to work, and certainly not starting during the cold weather. They certainly are not doing that. So you have compounded the problem and have not given adequate consideration to the idea that what's happening during Covid-19 is that people are getting in their cars and driving into the city in masses. I came into the city today and drove out and I it's three o'clock during the middle of the day. There was traffic at every turn, you could go and it's just getting worse by these bike lanes. It's also affecting the quality of life in our neighborhood, because the cars that pile up the noise- it's really it's really not commensurate, and I just I would be remiss to say that it does not it sort of foments or feeds into the notion. Let me say a little bit differently. I sit on the executive committee of my law firm, where we manage a group of about 400 people and whenever we make a decision, that's top down, we always wind up paying for it. Whenever we want something that we have to get done, we try to make it a grassroots bottom- up decision that everybody is participating in so they buy into it. And then we know we've made the right decision and even if there's some people who are unhappy about it, we know we've given due consideration to the community people who it's affecting it certainly feels like this has been a top- down decision and imposed upon the community. That is not in support of it. I think the department of transportation needs to think about not just making tweaks, but about not doing this to us. Our community is not in support of this. It's not serving a broader benefit. It's not serving the benefit of the many to the to the detriment of the few it's actually harming more than it is helping. So I think you should really give it some deeper consideration. I think the community board, looking back at its history, should evaluate it's its role in this and its history of standing up for quality of life issues when it comes to the installation of these bike lanes and yes, it goes without saying we're feeding into and out of the FDR drive and the 59th Street bridge, and it's really just not working out, and I sometimes you know in a good situation where, even if it's a matter of government or in private business, when you think you made a mistake, sometimes you have to say you know what this is not working and we should pull back and not do this. I do not think we're looking for tweaks. I think we're looking for the city to undo what they've done and to realize that if this was temporary to say, okay, the experiment is has not worked out and we should stop doing what we're doing, and I want to thank you for your time Jennifer. I hope you take these seriously and that would just not be given you know. You know you know the attaboy and that we're actually going to do something about this sure, and I think you know chuck and craig can attest to the fact julian too she's been on calls with the Manhattan borough. Commissioner himself as well. As you know, our Manhattan office colleen and myself and kimberly we've been working to see what adjustments can be made to the design and then for todd points taken. I have my notes with me and thanks for your comments, good to see you yeah, we todd just for just so you just so. You know that we did have an extensive hearing on this. I guess it was toward the end of last year, and sometimes you know, people miss it because you're not always aware of. What's on our calendar but- and there was there was extensive discussion and there were a lot of people who had concerns and things like that, and we spent quite a bit of time on that and I understand your thoughts and I think we're going to have further discussions as we before anything else goes forward on the community boards website. It was posted as temporary, so I think it gave everybody hope that maybe we were trying to see if it was going to work, and I think we would have to acknowledge that it's not working the way the community would hope. Okay, I mean that's, I think that's what we ought to discuss. Absolutely thank you. Wendy shone is next wendy. If you can unmute yourself hi, I live at 301 e67, which is on the corner of second and 62nd. I have several points. I've lived here for 40 years, so I have seen the traffic debacle get worse and worse and worse, we have been spared this year from the Un being in session, when every diplomat has their motorcade come down 62nd street to get onto the FDR to go to the U.N and if one truck one ambulance, one anything is going to be parked. Now, with the bike, lane is going to be arced in lane blocking it. A motorcade coming down would have created utter chaos, so we're very lucky that the U.N decided not to have it's it, be in session this year with the bike lanes, because it would have made chaos even worse, because under normal circumstances, when the U.N is in session, 62nd street is quite literally a nightmare because it's closed down regularly for the Un's diplomats and their motorcades. And let's not talk about when the president's in towns not trump, but when other presidents are in town staying at the waldorf and they have to get out to the help pad or the airport or whatever 62nd street gets closed down. So 62nd street is a very used street by everybody, and anybody who has to get out of the city and you've now created it to be one lane. But my major concern is: I am handicapped. I have a handicapped sticker that placard that I can put on my car, but I can't use it in front of my building because you have put up a bike lane and the parking across the street does not allow for me to use my handicap sticker and if I try and park there I'll get a ticket. The closest place that I can park with. My placard is three blocks away. That does not work, since my doctor said that I need to have this sticker placard, because I can't walk farther than 200 feet but you're with the parking that was allowed on my side of the street or in front of our building. So guess I understand why Bike lanes are important, but guess what so is parking for people who live in the neighborhood? But your bike lanes have done away with it at the parking signs on the other side of the street and on the other block, do not allow for anybody else to park. So bad situation gotten worse and the bike lanes have made it even more horrible. So I think you've made a really bad parking situation and driving situation and traffic situation even worse, and you did not ask anybody, you did not tell anybody, you just did it and it's really bad. That's what I have to say. Thank you wendy any comments. I do not know if Jennifer you want to comment at thanks, taken thanks, Wendy Okay Victoria Orton next. Can you mute yourself Victoria and me, do you hear me? Yes, I'm at 131 East 62Nd street. I was here the entire pandemic. I was a volunteer with God's love. We deliver and I was renting cars by Rikers island on my own dime, to deliver food to housing projects, and so I, the first time in my life, I've really driven around the city and people assume that if you live on this block, you have a substantial net worth. That's really not the case and for as Wendy said, she boiled it down to parking driving and traffic and the parking situation now is impossible. I'm not handicapped, but I there's no way to park and once in a while, I rent a car, it's impossible for plumbers, hello, we might have lost Victoria. I think you something happened to your sound there. I do not think she's still on the call. I think she dropped yeah. Well, we'll, try and see. If we capture Allison well, Ken, let's, let's go to Ken, are you? Can you be happy? Thank you. Let me introduce myself. My name is Ken Goldstein, I'm vice president of the Building Association or Homeowners Association. If we will at 337 east 62nd, we took a different approach. The minute the bike lanes went up. We approached our council person, Ben Callas. We made it very clear. We were opposed to this we'd like some dialogue. It was made by both myself and Jill Dennis who's, another board member. We even got to the point where Mr Pinkar was involved in some of the dialogue and we offered to have him meet with us, or we asked him in response to what he said to meet with us in front of our building, to show them the problems that we have and we never got. The decency of a response. Jennifer is not against you or anyone else from the DOT, but we would appreciate a dialogue. Our concern is very simple: there is an accident almost one to two a day in front of our building because of the turning lanes and the poor supervision by traffic police department traffic, who are either do a job or are there, but do not do anything they're very inept. Whereas now the people live on the street, we actually tell them to have a car go straight down, because you get a blockage of cars who refuse to turn or because the turning lanes are backed up on 62nd. They block the whole street and intersection there there's a more important issue. The issue is NY, while Cornell has a daycare center, just half a block up from us, and you have kids and their parents in strollers going back and forth in here, and this is very dangerous, so the bottom line is very simple. We would appreciate Jennifer you or a dialogue back because we're not getting it from Mr Callus's office, we'd like to meet with Mr Pinkar we'd like to show him what's going on. I happen to be a transportation consultant, albeit for the airline industry, but I'm more than willing to work with them and at least that give us the decency of a dialogue. Thank you, absolutely ken nice to meet you. I will certainly check in with borough, commissioner pinkar. You know Colleen Kimberly and I can we'd like to, though understood yes, not a monologue. It's a dialogue noted. So you know we have not been doing site visits. You know earlier on in the pandemic. Of course you know in terms of safety reasons, but this is something that I will take back to see. You know when we could come out. There's. Certainly, you know, I think, as a team and with our bike group we want to be able to. You, know, evaluate thoroughly and review the project ourselves, we're also taking back all of your feedback and then see about you know: potential site visits in the future. So can I'll check in with the borough commissioner to see where we're at, and we can certainly get back to you. I did not catch your last name Goldstein. Thank you. Thank you. Thank you. Ken Allison Jordan is next allison. If you can unmute yourself, are you there allison hi? Yes, I just took it a minute to unmute most of them. I live at 301 east 62nd street. Most of my concerns have been addressed by my fellow members of the community. So you know just sum it up. I agree with the points that 62nd street is probably one of the most heavily trafficked streets in the city. Just between second and first requires three traffic cops, and that was before we shut down a lane. Now we have another lane shut it's more dangerous for drivers, it's more dangerous for pedestrians, it's more dangerous for the bikers, because everything previously noted you know, there's no place for commercial vehicles to stop, so they go into the bike lane everything everyone said prior, so I would just reiterate that it was a traffic problem to begin with. Now it's completely ridiculous, and you know there are other you know, routes that would probably make more sense. In the 60s I mean there is a permanent bike lane already on 60th street. That leads to the FDR. So you know, perhaps ending this more west on 52nd street and redirecting to another street would make more sense just because 62nd street, as everyone else has pointed out, is extremely heavily trafficked, and you know it's definitely become way more dangerous for everybody allison. I know we've heard you know the requests to evaluate other sides of the street or different sides of the streets and other streets, and so you know we're looking at a more thorough review and evaluation of those locations as well. Thank you thank you, Judy Schneider's, next Judy and Chuck. I just want to highlight that Victoria also is back. She was able to rejoin oh okay, why do not we? Why do not we see if Victoria will, if she can, if she has further things to say, we'll finish up Victoria there yeah sorry about that, my computer died. It was a couple hours of low battery, so I just wanted to reiterate that I've been here this whole pandemic. Nobody uses the bike lane on my block, which is between park and lex. I do not see a lot of people using it between third and lux either and in addition to the parking limitations, it creates a real problem with you know, sidewalks. I saw a officer this week and I talked to him. He was ticketing, a fedex truck and he just said the delivery guys use the sidewalks anyway. So I mean it creates problems on the sidewalk and one of our neighbors to our toward Fishtail or David Byrne, he's old he's, he can barely walk and he and his wife are having they're fearful of being hit. So it's a safety issue, it's a congestion issue and it really is hard to park and not all of us have 50 or 60 dollars for an overnight. You know at the garages, which is what it costs. So it's just it's a disaster and I've been here the whole time and nobody's using it. Thank you. I think Jennifer and her colleagues are getting the picture here. Judy Schneider next Judy good evening. Thank you, Jennifer and all your colleagues from DOT for coming tonight. I appreciate it. I know you're familiar with the East 60s Neighborhood association next year will be our 30th year and ever since we started the Queensboro Bridge area under the various mayors and the exits and exits and entrances from the FDR drive and the bridge have been a terrible problem, and this really has not helped the problems in the community. So I think that the whole area needs to be studied, not just the bike lanes, and I know that's a tremendous ask and it costs a lot of money, but the bike lanes have just exacerbated all the problems. I'm going to ask for something that no one else has spoken about tonight. I spoke about it last month and that's for more traffic control agents on first, second, third and maybe even lex, at 61 and 62, because what's happening with all this traffic backup is that the traffic going down second is being stopped. The traffic coming up first and third, etc, is being stopped because they're going across the street and they're stopping in the middle of the avenues, the traffic is so heavy, so the backups that we've always had for the bridge have become far more extensive than they were in the past. So I'd appreciate it. If you would, I know the traffic control agents have come under the police department, but if you could, please speak to Commissioner pinkar about that specific problem. I think that might ease some of the burdens that are going on right now if we could get some of these agents, particularly during the morning and the evening rush. Thank you thanks. Judy, I'd also encourage the board to reach out to pd and the precinct in terms of traffic control agents, but also regarding your comment about a larger study in the area. It would also be wonderful to hear the board spots on exactly like which bounds you'd like us. To take a closer look. Well, I must tell you we have reached out to the 19th precinct and as far as the traffic control agents, they do not come under the individual precincts. They are one. You know it's a separate group, so I'm asking you or the commissioner to reach out to the pd to that segment of the agency to ask put them there, if not permanently, for a little while, so that the traffic would realize the problem absolutely, and so they do fall under the traffic bureau of the NYPD. I would, I think you know additional advocacy, always helps so reaching out to NYPD. In addition to having us try to also have that conversation and make that request as well. Would I think, go a lot farther than just us trying to start that conversation, but I hear you Judy and nice to hear you can follow up on Judy's suggestion too. Let's see next is Louise's ipad louisa are you? Are you there? Are you able to connect and unmute yourself? No trying you should just be able to confirm I'm new okay, I'm Louisa Pagel and I live at 555 park Avenue, I'm the president of the board and I have lived in this building for 43 years, so I think I probably from what I've heard probably probably have lived longer in this one spot than many of the other folks that I've listened to. We were under the assumption when we finally found out about the installation of this that this was something that was addressing on a temporary basis, the pandemic, the coronavirus and that these temporary lanes were for many commuters, who were apprehensive about using public transportation. So a lot of what I'm hearing tonight is very distressing to me and to my fellow shareholders. One other thing that I wanted to point out, which I'm not sure is generally well known, but we actually did pace out. I know 61st, Street and 62nd street were basically twinned, one going east and one going west, but in point of fact, 61st street is approximately six feet wider than 62nd street and I've stood there and taken pictures. I have them on my iphone, which demonstrate incontrovertibly that, should there be something that's double parked on 61st street, there still is another lane that is open for West going traffic. We do not have that luxury on 62nd street if there is something that is where somebody has to say, take a taxi or a lyft or an uber, or something like that. We have many elderly people who live in this building and if the car pulls up, they then block the entire lane. There is no margin extra margin that six feet makes an incredible difference. So I would like to echo the sentiments of many other people, who've spoken before me and say that we really think this whole thing should be rethought. I personally do not feel because I'm listening to the distress of everybody who lives much further East. I do not think that this is a situation that bears tweaking. I think we're talking about finding alternative streets, we're basically not opposed to bike lanes, but I too have walked the streets back and forth every single day and the bike lane on 62nd street is hardly ever used. There's hardly anybody on it ever even on the weekends, when you would expect people to be out for joy rides, there's just nobody on it, so I think the whole prospect has to be rethought and I agree with everybody else. I think we have to have some kind of a meeting. I know you said that, and I heard you say that there was extensive conversation about this, but quite frankly, if you do not happen to be hooked up to community board eight meetings, you would not have known that this was a topic of conversation and in the past I know there were always bill. You know placards put on up on the lamp posts, so we had no idea that meeting was coming up. Certainly, we could have marshaled ourselves to express our dismay and opposition. That's really our entire that this is where we're coming from. This is a severely challenged street and it has always been so since the day I moved in 1977.. Thank you. Let's see, we have, I see Joerg or Georg. Is it not sure how that's pronounced right here? Well, thanks Lisa for your great presentation, I have lived a little longer than you have on 62nd street. I moved there in 1973. and what I'm seeing right now, particularly the statement from Miss Star, that no sites visits have been made to this location before this decision was made for me is symptomatic of how the city is being run right now, it is run without direction without foresight without looking into the future and how things work and do not work. Many of the things that have been said before I can only agreements, and the only thing that I have to add is unlike louisa, I have seen a large number of bicycle messengers on the electric Kamikaze bikes that constitute a major danger not only to the people living on 62nd street to everyone. There's absolutely no regulation in the city regulating these electric bicycles and the type of things that we see right now with accidents are only symptomatic of what we are facing in the future. Coming back to 62nd street. This needs to be changed. There has been absolutely no sinking and planning regarding the situation, and I have in all my years in New York, I've seen many different mayors, okay, some more competent than others, but nobody as incompetent as mayor De Blasio, and this decision on 62nd street is symptomatic of what is happening in the city. We have to do some really rethinking about how we run the city and we have to start with 62nd street. Thank you very much. Thank you. We'll take some questions from board members. I see there are a few board members who wanted to speak. Michelle Birnbaum has had her hand up Michelle. I do not know if he's yes, I'm here, I do thank you. So I'm very sympathetic to all of the neighbors as a person who's been advocating against bike lanes on most of the streets you'll, be very sad to hear that most of the bike lanes are placed on streets without and not preceded by big studies. For example, a bike lane was put on the street where Lennox Hill the entrance to Lennox Hill is, with the double parked ambulances, some of us on the Community Board begged, that no bike lane be put there, and yet there is- and I can name many streets throughout the city where I and others have felt that bike lanes were ill- advised. I think that the board and others have been far too sympathetic to the needs of cyclists, as opposed to the needs of residents, and I think by being that way and by the expansion of this bike lane network, we have only encouraged more and more riding and while that may seem like a wonderful thing, because it takes some burden off transportation. But to me not really, it is healthy, but it is a seasonal activity for the young and or able- bodied, and it does pose restrictions on those streets that others would could otherwise comfortably use. So I would ask the representatives Jennifer and others colleen you're here. I would ask that this bike lane that we're talking about tonight that these two absolutely be removed. They do not belong there and they were put there to give access to bikers to go over the bridge. That's why they were put there, but it was the absolute ignoring of ever of all of the residents that lived on the block, so I would say that they should be removed. I think it is also if you'll notice there are more and more cyclist accidents. All the time, because we're increasing the degree of bicycle riding when this whole program started, two percent of the population was riding bikes. Now I shut it to think what the popul the percentage- that's riding bikes, all unregulated I've been pushing for licenses for years that comes on the state level. There's tremendous resistance to that, and now the industry has grown to CitiBike, which is also located on inappropriate streets, school streets hospital streets. Now it's expanded to motor scooters mopeds that can go as much as 30 miles an hour and there's no regulation of any serious kind without a license plate, there's no way that the police can regulate this because they can't run up right after a cyclist who they can who they see in violation. So I'm very sad to see, but your plight, I have heard- and others on this board have heard from many others, and I would hope that the DOT would be more responsive to requests for removal of these bike lanes where they are found to be inappropriate and better than that would be real consultation with the community before they're put in now. I know there was a posting about this one, but I have to tell you I'm on the committee- and I do not remember discussing it because last time I brought up with the with this committee that why was this put in without any notice to anybody? I was informed. There was. I take them at their word, but I somehow missed it and I'm my attendance is, I think, 100, but maybe I was not listening that night, but there's certainly to my mind, was not enough discussion and the fact that it was publicized as temporary and now just as you, if you've been sitting here through the whole restaurant, the outdoor restaurant thing also proposed as temporary, and now it's we have a proposal, that's permanent. So we have it's sort of very threatening in the city when something is proposed, because it's needed for a certain period of time and then automatically it becomes permanent. The same thing happened with the public clauses at Times square and other places like that. They were supposed to go in temporarily to see how they worked and now they're permanent and there's like one lane of traffic down Broadway. So I sympathize with you. I hope that the Department of transportation does not just take it back, does not just discuss it but in fact removes it. Thank you thanks, Michelle Point taken. I need to switch over to my computer speaker, so I'm sorry that you're seeing me fumbling a little bit, but I my ear pods have run out of battery if you'll give me a second just so I do not miss any of the comments. Sorry Chuck. Okay, I just want to make the point. We had not only noticed, but we had an extensive hearing that went on for hours and went into some great detail. So obviously you were not at the meeting. I'm sure you would have remembered it and would have spoken about it. So that's on the record and we can get you the minutes to that meeting. If you'd like go ahead, Jennifer she's changing her headphones. Okay. Why do not we let? Why do not? We let I think we had. Let's see who was Rebecca Dengue had her hand up, but I think she is she's lowered it any further. I do not know- and I think we've already heard from the other speakers and I think we should probably move the agenda. I think Jennifer did you she's still connecting she says, she's still trying to figure out her speaker all right. So it's colleen, I mean we've heard all the comments and we've been getting emails about the bike lane and, as Jennifer mentioned, we'll take it back to our commissioner pinkar and the team and we'll you know, get back to the board on this. Okay. Well we're going to craig, and I will talk about having further discussions to see what we want to do about that and there's, and I know that the I know that D.O.T is going to come back with any proposals for making anything permanent and we'll have further discussions. Obviously, on this rebecca just raised her hand again and I feel like we should hear from her yeah rebecca, why do not you? Why do not you so? I do recall the meeting, but I do remember believe I remember we did not actually vote on a resolution about this issue at all. That is correct, yes, which was kind of surprising, and clearly I mean this is a crazy night. I'm sure most people are exhausted and want to be watching the news. The fact that so many people showed up to speak about this without it being on the agenda. I think it clearly is a top concern for a community and something that we need to maybe have another meeting about also to make sure that all of the parties are present, because I'm sure there will also be a lot of people in favor of this bike lane. So I think it's important that we continue this conversation again, because the community is clearly unhappy with what's going on. Thank you, rebecca, okay. I think I do not think there's anything else on our agenda. Does anyone want to raise well before we go on? I just want to announce. We had received an email that I just want to preview we'll try to address next month, and that is a request to address the need for a sleep, a safe non- slip, bike path on the Roosevelt island bridge. We had received an email from when strong, but shinozaki, and I had promised that I would advise everyone that we were going to be taking this up. So I just want to make that announcement. Good. Thank you. Is there anyone else, any older, new business that anyone wants to bring up? So I think I appreciate everybody's attendance. I think we'll further we'll have further explanation on obviously on these bike lanes, crosstown bike lanes and thank everyone for their attendance, and I believe we are adjourned. We appreciate it take care, goodnight, everyone, good night, you.",
            "summary": "You know the open restaurants, program, there's an executive order, number 126, which was signed on June, 18, 2020 And, then there's a recent executive order, which is for the newest one, the stores and that was executive, order.\n157, signed on October, 28, 2020, And I know that in some one of our previous meetings there had been some issues as to how zoning was affected by these programs in the executive order and the one thing that both of these executive orders do.\nIt suspends a number of things under city law and it also suspends parts of the zoning resolution and that's why they're allowed to have restaurants and places where they you know in the street in places where they cafes, where they would not normally have them and that's the same thing with the stores.\nLast week the mayor announced the open storefronts program, which is a city initiative and Covid-19 recovery program that allows for ground floor storefront businesses to temporarily conduct retail activity on sidewalks that are directly in front of their businesses or on roadways that are participating in the open, streets.\nSo businesses are allowed to self- certify that they need these program requirements in order for them to participate and the DOT team, emily, and I were happy.\nYou know to help answer any questions that folks may have about program criteria or outdoor setups, and thank you again to Community Board 8, for the invitation and for having a fun.\nAnd I understand that you're looking to expand the bike lanes, I, find them very dangerous hold on one second susan, we're not going to discuss those This is this is about the restaurants program or if you want to talk about well, I'm, very supportive of the restaurant program.\nYou know small businesses in particular that are able to self- certify that they meet program requirements for this new open, storefronts program, And you know just to reiterate a kind of where exactly they're able to set up these businesses will be able to set up on the sidewalk that is directly outside of their business or in the road bed and on the street of you, know the streets where we have open streets, restaurants, corridors.\nSo I would think that, if a restaurant, that is, it has done that and gone to the expense of having the new filtration system that they should be allowed to have more than 25 percent of occupancy within the restaurant as well, because they've gone out of their way to try and consider what's necessary and the city needs to meet them halfway.\nWe know many of our restaurants in order to find the space to open up outside on the street kind of go off from in front of their stores.\nBecause I would think that yeah, the people living in the neighborhood may have a problem with stores and restaurants.\nThis is a bit of a touchy subject, but from my perspective, street vendors, you know play an important role in the fabric of New York City and we've got a lot of people who have been suffering.\nGuess what sort of considerations DOT given to expanding this program to street vendors and one consideration that came to mind, because I know we want to certainly support.\nThink your questions about potentially pairing vendors with open storefronts is sounds like a very creative idea and something again maybe to coordinate with and talk to the department of small business services, who has and does a lot of outreach and contact with property owners and retailers and may be able to provide thoughts and guidance on that anything else.\nIt has been announced that it will be a permanent program and multiple city agencies are, you know, currently kind of looking and in discussions about what that will mean what the process will be all of those things, so there's kind of little to report yet because we're still at the very beginning, stages.\nCertainly, there will be a lot of things to reconsider for a permanent program and that will certainly include the design of the spaces that are on the street.\nI know that a lot of small business owners, especially on the east side, are having trouble actually sourcing, the heat lamps that are clearly needed, now, as we go into winter.\nI, do not know if the city has put any thought into trying to help restaurants and now retail stores acquire either it's actually.\nNow that some of the rules have been changed, and hopefully that question was clear: A great question, all sidewalk cafe, rules, Kind of pre- pandemic were suspended as part of the executive order for open restaurants.\nAre our colleagues at the Economic Development Corporation have started a series of resources both to connect designers to restaurant or store owners to kind of help, build out some of the these things.\nI've noticed with a lot of the restaurants, and perhaps the storefronts will be doing this as well- are building structures that they're now pretty much enclosing on three sides, almost creating an indoor environment, So I think it's important to note that New York City is really following the state's lead on all of the health guidance related to to restaurants, and so we've been working very closely with our colleagues at the Department of Health.\nThe open, storefront program allows for people to actually have a transaction on the street, so you could call up.\nOut, and I think it is very fair to say that those you know the considerations for a permanent non, coveted program are very different from the considerations that created the open restaurant program.\nWhat is why are we creating this permanent program when it was created for a specific reason, and now that reason won't will be eliminated And yet we're encouraging the program to continue, because, after all, there's a lot of repercussions to having such a program permanently on the street, not to mention the visual blight, the structure, the traffic they're in bike lanes they're in you Know there could be a bike lane on the other side of the restaurant, You, all know, But what's the rationale for doing this and breaching the zoning So they should not be in bike.\nThe first about zoning is that zoning will need to be reassessed, and All all associated processes that come along with rethinking zoning The city did have a sidewalk cafe program and two DOT did have did have a a street seat program.\nI do not want to gloss over the fact that a permanent program really needs some serious thinking about process and design and how all of these spaces interact both with the street.\nI. Think what we're seeing and what we're hearing is just that having people out on the street enlivening our sidewalks and our streetscapes has been not only in terms of covered times where it feels you know like a breath of fresh air and to see like life and our neighbors on our streets, but that it really does have you know a quality of life kind of public space benefit to to our streets, and So I.\nThink it's taking a program which was envisioned to kind of bring the parisian sidewalk cafe, environment, to New York City through the through the zoning The ability to work with restaurants, to bring public seating and restaurants, heating onto the.\nYou should come to the community and the locations should be discussed and decided in conjunction with the community and not just making a statement that this whole restaurant thing is going to be permanent and so that everybody who's self- certified who's on the street now can just be assumed to stay there.\nYet, given you know the pandemic and recovery, And things like that, but I do just want to be very clear that a permanent program will look different than what you see on the street now I'll direct this to you too, as the deputy borough, commissioner, that obviously you'll come back to the board and talk about any kind of a permanent, program, and I assume that's what Emily was referring to before we currently permanent program implemented and check.\nWe know that restaurants, who are in front of bus stops or bike lanes, do not have the same ability to expand as other better located.\nIf you want to give a little bit more detail in that for our new open store french program, I think we can expect kind of similar type requirements, as neighborhood cases may go up.\nIt's a tricky situation, You know with the building department and see if we can come up with some kind of rationale when they get a permit to do scaffolding, maybe it has to be renewed at a you know on a certain basis and it has to be looked at and in some kind of process, but I think that some, that is, an issue in our area, clearly agreed and colleen, and I can take that back because we do know it has been.\nHave a hard time thinking that far back but empty storefronts were not an unheard of phenomenon before the pandemic, and so a lot of businesses were going out and Until.\nAnd, you know, city agencies, feel that there is a possibility to extend , I think you know we'll cross that bridge when we get there, but open storefronts right now is looking to run just from now until the end of the year and then outdoor dining program.\nThe, open restaurants program that was announced by the mayor last month that we are looking for a way to create a permanent program for outdoor dining and that's what we'll be returning to the board with updates.\nYou know, restaurants, have to self- certify and guarantee that they need certain requirements to set up their outdoor dining on the sidewalk or road bed directly in front of their establishment.\nWe've talked about zoning: We have a number of streets and avenues in our community that have restrictions regarding outdoor dining.\nWe as a community need to ask the question: Is this sun setting, or are we going to give away all zoning and forget that we have any in the city?\nSo I'd like a response from the city agencies on what's going on here Other communities are raising zoning issues.\nSure so maybe just quickly say that the Department of City planning was a strong partner in developing the open restaurant program.\nThe mayor can not just wave the magic wand, and you know if you live in the community you're getting asked the questions, And, so I'm asking what's going on with the zoning.\nYou know the program guidelines for making open restaurants permanent is still under development, and so I'm sure I can coordinate with will craig and chuck on when we can return.\nWe had to, as you know, implement the open restaurants program very quickly and we had to create.\nUnfortunately, but you know, as of today, there's over ten thousand participating restaurants in our outdoor dining program.\nD.O.T was trying to kind of think through and come up with creative ways to make it livable and safe for all seat street and sidewalk users.\nIf you actually want to send us that location and we can contact that business directly and do some follow- up to make sure that those elements are removed, all right, great and then just looking forward, I know.\nIf you know for the open, streets, restaurants program, we need a minimum of three restaurants to apply on that block or along that corridor.\nIs it going to go into the crosswalk so that people can not cross So, regarding your second question, so No, you can't throw snow that you shovel back into the street.\nOne question to the DSNY: they said that when there's a snow emergency that they would expect the restaurants to take in their outdoor tables and chairs and that what happens to the permanent structure that stays there, I assume.\nWe welcome an opportunity to work with the city to provide our advice and to have input into these decisions that affect not just the immediate ones like the restaurants or the stores, but the people who live around them.\nI. Think you got to ask yourself: Why would you put a lane on the street that has the exit for the FDR all the bridge, traffic, thousands upon thousands of cars every day, Now I know it could inconvenience the bikers, and, I, believe in bike.\nThey do not want a bike lane on their street, and you know I think it's important to have bike.\nChuck, I'm, going to first have my husband speak because he's a regular biker and a resident of the neighborhood I think Bike bicycle lanes make a lot of sense.\nFor all intents and purposes, and so you know, now, we've basically got as people talked about access to the FDR and 62nd street with one lane, people have no curb out access and traffic is backing up.\nWe know: you've all spent a lot of time on this, but there was no study that was shared with the community that people who live here on a daily basis know what traffic was before and is now, and I really think you need to hear it in full spectrum on just a discussion over 62nd and 61st, street, These tweaks are helping a little bit, but the impact is just so huge that even a little change is not at all benefiting our neighborhood.\nI'm, the vice president of the board at 200, E, 62Nd street I've also worked with Juliana in connection with the Treadwell Farms Association, putting my law firm behind some zoning issues that we've had over time as well, And I just want to say that I appreciate we're a complex, city.\nI do not think you would find a single person in our community who's in support of these bike lanes and the traffic and noise that they're engendering in the in the area.\nIt is absolutely true that I do not know if the members from the department of transportation live in our neighborhood, but if you, if you're in our neighborhood any time after four o'clock, particularly right now during the pandemic, when everyone's driving, you would see what it's like, and it is not.\nI also had this notion that when it first went, in- And I have to confess that when I first went- You know full open discussion about it Basically you roll out of bed one day and see these bike lanes out in front of you and see the traffic start piling up, and I just made the assumption that it was done because peop the administration figured that during Covid-19 we'd have people coming back to work in Manhattan and that people would not be wanting to take the subways, and so therefore they would be getting on their bikes and going to work.\nWhen it comes to the installation of these bike lanes and Yes, it goes without saying we're feeding into and out of the FDR drive and the 59th Street bridge, and It's, really just not working out, and I.\nI understand why Bike lanes are important, but guess what so is parking for people who live in the neighborhood?\nI mean there is a permanent bike lane already on 60th street.\nI mean we've heard all the comments and we've been getting emails about the bike lane and, And I know that the I know that D.O.T is going to come back with any proposals for making anything permanent."
        }
    }
}