{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB10",
            "channelId": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q",
            "title": "June 2020 Executive Committee Meeting",
            "publishDate": "2020-06-29",
            "shortDescription": "",
            "lengthSeconds": "3:45:09"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB10",
            "normalizedName": "Manhattan Community Board 10",
            "twitterName": "Manhattan CB 10",
            "youtubeChannelName": "Manhattan CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
            "twitterHandle": "@mancb10",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "uoVJ_1NJM_Q",
            "fillerWordCount": {
                "uh": 1,
                "um": 51
            },
            "readTimeFullTranscript": "53 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "information": 26,
                "budget": 20,
                "housing": 19,
                "fireworks": 17,
                "businesses": 16,
                "block": 14,
                "today": 12,
                "report": 12,
                "chair": 11,
                "day": 11
            },
            "wordCountSummary": {
                "budget": 4,
                "information": 4,
                "pandemic": 4,
                "intelligence": 3,
                "police": 3,
                "boards": 2,
                "30th": 2,
                "conflict": 2,
                "interest": 2,
                "president": 2
            },
            "fullTranscript": "Hello, hi, hello, you call a roll yeah, II Oh, God yeah. This is not working- Roscoe yeah we just got into the meeting. I can't hear anything. It's gone. It went back talking to some about some other stuff on here. I do not know what happened. Cuz I have not had any trouble befo once you set it up, I just go in. So what have you done? What is it yeah but I'm, not even in any college anymore? It's coming about Gooper, zoom and all this stuff go to the text messages. So long text, messages: Roscoe, join our cloud meeting. Hit that hit okay, I did during our cloud I'd be what happened in he said. Join our cloud HD video meeting. Okay, he says you might drive safe. Your microphone is unmuted. Your video, your video is stopped Darn speaking Oh God up top it says safe driving mode. Yo Microphone is unmuted. Your video is stopped. Don speaking. What did he change? I can give him you in the Navy, sir. You I can't get acting. He nothing on this. Maybe there's not know what Steve you're in here. You hello, when I do that, but I can't hear nothing I can't either, which is why I am we can see? You can hear us. No I can't hear you. Can you hear me? Yes, we can hear you. Okay is the meeting I think the meeting starts at 6:30, the meeting start at 6:30. That's what she teeth told me. There's a few people on now: okay, who speaking to me now. This is Denae the captioner, the person who takes down the meetings. Okay, thank you, hello. Everyone, hello, I, good evening, good evening, good evening, good evening, hi everyone we're going to start giving Memy another two minutes and we're going to go ahead and start I know a couple of folks said they were going to be late, but I wanted to give enough people to get on here. I know we have a presentation from Echo Dev and from parks and from Health Committee, yes Ma'am and from Hell, yes, Ma'am yeah from hell. Oh yeah put that in there, okay, hey, sis, Lake Charles. How are you I'm? Fine, you good so I'm moving around so I'm going to be. You know with my picture: okay, nice, to see you in the face. If you want to, you, can show your face. No I'm just telling you girl, okay, here I am unshaven. You guys said you know. So you know this be a real girlfriend. It's a better picture of me. So are we the only ones going everybody's here? We are I, think I see I just wanted to make sure dude Joshua. How are you good how you chose how you doing Josh? You did a great job, Dr. Duke, sunny, Brian Benjamin called earlier today. Thank you, I'm sue I was on there. Dr. Dukes I just got on a little late to the call. Okay go ahead and start shot a cure. There I see you shot. Okay, yeah, hey guys! Good evening, Mrs., Debora, Gilyard, Deborah I, know Deborah Yates said she was going to be a little late. I know, Karen said she's going to call in an Chanel. Oh there you are now I, see you Chanel, okay, so I'm going to go ahead and call the meeting to order. It is 6:35 p.m. welcome to our June EC meetings. We have a couple things on the agenda, but for the counter for July in August. It's not completely done so the counter and August we'll just have your regular committee date. So we're not going to be having our general body meetings in July in August, but we're going to have our regular committee meetings. So if you have committee chairs decide that you want to move your meeting, combine it with another committee, let's try taking Juanita know so they can make those changes to the calendar and again I want to reiterate. Thank you. All for agreeing to continue to meet over the summer know how important it is for us to still come together and be still be a sounding board for the community. So thank you for agreeing to do that and I've had a lot of great feedback about this decision. So thank you so much first for doing that and agreeing to it. Okay, I'm going to go ahead and start with my report. So there's, as you all know, there's probably a lot going on. The big thing that's been talked about and being dealt with, has received a lot of complaints and we all have about the fireworks situation. Dr. Dukes. Thank you so much for handling that on the call with Senator Bryan Benjamin's office, following up to make sure that we were able to discuss the fireworks situation. There were a lot of solutions given on football, but, as you all know, the mayor has decided to do some sort of crackdown on it. There is work to be done within my PC and enforcement, rather whether you want to criminalize it because it is a summonable of friends, and we all know that summons that are not paid lead to warrants and such like that. So we do not want to have that happen, so it is a gentle walk that we have to do with it, but it's something that does need to be addressed. Does anyone have any comments about the fireworks situation or what's going on with it Dr. Juice? Did you have any updates? I know, Charles was on the call today as well. No I think, as Athena said, you know, we do have the board committees there and my thing was tried to push that. We need to sit together. All the leadership and a community board can because I did call the priests in 32nd$, 0.03 and I told him. My name. I got a call back about I put my calling about through your clock. My doorman downstairs when I went downstairs, because the cops came immediately from my call and I went downstairs was about 3:15 in the morning and they was there. As I said my room. One of my rooms face of the Lincoln Housing and I understand they was from the rooftop over there and I. Think Athena made a good point. You know they have to do something about boating up that people can't get to rooftops in the housing and Nina Saxon most certain. It was great when she said that about we got to have one room for everyone in this city. One of the questions I wanted to ask and I could not remember when we do block parties when they come before the Community Board for block parties. Is there time in like say from 4:00 to can you know like they cut back on the parades? Did they ever cut back on times for block parties yeah they did. Do you want to answer that? That's what I thought yeah they have. We have some complaints because I think the earliest one that I saw was like 5:00 or 5:30 p.m. and then there's been block parties who've been operating and they've been pretty good. They've never had any instances, so they were given pushback saying you know. Why should we be penalized because there were a few blocks who are unable to control I'm the constituents on the block? But to answer your question: yes, there was our restrictions placed on certain block parties. What is the time frame? They believe the earliest I guess it is 5:30 p.m. that be closed. Usually they would let the block Party go to about 7:30 8:00 mm-, hmm! Well, you know. If they've been getting calls that this block has been problematic in the past, then they bring them a block party time down so about 5:30 and that's all on there for about a local preset. Okay, all right, thank you, that'll be a when we meet. That would be a good point to talk about. Okay, thank you. Madam chair am I still on. No thank you back to you. Thank you doctor. So thank you for talking about the firework issue. So when I move on to the black lives, matters, mural I'm sure you all have heard a lot about it. So it's happening from July 1st to July 4th, but the big kickoff is July 2nd. So we will be a part of that so I'll be working with Harlem Park the park and got to stop LLP or LLC, but we will be a part of that. So everyone is on. The board is welcome to come out there and be a part of it. Does anyone have any questions about? It is a social distancing event. So if we want to I've already said we would be involved, but I did not think I did not know if the whole board would be there. So if we could maybe get an attendance or a general amount of folks that might be out there, we will let them know because we do wanted them to be able to social distance. While we do it, but it starts at 10 a.m. on that Thursday July 2nd. So we will be taking a part of that. So recently we had a town hall with the borough president on all the Uptown boards were in conjunction with that Town Hall Thank You Sachi, for working with that and getting that together it was 9:10, 11 and 12. We had at one point I think were there 130,540 participants, so it was a really well attended and I think there was excellent information there. It's on Facebook I believe they did post a and record it and post it. If there's any issues so CB 10, we were responsible for small business services, so we talked to make a mini Lane mega Lena are with C and D ot. We had Jennifer St. Anna's as well as La Blackwood, as our panelists, so I think that was, it was I, think really constructive, very informative and we got to ask questions that were actually posed by our Community board and the general public. So I hope you all get a chance to check it out. Also we had a housing forum with a Phillip Randolph, Thank, You, Charles and Donna for getting that together for the commute from community boards hen. We had a lot of folks involved and if you got to attend that I'm housing forum, there was a lot of great information. So I believe that was also recorded and available for you to look at. But one thing I would highlight: is the Manhattan, its Manhattan housing service or something like that? But the attorney's name is Jerome Freedman and he are Frierson Manhattan legal services, yes, legal services, Thank You, Charles I, might be a little frozen there, but they were great and they're. Their presentation, I think is available for us. So please I think chic. If we do have it, we can send it out to the board and ask a lot of questions. It was in a FAQ format, which was really helpful. Then we had a Juneteenth event again shot Eek. Thank you for getting that together in conjunction with the hell's kitchen's Democrats, as well as in double- a-, c- p. We had a really good showing for that great conversation, I'm, not sure if that was taped, but Charles Johnson represented CB 10 as well as Jacob Richardson. She was not representing CB 10, but was there for CCRB, so we had a really good turnout for that. Lastly, there is a what's last. Two things we signed on was several other community boards to support the extension of spectrum Wi- Fi, so they were giving free, Wi- Fi that was supposed to end June 30th, so the borough president's office was sponsoring a letter that would support the extension of free, Wi- Fi throughout Manhattan, so we did sign on to that. And lastly, there is a conflict of interest. Training coming up, June, 30th I know we always talk about conflict of interest, so it is a free training by the borough president's office. It is June 30th, so I think that is a Tuesday from 10 to 12 and then from 6 to 8. So there's two sessions so I recommend that everyone take advantage of that. We just want to make sure that we are in compliance and that everyone is on the same page. So if you do take that counting trés class, we will definitely send it out to the poor. So everybody knows, but please send an email to shotty or me to. Let me know that you did take it and then we can check you out for compliance, because this year it is going to be required that everybody take conflict of interest. We've been asking the borough presidents office to give us a conflict of interest class. They finally came through they're, making it available to all the boards, so I want everyone to take advantage of it. So we can all be on the same page know when to recuse ourselves no- one to abstain. It's very important that we follow the rules and that we know the rules, so please take advantage of the class. If you have not received the registration I just received it from Aldrin. Today we will definitely I do not know if he sent it to all the community board members, but we will definitely give that to you first thing in the morning, so you can go ahead and register for that conflict of interest. Training, I believe that is all I. Have the treasurer's report, hello, everybody's, so going into the treasurer's report. We had a second meeting on finalizing our budget for the year thinks everybody participated, all the chairs, Cecily arm, Charles and Marquis Harrison arm. So we were able to finalize our budget on some of the things that we purchased were an HD livestream camera that we received to support our meetings in the future and external hard drive so that the staff can work our remotely and have all their information stored on there. We've got an office air purifier to make sure that when the office does reopen on the taper for the staff and for any visitors, because it'll control, the air circulation and purify, you know any bacterial viruses that are on the air and then we also purchased some office equipment, some routers, etc arm. In addition to that and purchase, some hoodies base mask our bag, poly style bag book bags, replacement off filters for the air, purifier and polo shirts. Most of these are for the board members, but certain the book, bags etc, and the face mask will also be all distributed to residents in the community. There's about two disillusion: 250 face masks and 250 book bags that will purchase. In addition, we spent five thousand four hundred dollars on the haul on holiday light event. This was a pre purchase because we had the money left over in our meeting budget and we're not certain about how much how much funds we'll have in our next budget arm, which starts July 1st because of the budget crisis that the city is happy is having so we went away so we went ahead and just paid for that expense now try to be responsible arm and in the event that does take place. We won't have to worry about digging out of our current budget and that's the school year to pay for that. So all in all that leaves us with the remaining operating budget of three thousand one hundred ninety dollars and our City Council capital Budget has a remaining balance of twenty thousand five hundred and fourteen dollars. So we could basically complete our objective of trying to all utilize all the funds available in our operating budget, which was twenty four thousand four hundred and eighty nine cent at the beginning of COBE. When everything shut down, we wanted to make sure that we utilize those funds. We had a lot of extra funds because, after we arm we let go of one of the staff were able to reallocate the funds assigned to their salaries to the operating budget. To that game without basic request, our operating account. We do not anticipate having the same amount of funds in the operating budget next year, so it was great that we were able to utilize it in these waiting months for our future on uses and the City Council budget. We really would have wanted to use that budget, because it's specially designed for for certain expenses, such as events etc, but because it's so big, we were not able to really utilize that budget. The way we would have liked to, but going forward as we reopen, will we'll definitely be able to use it, but we'll have to see exactly what those figures look like in the end of next budget. I know that the budget deadline is July 1st and the city is still trying to figure out arm what, where they're, going to cut different services so that they can make up the budget deficit, because the budget deficit that they project it for 2021 was originally seven point eight billion, but now it's going to nine billion dollars, so the city is proposing. You know different cuts in different areas following city workers, etc. So I guess we'll know about July. First, what that actually will look like Thank You Josh. Are there any questions for Josh the Treasury report Josh? This is Kevin yeah, just a question just for clarification, the unspent City Council budget. That 28000 is then it's just forfeited correct. That is correct. It returned to the city, does not carry over into the next off the school year there. Another question: yes: are we submitting Committee by Committee the various proposed budgetary and I do not know, I do not know it well. I did mention that the last meeting for any specifically the last EC meeting for any armchairs to reach out to me if they had any ideas, are more or had any requests for the remaining budget. We did get some requests in from just a few arm committee chairs, who reached out to me on one of those was the book bags from the Education Committee. So you did, you know, solicit that input arm, but we did not receive it from everybody, but that's okay, because you know understanding that there's not a lot go to the events, etc that we would have in the committee have in the community. So we just tried to do. We just tried to basically brainstorm what could we do to just improve our operations and support the staff if they have to work remotely for an extended amount of time? Yeah? Are there any other questions for Josh? Hey we're going to go ahead to the district manager report, Thank You Shetty good evening I'm, everyone up thanks for your report, Cicely and Josh Alma I just want to start talking about on the test and trace core problem. That's being administered by the city right now we're currently at our lowest. You know, I, guess you could say the Covid-19 viruses level. This self I was actually decreased on to the lowest point that it's been on since March. At the height of the pandemic, we were losing about 800,700 to 800 deaths per day. Right now, it's under 30 I believe from the last time that I checked on the test and trace core on they're, currently administering 30,000 tests per day, I'm at 200 testing sites throughout the city. So they are really stressing and urging everyone who has not been tested to go out and get tested on. The first step is to actually take the test. Everyone can and should be tested on. The test is free and it's also confidential. All your information is protected by the Department of Health. After you have been tested, whether you have you know, tested positive or negative in a situation where you have tested positive, then that's when they would send out the workers to contact I'm in trace people. That's in your inner circle! Colleagues, people! You may work with people that you may live with in your house and then they would urge them to get tested if they get tested and they do not show any symptoms and they would tell those people the self quarantine for about 14 days. I believe they're still hiring at the agency for case and contact intakes case investigators, monitors and information gatherers. I can put the information in the chat box if anyone needs more information on how to get tested or where the sex to get tested, and also just to just to view the test and trace program overall. Just to piggyback off of that little bit of information, Sydney white on the on the state level I'm, the governor announced today, along with New Jersey and Connecticut, that they're instructing anyone arriving in the tri- state area from a state with a positive Kovac 19 test rate of over 10 per 100,000 residents to follow a strict of 14 day quarantine upon entering the city. Well, if they come in a city and they're, not quarantine, they've been threatened with stiff fines from the government. Next I'll move on to transportation matters, the Harlem bike network expansion, I just received plans today that they're going to have protected bike lanes all along the east side of Fifth Avenue from 110 Street to a hundred and Twentieth Street I know this. Conversation has been going on before I even got on the community board, but dating back to 2017 has been ongoing. They've come to our they've met with us at our community board. They've also I've met with community Board 11, or one of my questions that I asked them was parking going to be taken up. They said that it would be, but on the east side of the street, which is CB 11, but the way that the way that is structured, the parking would be replaced because they're going to use one of the middle driving lanes as a parking so to be parking in the middle I do not know. If you seen the protected bike lanes in Midtown Manhattan, they have parking in the middle of the road. So that's what that's? What our 5th Avenue would look like, and I'm miss Horry I'll. Send you the plans that I've got to be I, miss my assistant, Lee I'll, send you the plans that I got today, so you can take a look at the UM design. Next I'll move on to just this week: New York City, we're now in Phase, two of reopening our businesses that may start to expand operations, include offices and store retail, outdoor, dining, hair, salons and barbershops real estate, commercial building management, retail repair and cleaning vehicle sales. We have not got word yet from the borough president's office when any of the community boards are allowed to go back. We do not have a start date as of yet but I'll once I get that information I'll, let you guys know alternate side. Parking has changed for the first time, I thinking like 20 years, so now alternate side parking will only occur once a week during the summer. They have not issued a lot of details, but there's basically saying that it's once a week and to tell which day it is, you would have there's actually two dates on the sign. So if it says Tuesdays and Thursdays you have to move the car, then you just look at the Thursday. You look at the day of the week. That's on the bottom of the sign and that lets you know that's the day. So, instead of the two days, you only be required to move it. One day on that side of the street. I know it sounds a little confusing, but Kevin you have the Henry's. Just for clarification is that his sign is changing. Is that no the Simon is not the signage is not changing. What I saw is they put an X on top of the top date and I do not know if they're going to go in on every sign and put an X but they're big they're, basically telling the community to they, ignore the top D and just focus on the bottom day. So all right, so that's for ultimate side parking to me. The task force for the fireworks I'm, not a Cicely, spoke briefly about it, but the task force will be composed of like police officers. That's an investigation unit they're going to be shipping them over to the farm sort of like the task force of fireworks. They'll also have FDNY helping out with these investigations and I heard they're trying to ramp up on the penalties and they're trying to get the people who are actually delivering the fireworks. Not so much focused on the people who are lighting the final fireworks, because if you did not have the deliveries, you would not have any fireworks to like. So the bigger problem is these fireworks are coming in from state to where fireworks are actually legal and they're just no coming up with either from down south up I-95 wherever they're coming from. So those were the investigations. I will look into just to add to the piece that you said on black lives matter. The black lives matter will be on both sides of Adam Clayton, Powell Boulevard from one hundred and twenty- fifth 427 Street. Also, with the protest that's been going on, there's been a call to the fund on the police by the New York City Council has, since endorsed a plan to trim a 1 billion dollars from the department's budget, or currently the department spends 6 billion dollars annually and mayor De Blasio. He said that he would shift funds from the police department to youth in social services, but he has rejected the 1 billion dollar number. So we do not know how much it is as of yet, but he did say that he wanted to give the money to youth for social services, such as the cure of violence, movement and I. Think two other things I have for any small businesses who have been affected by looting. I know we do not have that many and our district, our district was not, you know, hit as bad as some others, but there's a 1.3 million dollar fun I'm, giving out through SBS for those who have been affected by looting that you could apply on for that loan. And. Lastly, there is a new senior affordable rental development I'm located at 11 West 118Th Street on the property will consist of 135 apartments. A 41 are set aside for homeless, seniors referred by HRA and DSS. The remaining 94 apartments will be marketed through New York, City, Housing Connect, and the project is published and published on the housing connect website. As of today as an upcoming project and the application will be available for use as a today, and this was brought courtesy of HCC I. The development is called the HCC I of victory, Plaza senior, affordable rental apartment. Once again, the address is 11 West, 118 Street, and that concludes my report. Unless anyone has any other questions in regards to the bike lanes, I think did you mention that the design is configured so that the cars are at the middle of the street and sit on the outside of bike riders? Yes, so that's a protected bike. Lane means that there's going to be two lanes, but it's actually one lane, but they cut it in half they'll allow two bicycle lanes to take up one lane and it's protected. So it's a separate and aside from the floor of a vehicular traffic, if the only problem with that design configuration is that what typically tends to happen is when a car is parked, which is which is what's supposed to be providing the protection. Sometimes the driver will open the door and cause the bicyclists to basically fly from their bicycle, and deaths has actually been caused. Because of that, the difference is that when the car is actually parked curbside, if the door is open on the passenger side, the rider has more opportunity to swerve out of the way off the door instead of being trapped between the curve and the car. Well, the way, the way that the way that I look from the design, the protected bike lanes are to the Far East side. So on Fifth Avenue, you know, Fifth Avenue is a one- way going downtown. You know sort of the Far East would be the lanes, so the cars will be separated by island, so the cars will be in the middle of the road, so they won't have any type of interaction, I'm open the door because the bikes will be on the Far East side. Okay, terrific yeah, that's perfect! Thank you. Take I've requested to take yes, I was talking. This is Charles Oh. How are you name? You know there was some information, then you receive with respect to persons who are bringing fireworks into the community. I think hazel and others who are on Sicily this afternoon would agree that both the commander's and patent off the 32nd and the 28th precinct indicated to us that they have no idea who actually is bringing fireworks of industrial- grade into our communities. So can you just share where your information is coming from, because the commanders as of 2:00 p.m. today indicated that and they do not have any investigatory information they indicate where those fireworks to coming from well I can speak from a personal, a personal account. A God pulled up on my block I'm a few weeks ago and two guys they pulled up. They had a van and inside the Van. They had a bunch of fireworks and I asked one of the fellows on the black set home know who's those guys. He said. Oh, those are some guys from Philly they're selling fireworks and then people come and buy what the fireworks in May left. So that's just something that I witnessed on my own and then I heard you know just from different other sources. People on the street was saying: you know: people drive to Virginia. They drive on Pennsylvania to get fireworks because they're illegal here so clearly they're not buying them in New York City. So they have to be coming from somewhere else, but I think the mayor's task force their job. Is there investigate you know, even if it becomes federal, where they're going from state to state to find out the actual source, because I guarantee you they're not just coming from one place, they're coming from different states, Thank You Charles. Thank you for bringing that point up, I. Think in a meeting like this disadvantage, you have to be very careful because that's what was said also that in when we did have this search people would report it. They have no reports. If this is happening on your block and somebody else know it, nobody is telling it. As I said, I was one of the persons that called 32%, because I thought it was. You know right in my window that I would be filled in my bed. So it's very serious, so your people are people are saying these kind of things. I. Think that before you report it I would say to you that you should say that they should if they know these are the guys they should report it, because this is a serious thing in the community. But this is when I've been getting my constituent complaints. I've been responding, so all of our constituents by giving them the FDNY's hotline number they have a designated number just. So we know that. That's not the point. The point of it is there. If there's someone knowing that people are coming in our community, it's just like with the with the drug thing, when people took over the community took over and start painting doors that they knew I'm, saying I would refer them say to the Amish citizens. You know just blotted out it- telling you but yeah. These are the guys that we would say. Well, if you noticing- and you live on this block, you should be concerned. What my point was. The least commander's fatigue indicated today is dark. The deuces indicated that there's no intelligence I saw Joshua's point about the fact that it's legal in New Jersey and they believe that it's coming from New Jersey I, saw comments about Pennsylvania, but I think the message is Dr. Koontz is indicating from the community board is I know it's a difficult message, but the police is saying they can't get in the intelligence. People are not saying where this is coming from, and so when we have information, I guess, there's the real serious question. I know what it's all about in terms of squealing and all the rest, but at the end of the day, I think we need to be able to ask the police to say here's the intelligence, here's the information, stop these things from coming into Brock, mewn, Josh, shadow question, yeah I, agree with you all by also think the police need to do their job and really investigate. I was on my 16th Street yesterday and there were kids shooting off roman candles in the middle of the block between 101,16 between Armed, a thousand and seven thousand. So it was crazy. The cops so they came. They rolled behind these big giant like emergency service trucks. I never saw before, and they just they came. The kids ran away. Copters drove by they did not get off. The car did not talk to anybody in the community or actually running anything they just drove by and then the kids came right back. It started shooting the firecrackers again, it's like the cops have to actually investigate they do not, they do not go and they do not talk. There's no real detective work being done. I would think that you need to talk to our people of Safety Committee on this, and that should not be a wide discussion here. It should be. We are trying to get the leaders to have a meeting on the strategy our chair was on the meeting I understand. Charles I was chair from the Community Board and Miss Moore Athena said that the borough president have said to NYPD that we have safety own community boards, and so they should be reaching out to us. So I think we should not have this open discussion without any strategies, because this is so serious. The we should not be getting out of their car with young people is at the height of what's been happening in this city and up in the world. We do not want that, so it's very complex and I do not think we need to take this meeting. So what I think it need to be without the chair of our committee and with the leadership who is on the call today I think they're closed meetings on, because they're going to be practicing social distance, it's all by them by owning I, know that Charles Johnson is going to be attending 228 crease, Sense Media I'll be a 10 minute, 30 second preset so I'm interested if they have any more information or updates on this and then, if they do, we can share it with everyone. Well, I was sharing it with us, our community and that's what we did today. We left it there and there will be a community meeting. We need to have our own strategy. We are not the police department, we're not going to be doing their work, but we have to do our work as a community to do. Are there any other questions for chic? Okay, we're going to go ahead and into attention quorum as we prepare for that I just wanted to bring out one quick thing that I forgot to mention that on Thursdays, usually the third Thursday's I attend the borough, President Meeting Borough Board meeting that includes the councilman and all the board chairs I again. I've said it before, but I do want to reiterate that this board I'm so very proud of CB 10, because all the other boards they've been having a little bit of issues here and they were having their meetings. But we can proudly say that we have had every meeting, maybe some committee meetings but not have happened, but our Oliver Genoa meetings, all of our EC meeting, have happened since the covent pandemic began and we have worked very hard with our community partners to make sure that we are there and that we know what is going on in our community. One thing that did come up in that meeting people talked about Proton quote: rioting quote unquote, looting do not really use those words. You know it's just under the guise of protesting and then sometimes protesting takes it to another level, because using certain words bring about certain pictures and folks, mind that are not something that we want to stay away from in the movement and they're, not indicative of a lot of the players in the movement. So we did not have incidents like that up in Harlem, because a lot of our CBO's came forward. The bid one choice, Tryst Rebid, Street, corner resources, warm all of those organizations working together and if you have not had a chance to see the artwork on the 125Th Street buildings that the bid has put up the black chalk, words- May- for positive messages. You should look at that. I believe that will be up for a while and it will be in different places. I think they're, putting it in a couple of the stores when they reopen fully or there might be a one store. This actually has the black chalkboards up now, but those are not going away permanently. Those are going to be repurposed in other places. So that's something for you all to look forward to and to be very proud of Harlem right now. I just had to put that out. There also CB7 it's having or wants to get all the words together to have a conversation about implicit bias and I. Think that's really important. I've done implicit bias sessions before I've, conducted them and I've participated. The results are always very surprising. If you have not had a chance to do the free, implicit bias test on the Harvard website, you should take advantage of it. There's a couple of them. You'll be surprised, that's your own implicit bias, but we're looking at maybe coordinating with them, and you a session for community boards to talk about our own implicit biases, because we need to deal with the things that are going on and then we will be able to going on inside of us with us, and then we will be able to influence the community. So those are the things I wanted to bring up I'm very proud of you all great I'm, going to move on to attendance and quorum Kevin door, so we'll jump right in I'll start with the running down the list of the names of officers and committee chairs and afterwards, if there are any vice chairs present in place of chairs, you can give me your names afterwards. So we'll start the roll call please verbally state present. If you are here, Cicely Harris, Marquis, Harrison, present, Charles Powell, president Josh McLennan, president Deborah Yates I know Deborah eats is planning on joining us later, but Deborah, one more call for your name, Deborah gates, all right, we'll mark her as excuse for the time being. Kevin Bitterman present Stephanie Palmer present Janean Brown Buckman Danine on the call Shattuck any word. I do not see her on the call know here will mark absent Lisa downing yeah Hazel dukes Dr. Dukes present Deborah Gilyard present George, her Oh George from arts and culture, Karen ory present Charles Johnson he's excused okay and Chanel Washington present great. Is there any other committee that is sending their vice- chair? That's represented right now, anymore from arts and culture. Okay, all right! So one two, three four: five, six: seven! We have eleven present and we appear to have one. Thank you, Kevin we're going to go ahead and move to reports. If you look at your agenda, we are missing health. So we'll stick health in there Chanel. Are you ready or did Dr. Duke said you need to go first or for your committee report? Did you okay Chanel? Are you ready for a Kodak? I can go okay. So at our meeting we had small businesses, Eric Parker he presented on SBS, providing relief for businesses and PPP also opened data came and they reported Stacey Garner. She will be holding a treat a training at our next meeting in July 9th for open data. So any board members that's interested in finding out about open data. You can attend that training. Also she did. Let us know that she would be willing to work with us on collecting data specifically for this district. So that'll be good, but hopefully once we go through that training, we could get a grip on what type of data that does not exist, that we need to address some of the issues that we're facing with Colvett. Also the neighborhood Advisory board for rain Griffith. She presented Dy CD. They are currently about to open up their grant process, I believe and also she reported on how folks can apply to the board itself. Ninis accent from the Scotch from stringers Office, also presented on MW BMW and B scuse me workshops and where folks can register assembly LEM scuse me Lamar from Assemblywoman Ana's Dickens office, also reported. He gave an update on the repeal of fifty a also Bill's, a three to four to two access review of real property, passed waiting for Senate right now, and also eight to a five to disclose construction projects past. So that's waiting for the governor also hold on. Let me scroll down Isaiah from the mayor's office, also presented on phase one and two of reopening wholesale construction and curbside retail, and he also mentioned that social distancing rules are still in effect. We also had a presentation from Verizon Tonya Davis. She reported that Verizon has maintained, reliability levels arrived, the resident will not be cutting any services through June 31st they're, providing touchless retail in stores. They are offering free, New York time subscriptions to all high school students. At the moment, Verizon invested seven and a half billion dollars and local initiatives to support the corporation twelve business businesses and our district have received one hundred and ten thousand and grants from Verizon, and you can go to Verizon dot- com to get some information on those grants. Also commute I had a community concerns and comment section where we went over the SLA process and the newsletter. Also the chair mentioned the FT, the Frederick Douglass Boulevard association proposal or open streets from one twelve to one twenty second Barbara askins also provided grant opportunities. You all can view the video online if you like. Also you can view our newsletter as summary, and also our minutes and video attached. There is a up an upcoming discussion on Sunday at 8 p.m. on 5 g and what is 5 g and how it's going to affect our community. I will be producing a resolution out of that and presenting it at the next Economic Development Committee meeting and that's pretty much it. We also had some liquor license come in from hold on Ponte Bistro and from Ponte, Bistro and I believe neighborhood brulee. So there was a committee vote that was done by email and you guys have the results. Oh and you guys also have all the documents in the questionnaires that was submitted by the applicants and that's pretty much it patient now sense and just a point of clarification for everyone. Thank You Chanel for coming up with a process to still get these liquor licenses done for these businesses. A lot of the liquor like a lot of the businesses, have fallen back or just falling behind and getting their paperwork done due to Coba a lot of different things going on. So some of these businesses came forward after the echo Dev Meeting so and their license expires at the end of June. So, in order for us to give an opinion and not just let it pass us by and they get it anyway, shanell devised a way for her committee to vote, even though it's not an official vote, but it is a chance for them to give an opinion before they come to EC. So we can know what they think and then the EC will have to vote on those liquor licenses and in these cases I believe in Potty Bistros case it will be a waiver and it just gives them additional time to submit their official liquor, license application and then I do not know neighborhood rule a. Is that a new one, or is that because I know it's a coffee shop yeah, so neighborhood Brule is a new one. That's not a renewal. I believe I specified that in the email and attach all those documents. So if it's a new liquor license, we are asking them to fill out the questionnaire. So we have a little bit more information on them to present easy committee meeting and if it's a renewal and the committee votes to have them before us, then they come before us and that's pretty much how that goes. But we're trying to see new liquor license come before us so where we have already reached out to our neighborhood boule for them to present to us so I'm, not sure if they've reached back out or how that's going to work. But we have reached out, we have voted on it and the committee has voted to have them present. Neighborhood brulee they're, not in danger. They have never had one so they're, not in danger of losing their life exactly okay, so Ponte should be a voting item for tonight. Kevin again sorry I was not able to attend the meeting. Shanell I'm wondering if you give a very high- level overview of what was discussed along Frederick, Douglass Boulevard, and recognizing that it's a pretty substantial economic development corridor within Harlem, but also looking at the number of potential restaurants that are automatically going to be granted. You know the option to serve alcohol to have people in their sidewalks. Has there been any discussion about how that decision- making through the open streets program might unfold? Yes, we are in discussion I'm in discussion with the chair and Patrick Douglas Boulevard Association. So there are things the work I'm not sure, that's up to the chair to disclose, but we are having those discussions. Yeah I could talk about it. So it's been. It's been a long conversation. So when we're talking about open streets just in general, the phase two businesses can put their chairs out and do whatever, so they can have their own sidewalk cafes without a street closure, so that sidewalk cafe can go up to the curb and into the parking lane. Okay, as long as they are able to provide proper barriers. This is a self- certification process that the business just has to submit to do tea and then there's certain they are self certifying that they are able to do this and do this properly. So a lot of the community boards, including CB 10, we have been like what is certification mean? How are we inspecting this? How are we making sure that it there is proper social distancing? How are we making sure that there are mass? How are we making sure that things are clean? How are making sure that there are just no issues with their spacing so, but right now they are free to do as they please, and there is. There is some oversight, but we're just all worried about. You know how I'm intense and how effective that oversight is. So that's the first thing so M TBA is requesting to shut down 112 to 120. Second, we are still in conversation to see if that's a feasible thing or even a needed thing, especially since these businesses are able to put out their own sidewalk cafes without going through an efficient process without submitting a plan, or anything like that. So they're able to do that. The big thing about F DBA and what we have been communicating to them is that we would like to have, of course, an opinion in all of this, but we're also worried about the security of this. Who is going to be monitoring this and monitoring? We do not want to say policing that, as in making sure that it's safe for everyone to be out there, we know with sidewalk cafes, there have been incidents where people's perceive and stolen, and things like that. We do not know if there's going to be any monitoring that way, we're also worried about transportation. So the big thing for us is: we do not want the m10 bus to stop so if they, when we talk to G ot one of the key things about open streets, it's that it can't be on a major thoroughfare where there is an operating bus. So in our minds with open streets, Frederick Douglass Boulevard is not an option, however, because they are, you know making and because they are supporting their businesses, and we do want to support the small businesses there. They are going to make a request to do so and to shut it down. Do t right now has told us that right now is not an option due to the bus lanes there, but that's always up for discussion right now. They're saying it's not going to happen. That's when do T is telling us the last question on that. Just do you know to what extent neighborhood associations block associations are involved from those conversations? Is the association reaching out to residents? We did ask them to do that. They did tell us that F DBA is not all about businesses that there are residents and part of our CBA, so they let us know that, but they are looking into the block associations doing that. But one thing that we are wary of, and one thing that you all know there are currently open streets that are managed by CBO's and by alliances and not by NYPD. There have been issues with those because those agencies, those CBO's, are fully responsible for them, not NYPD, so they're, the ones that have to take the barriers up and all of those things and make sure that you know social distancing is happening everything. So we that's another reason why we're very weary of it, because F PPA they may have a plan. We have not seen it yet so, hopefully, when we're having these conversations, they come with a fully written plan. So we can talk about it and talk about how they're going to be monitoring all of these things, but that's one of them, one of them. Another reason why we are you know a little apprehensive about it. Thank you. I have a couple questions so I think that it's great, that we're being proactive and doing a streamlined process for businesses to be able to get assistance and really be able to move forward and flourish, especially in the case of Covid-19 I. Do not want this committee to lose sight, though, and aligning ourselves with what's been happening as far as the movement, this process was developed because of the statistics from the district need statement, which stated that we had a 20% poverty rate and a 13 percent unemployment rate. Now that we have Covid-19, those issues are even greater so making sure that businesses have access to not only the resources that are available like what Verizon is doing, like all the corporate responsibility that it's happening, but also to make sure that we are tying in. How are we being effective in curbing these numbers, especially now during coab in 19? How do we curb these unemployment numbers, this poverty rate? How can we be more proactive about those aspects of this process, so I'd love to see that come forth into fruition as we are developing these plans? Thank you, okay. Shanell! Do we have you had a voting item? This is a voting item. Ponte Beach, yet and I just wanted to mention that it is without community input. Also that they're able to Kevin bitumens point that it is without community for input that they are able to apply for these things. So we do not have any sort of control. No, it's just thanks for that clarification, but I will say this because we have been making such a big I know eyes about it. All the Community board chairs there was, since they do not cease businesses that are applying for these temporary sidewalk cafes. They do not have to come to the board. We did not know. There was no way for us to know who had applied in who head and so now they are making their applications available to community boards. So that is a win for us. So sorry are these. Would these than be temporary or is it in perpetuity I mean that you know? Is it a two- year renewal process? Is there clarity on that? So we go ahead. Would you say good does not mean yeah cuz. That was a question that we asked so right now it is a temporary solution. So in time it's it looks like it might go into. October I know that the FDA proposal took it in to its 20 weeks, so that took it into November that the streets might be shut down for F DBA. So their proposal is a little bit different, but when we talk to open Treacy ot, it was not so October questions about open streets, okay, but we will keep everybody updated on that I'm Channelle. So you have a vote. It's Ponte Bistro, okay. So what was the even though it was not an official vote? What was the consensus of the committee? Do you know yep, so I believe everybody should have it. Let me just pull it up, so it was sent to everyone. You just try to get those documents so for Ponte Bistro there was a unanimous vote. Yes, and also for hold on, let me just try to bring this up okay and also for whether they would like to present to the committee only for people like for them to come before the committee also I did put in the forum that Ponte Bistro was, and you know, facing chances of losing their license and that we would need to provide a waiver. So I did take a vote on whether committee members were in favor of providing a waiver and that's also a unanimous vote of yes. I also prepared the waiver that everyone should have received for them to receive I, guess that that's what we will be voting on tonight and Shannel just for clarification. This is a full liquor license renewal, correct, yes, and we have 13 votes actually 12 I'm, sorry 12, because the chair voted twice. Okay, so at this time I will entertain a motion. Is it yeah? I will entertain a motion. Do not move okay! Thank you. Is it moved and properly seconded the Ponte Bistro liquor license, which includes granting them a waiver? Is there any discussion hearing, none all in favor aye any opposed hearing none the motion passes. Thank you church Janelle, for preparing the waiver, so we need to get that out like tomorrow, Shoetique, because I think it needs to be there by the 30th, Oh June right so as possible. Thank you. Okay. We're going to move on to Parks and Rec there ty good evening. Everyone I just wanted to a presentation from the mayor's office on the on the waterfront Brasilia. What if they're doing Waterfront Resiliency study so they'll be working with us on that? There was also we've been identified as an extreme heat zone, yeah zone and they'll there will be a distribution of 74,000 air conditioners. I'm going into the night show buildings, but also residents and other buildings in our area can also apply for those air conditioners, and you can contact three one about that and then also we had our meeting on June 10 and we met with the exonerated five group around the Central Park exhibit for the exonerated five and out of that meeting we came up with we established a subcommittee. The subcommittee to this point exists of the exonerated five and their families, the innocence project, which Reverend see Vernon Mason of the New York, theological, Society, Reverend, Calvin old buds from the Abyssinian Baptist Church, the justice for the wrongfully incarcerated, which is an organization represented and Keith. Wright. To this point, as a member of the subcommittee we met, we had our first subcommittee meeting on June, the 18th and out of that, we had a discussion of a plan for a fan of public panel discussion so that we can get bring together as many broad views on the issue of the Central Park, exonerated, five and exit end and the that whole experience and the around social justice. So out of that some discussion, we are looking at a panel to take place a public panel to take place by a videoconference on either the seventh for the 9th of July, and there will be three panel discussions. But the first one is to determine the content of that of what the panel of what the exhibit will be and the panelists we have in mind or, of course, The Exonerated 5, an artist at Imola, a little foal and I'm. Sorry I may not be pronouncing his name correctly. Simply a Copeland of the Seneca village project, Loic wacquant, who is a sociologist and social and social anthropologist who called next, is also interested in coming on and we're. Looking at mark Lamont Hill, who was the author, nobody and a forum and a journalist we're also looking at Vincent Sutherland he's a law professor at NYU and Maya Wiley, who was at MSNBC who's a legal analyst. So those would be the panelists that we're looking to get for the first discussion and then the next. The next discuss panels would be a week apart. So that's what we're looking at right now, also during July and I'm. Sorry June 10th through the 13th I, attended a video conference with the Congress for New Urbanism and I met a professor there who is interested in working with our community around recovery from the pandemic. So when we just okay, so the professor's sent me a copy of what's called the streets for pandemic response and recovery, it's produced by the National Association of City transportation officials, and this is chaired by Jeanette Sadiq Khan, who served as New York City's transportation, commissioner from 2007 to 2013 under Mayor Bloomberg. The professor is a director and associate professor of a master of Brazilian urban design at Clemson, University and she's offered to talk with us specifically about ideas that we could apply to Central Harlem. With respect to returning from the pandemic. Dr. Galvin has a group of graduate students who would produce the assessments and recommendations in partnership with the community as a remote academic project and the student, the graduate student team would be available by the end of August, so I'm just offering bringing this information back to the board. If this is something the board would like to do, there's no fees or anything involved. It's a it's an academic project. For these graduate students. We would provide information from our community. They engage with the community. So this conference that I said what was the university again sorry Clemson Uniqlo same University. Thank you. So the this conference that I attended it's an annual conference and they're people coming from all over the country and abroad in Europe and different places in South America, who are bringing best practices to share. So this is something that and I thought I sent you the brochure system, yeah I, know I may not have attached it, but I will send it on to you, so they even have a section in the brochure which deals with all outdoor dining and best practices. So if the board would like professor Galvin to come in and speak, she would be glad to do that and explain a little bit more about the program. And another thing that was said is that, as we go forward with coming back from this trying to become a famous pandemic, there will be things that we'll find that will work and things that may not work. So we have to be very resilient and can flexible about planning things and that's my report. Thank you, Karen. Yes, you did share with me. The email, not the brochure so okay and I, believe the board we could look into it is it? Is there costs it's free? No, there's no fee. It's a good there. Graduate students and they'll be doing it as an academic project. Okay, I think we would probably maybe need to look at the brochure and then maybe talk to Dr. Galvin, okay right, so it's not here so I just wanted. Where is it so? Yes, so maybe we should talk to her about what and then again, where is the information going? I know they're doing it, for them it'll be done for us, but what are they going to do with the information? So I think that's something that we need to talk yeah. We, those are very important questions, yeah, okay, but if it's free and it's good and with good intentions, then I think maybe we could look at it. So, oh you're welcome my pleasure ever comment. My Karen said there have been a lot of a conditions distributed to seniors, but a lot of air conditions we found out are not working. Hmm, a lot of the seniors are calling a senior citizen centers to get it fixed. So we mentioned that at our last senior task force meeting in Isaiah from the mayor's office and from the Department of Aging was there so they got ta find a number so that the seniors could call to get it repair. Some, the water is leaking back into the room some after the person left who installed it and they cut it off or put it on the next day. It's just at work, so we have to find out what happened all right. We can look into that too. Debra. Okay, all right question: Janelle no I just wanted to say to Karen that I spoke to miss dukes and Jeff. He is preparing a letter of support for the exonerated five project so and that he said that he would able to be on a committee and did you ever get in touch with Daniel Patterson about the opportunity he wanted to talk offline about? Yes, I did speak with him. He spoke with Prince hunt, so you know, I was not privy to that conversation. I also wanted to say that, in terms of letters of support, we just got one from the borough president. We have a commitment from the my peak Commission on community partnerships. Right I also spoke to Lamar today, when he called me he's interested. Also I, know thickens office I'm in that committee, so he said he was going to reach out to you mean Lomond yeah. Thank you. That's the next meeting! Next, yes! Well, the next meeting would be that panel discussion, which was is going to be July, 7th or the night and I will, let you know: okay, I'm, just I'm going to send the synopsis to the office. I was just working on it, okay and when you get the panelists or any potentials a lot of snow too, so we can kind of okay, Dr. Duke said in the Help Committee. Thank you very much. Madam chair I'd like to express my thanks to Karen Dixon and Dr. Smith Deborah, Donna, Gail and mushy book. While I was out on leave the problem of the health or facilities here at 137Th, Street was brought to me by community members and constituents. Community 14 and I spoke to our manager, district manager and, of course, we got involved in it and finding we've had several meetings. They were also. The district manager was diligent in defining the new, not the owners, but the new members who the administrator at the facility. They came on a call with us, and they were very not forthcoming because after they left the meeting, Dr. Smith really grilled them and they did not answer anything. The administrator had just been there, I guess a month when we met with them later. The paper did verify and they've been find that it was not full bodies there. It was 20 persons that had died and their lawyer, who was on the phone that day saying he could not give us that information that they only reported to the State Department from there we have come up with a. We asked told him about the advisory board when the same owner. The lower group butchers became the owner of the facilities, and so we've come up with an advisory committee, aboah not all being from community bullet in, but we are proposing that we family members, as you know, from the meeting we had dealt us- have been working there for many years and I was thinking. That was hope. It's in the material that you had. That was provided from the members that you would approve us going forward with that. If there's any questions, I will answer them, but it's very thoughtful and is taken in what we would like to see for our community to be involved and to report back and make sure that this never happened again. Many of the people they are do not have family members that is able or have a desire to really look in on. It was brought to me by a member from convent about this church. They have several members there and they are go there on Sundays, I think twice a month and so the report of what was happening there came from them from their visits. If you want I guess, I could share the letter on the screen so for people they do not have it yeah I if they have, they do not want either sent it out, but for those who will have it on the screen now, just so everyone can view it. Oh thank you all right give me one. Second, I did receive it. Okay, AB that spoke with you looking at. Are there protocols that we know of that these nursing home tablet? Do they have a regular schedule or do we know this informational? Well? Not yet, but they are, they do I have 32bj workers there. They all the workers, they are unionized, but we do not know that those are some of the questions. As I said the young man that our city Mr. Mitchell, that which was awesome the way he did this, but the guy has just been there for a month so and with you, he had the attorney on the phone who was very not forthcoming and did more to much so. We believe where we have, as chairman said, that when we go in, we want to sit down and go through a litany of things there and then those are the questions that we can put forth and horsemeat know. We have not determined any of that yeah we want it, you just see it and then we're going to send it to them and wait for their response, but we want to move it fast because when we met with them we told them. We would do this in two weeks, but of course, because of all other things that it's taking place, so we could not move forward until you, the executive committee had a chance to review it. Well, thank you. Are there any questions, any additional questions? Okay, so are you proposing I do not even know if we'd have to really vote on this, but or do you want us to take a vote on this Tantra Duke's? Yes, I would so via stay in unity. Yes, I agree. So if there are no other questions, we can move into a vote. Are you done with your report? Dr. Dietz? Yes, if there is any questions you know from any of the people or even after we do this tonight, if people think of some other things when we go to meet with them, you know we can add them to the agenda. But this is the framework Josh. You do not have a committee Josh you have any, then is the Donna he'll leave I can come I. Think the table is a great idea. Palliative care is very important and it's something that's more. It's actually needed more in our community. We have too many seniors that die and ICU is unnecessarily in pain at home unnecessarily. So I think it's important, but it's also important that we make sure that these facilities do not take advantage of seniors, whether financially or physically, and mentally, in and providing the proper services I I'm all bonded. Okay, are there any other comments? Thank You, Josh, Donna-, Yes, Michelle, child I also think the cab is also really important so that we sustain momentum of being engaged with the nursing homes, so the unfortunate traumatic loss of life due to cold at 19. This is the response to that and to address moving forward to make sure that measures are in place that the community is engaged so that these nursing homes really are doing a better service to those who are in their care. So that's a really important reason why Dr. Dukes and the Health Committee had moved forward with this. Thank you, Thank You Michelle Donna. Do you want to be heard or everything saying? Okay go ahead and move on at this time. If there are no other questions, I will entertain a motion to support, make a motion that we support the nursing, effective. Okay, it's been moved and properly seconded that we support or implement the nursing home cab. Are there any questions discussion hearing on how do we submit this to the facilities, Madam, Chair I? Think the letter should come from you there's all available? Yes, Ma'am Mails should come from the chair, so you can get that to our manager, Mr. Mitchell and we can get it out to them. Yes, ma'am, okay, thank you all right. Are there any other questions or concerns? Okay, hearing none all in favor any opposed hearing on the motion passes. Thank you all. Okay, I do not believe there are any other committee reports at this time. Charles did you have anything more housing or Lisa from plan use we're having our next land- use. Meeting the third Thursday in July believe it's 17th and our guest speaker is going to be Malcolm hunter from Harlem congregations for Community Improvement, and our goal is to continue the dialogue with between developers and housing specialists to see how they're dealing with different issues as it pertains to open 19 and how we can support them policy perspective with regards to advancing their agenda. There have been no developers, who've come before us. You know during this time, but I'm assuming that by fall, things are going to pick up as this is the new way of presenting proposals and also the advanced land- use. Training sponsored by the borough president's office is next Monday from 6 to 8 and I encourage all those members to participate, because that's the information, if you remember from Lennox terrorists, we really need to understand zoning and all the implications around that. That's the information we know to need to know to make important decisions when developers come before us. Thank you, Deborah did you want to say something? Forgive me yarn, I'm Channelle, you have your hand up. Yes, I have a question for Lisa yeah. You mentioned housing specialist. You mean housing, specialist people who are professional and the industry, our housing specialists, the occupation, because I think it would be good to have housing specialists, the occupation there to give their experiences of trying to house folks and shelter with developer there or and also management. That's fine for this. Another occupant I mean Senator again for professional in the person who lives in the shelter right there, the occupation that thousand specialists, if you do thousand specialists, that's an occupation, usually those folks help move folks out of shelter and into units. So that's why I was trying to clarify. Did you meet a housing specialist, the occupation or housing specialists in terms of people who specialize in housing, initiatives or housing area, because that's an occupation, so we could do one? We could. We can concern and broaden broadening the conversation, so people can get a broad understanding of how it goes from the developer, building the building the building to placing the people sourcing, the people, so we can open it up and make a broader conversation if you have any idea how this is armed. Now that you know construction is resuming arm, is there any news from Monica terror? So there are they just? Are they not going to move forward with any sort of construction or renovation or thanks Lisa, keep a surprise. Charles did you have anything to say before we close out that relating to housing? Are you talking to Charles Johnson Charles? You passed out, okay, so no I just wanted to thank Donna Gill for the great work that she did in terms of that amazing housing forum. You know that occurred and I will say a you mentioned it. Sicily too, should take. We've been waiting for the powerpoints from Manhattan legal services and a couple of the others yeah to receive that saw, I'd appreciate it. If we could also in the collaborative you know, discussion the other evening, I think I get confused, I think it was this past Monday or Tuesday, but between community Boys, nine, ten and eleven and twelve. It was also great information relating to housing. He you know we are joining with land use. As you know, Lisa indicated in our next meeting. As we were moving over to the summer, we really do not have any action items, but I have to say that what I'm hearing from virtually everyone is, we still do not have any real, comprehensive plan from either New York State or New York City. As to what's going to be offered, you know, people with respect to you know when this moratorium ends. I know that many lawyers and legal service organizations are preparing themselves for that pandemic, which is going to be the pandemic of people being brought before the housing court. The non- payment of grant I just do not think that right now, there's a comprehensive call, and so we've been working with the mayor's office and representatives from the governor to try to get some proactivity and even from the federal government shall book her I'm hoping is listening. You know to say, what's coming out of either the cares or heroes Act, but right now there really is no firm protection other than this moratorium, and that's just not enough I think for our residents, who are facing possible displacement so again, kudos to Donna and Gregory baguette, and if this moral worth to be kind, Thank, You Charles we're going to go ahead and move on to old business there. Any new business, so sweet old business is more of an announcement. But I do not think you mentioned this in your report. It might be useful just to talk about the orientation that you learn with new board members. Oh yes, thank you. Kevin first like to thank Stephanie Palmer, so much for putting that together, our keys, Charles Kevin and thank you all for dialing antique. We were able to speak to some of the new board members that could make it they are currently making their committee choices. So if you submit a committee choices, new board members and you're all here, I did we see them, I'm, sorry, I'm, compiling them and then I will send back something to you and we'll discuss those choices, but I hope that they are able the new board members are able to take part in all the meetings that are going on and get a real sense of the board and figure out where they want to go. But in that conversation we were able to really talk to them, find out little bits and pieces about them. So I'm so excited that they're here they are extremely qualified folks in their areas of expertise, so I'm excited to see them put them to work on the board. So did anyone else who attended that have anything to say Cicely just quickly of that they are an awesome group of New board members and for those of us who've been serving please take a minute to reach out to them and welcome them and find out stuff about them. It's a great group, Thanks I, think Jack. You were on there too sorry to leave you out. Josh thanks red, okay, any new business, okay, Heights, Michelle, hi, Michelle, okay, I just would like to share this with the board. It's something external, but it's just that there is a congressional app challenge. The congressman is hosting an app challenge with this, which is the target stem you in our district that have interests in stem and interest in coding, and the deadline is October. 19Th and I will share that information with you shortly: Thank You, Michelle, I'm sure that will be really interesting. Thank you for sharing that any other announcements. Okay, this time, I, will entertain a motion to Adjourn, so moved, okay mood and there's a second somewhere yeah. Okay, is it moving properly? Second, all in favor, aye, post hearing them? We are adjourned at 8:09.",
            "summary": "I, know a couple of folks said they were going to be late, but I wanted to give enough people to get on here.\nLet's try taking All for agreeing to continue to meet over the summer Know how important it is for us to still come together and be still be a sounding board for the community.\nIf we could maybe get an attendance or a general amount of folks that might be out there, we will let them know, because we do wanted them to be able to social distance.\nWe got to ask questions that were actually posed by our Community board and the general public.\nTwo things we signed on was several other community boards to support the extension of spectrum Wi- Fi, so they were giving free, That was supposed to end June 30th.\nTraining coming up, June, 30th I know we always talk about conflict of interest, so it is a free training by the borough president's office.\nDefinitely I do not know if he sent it to all the community board members, but we will definitely give that to you first thing in the morning, so you can go ahead and register for that conflict of interest.\nWe were able to finalize our budget on some of the things that we purchased were an HD livestream camera that we received to support our meetings in the future and external hard drive so that the staff can work our remotely and have all their information stored on there.\nI know that the budget deadline is July 1st and the city is still trying to figure out arm What, where they're, going to cut different services so that they can make up the budget deficit, because the budget deficit that they project it for 2021 was originally seven point.\nYou did, you know, solicit that input arm, but we did not receive it from everybody, but that's okay, because you know understanding that there's not a lot go to the events, etc that we would have in the committee have in the community.\nHey we're going to go ahead to the district manager, report, Thank You Shetty good evening I'm, everyone up thanks for your report, Cicely and Josh Alma I just want to start talking about on the test and trace core problem.\nThe Harlem bike network expansion, I just received plans today that they're going to have protected bike lanes all along the east side of Fifth Avenue from 110 Street to a hundred and Twentieth Street Conversation has been going on before I even got on the community board, but dating back to 2017 has been ongoing.\nThey've also I've met with community Board 11, or one of my questions that I asked them was parking going to be taken.\nThey said that it would be, but on the east side of the street, which is CB 11, but the way that the way that is structured, the parking would be replaced because they're going to use one of the middle driving lanes as a parking so to be parking in the middle I do not know.\nWe have not got word yet from the borough president's office when any of the community boards are allowed to go.\nYou know there was some information, then you receive with respect to persons who are bringing fireworks into the community.\nI. Think, in a meeting like this disadvantage, you have to be very careful because that's what was said also that in when we did have this search people would report it.\nI. Think, that before you report it I would say to you that you should say that they should If. They know these are the guys they should report it, because this is a serious thing in the community.\nThere's someone knowing that people are coming in our community.\nIt's just like with the with the drug thing, when people took over the community took over and start painting doors that they knew I'm, saying I would refer them Well.\nThe deuces indicated that there's no intelligence I saw Joshua's point about the fact that it's legal in New Jersey and they believe that it's coming from New Jersey I, saw comments about Pennsylvania, but I think the message is Dr. Koontz is indicating from the community board is I know it's a difficult message, but the police is saying they can't get in the intelligence.\nI know what it's all about in terms of squealing and all the rest, but at the end of the day, I think we need to be able to ask the police to say here's the intelligence, here's the information, stop these things from coming into Brock, mewn, Josh, shadow, question, I, agree with you all by also think the police need to do their job and really investigate.\nI would think that you need to talk to our people of Safety Committee on this, and that should not be a wide discussion.\nI just wanted to bring out one quick thing that I forgot to mention that on Thursdays, usually the third Thursday's I attend the borough, We can proudly say that we have had every meeting, maybe some committee meetings but not have happened, but our Oliver Genoa meetings.\nAll of our EC meeting, have happened since the covent pandemic began and we have worked very hard with our community partners to make sure that we are there and that we know what is going on in our community.\nThere was a committee vote that was done by email, Thank, You Chanel for coming up with a process to still get these liquor licenses done for these businesses.\nWe have a little bit more information on them to present easy committee meeting If it's a renewal and the committee votes to have them before us, then they come before us And But we're trying to see new liquor license come before us so where we have already reached out to our neighborhood boule for them to present to us, So, I'm, not sure if they've reached back out or how that's going to work.\nWe are still in conversation to see if that's a feasible thing or even a needed thing, especially since these businesses are able to put out their own sidewalk cafes without going through an efficient process without submitting a plan, or anything like that.\nLet me just try to bring this up okay and also for whether they would like to present to the committee only for people like for them to come before.\nThe committee also I did put in the forum that Ponte Bistro was, and you know, facing chances of losing their license and that we would need to provide a waiver.\nAlso during July Sorry June 10th through the 13th I, attended a video conference with the Congress for New Urbanism and I met a professor there who is interested in working with our community around recovery from the pandemic.\nHe is preparing a letter of support for the exonerated five project so and that he said that he would able to be on a committee and did you ever get in touch with Daniel Patterson about the opportunity he wanted to talk?\nLower group butchers became the owner of the facilities, and so we've come up with an advisory, committee, aboah not all being from community bullet in, but we are proposing that we family members, as you know, from the meeting we had dealt us, have been working there for many years.\nIf there's any questions, I will answer them, but it's very thoughtful and is taken in what we would like to see for our community to be involved and to report back and make sure that this never happened.\nIf people think of some other things, when we go to meet with them, you know we can add them to the agenda.\nYou know during this time, but I'm, assuming that by fall, things are going to pick up as this is the new way of presenting proposals and also the advanced land- use.\nI know that many lawyers and legal service organizations are preparing themselves for that pandemic, which is going to be the pandemic of people being brought before the housing.\nWe were able to speak to some of the new board members that could make it they are currently making their committee choices.\nIf you submit a committee, choices, new board members and you're all here, I did we see them, I'm, sorry, In that conversation, we were able to really talk to them, find out little bits and pieces about them."
        }
    }
}