{
    "YoutubeMetadata": {
        "author": "MCB3",
        "channelId": "https://www.youtube.com/channel/UC2-H8TgM1ODhDxjRto0L8cg",
        "title": "CB 3 Manhattan - Executive Committee - August 20 2020",
        "publishDate": "2020-08-26",
        "shortDescription": ""
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "MCB3",
        "normalizedName": "Manhattan Community Board 3",
        "twitterName": "Community Board 3",
        "youtubeChannelName": "Manhattan Community Board 3 NYC",
        "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
        "twitterHandle": "@CB3Man",
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "All right, thank you michael good evening, everyone and welcome to exec good to see all of your faces on this day. It's a nice day outside. I hope everyone got a chance to enjoy a little bit of outdoor time. I've been in my hot kitchen all day but anyway, so let's go ahead and get started with our meeting michael. Can you pull up the agenda? Okay? Can we start with the roll call and the the approval of the minutes from last month? Michelle sure yep alicia? Yes, michael moreno, yes, lisa kaplan, not just not on yet. Oh, I think anisha is an italian. Are you here, yeah? Okay, all right, president? Yes, okay, eric diaz! Yes, sorry about that! They're! Fine, michelle cooper smith, yes, herman, hewitt herman is not on okay anisha siphon, yes maylie! Yes, jackie wong, yes, linda jones, yes alex militano, yes, trevor, holland! Yes, thank you! Okay, good! Thank you! Everybody so, and the chairs report is just very small announcement, but very big announcement, because we have our nominating committee, we've done it ahead of the game. Thank you, alinda for stepping up and being our chair again for the 2020 nominating committee for exec, and we have four other board members that have joined linda ellen, paul, robin and sandra, have joined linda on this on the 2020 nominating committee. So thank you so very much linda for stepping up and doing this very important job and approving these four great individuals- and I know you guys- will do a really great job on the nominating committee. Also just really briefly just want to welcome michael back for those that got the email michael left. Now he's back. So thank you, michael for coming back for, however long you decide to stay. So that's it for my report. I don't have much for my report either, but I just wanted to go over some zoom stuff, not because the office has taken over a lot of the zoom stuff that I used to do during the day, since I don't have the bandwidth to do it anymore, but just a reminder that if you're going to join if you're going to start the meeting early to like have a conversation with the chair or with the board or the board members or whatever before you actually start, the business try to pause the recording. Otherwise we have to go into the youtube and try to edit out, like 10 minutes of non-business, to get the meeting to start at the business part of it and remember to use pause and not stop, because if you stop the recording it's going to create multiple files, you can pause. The recording it just makes one file. The other zoom related thing is right. Now all of the committees are pretty much covered and self-sufficient, with the exception of arts and culture. So I'd run it once linda's run it once I'm going to ask clint since he's our third sort of most prolific zoom person, if he would run the next one and then maybe between me, linda and clint, we can just take turns running it every month until we start meeting in person again, that's okay with you linda, it is okay and I don't think you should take a turn. Just let clint and me alternate, you have enough responsibilities. Okay, oh that's! Sweet I'll! Ask, though trevor you got your hand up. What's up quite real, quick question. I probably should know this, but where do we find the youtube recordings I can, while the meeting's going on, I will open up the youtube channel and put the link in the chat box or I'll just email it to you all tomorrow. But if you just if you just search community board three under youtube, you should find it yeah, I'm finding the channel 13 one cly Manhattan community board three yeah. The link is on the website, but it's like on the right hand, side kind of down. You know it's relatively easy to find. Everything's on our website on the home page, if you go on the right hand, column in the bottom, it'll say I think, meeting videos or something videos and when you click on it, it'll have one for full board, one for committees and one for other, which is trainings and those things. Oh sorry, jackie, you've got your hand up yeah. I just want to say I think herman is on the attendees list. So if you want to move him to beyond the panelist doing it now. Thank you, jackie mae, oh yeah, so I don't know if you want me to mention this now, but since you mentioned nominating committee alicia and elections, you know you know. I borrow board. I mentioned that we were having we're preparing for the our first virtual election. Yeah so and many other boards are in the same position except for cb1, who already did it, but they said that, what's his name noel, no, is that his name beta new york city? He said he was working on some something for cb6 in Manhattan and queen the two cb6s in Manhattan and Queens on some sort of virtual voting thing. Okay, that could be used so he's going to pass it along, and then he has some like best practices that actually all the boards need it, but he could pass that along too. Thank you mate. I did see that today in boroughboard they commented on community board. One had already had their elections in June and I think that it was a reference to speaking to lucian to find out. You know how that went, and you know what we could do. Okay, thank you did my report. Thank you, susan okay, so so we are going. Thank you thank you may and thank you susan, so we'll go on to second vice chair's report. I guess I maybe I should mention very briefly that as follow-up to my responsibilities to monitor the attendance, we reviewed everyone who had received the warning letter several months ago and everybody's attendance improved and met the new criteria. So nobody has to go to the second round of possible elimination. That is awesome. Thank you linda. I mean lisa. Thank you so much sorry, thank you, lisa. That is awesome. I'm so glad to hear that I know that we have a couple of members that have been kind of missing in action. I'm not really sure. What's going on so we'll just wait until the next quarter to find out- and I will try to reach out to those members that I've noticed that I haven't seen them, and I know that one of the members are is sitting on paul's committee, so I think paul and I will reach out to that particular member and find out what's going on, so thank you so much lisa. I appreciate that anything from the treasure to report herman. Do you hear me? Yes, we hear you. Okay. Now we hear you you're breaking up. He said no, you have nothing to report. Okay, thank you. Thank you. Herman district managers report sure I'll start with the election, since you guys brought it up so just sort of an fyi for all kinds of operational things. The 12 district managers in Manhattan always like email each other about how do you do this? Have you ever done this? So I've already emailed everybody regarding virtual elections, I elite lucian has sent me. I think it was a vote sheet that they used for the election, that, to be honest, sounded really complicated. Another board sent me a virtual vote sheet, but it wasn't for elections, but the thing is next so next week we I sent around all the workshops from this community engagement, commission and next week, they're doing elections for community board so linda, are you able to be to attend that? Yes, I've signed up for it super. So so I think you know. The next step, I would say, is to wait and see what we learn, and you know whether they cover virtual I'm hoping that they'll cover virtual but wait and see what we do on that. I would also like, when we figure out what we want to do, because, basically, the only real difference I can see because we vote all the time anyway, is that we were handed a paper sheet to fill out, and so we need to replace that- and you know I don't know if they're making a bigger deal or not, but I do want to run everything by the committee on open government because they're the ones who decide things you know anybody making up like noel or anybody. That's making up guidelines you know has to run everything by them. You know to make sure that they're right, so you know I feel confident if I go straight to the straight to the top to check, but I wouldn't I don't think it's going to be a problem briefly I'll mention the you probably heard about pending layoffs from the city. No one has a clear explanation of this, but we just found out this week. There was a phone call from omb about this program called volunteer layoffs. I was an on the phone call. It was, I think, was monday morning this or tuesday morning. They scheduled it for tuesday morning, like an hour later, so there weren't too many people on the call, but then the person from omb called the rest of us individually. So we have nothing in writing. We all think we heard something slightly different, so what I think I heard was that you can offer your staff, including me voluntary layoffs, but there's no incentive, there's no like buybacks or early retirement. If you know you, if you're gonna lose your pension, if you quit, you would still lose your pension or you know it would be impacted. So the only advantage I can see. That would be that if you want to leave your job anyway, this would allow you to quit and still collect unemployment. So on our staff, three people said no, and one person's going to have a union represent that person. So I don't quite know what that means, but we have to give our aunts alicia and I have to jointly email, omb next tuesday they're, calling that the first phase, so I assume they're, wondering, are looking to see how many people will accept the voluntary layoff. But I can't imagine that very many people would accept that, because there's really no point to it. We have two areas in community board: three that have serious complaint, systemic serious complaint issues, but I will say the conditions in community board three, like the conditions in much of Manhattan and conditions in much of new york city have deteriorated draft deteriorated drastically in many ways. I've talked previously about many more homeless. Interesting thing is dhs has not released their hope count from last January, which is supposed to be made public every year, and you know I've asked for it now, I'm asking elected officials to help me get it, but it's not that it's not the issue. Often people like to lump call everything homeless, but the real issues people are complaining about are a tremendous amount of crime on the streets. There's lots of people on the streets, they're, not all sleeping there. You know people do have beds, but they come and they're on the street during the day they're using drugs very openly, they're selling drugs pretty openly there's a lot of crime, petty crime and more major crime. You have even things like car break-ins assaults on people, it's all happening to a serious degree. It's brought up at every police meeting some merchants and residents together, complained to the ninth precinct about the second half and lower second avenue area. They called the meeting in the precinct, which was interesting because they weren't wearing masks and they were going in the elevators with public, but basically they really didn't say much. They sort of tried to blame it all on homeless and said we had the homeless outreach person there and you know they kind of said. So. What are you going to do? It's a serious problem and the city is not planning in any way on how to deal with it. Some of the police are more concerned than others, but they all say, there's really not much. They can do there's nothing. They can do as far as the second avenue area. All the residents also contacted the elected officials, so we're we've had one conference call we're trying to figure out some steps that can be taken, and I want to publicly talk about them because they're being investigated and if they don't work out it'll be a problem, but there it's not very much. I mean the city has to the city has to have a plan, and you know people think that nobody's listening to them. Many people are listening. We all acknowledge- and we agree on what they're saying, but it's kind of out of our hands other than to keep talking about it. So it's kind of frustrating the other really hot spot area. People are besides himself are the broom orchard area that came up in the transportation committee, because d.o.t wanted to have a plaza, and I think the residents around there kind of freaked out, because it would mean more people congregating in the area, so they wasn't approved the bid called a meeting. So these are weekend crafts. The interesting thing is that the problems are not from licensed establishments. There are these lifestyle establishments that sell clothing and their art galleries and they sell sneakers and it's kind of a lifestyle party type thing and they don't risk losing a license but they're impacting I'm getting complaints from the licensed businesses. Some of the restaurants are actually closing early because their crowds are running into their space and they're afraid of losing their license. So we had a preliminary phone call today we're going to try and have multi-agency meeting again to work with the city on how the city can engage with this issue. It's kind of the same story. Again and again, I wrote a letter. I was approached by kasir the lobbyist, that represents project renewal. All the adult shelters in cb3 have been emptied for social distancing, all the city contracted or city shelters and the ones in kenton hall and project renewal have been moved to the upper west side and I'm sure you've all heard about the issues on the upper west side. You're only hearing, there's a lot of people complaining and you're. Only hearing about that, as actually all the elected officials and the community board, are working to resolve issues like find public space for the shelter residents and programming. That kind of thing, so I was asked at first I was asked if the board could support project renault- and I said you know that would take a month because it would have to go on the agenda. But I offered to do what I've done many times in the past is if I'm asked about working with a specific organization or place. You know, I give a reference on good neighbor, bad neighbor thing, so I have written a letter for project renewal as district manager. My experiences over the last 16 years, working with them. They had wanted me to send a board seven, but I thought that was kind of presumptuous because support seven wanted a recommendation. They would ask me so I'm sending it to the president of project renewal so that he can use it as he wants. I'm letting you know just letting everyone know, because this has been in the news and it has been so controversial. If you would like me to read the letter to you, I'm happy to it's kind of long, but that's up to you just let me know what you prefer so just for the notes. What exactly are they asking for support from us? For? Oh, have you been hearing about on the upper west side, people yelling, those are our shelter residents, those that's our third street project renewal in kenton hall project, renault, let's see so what I am. What I am writing about is our experiences working with project. We know, oh so, supporting the organization's work. I see. Okay, it's a letter basically saying that they've been very responsive, very collaborative we've had community meetings with them. I even talked about you know how we've had some of the residents several years ago come and testify at our board meetings to support a k2 resolution about k2. So that's it! That's not it! I'm susan! Can you what was the result of today? I know you attended a press conference about the psa iv. Can you tell us a little more about that? Can I can I finish. We finish the letter issue. First, okay: go ahead, so let I'm asking the exact. Do you want me to read the letter to you? It's kind of long. I just explained what it's about. Would you like me to read the letter to you? I personally say: don't read the letter I say: send us a copy of the letter, so we can all read it on our own. That's me. I don't know what everyone else feels. So I'm not going to speak for everyone. There are two hands up lisa and michelle are your questions about the letter or about something earlier, because they've been up for a while mine was about something earlier, but I agree just sending us the letter would be fine. Okay, I will do that and michelle, I assume, is the one. Oh yeah, sorry I'll lower it, but I also just wanted to ask about the the orchard broom situation. I think I know which establishment you're talking about, but has there been? Have people tried to talk to the establishment themselves about it? Because, yes, I it's the one right across this well, first of all, it's not one. The worst one is right across from cafe cacha, I think it's called yeah. There have been more, the police have been, there have been multiple conversations absolutely, but there are bodegas that are having their own party there's a barbershop. I mean these businesses just decide. Well, everyone will feel great if I do this thing, that creates lots of people. We also have roving bands that put out hats. We have that on st marks too, and someone said what's so bad about that, it's fine in the subway and it's like yeah. It is fine, if you're walking by in the subway or waiting for a train, but if you're living above it for six hours, it's not always so fine, but yes, there's been mo, and that was the first thing that came up on the phone call. Has there been attempts to educate and absolutely and I'll? Just briefly alicia about the press conference? I never went because my 2 30 call turned into a zoom meeting, which was about broom and orchard, so I wasn't able to make it to the press conference with them. Harlena had a press conference today about officer gonzalez the officer who beat up a resident on 9th street and avenue d and who has not been charged with anything susan. Are you ready for questions, or do you have more? I was just going to talk a little bit about the those workshops coming up, but I'm happy to take questions now. All right. Well, lisa is the only one with their hands still out so lisa. Do you want to ask your question? Yes, please, oh, I thought I unmuted myself. Sorry, you can hear me now right, yes, okay, in the context of the comment made about people voluntarily resigning. Okay, thank you for the correction. I just wanted to understand. It was that in apropos of any announcement you've received about a possible budget cut, or that was just out of the blue. This is in addition to the budget cut we already got for this year. I had before the fiscal year started had announced that we had eight thousand dollars cut from our budget right, but that wasn't the end. That has nothing to do with this right. There was no anticipation that there would have to be a staff reduction is what I'm getting at. No the eights we will manage without the eight thousand. For one thing, we got discretionary funds from our council member. We have backup funds, so we are making all I'm trying to get it is. There was no reason for anybody to resign. That's all I want. I understand, no, it wasn't, but because it was being offered to people, I felt that I had to give an option, not so that we can save money, but because they might want the option. Thank you for the clarification, so the only other thing I wanted to mention. I wanted to really recommend those workshops that the community engagement commission is offering. I thought the one on parliamentary procedures was absolutely excellent. I know sandra thought so also I'd be like to know what may and jackie thought about it. I thought it was very clear and concise and instead of talking about a million different parliamentary procedures, it focused on amen, emotions and amendments, but then everything around it like how they're brought up how the you know the context of what the chair is doing, the context of order of rules that govern the community board's use of procedures. So I thought that was really good. I want to like recommend the other ones, just two interesting things. I'll say from that. They said the two essential leadership positions in each committee are the chair and secretary, and they said the chair has three main functions: to maintain order to make sure people speak and turn and to enforce the agenda and then one other interesting thing. We keep talking about motions for minutes. You do not have to have a motion to vote on minutes, you can say: does anyone have any objections to the minutes? And if there are none the chair can deem the minutes approved, which will streamline it even further? And that's it if there's no more questions, but we still have to take attendance, though right we do yeah, we do, but because there's been so many I'm the reason I'm mentioning this is people seem to have a problem on knowing whether they have to you know it's really difficult for people to remember that they don't have to make motions, they don't have to second it, and if you want, we could change the agenda to approval of minutes and roll call, and that might make it easier for people. But you should. Let me know what you want on that yeah. It would be. I think that would make it easier to remember yeah. Would you like me to do that? Absolutely okay, so we'll change where it says: approval minutes, we'll say approval minutes and roll call, and you will know all you need to do is ask if there's objections, if there are no objections, deem the minutes approved and call the roll. Thank you, susan. Okay, now we're going to move into the committee reports. Sla yeah can, I also say I think, there's some confusion about the minutes, because on the vote sheet it actually appears with a section for voting, and maybe, if you just make it a line item with no section for voting it'll be less confusing people. Remember they don't have to fill that part in. We will change that. Okay. With respect to the report, there's not really anything to report. I appreciate that you came alicia. I know I took a little while with the fry guy beginning to actually talk because at the end he provided me with useful information to include the resolution, which was really that he doesn't know anything about the area and or have any experience with what he's doing. But you saw that he thought that he was doing something good and provided people comfort, yeah. I saw that I'm still very disappointed, because I feel that they are in total denial of something that I know he must have signed off on. He had to have susan's got her hand up for a question yeah. Thank you. So I would wanted to talk to that issue. Also, I was watched a little bit of the video and I was appalled that he took no responsibility. You know it's one. It's one thing, I'm trying to speak out of turn, but I don't think everybody knows what you're talking about. I don't know who this person is. You want me to give it alex, give some background. Please there was an application on the agenda this month for 132 ludlow street for a fast food like a takeout belgian fry place, the place that actually opened in may and in may very close in time into with its opening, if not at the same time as it as its opening it shut down the street or people on its behalf, shut down the street with 30 to 50 luxury cars, including a porsche a delorean and this giant white suv with giant wheels. I mean white truck with giant wheels and again the man was saying he had nothing to do with. It was just his friends doing a kindness, but they produced they produced decals adhesive decals to put on the cars that advertised his business. One of these car aficionados, according to him, was also a dj and brought all his equipment with him and set it up on the street. They cordoned off the street and crowds started to gather and it became incredibly unruly and loud and they all the videos of it seem to have all of them seem to be carrying around the cones of fries. So we heard it for it was listed as beer license. The attorney said it was actually a wine beer license, so we heard it because it wanted to stay open until 2 and 4 a.m, but also because there already been this incident. Susan had emailed me and said that she and the precinct and the bid and local elected officials or their representatives had to actually show up on site at some point because of problems with respect to the business which that guy denied, knowing anything about that at all. But you know what he was saying was unbelievable, because there was a lot of documentary evidence about his event and like the promotion of his event before and after the event and alicia did come as well, because she said she saw the event and herman spoke to the event which he saw live streamed, and then michelle also found like this promotional video that they posted after the event, which was both inside and outside the location, had people driving by in the fancy cars had him in a fancy car and you could see that his logo on all the fancy cars. Okay. So so, like I said this, you would not believe the number of complaints at all the elected officials offices, everybody. I actually got a complaint at the time from jamie rogers who was down there and I called the captain and he sent someone over immediately. So today, after I saw a little bit of that video, I called- and I spoke to the police that actually was there and it was a community affairs person, and I repeated the fact that this person had said he didn't know anything about it. He took no responsibility, so what happened is when the police got there? They immediately told him to shut down the dj and he immediately shut down the dj which, although, according to him, he had nothing to do with the dj and he was in charge of him, but he shut him down in five minutes. He also said he didn't know anything about it, but added that his daughter, who I don't think any of it. I don't know if any I didn't know she existed before it's either his daughter's business or his daughter's running a day-to-day. The police weren't clear, but when he was saying he didn't know about it, he seemed to be slough sluffing it off on his daughter, and he did mention now. He had no idea that the whole thing existed, but he told the police that the money collected was going to first responders, so it was a good thing. I had reported a second event, so I researched that more and his business is actually being lumped together with other business other non-licensed businesses, so he wasn't actually the cause of the second event and the site meeting. We had, he actually wasn't there. It was. It was everybody from these offices to discuss to discuss the issue because all of the offices had so many complaints. My concern I have my concern about this is that it was so egregious and the person is not taking any responsibility at all. I'm afraid that if we, although ordinarily a beer wine, any beer wine is going to get approved. I don't know if that's true under the conditions that he was breaking social distancing, which the sla for one brief period in time seems to be very enforcing, and I'm just concerned about how it might impact our credibility in asking for enforcement. If we support the business and I'd like to know what people think about that, well discussed that strategically. If you watch the meeting, then you saw that we did and thought it was better to do the resolution this way, but I think that we were all open to doing it either way we just wanted to do the thing that would we thought would be most effective in curbing him in some way. So I and I understand that totally I'm sorry. I wasn't there, I thought it was so clear-cut is like one of the worst events of the year that I didn't need to be there, and I understand totally what you're saying about impacting the license. I just think looking at the bigger issue of all the problems we have with enforcement, that I think I mean to look at what scenarios could happen. The sla could deny them or if they prove them, I am certain they would put extremely strict restrictions on them, but we would not have supporting them. You know be part of art, it wouldn't be support from us, and you know I would just ask that that you might want to consider whether that's a possibility, considering what I have found out from the police today. Do you want me to bring up the vote sheet to show the resolution it's up there because they hadn't finished them? Yet? Oh, okay, yeah and I don't know that it really impacted. To be honest, I don't know that makes a difference. I'm open to a different resolution being moved at full board. I think it would help to be able to include something more specific, which we hadn't done, because I didn't. I have information about complaints to all the elected officials, but if we have that, then I could document it in part of the resolution, if you think that's a good idea so like I could put in writing to you kind of one, what the police, the reports from the police today, which I think you know the fact that we got them after the meeting in response to his response, makes it pretty rational and you want. You want specific complaints from elected officials or you I mean basically get. They got the same complaints or do you just want their names because they got the same complaints we got. I guess I'd like that. Maybe who the elected officials were the approximate number of complaints? Maybe who the elected officials were who had to respond to address this in some way also would be helpful. They don't so what we usually do on this, and particularly when we're all on the same emails. We don't we. This is a and it's actually something I forgot to talk about in my report. We have a policy of always having one office in lead, and so we have one office answer and just copy other offices. Now I understand that I meant the with respect to the email you sent that I that I distributed to the other committee members in advance of the minute meeting to look at that said that what was going on required a response from the bid from the precinct and also from various elected officials. So it would be helpful if we could say in fact it this is what happened. These people are the ones who responded or representatives of these people are the ones who responded. Are you talking about at the meeting we had yeah, okay, yeah that I can do to specify who is at the meeting? Okay, that's it. Otherwise it was fine. The rest of the meeting was fine. Okay, alex! Is that all for your report? Yes, walter paul did ask susan if he, if you could be his mentor, though oh my god, but that was just a funny thing and we can move on you alex transportation, paul, I'm sorry, I'm still stuck on the delorean part believe it I was looking at. I was like oh my god, it was pretty crazy. I saw it too. I walked down that block when it was happening and I was like what the hell is going on. I thought I was in back to the future exactly so it's a perfect segue for transportation. I would say it was an uneventful meeting, but it kind of was with the partnership and the neck down extension. We chose to postpone the item indefinitely, just because we wanted to see the tournament museum show up for that for the item, not just the partnership and the letter. I think there's a lot of questions from the community in regards to the neck down extension and the pedestrian plaza. So we decided to postpone the item indefinitely until there's some more support in a potential resolution other than that it was. It was quite eventful. I think the chat room got a little bit out of hand even after we had, or I had actually explained to the community. Well, you know the rules and regulations and had been posted at the beginning of the meeting, and people were saying that they were getting shut up. They were getting told not to say anything. I was like that's not true. I did give. I believe I gave the public enough time and ample time to say comments and we ended up postponing the item indefinitely as it was so we'll see when it comes back whenever it comes back other than that, that's it well. If that happens again, you can always do what we do at parks and change the chat so that it only goes to the host of the meeting we did. I did we got the and then we got the chats. I don't know what a pitchfork feels like, but what an online pitchfork feels like, I think, that's kind of what happened this way, they're at least not feeding off of each other. No, but they got a good piece of meat, so it was. It was interesting, but I think it worked out in the end and hopefully we'll get to hear it again at some point. Thank you paul. Thank you. Okay, health and human services, hello. So at the last you muted me, may we lost you muted? Oh I see you did that yeah, okay, oh there, you go okay, so the oh, so we had our community meeting. We mainly talked about district needs. This time it was about health. We had three speakers. Economic development got skipped. Paul, says sorry. I saw it sorry, nisha we'll come back to you. I'm sorry! Do you want to go back now or okay, we'll go back later? You can put on my glasses after you may we'll go back to an economic development, I'm sorry, okay, so yeah. So so the main we talked about the health section and we had three speakers, two from the you know the federally qualified health care, centers beethoven, charles b, wang and also somebody from gouverneer, and I think the takeaway was that you know every year we talk about various health diseases, you know and the prevalence, but this year they all talked about the same thing. They talked about mental health, they talked about child development and they talked about what people call the social determinants of health. So that's like everything that's happening now and it covers all the committees. You know like it's the housing. You know the loss of businesses and jobs. You know what's going on with the school and the kids, you know. Suddenly, you know their whole life has changed. So they said those things are the things that really need to be fixed. If we, you know are to you know, if we're gonna talk about you know, what's the main thing that's affecting the health of our community, it's those things. So that's so I you know the takeaway was that it wasn't. Just health is not just in its own little. I mean this is not rocket science and it's not new, but this is what they emphasized this year, that it's not just something in its own little silo. But it's you know everything is impacting the health and also the the institutions. I mean, I think the health clinics, the state of them, are the only they told us this before. They need a lot of repairs. You know they. Some of them are in NYCHA building. Some of them are not, but they get very little capital funding for the repairs that they need. Okay, so the other thing is, you know the census. I know that I said I was gonna, send out an email, but I never did but just or send a draft to alicia to send out to the whole board, but because I felt that we had a little bit more time so what's happening now I heard is that the census bureau originally planned to end all operations at the end of october, but now they want to end them at the end of september. So there's a lot of uproar about that. I don't know if some national groups are planning to sue about it, but that's you know, cuts into the time and they have started the door knocking operations. So I think the message is to you know: people can still go answer the census. You know and avoid a knock on your door, but I'm just wondering if anyone has any ideas about what we can do it doesn't. Maybe is there a message that we need to send out to somebody or target certain groups? You know I look at the hard to count map, so our neighborhood is considered good compared to other neighborhoods like no one ever prioritizes us, but still ever you know for the whole city, the response rate is about like at best a little over 50 percent. So you can say that there's another 40 percent that haven't responded. Oh okay, I am may I just want to let you know, like I've asked my family members actually each one to reach one. I've asked all of them to reach out to their friends in our community in the african-american community. To actually just say: listen, we are low on a totem pole. Our people do not respond to this to the survey and I think that isn't very important, and even I tell my co-workers, I said everyone needs to fill out the census form. So I have done my part as far as that's concerned, but I think that each one of us needs to reach out to our friends and our family members just asking them hey. Did you fill out your senses? I think that it's a very important thing, because I got actually one of my co-workers. That said to me: hey, what's the importance of filling out this senses and I was kind of like shocked, I was like oh my gosh. It's everything, it's everything that we need in our community, so I think a lot of people really don't understand the importance of filling out the senses. That's another thing! Okay, so maybe that's what we could do is maybe send out like or at least to the board members or even to our mailing list. You know these. This is the importance and then you know talk like you know, talk to a friend, friends and family. I mean I think that would be helpful at this time I mean. There's I mean there's a lot of organizations out there. I know eric's organization is doing stuff, like you know, door knocking or not door, knocking a literature, giving out literature, and they don't want you to door knock now, because they don't want you to. They don't want to get confused with them, the actual census, bureau or knockers yeah, and then the last thing is so I'll. Try to draft something, if you think that's necessary. Do you want me to draft something? Or does somebody want to help draft something, or maybe you can just get some ready-made material to send out? Okay, yeah we can send out before before monday I mean we should really try to get it in by monday, because we have full board on tuesday. So if you want to say something at full board on tuesday about it to me, that might be helpful as well. Okay, let me also see find what else that was something that maybe that's already ready made. Okay, let me see if julie menon's office has something so we don't have to reinvent. You know something as like: graphical, okay, hey there's. I think I still have them, but there's graphics, that they sent out a while ago that we published on our social media. Although I still have them, I can send them to you. Okay, thank you, okay, so the other thing is just the schools. You know it's, oh god, it's I don't know. What's going to go on with, what's going to happen to the schools but they're supposed they're, not ready, they're, not ready, they're, not ready, right, you're, not ready and there's this thing with the transportation and the open streets and the parks, and you know last week or a couple of weeks ago, susan had to intervene because you know there was some. There was a school in our area who you know they try to apply online through the website and they get a reply that we'll get we'll get back to you in october, which was not what they needed so it exists. I think they're trying to work on the central's. The DOE central office is trying to work on this process where the schools can get. You know the outdoor space or the parks or everything that they need and at borah board. I said that they should also- and susan told me they should loop in the community board because we deal with parks and streets and so many other things yeah, but they're not ready at all yeah. No, I mean you know, I work in a school building and I see what goes on all day long and it's just they're not ready. I'm telling you guys right now, they're, just not ready yeah, we had a presentation and the schools could choose like four options. You know there's like one two or three cohorts, and you know all these chords are supposed to come into the building at certain times and be remote at certain times. It's you know it's very confusing and yeah. Also we just want to let everyone know. I'm sorry. I should have added that to my report, but the DOE has deemed because I my concern has always been what happens when the children return to school and we have all these adults that have been coming to the school doors for food distribution, and so my question to my supervisor this week was so what is gonna happen? How do we handle the adults that have been now programmed for the past like five months to come, get food from us and they no longer can, and so she said that there is going to be some schools in the in the area that are going to be deemed for afternoon distribution so be on the lookout. For that I'll, keep you guys posted I'll. Let you know about it. Okay! Thank you. May I'm sorry now we're going to go back to anisha economic development. Thank you. Anisha, I'm sorry no proud. My report is short only two things. The first is the meeting went well, we had the center for urban future come and speak to us in addition to lesson. But if you look at the cb3 website, the two presentations are there and there's a you know: the center for urban future did sort of dive into sectors in cb3 that have been most affected by the pandemic, the top sort of being you know, retail restaurants and then a big portion of the performing arts and then also sort of unemployment trends. Because, as you all know, we have a lot of community members who are not able to work right now. We don't necessarily have the highest in the city but the highest below 96th street. So something to consider the presentation was good and then the second thing not really related to the committee meeting is that you know we, susan myself, megan we're getting a lot of emails. Obviously that you know businesses in the neighborhood are closing, so I just wanted to give a shout out to susan for fielding all of those emails and you know sort of shepherding people to the right set of resources. There aren't that many resources. Unfortunately, you know there are technical, there's some technical assistance and there's some ability to still get capital through these various programs. But I think this is you know worse. We're gonna see a lot more businesses close. So so thank you to susan for handling. All of that. Thank you. Anisha land use yeah, so we had a meeting this month and we approved the we approved cp3 to sign on the two bridges co-applicants cover letter to dcp for resubmitting the rezoning application. So if dcp turns down this application again, then the co-applicants may sue the city, but cb3 would not be part of it, but that's the future and other than that's all. I have sorry the letter was very long. I don't know if everyone got an opportunity to read it, but I will encourage all of you over the weekend. If you have a little spare time to just sit down and just read, it was very technical, a lot of it, but very thorough as well. So thank you, jackie. That was awesome. Your committee really worked very hard on that. Okay, moving on to landmarks, okay! Well, we had a very lively discussion regarding ps64 jaris and the current conditions there, which are continuing to deteriorate and there's a great deal of alarm in the community, because people are getting into the building and damaging it. The police have said they can't go in there because they don't have permission from the owner. So it's kind of a standoff. So we had a. We have a resolution which you could read at your leisure, the whereases go on and on and on, and on and they're, essentially a history of, what's gone on with ps64, but we had some asks which I'll share with you. First of all that the department of building should immediately secure the building and make emergency repairs and bill the owner that public safety issues at the building, including, but not limited to fire hazard and materials that could fall off at any time. Dob must issue a warrant allowing NYPD to enter the building. Landmarks commission should take legal action to compel repairs and issue the maximum fines retroactively and moving forward. We do feel that lpc has been not slow, walking exactly, but I know they're very careful about bringing demolition by neglect charges against owners of buildings that are allowed to deteriorate. However, they really need to move forward with that and that the city should retain a preservation engineer as soon as possible to assess the building for potential hazards. I think that the landmarks commission has such engineers in contract, and they can do that I'll. Just read the last bit further cb3 reiterates its call made in a resolution in 2013, requesting that the de Blasio mayoral administration returned the former ps64 school building to the community by legally retrieving and then selling or giving it to a well-established, not-for-profit organization. With a long history of serving the people of the lower east side- east village, including, but not limited, to restoring the not-for-profit organization known as charis elbow gio to the building, as some of you know, back in 2013, the mayor did promise to reacquire the building, and he has not done so. I just wanted to ask on the department of buildings ordering the I don't remember exactly what it was, but is that a power that they have, which one to go to ask to give permission to the NYPD? You mean that one yeah is that a power they have. We don't know well shouldn't we search it before we tell them to do it. I mean telling them to do something. We have no idea if they can do, and I kind of actually doubt that they can yeah. I guess maybe just be slightly changed- that they should compel the owner to give that permission. That would be good because if even if DOB had the power- which I doubt it would go through their legal department and would be stuck there for at least a year. Okay I'll just add that as a friendly amendment. Okay, thank you linda parks trevor. I always a number of issues with parks. Very long agenda, very long meeting same thing will repeat the next year, probably with the project going on, but the ascr was mainly an update. Although I do have to ask a question to exact about the cag, because it's not listed as one of our task forces and subcommittees, because we are just a member, but I do need to give updates and they do they've already sent out one request to have a vote, and I need to know how we're going to proceed as a community board, because a lot of these issues are timely. But I can save that for the end of my report, the only resolution we had to do at pier 35, which is suffering a lot of what we're seeing in the city sort of on an excavated level because it is a park under destruction with a number of crimes. So what we're trying to do is be very preventative because there's already been at least a couple of bodies found off the waterfront lots of crime, so we're really trying to be preventative because we don't want more issues and that is to enforce the rules that we already have, which is closing a park. It was either 11 and one we sort of split in the middle at midnight, which I think is still late, but I think it's fair gives people enough time to enjoy and then get out of there before trouble starts problem is that area is difficult to close, so we ask for physical barriers and some more police enforcement and some maintenance issues, but that was the only resolution with regards to the cag. I know susan has her hand up, but I was gonna answer your question. Okay, go ahead and answer so we have this on quite a few committees where we can just add if you want, it can be one of those every month, things like update from the community advisory group sure and what about the votes? Well, if it's a specific vote like if you want to put if the issue the issue of making the meeting public, if you know, if that's one of the issues, I would suggest that we put that on the agenda specifically yeah. The thing is that they're not going to wait for our vote, and that means either I vote or I don't vote. That's we have that problem. A lot. That's actually kind of what happened with the co-application co-applicants people should realize. I mean you have board six on there, they're also right yeah. They handle things. I mean that should be you know. Generally, we make it as part of the state that in the beginning, you know, if you want the board to be an active member of this in voting, you have to understand our procedures and we've done that with every commit group that we've been on. So you please, if you could email me exactly what you want for the to add to the september agenda, whether it should just be a cag update or if you want me to put anything specific on okay, that was it. Thank you trevor. Anyone have any questions for trevor any hands. I don't see. I can't see just susan, but I believe that was what the hand was up for so okay, it was, but I forgot I don't know if this is a good time. Let me know I forgot something incredibly important from my report. Would it be it's about a meeting september meeting if I could mention that now? Is that okay, yeah okay, susan go ahead? Okay, so I don't know if you guys have looked at the september agenda, but september is when we have our budget consult meeting, so that is on the agenda. We have it. We will advertise it on our website as always, and we always send out a flyer to all the community groups. It would be good if we can, this time we can advertise it on social media. So generally, the chair shares that meeting and we try to get all of the chairs of the different committees to attend and be the committee for that meeting. Okay, thank you. Susan NYCHA, in section 8 subcommittee did not report jackie and I need to we jackie. We need to have a conversation because there's some conversation that has been generating from sandra and a few I think she's trying to get a few other members on board. I think they want to have a conversation to have an agenda item added at your committee level yeah. I also had a conversation with her and I just sent you an email 30 minutes ago trying to see if we can talk after the exact sure, that's not a problem. I just need a five minute break. Okay, arts and cultural subcommittee is going to meet on tomorrow. Anisha is there anything in particular that they're meeting about what meeting tomorrow it already matters? Oh, they already met, I'm sorry, but there's there are no updates from they're opening. Okay. Thank you. Chinatown neighborhood planning subcommittee. There's nothing to report there, any old business, oh business, any new business. All right, a vote to adjourn, may have a motion to adjourn. Listen to adjourn. Thank you second. That, second, are we breaking the rule already susan? Oh, we need to take a roll call vote. Yeah. Just take it sorry! So can we have a roll call vote and the vote to adjourn at the same time? Let's do that? Go ahead, alicia, louis coleman? Yes, michael moreno, yes, lisa kaplan! Yes, eric diaz! Yes, michelle cooper smith, yes, herman hewitt! Where did herman go man? Herman is elusive? Okay, now you know anisha stephen, yes, maylie. Yes, jackie wong, yes, linda jones! Yes, alexander militano, yes, trevor, holland, yes paul rangel! Yes, thank you! Thank you, everybody! I want you all to have a great weekend. I will see you all on tuesday, night zoom, okay, all right. Okay, bye, panelists,.",
        "summary": "Maybe I should mention very briefly that, as follow-up to my responsibilities to monitor the attendance, we reviewed everyone who had received the warning letter several months ago Nobody has to go to the second round of possible elimination and I will try to reach out to those members that I've noticed that I haven't seen them and I know that one of the members are is sitting on paul's committee I appreciate that anything from the treasure to report herman You have nothing to report.\nHerman district managers report sure I'll start with the election, since you guys brought it up so just sort of an fyi for all kinds of operational things: The 12 district managers in Manhattan, always like email, each other about how do you do?\nBut I do want to run everything by the committee on open government because they're the ones who decide things you know anybody making up like noel or anybody.\nI've talked previously about many more homeless has not released their hope count from last January, which is supposed to be made public every year, and you know I've asked for it now Often people like to lump call everything homeless, but the real issues people are complaining about are a tremendous amount of crime on the streets , There's lots of people on the streets, they're, not all sleeping there.\nPeople are besides himself are the broom orchard area that came up in the transportation committee, because dot wanted to have a plaza and I think the residents around there kind of freaked out, because it would mean more people congregating in the area, so they wasn't approved.\nI was approached by kasir the lobbyist, that represents project renewal, All, the adult shelters in cb3 have been emptied for social distancing, all the city contracted or city shelters and the ones in kenton hall and project renewal have been moved to the upper west side and I'm sure you've all heard about the issues on the upper west side , You're only hearing, there's a lot of people complaining and you're Only hearing about that, as actually all the elected officials and the community board are working to resolve issues like find public space for the shelter residents and programming, so I was asked at first I was asked.\nThey would ask me so I'm sending it to the president of project renewal so that he can use it as he wants If. You would like me to read the letter to you Are they asking for support from us?\nYou know how we've had some of the residents several years ago come and testify at our board meetings to support a k2 resolution about k2 We finish the letter issue Do. You want me to read the letter to you?\nIs people seem to have a problem on knowing whether they have to you know it's really difficult for people to remember that they don't have to make motions, they don't have to second it, and if you want, we could change the agenda to approval of minutes and roll call and that might make it easier for people Now we're going to move into the committee reports.\nI took a little while with the fry guy beginning to actually talk because at the end he provided me with useful information to include the resolution, which was really that he doesn't know anything about the area and or have any experience with what he's doing But you saw that he thought that he was doing something good and provided people comfort, Please.\nThis incident Susan had emailed me and said that she and the precinct and the bid and local elected officials or their representatives had to actually show up on site at some point because of problems with respect to the business which that guy denied, knowing anything about that at all Had people driving by in the fancy cars had him in a fancy car, and you could see that his logo on all the fancy cars So today after I saw a little bit of that.\nSo he wasn't actually the cause of the second event and the site meeting My concern I have my concern about this and I'm just concerned about how it might impact our credibility in asking for enforcement If. We support the business and I'd like to know what people think about that.\nso, like I, could put in writing to you kind of one, what the police, the reports from the police today, which I think you know the fact that we got them after the meeting in response to his response, makes it pretty rational.\nThink or I had actually explained to the community You know the rules and regulations and had been posted at the beginning of the meeting, and people were saying that they were getting shut up.\nWe, don't necessarily have the highest in the city but the highest below 96th street and then the second thing not really related to the committee meeting and you know, sort of shepherding people to the right set of resources.\nOne request to have a vote and I need to know how we're going to proceed as a community board, because a lot of these issues are timely."
    }
}