{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB5",
            "channelId": "https://www.youtube.com/channel/UCkKjj-dHqChNQ2qOOrPaCfA",
            "title": "October 26th",
            "publishDate": "2020-10-27",
            "shortDescription": "",
            "lengthSeconds": "1:33:45"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB5",
            "normalizedName": "Manhattan Community Board 5",
            "twitterName": "Community Board Five",
            "youtubeChannelName": "Manhattan Community Board Five",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "twitterHandle": "@ManhattanCB5",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "UzAK2WgIyjc",
            "fillerWordCount": {
                "uh": 213,
                "um": 327
            },
            "readTimeFullTranscript": "52 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "bike": 37,
                "bikes": 37,
                "street": 27,
                "stations": 26,
                "budget": 23,
                "enforcement": 22,
                "sidewalk": 20,
                "traffic": 20,
                "years": 19,
                "station": 18
            },
            "wordCountSummary": {
                "enforcement": 7,
                "bike": 6,
                "space": 6,
                "street": 6,
                "stations": 5,
                "proposal": 5,
                "business": 4,
                "demand": 4,
                "plan": 4,
                "laws": 4
            },
            "fullTranscript": "Hmm we'll give folks, maybe another 30 seconds and then we'll get started all right, we'll go ahead and get started. Welcome all I'm Ej Califarsky, I'm the chair of Manhattan Community board, fives Transportation, Environment, Committee and you're at our monthly meeting. So thanks for joining us today we have. We have three items on our agenda tonight: two presentations by the New York City Department of Transportation, and then one discussion amongst the committee members without any further ado. I'll kick things to Luke very briefly, to walk us through any zoom notes for how participatory discussion will happen through zoom tonight, but otherwise we'll go ahead and get started because there's anything you wanted to add sure. So, as briefly mentioned earlier before, we started recording if you're joining us from a phone, you can press star nine during the public session to indicate that you want to speak. We will have a public session this evening. So if you want to speak, you can press the raise hand as an attendee and committee members. You know we use the raised hand function throughout the meeting to ask questions or bring up points. So do not hesitate and I'll turn it back to you, thanks and for everyone's awareness for each item on our agenda. We'll likely hear a presentation from the presenter we will. At that point I will open it up to members of the committee to ask questions and then, following that to members of the public, to ask questions or to make any comments that they'd like to make from there we'll move into a business session where the committee and only the committee members will have an internal discussion around the topic and though I do not currently anticipate this for any of the items on the agenda tonight to potentially take a vote or any board action and then from there. We would move on to the next agenda item with that, I will invite the department of transportation to present their first topic, which I believe to be a bike share: infill presentation, thanks, Ej hi everyone good evening, I'm Jennifer Santina as Dot's Manhattan deputy borough. Commissioner. First I wanted to wish Marisa hardy welcome and congratulations in your new role as district manager for Commissioner Pinkar and the DOT team. We're all looking forward to continuing to work with you and the board members on our Midtown projects: Ej Luke, Committee members. Thank you again for having us on tonight. I'm joined here by my colleagues, Brian Peret and David Andrew from the dot's bike share program as well as colleen chatterboon from the Manhattan office, who many of you also have the pleasure of working with Kimberly, Rancourt and Casey. Guerrell are also on for team, DOT and they're here to speak to the Lexington avenue project next up on the agenda, but for now I'll get back to bike share. Last year, DOT embarked on our five year phase three CitiBike expansion alongside our partner, lift, and this will double the size of the system and triple the number of available bikes. Since the program launched in 2013, new yorkers and visitors have turned time and again to CitiBike as a healthy, safe, fast and affordable alternative for transportation and as the city continues to reopen now in a Covid-19 world, we believe that bike share will play a critical role in getting people around the city and back to work phase. 3 expansion in Manhattan started this spring when we expanded into new neighborhoods uptown, but we're also focusing on adding new stations and more dock capacity into the existing service area, including here in Community board 5, to help support the demands of a larger system. I want to thank the board again for giving us the opportunity to present and at this point, I'd like to hand it off to Brian from the bikeshare team to walk us through tonight's slides good evening, thanks for having us, so I'm assuming I'm just set to share my screen. Yeah go ahead. Great! Okay! Everybody can see this okay. Let me know if you can't thank you again thanks for your time, I'm Brian Peret and with the DOT bike share program and again here to discuss so you like infill in CB5. First just a brief overview of CitiBike CitiBike is New York's bike share system. It's the largest bike share system in the western hemisphere. It's a convenient network of shared bikes intended for point-, to-, point trips and it's just another one of the multiple mobility options available to New Yorkers. The system operates 24 hours a day and offers the convenience of bike trips without the hassle of storage or maintenance. Cinebike is a public-. Private partnership. D.O.T is responsible for the planning and outreach of the program. Lyft is responsible for day- to- day operations and maintenance, CitiBike launched in 2013 in Manhattan and Brooklyn, with 300 stations and 6,000 bikes, starting in 2015. We expanded to 750 stations and 12,000 bikes across Manhattan, Brooklyn and Queens, and we're currently undertaking our largest expansion to date. This is going to add 35 square miles to the program we'll fill out Manhattan and expand further into Brooklyn and Queens, and also into the Bronx, and this will add another 16,000 bikes to the program. Citibike over the seven years has been a highly successful program. We've clocked over 107 million trips on our busy days. We averaged five and a half trips per bike per day and about 70,000 daily trips during peak riding season. During the busiest days we're up around 90,000 daily, rides and close to 100,000, and really this program is built on the back of our 170,000 annual members. I want to touch briefly on CitiBike and Covid-19 and DOT and list response. The really lifts response has been focused around ensuring rider and employee safety that has involved cleaning high contact areas on the bikes when they're returned to the depots, disinfecting bikes at high use stations, especially near hospitals, and using social distancing practices in the field while handling bikes. Another component of this has been the critical workforce program, which was a program that offered free memberships to essential workers in the spring, about 20,000, essential workers signed up for this program. Moving on, I'm going to just touch a bit about our overall phase: three expansion in the film program phase three expansion is bringing Stig bike to new parts of New. York City is going to double the geographic size of the program. You can see that here in the dark blue on the map, we'll bring an additional 32,000 docks and 16,000 bikes into 35 square miles of new territory. What we're here to discuss tonight our infill program is adding capacity to the existing phase, one and two service area, so we're going to be adding 16,000, docs and 8,000 bikes into the 33 square, miles of phase 1 and 2, which already contains 29,000 docks and thirteen thousand bikes and infill is a critical part of our phase. Three expansion, similar to the subway and buses CitiBike like brings bikes into the center of the program in the center of our service area, demand for bikes shifts throughout the day and infill is really going to like support this component. It's going to support increased demand from phase 3 expansion meet unmet demand in the existing service area and overall recruit improve rebalancing in our overall system operations. Infill is going to be a rolling program over the next four years, we'll roll out new and expanded stations. It's going to be demand based, so areas with high demand will receive more docks. Installations will be rolling, so they may cover multiple community boards at a time, and really this is going to be an iterative planning process, we're going to try to be nimble and address changes in the system as demand changes. We have a few design tools to achieve this goal, the most obvious ones, new stations and expanding existing stations. We're also going to be looking into creative solutions. What you see here is 3D bridging, which is a way to kind of jump the curve and allow us to install those both on the road bed as well as the sidewalk in one contiguous station. As I mentioned, this planning process is going to be rolling. You know we're gathering online feedback via our flexure website and feedback portal. This is where riders can drop a pin and tell us where they want to see more capacity, using that we're going out and using ridership data, as well as technical criteria to identify feasible locations following that will undergo a community notification process where we'll notify property owners, Community, Board and other key stakeholders prior to installation post installation stations will be monitored to ensure that we're really meeting the goals of infill. Finally, I just want to touch on the stations we're proposing in CB5 overall we're proposing four new stations. You can see them here in the blue. Dot. Excuse me, the blue dots on the map. I will go into further detail in the subsequent slides here in this area, in the kind of mid-30s we're talking about a new station on the south Road bed of West 36Th Street at 7Th Avenue and a new station on the road bed at West, 32Nd, Street and 7Th Avenue, that's in the North Road bed, second station or third sorry rather a third station. This is a relocation mix of an existing station, we'll be flipping the station. That's currently on the side street, on 45th and 6th avenue onto the Avenue adjacent to the new protected bike lane at 6 and West 45th street. That's in the West road, our final spot, a station on the north road bed of East, 50Th, Street and Park Avenue, and that's all I have for tonight. Thank you for your time. I'm happy to turn this back over and answer any questions you might have. Thank you Brian. I do have a couple of initial follow- up questions and then I'll, of course open it up to members of the committee to ask what any questions that they have. I'm sorry, I'm just based on your slides when you defined the scope of phase three, you said 2019 to 2024 and phase two said it was twelve thousand bikes phase three refers to sixteen thousand bikes. Is that an additional sixteen thousand bikes, or will that bring the total number of bikes in the system to 16,000.? No, that's an additional 16,000 likes okay and you did not refer specifically to how many new stations phase three will have. Is that simply because it has not been decided yet or do you have a target number for the number of new stations? No, that's correct. It has not been decided where, as I mentioned, this is going to be focused on demand, we're looking to try to where it makes sense, Max out space, that we have existing and also add new stations where we feel like it makes sense got it. Thank you. So you also do not have the number of you do not have the number of new stations within the Community Board 5 district, but you probably also do not know specifically how many bikes you'll target, how many new bike bays will end up in the district as well, because they might because the distribution might mean they're, either in the district or across other districts. That's correct! We do not have a specific number that we're targeting for CB5. Okay. Thank you very much with that I'll, initially open it up to members of the transportation environment Committee, to ask any questions that you might have by using the raise hand feature in Zoom Ryan. Thanks for the presentation, a couple of procedural questions, the first is you describe the the three potential forms of infill, whether news stations, expansions or 3d, bridging in all of those forms of expansion. Will the various parties be notified of that, even if it's, for example, an addition of a handful of new docks on an existing rack, that's correct for new stations and new docks. We will be notifying both adjacent property owners and through the borough commissioner's office, notifying community boards great and then just a quick follow- up to that is you know things may change, of course, but do you have an expected rhythm of how often you think we might hear about new additions? Is this something where we should be prepared for this coming every couple of months? Is it going to happen, maybe just once or twice a year? What should we prepare ourselves for right? That's a great question. You know like the work that we're putting forward here, we've kind of been working on all summer. I think, it's probably more fair to say we lean more in a couple times a year camp rather than every. You know like a regular cadence every couple of months, as I mentioned, this is going to be iterative, we're going to have to see how kind of data shakes out and but we will come back when we feel it's appropriate. Thank you, Nancy. Do you have a question? You have a question. My question is: are these locations coordinated with restaurants that are using the sidewalk for their expanded services during coving? That's a great question. We've certainly taken open restaurants into an account given that it is a seemingly permanent part of the city landscape. These four locations do not have any conflicts with open restaurants. Thank you. I actually have sort of a follow- up question to that which might be more backward looking than forward looking, but I am curious whether or not you can speak to have any current stations or how many current stations, if any, have been relocated as a result of say the need for a restaurant or a business to sort of reclaim that sidewalk space during Covid-19 once open streets started for the purposes of say that business having to needing the space to stay in business were any, were any existing stations, relocated or moved to this point, we've only relocated and really not even relocated. We've shifted one station, not in CB5 Jennifer. Did you have anything and iuj just to confirm that it's correct what Brian said. We have not relocated any stations, for you know to convert for outdoor dining space or adjusted any of our existing transportation infrastructure for that specific recovery initiative. So just wanted to clarify that point. It is something that has been brought up on a number of occasions, as I think I think the board Members Committee members, others know you know. Curbside space is definitely has always been. You know like a hot spot and that's something that the agency is taking into account, but right now we're not looking to relocate any transportation infrastructure for the outdoor dining initiative thanks. I have some larger questions too, like for example. If and you might not have these numbers off the top of your head, but like, for example, what- and I preface this by saying- you know, I think, a lot of people you know thought there might have been like a like a parking armageddon by removing any parking spaces. I have not seen a full- blown Armageddon yet, but I am still curious. You know whether or not there's like, for example, what percentage of curbside parking in the district has. You know over time been converted to CitiBike stations, and then you know additionally, I'm sure this number does not exist yet because it has been done ad hoc by the restaurants, but I would be curious eventually to learn how what percentage of curbside parking spaces in the district have ultimately been converted from parking spots to, for example, curbside dining. I do not know if you have any information along those lines. Now, or is the kind of thing you're, maybe hoping to study, you know, particularly as for example, Covid-19 goes on, but those were just kind of two questions that came to mind absolutely and D.O.T is more than happy to continue this discussion with Uej and the members of the board as the open restaurant program. Permanence, really, you know, continues to get developed at the agency and with the administration. We'll certainly keep the board up to speed on how we're trying to kind of balance out our street improvement projects, recovery projects- there's you know a lot of just conflicting and competing items at the moment, of course, so we'll keep you posted and continue with that discussion. Okay, thank you! Noah! Yes hi! I just was wondering if the five CitiBike stations that you found were kind of found before the pandemic or kind of as a result of the pandemic, because I noticed that you know all I think most of most of the five stations were located in Midtown, which has seen a lower. You know a decrease in work traffic, so you know. Can you speak to that? Please yeah! That's a great question: we, you know this infield process has really taken a need to kind of re-, examine everything whole cloth when we started this process, we really especially for each community board, we're taking a real blanket look at everything again and looking for space where, where it's available, so I would say, for these sites, we definitely looked after the pandemic started any other questions from any members of the committee. Okay, with that we'll open it up to members of the public if you're, if you're in attendance- and you have a question- please feel free to use the raise hand feature and we'll start with Lisa Wager hi. Thank you very much. That was a great presentation and I'm especially interested to note that the news station, which was discussed to go behind fit, which would block the loading dock we're now going to be forced to use for three years while we hooray finally build our new academic building does not seem to be in this presentation. May I report back to my people that it is not in the current plan, hi Lisa good evening, it's good to hear your voice. I know that we have been I'm sorry, I'm just a box here. No, that's fine! I know that we had been coordinating and discussing that plan station on Eighth Avenue. We actually presented that at the CB4. You know transportation committee last week, but there are a few kind of like updates that I wanted to share with you. So I'll connect with you Offline, and I can send the link to that presentation your way, so you can share it with your friends. You know that side of the block is CB5. Then we must have missed it. There is a planned station on. Our order is mixed up here. There is a plan is four and the east side is five. Well then I need to speak against this. That station, which you did not present to the board Jennifer so Jennifer and Brian. Could you clarify exactly what block and what side of Eighth Avenue we're talking about here sure this would be the east side of 8th avenue between 27th and 28th street behind, as Lisa mentioned, the fit building yeah that would that would indeed be CB5. So so it sounds like we're. Talking five, essentially five proposed stations delineated within the CB5 district. In that case that'd be correct. Yeah, I think it's six is not it four, but was not it already. Five! It's for currently so we'll go ahead and revise the presentation Ej. So we can circulate the updated one to the board tomorrow and what we'll post on the website will be the updated slide showing this additional station, but just to clarify again for all the committee members. It's on the east side of eighth Avenue between 27th and 28th street proposed for that sidewalk. May I speak yeah go ahead. You can make a comment. Thank you. So I had an email that I had sent to DOT, that included photographs of the site, and I believe that distributed it to the committee a couple days ago, perhaps right before the weekend, it's maybe buried in your email, as a lot of you are new, but as some of you long- timers will remember, since the earth was cooling, we've been discussing how we are going to build a new academic building on an empty lot. We have on 28th street, it's supported by the community; it had unanimous approval from the CB5 land use and then from the full board. It's taken quite a while to line up the funding for it. We are a community SUNY college, even though we offer bachelors and masters we're chartered as a community and our capital funding comes 50 percent from the state and 50 from the city. We have a go- ahead and we will be breaking ground in the next or beginning our mobilization in the next few weeks. The reason that's relevant is that our main loading dock for trash and sanitation removal and for accepting all deliveries for the 10,000 person community of Fit is on that now that lot that's on 28th street. So within five weeks that's going to be closed down and all of our sanitation, pickups and all of our deliveries, food supplies. Everything is going to have to come in this much smaller loading dock, that's on 8th avenue and if you do get a chance to look at the email, there's a picture of where it is it's in the middle of the building. Our building on 8th avenue runs from 27th to 28th and in the middle of it, there's a what looks to like a normal person would consider a sizable loading dock, but it's half the size of the loading dock that currently services the college and then as you're. Looking at that, building to the right is a smaller thing that looks sort of like a one car garage door almost and in the picture that DOT sent it's a sealed up thing with two vents coming out of it, because we have not had to use it as a dock for a couple of years and we just used it to add ventilation into that area of the building. But now it has, it is, has been re- purposed to its original purpose as a secondary loading dock. It is barely the width of a car, but that image, which is what D.O.T saw when they surveyed the landscape, is not real anymore. Now it has a like articulated garage door, the kind you pull up over your head that rolls up it's a roll- up door, and so as for smaller packages or deliveries, drivers are going to pull up, there's no curb cut there, so they have to park at the curb and that stuff will they'll ring a bell and that door will be opened by the mail room who are relocating a piece of the deliver. The acceptance delivery people are down there and they'll accept the packages, and we anticipate that will be very constant throughout the day directly like five feet in front of that door is the main loading dock which we anticipate will have truck deliveries. Coming to it quite frequently. The proposed situation for the new CitiBike dock goes from. If you're facing the building. It starts at the sort of southern edge of the main loading dock, so it does not directly obstruct the main loading dock, but then it goes 54 feet south stopping right before one of those kiosks completely blocking access to this secondary loading dock, which is now a vital part of our plan of how we're going to manage intake for the institution for the next three years. So anyone who's delivering will have to walk around 54 feet of CitiBikes. So we would ask we would hope that it goes away and does not come back, but we're not even asking that now we're just asking that it not come as we mobilize and demolish our existing loading dock, and I made a more cogent with visual AIDS argument in the email. Jennifer is that I guess initially is. That is the second loading dock. Something DOT was aware of when placing this fifth CitiBike station in CB5- or I guess, if not, is it? Is it something that you DOT plans to at this point kind of go off and study before finalizing a station here? So this is an area where we're kind of looking for other alternates as well, because we are finding out that there might be some conflicts with the upcoming construction at Fit. So I know I you know Brian and I had met Lisa and her team on site. Probably over a year and a half ago and like she mentioned, there has been some changes to the existing conditions. So Ej and you know we're going to take a look to see if there are other alternates that we can find that do not conflict with the construction. Okay, and if it's of use to you to further inform your view, the the construction site. There are three current construction sites on 28th street on the north side, the fourth one, which is that parking lot. That was an edison parking lot where they dropped casings in like three or four years ago to get grandfathered in under that tax break construction law, they're mobilizing a week from Monday and they're, going to do foundation work like five days after that, so that street is going to be extremely busy and we also. We do not know how our staging is going to get approved, because you can't have two construction sites staging in the street opposite each other, because you could only get through on like a scooter, so we may have to wrap our staging around onto eighth avenue to accommodate the already existing construction. So it's for many reasons, but the primary one being complete obstruction of this much needed loading dock. We would ask that you delay this particular site and reconsider understood, Lisa I'll circle back to you on the email thread that we have and then Ej will keep the board posted on any alternates that we plan to make to the plan here. Thank you. Okay, thanks very much Lisa and Jennifer David, Achalas Question or comment David. You should be good to unmute there you go. Can you hear me now? Yes, thank you. Yes, I'm speaking on behalf of the West 50S Neighborhood association. I'll make this brief. Every town hall meeting I've been to and every precinct meeting I go to every month. The most recurring complaint is out of control, rogue bicyclist for the last 15 years. The department of Transportation has been shoving bicycles down our throats here into Midtown, and anybody who's been out on the streets in the last month or so notices that the Covid-19 has exacerbated this problem, because no bicyclist has been arrested for any infraction. They now feel that they can do whatever they want. These e- bikes- and let me tell you they're, not electric bicycles, they're, actually motorcycles. They can obtain speeds of up to 45 miles an hour when they're going downhill and these are dangerous, 60-pound bikes and they become legalized, but nobody stops them from riding on the sidewalks. Nobody stops them going the wrong direction. Nobody makes them use the bike lanes we're spending all this money on infrastructure, but not one. Penny has been spent on enforcement and the last department of Transportation representative that I spoke to during one of these meetings said the department had no plans or any desire to enforce the existing bike laws. I personally think this is not a problem for the least police department. They've got better things to be doing than arresting bicyclists, but somebody has to control these bicycles, they're a danger to almost anybody walking on the sidewalks or streets and, as you know, these bicycle lanes sometimes go right in the entrance of these houses where these older people are trying to get in and out of their cars with their wheelchairs or crutches or whatever. I just want to know just the Department of Transportation have any plans or any method for enforcing existing bike laws here in Manhattan. Thank you, hi Dave. Thanks for your question, you know we work hand in hand with the local precincts and the NYPD to enforce our traffic laws, but in terms of our CitiBike and bike share expansion into Midtown, I'm hoping that Brian can elaborate more on our education and outreach campaigns that we're looking to do with the increase in ridership, as the CitiBike system. Further expands sure. As all note, traffic laws are all posted on all CitiBikes in the handlebar basket. We work with our partners at Lyft to undergo or to host Bike safety and outreach programs. Thank you again for your comment. We'll you know, I will make note, though, that, like we realized that, like riding on the sidewalk, is an issue, we know that CitiBike riders do it occasionally. We know that it's not a great thing I'll. Take your comment back. Thank you. Yeah David, I'll. Just add that, from the committee's perspective, we have learned over time that, while D.O.T certainly can can fund and take it on themselves to do education initiatives as much as much as the committee has is on record saying many times that enforcement of bikes needs to be totally rethought and revamped that the city currently does not fund or give the authority to DOT to do that, it is given to NYPD so from at least my kind of personal perspective. As the committee chair at this point, it's not it's not so much a question of engaging with DOT to change that priority, but probably with the way that the city allocates that reso those resources and jurisdiction- and I know there is a history behind the fact that some of that enforcement authority might have lived with D.O.T in the past, but for something like 20:25 years. The city has assigned that to NYPD as opposed to DOT, so that may be a political matter that we need to engage, say the city and the city council with rather than if we expect to see that enforcement authority changed over time. That's again just kind of my what I have learned over time about where why that authority lives, where it does, are there any other questions from any attendees or members of the public? Well, not seeing any you know. Thank you to sorry. I did not see that there was one for a member of the committee nancy okay. So my question is: what can we do about this enforcement? I am seeing in my neighborhood many CitiBikes that have the writing on them. That says you should not do this and you should not do that. But no one follows it. I mean this is getting to be a real problem. I see four or five a day, either going in the wrong direction or on the sidewalk. So I do not know I. My question is: what can we do? What does D.O.T say we should do, but someone has to start enforcing the bike, the bike, road loot laws because for the elderly and disabled, this is a huge problem, so we need to come up with an answer, so I think DOT needs to give us some kind of answer. Can you answer that for us please I'll? Let D.O.T answer. I suspect that you know again, given the scope of their authority, given them given to them by the city. I suspect they won't be able to say very much hi nancy. Thanks for your comments. You know, as Brian had mentioned earlier, we are working on a lot of education campaigns and initiatives with our partner Lyft to ensure that all writers, whether they're new or you know veteran cyclists, continue to follow the posted, and you know, traffic bike rules for New York City. I also mentioned that we work hand- in- hand with pd to enforce these roles. So it certainly is, you know an inter- agency. You know type of solution, that's needed here, seeing bad actors and bad behavior on the roadway is always very frustrating, especially to those who are trying to travel around safely and just get from point a to point b. So point taken thanks nancy if there are no other comments from the members of the public I'll at this point on this topic, but related to this larger enforcement issue. I'll pro I'll ask the the committee to go into to business session, to discuss amongst ourselves and nancy I'll, try to address the kind of broader point that you just made here, which is we say very frequently that we find the current enforcement to be inadequate and we're continually frustrated by the fact that no one seems to none of the city. Agencies seem to feel both empowered and willing to change the way that they are currently enforcing kind of how some of the street use like like the bicycle lanes and the conduct of bikes in general are being are being done. One thing that we have discussed as part of these kind of one- off discussions. You know this topic seems to come up whenever we have any kind of new bike, Lane or new bike infill, or anything like that. We are brought back to this issue of enforcement. The city gives that authority to the NYPD we've engaged the NYPD DOT has engaged the NYPD. It never seems to change anything. One idea that we have, I think, talked about at a very superficial level in discussions like this in the past. Is the idea of not just continuing to say this kind of stuff at DOT or say this kind of stuff at the NYPD, but to engage the city as part of the budget process to budgetarily propose that they fund D.O.T to have their own enforcement mechanisms instead of using the city budget to impose that burden on NYPD, where NYPD does not seem to be doing it adequately right now, it is something that we've suggested as part of the budgeting process, that is, that is conducted by Bex, where bex brings ideas for budgetary allocation back to the city and is planning on doing so this month. So that's like one option of to answer your question. In a very long-, winded way, nancy, that is one option of something that we can maybe propose at a 30,000 foot view for the city to maybe start to address this issue of enforcement differently instead of what we have consistently done in the past, which is raise the issue with D.O.T or raise the issue with NYPD for context and again, my understanding is that until the mid 90s DOT was responsible and funded for certain elements of traffic and parking enforcement moving and parking enforcement and in the mid 90s, that authority was reallocated by the city to NYPD, so it lived with D.O.T in the past over the last 25 years. I do not believe that authority has been given to DOT in an in an enforceable uniformed core sort of way, the way it had in the past. I hope I'm being accurate. There would definitely be interested to hear from other members of the committee if you have thoughts on just kind of that concept or that different approach and nancy feel free to respond. Well, I think we've been talking about this problem for at least three years three years. This is not a new problem. Three years we've been talking about this and nothing happens. We approve the bikes. We approve the bike lanes, we prove the expansion and still nothing happens. Whatever we're doing whatever we're proposing is not working, and I just think in today's world, with the budget the way it is under so much duress from all the Covid-19 expenses that the budget direction may not be the way to go, I mean it may be, but I think we have to engage our electeds. I think we have to write letters directly to City Council and I think we have to make it aware that this mayor has something called safe streets. These bikes do not make our safe our streets safer. Three years we've been talking about this. It's really very frustrating thanks, Nancy Joel, just to go a little further than what nancy was talking about. You know we we've been talking about this, it's actually a little more than three years. It's really. The problem of unsafe biking got significantly worse and really became a an overriding problem with the expansion of CitiBike and it's not just CitiBike riders. It's the expansion of all biking with the construction of bike lanes, which our committee is, you know pretty much every time a bike lanes come in front of us, we've approved it. I can't think of one that we did not, and I think you know. Nypd has always told us that at Precinct council meetings that David Dakalis and I have attended that they do not have the ability or the resources to enforce laws against biking against illegal biking. They can't you know when a bicycle rider is going the wrong way on a one- way street. They can't get in the police, car and chase them down the wrong way in a one- way street because they'll be killing people. I think it's time for the CitiBike operators, the lift company for transportation, alternatives for the bicycle advocacy groups to take responsibility, and I'm not talking about education efforts. Ta has been telling us for years, though, we're telling people not to ride their bikes the wrong way on the one- way street. Obviously that does not work. I think we need to stop approving expansions that facilitate the huge growth in biking in the city. Until something is done about this it it's just it's beyond it's not an education issue that does not work. It's an enforcement issue and police do not have the ability to enforce it. We need the operators to take responsibility. Seven people have been Ki, seven pedestrians have been killed by bicyclists since vision, zero started nobody's acknowledging that and the number is going up thanks Joel. I certainly agree with pretty much everything that you said. I think all that is accurate. You know I, as I said you know, I think I think, as we've seen, that education so far, which seems to be the only thing that DOT is really empowered to do on the topic is not enough. I think we're the next question to ask ourselves as a community board is really what is our leverage here, and I present I present as one option participating in the budget discussion specifically because it is something where we have a voice on and we are specifically invited to present ideas to the city's budget on an annual basis. So, for example, I think I think, particularly in the context of a larger discussion that we've been having since this summer on is money that is currently being allocated directly to NYPD for various types of enforcement of even minor infractions. Should that be differently allocated, not necessarily in a sense of spending more money, but simply shifting that money over to, for example, letting D.O.T or charging DOT with enforcing traffic and parking violations the way they have in the past, presumably including at this point bicycles as well. You know I see that as one option that would be within the leverage of us as a community board in a in a venue where our voice is listened to. I think other options could consist of kind of, like you said, Joel, maybe directly addressing ideas or opinions to our electeds or to the, for example, the companies that you mentioned themselves at this point things like Lane bike lanes and expansion. I think you're right. We rarely if ever deny a bike lane, although it is one of those one of those issues where I think we try to express the opinion in terms of how it's placed and what the conditions of it are. But you know in the terms of a bike lane going in and, for example, an infill. You know a CitiBike expansion like this CitiBike stations are added all the time without our without us weighing in so you know, I think, there's I think, there's a question of where is our leverage most usefully applied? You know from my perspective, the budget is one place where we have that lever and that voice. I'm. Oh, I'm very curious to hear if there are other thoughts as well, such as whether we as a board should be reaching directly out to some of these companies. But you know, I think it's. I think it's not so much a question of. Do we switch off all new bike lanes and bike stations. I do not know that anyone would listen. If we did, I think it's more important. You know, I think it's more useful and more active of us proactive of us at this point to kind of figure out how we can have leverage on actually changing the way things are enforced. So you know, I think, that concept of reallocating parking and traffic enforcement dollars could be part of the proposal that bex brings become before the full board and thus something that we could potentially vote on, but again very interested to hear if there are kind of other ideas. Besides just writing resolutions at DOT and NYPD, which, as you've noted, has not been, has not accomplished very much yeah Jordan Aj thanks. My only concern with the budget process and the allocation of dollars from NYPD to DOT is that when it comes to on the street enforcement, I would think that the DOT would have the same problems that the NYPD has there's a bicyclist going 15 miles an hour down the sidewalk the wrong way. They can't chase them down either. So you know, I think, the budget. I think we should do everything, but the budget number one is a long process. Nothing is happening this year or next year with that I just do not see it with the current state of the economy and then we're so at that point what this group can do is we can lean on our electeds and we can lean who in turn, can lean on Lyft. I'm not sure that the budget is the answer. Thanks. That's fair one other thing that we have indeed called for in other resolutions that the board has adopted is that NYPD create a we've called it a and other boards have called it this too, a two- wheel unit, so that if NYPD wanted to enforce rules on bicycles, they are not either running them down on foot or driving them down on a squad car, but rather there would be it would be uniformed officials on their own bicycles, which presumably would then be able to safely. For example, ticket an infraction from someone on a bicycle. Nypd has told us that they are not currently funded to do that sort of thing to create a new unit to safely ticket bicyclists, and so you know that idea, though, written though written and proposed in resolutions that have already been adopted by CB5, has ended up also becoming a budgetary issue. Nypd has said: well, we could never create that kind of unit unless we received the budget allocation for it. I'm sorry we're not in a public session anymore, so we're not at this point planning on listening to any members of the public. At this point, we're in the business session of the of the Community Board Committee. Are there other members of the committee who have any comments on this issue again, I we we're not we're not necessarily planning on. We have not traditionally adopted a position on every new, a CitiBike station that has been proposed, and so we were not planning on adopting a position as a board relative to this. You know kind of influx proposal, as was presented by DOT tonight, but again just want to open it up to discussion and ideas. Sam Levy. I know you wanted to speak yeah look, I agree with the frustration and certainly share the frustration that Nancy and Dave and Joel have, and I I've felt it very similarly over the last several years, because we've had the same response over and over again. I wonder if there's a world in which we have to start thinking about the fact that there are multiple types of bikes out there are multiple types of riders. Citibike is a discrete set of bikes. There is no reason that I can think of that. Citibikes can not be identified by a number; it does not need to be registered. I know that we've had a lot of pushback about the idea of registration of bicyclists and bikes, but CitiBikes could very easily have a number or something attached to allow people with cell phones and other ways of trying to track bad behaviors, and I wonder if that's something that CitiBike would even consider by identifying very clearly Andrew Gilbert is saying that CitiBikes already have easily visible numbers on the back wheel. I had never seen them before. I do not know whether that would be something that we could at least request or suggest. If they do currently have or could have, you know he's like a license plate, essentially an easily identifiable registration number. Presumably, that would still need to at that point like ticketing of those city, and you know, CitiBikes causing infractions. The registration number could be matched up with. Whoever has rented you know the bike at a given time and a ticket given, presumably that would still be they would still need to be adopted as an enforcement priority by whoever is enforcing the traffic laws. I mean is that how you're seeing it cam? Well, that's correct. I mean, I think part of the thing is that we, the vast majority of complaints that we hear of, are the equivalent complaint of a 3-, 1-, 1 type of call. They are quality of life infractions that people are distressed by and there's no ability right now, if you call 3- 1- 1 as an example to complain about a CitiBike rider, there's no way of identifying them or stopping them, and I do not know whether this is a way forward. But it does seem to me that, because they're discreet and because they're traceable and trackable in all of the ways that you would be able to trace and track any kind of machinery that is borrowed by the public and a credit card put down whether that might be a start and the fact that people have credit cards put down might actually help with enforcement, because I do think there's a difference between, as we have discussed in past committee meetings about people who are using bikes for a living and trying to deliver food- and you know messenger services versus people who are you know, borrowing them for short periods of time for leisure purposes or for short, commutes yep. I think it's a worthy idea. I think you know again. We have to figure out as a board action how we craft it to address. Whoever has that enforcement capability, which again, I believed to be NYPD at the current time. I did not. I did not see any other hands raised when we were in public session, but yeah Andrew Gilbert has not spoken yet andrew if you'd like, if you'd no more than two minutes, I'm happy to let you speak hello. Well, thank you for making an exception and listening to my comment I appreciate it. My name is Andrew and I live in the lower East side, but I'm I work or used to work pre- covered and hopefully will again soon in Cv5. So I'm there often, but my comment is more general just about the whole city. I think I definitely understand you know the apprehension. A lot of people see you know, especially with people on ebikes and things zipping around going on the sidewalk going the wrong way down the bike lanes. There's definitely a lot of sort of anti- social behaviors like this. That, I think, are you know really concerning I'd just like to point out. You know a lot of the reason for these behaviors is because, up until now, we've given pretty much all of the road space, all of our public resources to prioritizing parking as many cars as possible and moving as many cars as fast as possible through the city. You know, if you look at a street like sixth avenue people were sort of complaining, you know not everyone. Obviously, a lot of people supported it, but a lot of people were complaining about the fact that you know DOT recently added the protected bike lane up north of harold square, all the way to Central Park and took out a lane of traffic for cars, even with that lane of cars removed. There are, I believe, four through lanes, two parking lanes and those are for the exclusive use of private automobiles and occasionally I think they have some commuter like the staten island buses that run there right, but primarily that space is entirely used for cars. That's you know roughly 65 feet out of the 100 feet of the road bed. Eight feet goes to bikes and then the balance is, you know, split into two sidewalks of like 18 feet each. So, despite the fact that pedestrians are 80 of the traffic and then bikes and cars are both very insignificant, small percentage of the traffic, the entire street looks like it's a speedway designed for cars, and you see that you know the speed limit's 25 miles an hour there. I would hazard a guess. You know. Maybe 30 percent of people follow the speed limit at any given point, and if you ask, if someone drives up Manhattan two miles, did they ever break the speed limit 99 chance? They violate the law during that trip? I definitely think that it's important you know bikes should follow the laws, but it's also important to note that the traffic laws as written right now were designed solely for the purpose of expediting car traffic. You know if we did not have cars going 30 40 miles an hour. We would not need traffic lights at all. You look at places the Hudson river greenway. You look at places where it's just bikes and pedestrians, and everyone ignores the traffic signals. Pedestrians ignore them, bikes, ignore them and no one gets killed there. You know bikes are roughly one to two percent of trips in the city and yes, as Joel mentioned, since 2014 seven people have been killed by cyclists. I believe two of those were people falling off their bike and killing themselves, which is still unfortunate, but I think five people have been hit and killed by bikes in the last six years. In that same time, one thousand five hundred and two people have been hit and killed by cars. So even if we say, let's multiply the bike number by a hundred and say every single car trip is replaced by a bike trip and they're all driving, just as dangerously as the Maniacs and E- bikes who killed. Seven. People multiply that by 100 we'd have 700 deaths, which would have the number of traffic deaths in the city. If we did absolutely nothing to improve the safety of cycling in the city and people were just driving like idiots. In that case, you know that would be a massive improvement on the status quo. We would have half the deaths and then, of course, you know think there are definitely things we can do, but I just want to put into perspective that you know. Even if you know this cycling, it looks dangerous, but it's significantly safer than the suvs and the taxis and the people in cars and buses and the 55-foot illegal trucks driving through Manhattan every day who, in the last three weeks, have, I believe, killed 15 or 16 people, which is more than the last seven years of bikes. Thanks for your thanks for your comment, Andrew yep. Thank you again so once again, unless there are any more comments from any members of the committee, you know I once again, we have not traditionally adopted a position on each new individual CitiBike station, that's proposed, but I think this question of enforcement is something we should continue as a community board to not endlessly, but sometime pretty soon figure out what new or more creative actionable items we can. We can come up with to again. Above simply, writing a resolution and addressing it to DOT or NYPD, which has not been effective up till now. I think I think there are a couple options in front of us. I think number one there's this budgetary option and the that specific reallocation to DOT may indeed come before us as something that we could adopt this month. When bex presents our pretend potential proposals for to pass along to the to the city budgeting process. So that's one potential new option. I think I think a separate one would be to either engage NYPD in a new way or more specifically, probably engage our city electeds along lines. That Sam was talking about in terms of creating new enforcement mechanisms legislatively which may not exist right now, but I think I think we do need to start to get creative, because DOT and NYPD, for various reasons, are not currently empowered or funded to do the type of enforcement that we're that we're asking for and at that. At that point, it might became become a legislative or political question for us to use our voice to atta to address, instead of instead of just prevailing on the city agencies as they're currently constituted anyway. If there are no other comments from members of the committee, thanks D.O.T for the presentation, we'll particularly look for that follow- up of once you've once you've adjusted and reassessed based on the comments and concerns that were heard tonight, as well as the kind of misallocated boundary we'll look to see the follow- up, slides and we'll distribute those to members of the committee. Thank you with that. We'll move to the second item on the agenda, which is also a presentation by DOT on Lexington avenue, temporary pedestrian space update thanks Ej. This is kimberly from the Manitoba commissioner's office. We do not have a full presentation but similar to when we presented our temporary protected bike lanes for 38th and 39th. We just wanted to kind of give you a brief overview of our plans and give you a chance to ask any questions. So this is our sort of latest response to Covid-19 in your district and the idea is to create a temporary sidewalk extension on Lexington avenue around grand Central, which is an area that we were looking at for improvements even before the pandemic, and we do plan to pursue a full street improvement project here in 2021. But after doing our normal outreach process of coming to you guys with a full presentation with all the details. But at this point the roadway has been or is being resurfaced this month and we have a chance to create some space for social distancing, as people are coming back to work in this traditionally very busy area. So our idea is to our plants. Actually, I should say, are to put in a temporary pedestrian, sidewalk extension and we do have. Hopefully, Casey is still on the line and able to talk through some more of the details, but in general the idea is that for the western lane, along the curb between 42nd and 47th street, we would shift the curbside bus lane. That is currently there over into the westernmost travel Lane and extend the sidewalk out, and we do have a cross- section I think available. If that helps, if that's able to be shared, I do not know if casey you have anything you want to just kind of add or if you guys want to just go right to questions it's a fairly straightforward, temporary project. We just want to be able to create that space yeah, I'm just trying to pull up the cross section, because I think it'll be helpful. I think Luke has it as well. If I had sent it just before the meeting to Luke and Marisa, so they might also be able to pull it up. Casey. Are you able to share your yes? I can so, as kimberly stated we're just looking at doing a kind of quick and dirty sidewalk extension on the west side of Lexington avenue between 42nd and 48th street. Doing this as a very light touch treatment just because we're taking advantage of the resurfacing so not doing any intensive changes, we're not doing any signal changes. Any parking changes just adding in the double white line, with flexible delineators, to create the painted sidewalk space and then following up next year, with a full proposal that we'll bring to the board and electeds for review. Thanks does that? Does that wrap up the information you wanted to present us with? I think so. We're happy to answer questions and just have a discussion around it. That way. I do not think we have anymore. It's a pretty. It's not a lot of details to add at this point. Okay, thank you. So I've got this would take place on the western lane of Lexington between 42nd and 47th street, and I you know, I guess my first initial question is: what have you studied in terms of the obviously we're going you'd be going from three travel lanes to two? What do you anticipate as being the effect on traffic capacity for the street by losing that travel Lane is? Are the travel lanes underutilized? Do you have any sense of how many cars per hour or any metrics take place on those five blocks right now, yeah so currently about a thousand vehicles. Use the three travelings in the peak hour, we typically assume under good conditions that 500 to 600 cars can fit in one lane in the peak hour. So going down to two has pretty minimal impacts to general traffic patterns. There are, of course, you know busy days that are kind of one- offs throughout the year, where sometimes there might be higher volumes for kind of random reasons, but we actually fully studied this. We were hoping to come to the board this summer for the full proposal, but due to Covid-19 and shifting of priorities for response, we delayed it for one more year, but we're looking to kind of get some of some of the advantages of the project as part of the repaving and for the winter season as more and more businesses reopen. But in regards to traffic impacts, we do not see any major impacts to level of service or cues for vehicles. Do you just clarify, on the extent sorry real, quick it the pedestrian space? In case you correct me if I'm wrong begins at 47th, but just to be totally clear. The transition for buses would begin on the block before that, starting at 48th. Yes, we need a block of like kind of transitioning the bus lane over from the curbside to the new bus lane. Okay, thank you and you have numbers at all on the on the amount of pedestrian traffic that currently takes place on those curbside blocks yeah it's in well. This is pre- covered. Obviously it was up until almost 7,000 people per hour on the sidewalk. The majority of them on well, not like a huge majority, but about 55 percent are on the grand central side. We have not done any pet counts during the pandemic, just due to resources, but this was a project. We've been working on for quite some time, so, okay, thanks and one final question and then I'll open up to members of the committee. The treatment that the light touch treatment that the temporary treatment that you're talking about here is a painted, sidewalk and collapsible dividers. Am I am I missing anything or is that pretty much what it consists of? That's what it consists of at this moment we originally were contacting the bid to see if there was anything else we can do, but I think those are still ongoing. But again it's not proposed currently, as actually painted right, just as the it would still be plain asphalt with flexible delineators and a stripe like a is that still the pen yeah the section's a I it's a little misleading, because it's we call them painted sidewalk extension, but there won't actually be the traditional like tan paint that goes down in all of our other projects. More like the temporary bike lanes, where we have not put down where we did not put down green paint until it was a full project that way when we're working through the details and the design and we're able to come to you and get any you know additional feedback or comments, we can incorporate that we would not want to put down that paint at this point. Okay, thank you. So open it up to members of the many now to ask questions. I'll, just preface this by saying my understanding is that the temporary treatment that we're seeing here is somewhat yes, the temporary bicycle treatment that we saw on that was presented to us and implemented by DOT on 38th and 39th street this summer, which is to say that to do a temporary treatment like this D.O.T does not really need an opinion from us and does not need to come to us, so they have obviously traditionally come to. Let us know that it was taking place, but there is not a traditional like necessary waiting period for doing a that. They would need to do to do a permanent treatment. So my understanding is that what we're seeing here is more informative. This temporary treatment can and will go forward without any waiting, but that DOT will come will after this, temporary treatment has been in place and studied. The DOT will have to come back to us with the full plan, probably for our position on what a permanent reconfiguration and permanent treatment of the street would eventually look like. So, okay, thanks with that context, if you've got a question for members of committee, please feel free to raise your hand Noah. Yes, I have a question about the bus stops. If a passenger wanted to board the bus, would they have to step into the temporary sidewalk and then walk those 10 feet to board the bus or are there kind of certain places where the bus can come in? That's a great question so for ADA access we're actually going to be dropping the sidewalk space at bus stops for the temporary project, so the bus will be able to pull to the curb in the long term, plan we're exploring other options to make a continuous sidewalk treatment, similar to what we've done on 7th avenue where we have the rubber bus borders. But that's not something we can do at this time. So the painted the sidewalk space will kind of go away at the bus stops and then come back. So it's not a continuous treatment for the entire stretch. Okay and then I just have one more question in terms of any passenger vehicles trying to make a riot, I believe, on 45th and 42nd streets. Would they come into the bus lane and then make that right or would they be forced to kind of you know, cut the buses off? What is what's the plan currently it'll be the same treatment for all of our bus lanes where right turns are permitted from the bus, bustling, so there's a dashed line prior to the intersection where cars can move over and then make the turn, which is kind of which is a very standard treatment that we do. Okay. Thank you thanks now for the question. Are there any other questions from members of the committee about what we've seen the zoom has been a little bit flaky for me tonight, so I just want to make sure I do not see any other questions. Ej. Okay, thank you with that I'll open it up to members of the public who are in attendance. If you have any question or comment, please feel free to use the raise hand, Fred Cerullo fred. You should be able to unmute yourself there you go yeah Ej. Thank you so much it's good to to be here and to listen to the discussion. I just wanted to add, because I know the bid was referenced just a minute or so ago that we appreciate the outreach by DOT to us, and the committee should know that we have done outreach to the property owners and businesses along this stretch so that they were aware of what was going on to try to solicit some feedback so far so good. But I also wanted to say that once the even this temporary plan becomes clearer to us, we will be happy to work with DOT about what we can be doing, perhaps to create a nicer experience for people using the space, as I'm sure you all know, at 43Rd, Street and 44th street, on the West side. Now, there's a pedestrian area bump out from the curb line where we were able to work with D.O.T in providing their planners and our plantings, and once we know what the design of this is and where these sections exist and then where they might taper back to the curb, for whatever reasons we'll figure out what we can do out there so that the area looks nice and the neighborhood looks nice for those people. We miss right now and are hoping to return very soon great thanks for letting us know any other comments or questions from members of the public in attendance, not seeing any. I guess we will wrap up this section of the agenda. You know once again, as this is a temporary treatment and D.O.T does not need our sign off on. It will move forward regardless, but you know I guess my final question for DOT would be how long of a trial period you anticipate this being and at what point do you anticipate perhaps coming up with a a plan for a permanent treatment? Do you have any time frame on that at all and understanding that we do not even know how long the pandemic will last at this point, that might be difficult yeah with all of our temporary projects. We have not had any end point given at this moment in time, so it's sort of we're ongoing evaluation and we'll have to get back to you on that. But, as far as you know, the goal is really to come with the permanent project, there's a lot of benefits that can bring beyond the temporary project. So I believe in case you can correct me if I'm wrong, but we're looking to come this winter at some point or early spring yeah. We have a few more things to work out and then we'll be coming to the board. It certainly can't get implemented until our next implementation season, but we would probably be coming before that begins. Okay, thanks very much kimberly and Casey and to DOT for both presentations tonight. Thank you with that. We'll move on to the the third item in the agenda, which is in reference to reviewing a budget proposal to create a director of the public realm position within the New York City Administration I'll I'll. Give this a little bit of context, and then we can sort of just have a an open- ended discussion. It's it's once again, it's something! That's analogous to similar discussions of a potential budget priority that have been had by multiple other committees in CB5 already, I believe, parks and land use have already discussed this proposal, and now we as Tne can discuss it here as well. The other committees did not adopt resolutions or official positions, but as with the other potential priority budget priority, we were talking about earlier tonight. There's the potential for this to be part of the package of budget proposals that comes out of bex and which we as a full board becks themselves. As a committee meet tomorrow and as a full board, we will probably be presented with a with a full resolution to vote on this month. This proposal for a director of the public realm position I sent out to the committee members a a link to the proposal as written up by the municipal arts society. The idea is to create a a role within New York at City, Administration thinking about the public realm and the interconnected aspects of the public realm. My best understanding of this is that you know right now: the public spaces that exist within parks and the public spaces that exist within commercial buildings as pops and the commercial spaces that and the public spaces that exist within our within our streets and roadways as much as they're, considered by different committees on CB5 they're, also considered by different agencies within the city, and thus there's not a singular vision. There's no one thinking about a single vision of how they're interconnected and what data flows between all those different public spaces they are. They are separate, fiefdoms and their separate silos within our city government. So the proposal from the municipal arts society, and which is proposed to become a full- fledged funded position within New York City's administration, is to create this director of the public realm. Who would be enabled and empowered to think about that interconnected vision of public space for our purposes? You know we have these different committees that have different jurisdictions, but those different committees could interact with that one role as they would other city agencies. So you know we bring this to Tne as it's been brought to parks and land use as a as a proposal that could indeed be part of the budget priorities that back specs ends up bringing to our to our full to our full board and generally for awareness that it's something that there is a a large advocacy push around for the city to actually adopt, as part of the next budget process, certainly wanted to open up the Florida to any comments or questions from any members of the committee. But again this is a. This is a potential budget proposal that we that we know is being talked about. It's not something that we need to take a position on tonight, but wanted to make the committee aware, as other committees are already aware and open it up to any comments that folks may have. I have a comment sure go ahead. George and you've- probably gotten awfully tired of hearing this from me for you for years that we need a comprehensive street use plan and it's clear that the responsibility for the street curb to curb is a public responsibility. We're not talking about these other additions that are desirable and so forth, but we do not have an approach to dealing with that itself. We discussed several items tonight that could have fit into a into an overall view, but they do not. They are not so I think we're still a long way from having a commitment to having a comprehensive street use plan, and it would seem that the DOT, as the agency, that's responsible for the curb to curb public space in our city, ought to be the leader in that I'll end. My rant there thanks George Yep. Certainly can't can't disagree with any of what you said: Ryan Whalen, so I am supportive of this idea. I think these kinds of integrated roles are becoming increasingly common in in executive government in city governments and state governments, and they really seek to cut across Silos and I think, there's a lot to be said for them. The concern that I have about any role like this is that they number one are given roles and responsibilities and resources to go. Do those things and then also that the public and stakeholders interact with them in a way that elevates them and puts expectations on them to deliver on those roles and responsibilities. So if and when we make any advocacy around this, I think we should emphasize the importance that we take their roles and responsibilities seriously and then also that we, as a committee, you know, give this role a shot and make sure that we are inviting this person to participate in our proceedings, that we are directing questions and inquiries to them and that they are that. You know we they're important things that this role would do and that we ask and expect them to do that, but I am supportive of this and hopeful that it comes to pass great thanks. Ryan Jordan, thanks Ej agreed with Ryan that, if we're going to do it, let's do it if we're going to do it, let's do it well, but my question is: I did not see this and I may have missed it, but I always like to ask how much is this going to cost? I assume it's not a trillion dollars, but it's something and with the state of the budget as it is today, not saying no, but I'd just like to know how much exactly are we spending it's a good question. I do not have the answer to that. On my hand, I do not know if anyone has information put into that and if it was not included in the in the Mes proposal Pdf, it might not be a specific dollar amount at this at this time I do not. I do not have an answer to that. I did not see anything. I could be wrong. The other point similar to the money is that I would hope that whoever, if this is approved, if out, adequate funding, is allocated that a job like this would go to someone with some sort of expertise, not another patronage position which we've had problems with the elections, as we all know, and the board of elections yeah. I think those are. I think those are both excellent points. It should be. It should be constructed such that it's you're getting a qualified, a municipal expert of public realm and not and not a patronus position, and then that person be not just a figurehead but empowered to have influence on the other agencies with which the public realm weaves in and out, as opposed to again just being like a symbolic gesture of someone to come to our meetings, but who ultimately can't respond to any of our concerns or or ideas. I would, I would definitely agree with both of those points: 100 dare to dream right, yeah any other, any other comments or questions from members of the committee right now, all right. At this point, any questions or comments from any members of the public who are in attendance and seeing none that will probably wrap up our discussion on this topic. You know, as I mentioned it's a topic that has also been discussed in other committees of CB5 this month, and what we're, what we're likely to see at our full board meeting this month, that the entire board will vote on is, is a package of budget priorities to be to be adopted and passed along by CB5. So you know, I think I think it'll probably be incumbent on all of us to pay close attention to what comes out of becks this month. And then you know, as I think happens every year, we'll all want to make sure as a as a full board that what has come out coming out of the budget backs. The budget committee is reflective of our priorities and our sense of what the city needs from all the other committees. Even though it's coming out of one specific committee bex, it certainly relates to all of us, and it's perhaps even more than usual, something that even if we're not on that committee, we should all be paying attention to with that. I think that concludes our agenda for the evening. So I just want to say thanks for everyone for for coming out, and I think that pretty much wraps it up, everyone have a good evening. Thank you.",
            "summary": ", I'm, the chair of Manhattan, Community, board, fives We, have three items on our agenda: Tonight: two presentations by the New York City Department of Transportation, and then one discussion amongst the committee members without any further ado.\nThat point I will open it up to members of the committee to ask questions and then, following that to members of the public, to ask questions or to make any comments that they'd like to make from there We'll move into a business session where the committee and only the committee members will have an internal discussion around the topic and though I do not currently anticipate this for any of the items on the agenda tonight to potentially take a vote or any board action and then from there.\nWe're, all looking forward to continuing to work with you and the board members on our Midtown projects: I'm joined here by my colleagues, Brian Peret and David Andrew from the dot's bike share program as well as colleen chatterboon from the Manhattan office, who many of you also have the pleasure of working with Kimberly, Rancourt and Casey.\n3 expansion in Manhattan started this spring when we expanded into new neighborhoods uptown, but we're also focusing on adding new stations and more dock capacity into the existing service area, including here in Community board 5, to help support the demands of a larger system.\nLet me know if you can't thank you again, thanks for your time, I'm Brian Peret and with the DOT bike share program and again here to discuss You, like infill in CB5.\nIt's, going to support increased demand from phase 3 expansion meet unmet demand in the existing service area and Installations will be rolling, so they may cover multiple community boards at a time, and really this is going to be an iterative planning process, we're going to try to be nimble and address changes in the system as demand.\nThis is going to be focused on demand, we're looking to try to where it makes sense, Max out space, that we have existing and also add new stations where we feel like it makes sense, got it.\nWe will be notifying both adjacent property owners and through the borough, commissioner's office, notifying community boards great and then just a quick follow-up to that Is. You know things may change, of course, but do you have an expected rhythm of how often you think we might hear about new additions?\nI actually have sort of a follow-up question to that which might be more backward looking than forward looking, but I am curious whether or not you can speak to have any current stations or how many current stations, if any, have been relocated as a result of say the need for a restaurant or a business to sort of reclaim that sidewalk space during Covid-19 once open streets started for the purposes of say that business having to needing the space to stay in business were any, were any existing stations, relocated or moved to this point, we've only relocated and really not even relocated.\nYou know this infield process has really taken a need to kind of re, examine everything whole cloth when we started this process, we really, especially for each community board, we're taking a real blanket look at everything again and looking for space where, where it's available, so I would say, for these sites.\nIf you're in attendance-That was a great presentation and I'm especially interested to note that the news station, which was discussed to go behind fit, which would block the loading dock, we're now going to be forced to use for three years while we hooray finally build our new academic building May I report back to my people that it is not in the current plan, hi Lisa good evening.\nYou know transportation committee last week, but there are a few kind of like updates that I wanted to share with you.\nI just want to know just the Department of Transportation have any plans or any method for enforcing existing bike laws.\nThanks for your question, you know we work hand in hand with the local precincts and the NYPD to enforce our traffic laws, but in terms of our CitiBike and bike share expansion into Midtown, I'm, hoping that Brian can elaborate more on our education and outreach campaigns that we're looking to do with the increase in ridership, as the CitiBike system.\nWe have learned over time that, while D.O.T certainly can can fund and take it on themselves to do education initiatives as much as much as the committee has is on record saying many times that enforcement of bikes needs to be totally rethought and revamped that the city currently does not fund or give the authority to DOT to do that.\nIt's, not so much a question of engaging with DOT to change that priority, but Probably, with the way that the city allocates that reso those resources and jurisdiction-And I know there is a history behind the fact that some of that enforcement authority might have lived with D.O.T in the past, but for something like 20:25 years.\nAs Brian had mentioned earlier, we are working on a lot of education campaigns and initiatives with our partner Lyft to ensure that all writers, whether they're new or you know veteran cyclists, continue to follow the posted, and you know, traffic bike rules for New York City.\nAgencies seem to feel both empowered and willing to change the way that they are currently enforcing kind of how some of the street use like like the bicycle lanes and the conduct of bikes in general are being are being done.\nYou know in the terms of a bike lane going in and, for example, an infill.\nSo you know, I think, that concept of reallocating parking and traffic enforcement dollars could be part of the proposal that bex brings Become before the full board and thus something that we could potentially vote on, but again very interested to hear if there are kind of other ideas.\nMy only concern with the budget process and the allocation of dollars from NYPD to DOT is that when it comes to on the street, enforcement, I would think that the DOT would have the same problems that the NYPD has there's a bicyclist going 15 miles an hour down the sidewalk, the wrong way.\nOther members of the committee who have any comments on this issue-again, I, we You, know kind of influx proposal, as was presented by DOT tonight, but again just want to open it up to discussion and ideas.\nThat would still need to at that point, like ticketing of those city, and you know, CitiBikes, causing infractions.\nBetween, as we have discussed in past committee, meetings about people who are using bikes for a living and trying to deliver food-Whoever has that enforcement capability, which again, I believed to be NYPD at the current time.\nI. Definitely think that it's important You know bikes should follow the laws, but it's also important to note that the traffic laws as written right now were designed solely for the purpose of expediting car.\nThat Sam was talking about in terms of creating new enforcement mechanisms legislatively which may not exist right now, but I think I think we do need to start to get creative, because DOT and NYPD, for various reasons, are not currently empowered or funded to do the type of enforcement that we're that we're asking for and at that.\nThis is our sort of latest response to Covid-19 in your district, and the idea is to create a temporary sidewalk extension on Lexington avenue around grand Central, which is an area that we were looking at for improvements even before the pandemic, and we do plan to pursue a full street improvement project here in 2021.\nWe were hoping to come to the board this summer for the full proposal, but due to Covid-19 and shifting of priorities for response, we delayed it for one more year, but we're looking to kind of get some of some of the advantages of the project as part of the repaving and for the winter season.\nThe DOT will have to come back to us with the full plan, probably for our position on what a permanent reconfiguration and permanent treatment of the street would eventually look like.\nBut I also wanted to say that once the even this temporary plan becomes clearer to us, we will be happy to work with DOT about what we can be doing, perhaps to create a nicer experience for people using the space, as I'm sure you all know, at 43Rd, Street and 44th street, on the West side.\nWe'll move on to the the third item in the agenda, which is in reference to reviewing a budget proposal to create a director of the public realm position within the New York City Administration That's, analogous to similar discussions of a potential budget priority that have been had by multiple other committees in CB5 , already, I, believe, parks and land use have already discussed this proposal, and now we as Tne can discuss it here as well.\nSo I think we're still a long way from having a commitment to having a comprehensive street use plan, and it would seem that the DOT, as the agency, that's responsible for the curb to curb public space in our city, ought to be the leader in that I'll."
        }
    }
}