{
    "data": {
        "YoutubeMetadata": {
            "author": "BXCB11",
            "channelId": "https://www.youtube.com/channel/UCNZyLULUQBp5e9Q1cKtvk6Q",
            "title": "Leadership Committee 11/2020",
            "publishDate": "2020-11-17",
            "shortDescription": "",
            "lengthSeconds": "0:44:12"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BXCB11",
            "normalizedName": "Bronx Community Board 11",
            "twitterName": null,
            "youtubeChannelName": "Bronx Community Board 11",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCG-BOeUcviapIkDFQfxLuiA",
            "twitterHandle": null,
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "vGBNE3rllzU",
            "fillerWordCount": {
                "uh": 91,
                "um": 77
            },
            "readTimeFullTranscript": "25 min read",
            "readTimeSummary": "3 min read",
            "wordCountFullTranscript": {
                "leadership": 20,
                "calendar": 12,
                "business": 10,
                "chair": 8,
                "report": 7,
                "problem": 6,
                "public": 6,
                "guest": 6,
                "attendance": 6,
                "chairman": 5
            },
            "wordCountSummary": {
                "leadership": 4,
                "report": 3,
                "order": 2,
                "meet": 2,
                "guest": 2,
                "statement": 2,
                "calendar": 2,
                "boards": 2,
                "times": 2,
                "chairs": 1
            },
            "fullTranscript": "All right so tonight is November 12th Thursday, November, 12th 2020. it's 708 pm. This is the leadership Committee Community Board 11. we have a Quorum Yahoo beat. Is the chairman of the Committee yahei see you wait hold on? Do you want me to take minutes for this, too? Are you? Okay with that hazel yeah? It's fine all right! Thank you appreciate it. That was going to be the first thing. I was going to say we're going to have to get hazel metal, so thank you, Hazel! That's I was going to start off with that and that's something we discussed in the previous meeting so going forward. I spoke with Pat a couple of weeks ago. I'm recommending that all the chairs, when they start their committee meetings, they assign someone to take minutes just to take the load off of them. That's just a recommendation. It's not in the bylaws or anything we're not asking all the committees to have a secretary position other than the chair or the co-chair, but just assign someone to take the minutes take turns it shouldn't, be one person every time so for this meeting. Thank you. Hazel for bringing that up and for volunteering to take the minutes next month, we'll rotate it. So it's not you for doing it for every leadership committee meeting anything on that from anybody, or does anyone want to say anything on that? Yes, in individual committees, if there's a person that wants to do it, what's the difference, whether that same person does it always well? That's fine, it's just I would recommend spreading it out. You know just taking turns if the same person wants to do it all the time. That's fine, but I think it benefits everybody. If everybody takes turns and I did subject, I did suggest that at our Parks Committee meeting- and we did- we didn't get a chance to vote on it because we didn't have enough of the committee in order to you know to be able to spread it out, but we did table it and we'll go come back to it in January, but once we do that, you know we will be. We will have minutes, but we do want to record it and as well as make sure that it's written out, yeah and I, don't think you have to vote on it at the beginning of the meeting. Just ask: would anybody like to take minutes and if nobody agrees, I think correct me? If I'm wrong Al or someone else you can the chair assign it to someone well I didn't want to do that. I just wanted to because I know some people are shy. Some people don't want to do, but I feel if it's rotated, that more people will get stronger at doing it and it won't fall on just one person, yeah I, agree, but I think next time, if you don't get any volunteers, just assign someone to do it. Okay, everybody hear that okay, I can I ask something: go ahead: Prana! Okay! In the past, since we reported these meetings, nobody wants to do the minutes. I believe it was assigned to Harriet or Lasky, am I wrong, Jeremy saying that's the General board, that's the General Board or committee meetings, even committee meetings, usually when the committees or when it the committees or in the past, passed when the secretary of the board failed to live up to any type of responsibility. Yeah, we try to pick up the slack yeah, honestly, I, don't think we should leave it to Harriet, because Harriet might be doing other things. The committee needs to take responsibility for their work. We are getting a lot of FOIL requests for the minutes. We need to attempt to be to come back in a timely fashion because they have to be posted within two weeks and I. Think a week is appropriate. That would give the office about another week to make any edits and to upload and upload them to the website. Okay, now I'll do that. Well, yeah I feel that it should be the responsibility of every committee to do their own minutes. I, don't see why Harriet should have to do everybody's minutes, and you know, in addition to all the work that she has to do for the office. I mean we're adults, and you know we like I, do my minutes. I have my own shorthand I write them out for her and I send them to her, and you know, that's I feel that that's my responsibility as co-chair of my committee and I, think that every committee should take up the responsibility of doing their own minutes. I agree I used to when I do manage, for economic development, I, take them at the meeting and I shorthand them and then I format it and send it properly to the to the office and all they have to do is just post it anyway. I have no problem because I'm lucky enough to have a person that likes to do it and does it on a regular basis. So mine doesn't matter with me good for you, okay, so well, we'll move on we'll go to item number one in the agenda, which is the October leadership meet in minutes. It was my fault. I did not prepare the minutes. I did not take notes, I guess it was my first time last month and I was nervous. I usually take notes in my other committee meetings, but this one was a little different, so I didn't take the minutes. I captured as much as I can I sent them to Jeremy prior to this meeting. So it's going to be a little bit before we get the minutes to even vote on them because we should be voting on them this month. So I know someone raised the issue that every committee meeting- the number one item should be reviewing last committee's meeting, but when we have to do them within two weeks we post them and then we review them after we've posted them. So then we'd have to go to the website and then make edits, so our hands are kind of tied. So basically the minutes have to be close to perfect. If not perfect, I don't know, if all that makes sense, so I apologize again I. Don't we don't have the meeting minutes to vote on them today, but Jeremy when you have a chance, can you send them to everybody at least we'll have a record of them? Yeah I didn't get your email, but so just double check that it actually went through I know sometimes board members. They forgot the attachment or anything like that. It could be a sentence. Draft yeah and also I was going to you know. I talked to about having one of our interns help us do the minutes, but the recording was terrible. So we want to make sure we get good recordings. Yes, the hard part of doing minutes from recording and I know Harry went through. It is the fact that you weren't there, so you don't know what the nuances were and what was meant by certain things. That was said somebody who's doing the minutes. That's at the meeting can cut right to the quick and get the you know, get the get. The word we're verbiage. Of course, without too much you know a fluff, so you can cut right to the bullets and boom rather than Harry, would have to listen to the whole tape and try to make decide for what was being said, especially when people were talking over each other, so that makes this makes it a lot easier, yep. So all right, so, even though we publish them online, we can always change them. If there's you know all the time, I catch errors, I caught an error for the ethics Committee agenda. That said, it was on a Monday meeting when it was a Tuesday, so we will I do correct those things when I catch them. Yeah I, don't know why Tuesdays feel, like mondays to me, but I feel like every day is a Monday except Friday nowadays. So all right. Thank you all for your input, we'll go to item number two, which is a conduct at public meetings, statement that we went over and we made some corrections. We got some good feedback from Ken and Jeremy I think we came out with we came out with it. We did not discuss it at last month's general meeting because we were just so backed up. We thought we would table it to this month. So I don't know what we can do with it at this, since we already discussed it Jeremy. Do you want to pull it up just to get everybody's so did we vote on it? Last time or yeah? We voted on it last month and then we tabled it at the full board meeting and then I know I sent you my proposed edits. I, don't know if anybody else touched it after that. Do you remember I, don't think so. I can share it. I mean I got the track, changes, that's what I have right now. So if that's large enough for everybody that good it's fine, so the original is not in red. The red is my proposals. We did get a member of the public more or less suggesting this, but even though I made these changes basically a month ago or suggestions a month ago, I can make all the track changes. So that just disappears. If you want, if that's easier for everybody to view. What's up today, you guys Jeremy you're, breaking up hold on I, got ta, stop sharing my camera, yeah Jeremy I. Think we're good with that. If you can email, it I think the issue was not enough board members last month had a copy of it. Can you email everybody, the final copy, yep? Okay, let me let me just accept them yeah and in the email tell them to review it. So we don't take too much time on what next Thursday. So everybody would have read. It wrote down some things that they think about it or any edits, so we can just go ahead and vote on it. So one thing I want to. If you don't mind, one thing I think worth bringing up is so originally it was electioneering and solicitations. So I had a conversation with Kenny following the leadership meeting and last full board meeting, and so he was concerned that the solicitations thing would turn off a not-for-profit from coming to us when, historically, we've never allowed businesses to promote regular, like sales like, like we've, never allowed businesses to come and speak in our gallery sessions. Unless it's like they were doing a free event. Unless it was something unique, but that's something we should consider adding back in there, because if we don't have that in there and then we stop people at our full board meeting and they're going to say why and it might be a problem yeah and that's why that word was taken out so I think it's fine the way it is now it's up to you, I mean it. Doesn't we still aren't prohibiting? So basically you know I, don't look. Maybe we won't have a problem. Maybe businesses won't come to us because I historically haven't because we shot him now, yeah I say leave it alone. Well, once we have, that is true, then we'll we're trying to address one issue and that one is not priority. On this list, so yeah, okay, so I'll email us an entire board, as it is all right. Thank you Jeremy and then you want to go to next yeah. If no one has any anything else on this we'll go to item number three, which is the draft November full board agenda. Jeremy. If you can pull that up, can you view it I? Don't I'm using my phone? Unfortunately, right now we I see the original one that you just post a few minutes ago. Let me pull it back up, hold that yep. Okay, so chairman's treasurer secretaries, I, just emailed off the full board minutes from October, so you get a chance to look at make sure there are no errors. So I don't know! This is a motion that was voted on at October. So do you want to keep it like that yeah, hey motion to publish after I send it out email it out, yeah, okay, any motions! Currently, you know we may have a motion from public safety, community development or ethics because they're meeting next week, but that aside I, don't think the other committees had any emotions am I wrong about that transportation did not. Okay and housing, I, don't believe I invited as a guest speaker, Jeremy I invited a guest speaker Sean the same person that came yeah to my committee meeting. Okay, so because I think it's important that he make a presentation for the full board, so I'll reach out to him about speaking in the gallery, because right now we only have Miss Delgado Jesus, okay, he might need more than two minutes, though, because well I don't think we can I finish yeah. Sorry, okay, I think it's very important that the community understands exactly what the program is, and you know because it is coming into our community. So I don't know if he can do that in two minutes and people are going to have a lot of questions because questions were brought up at the committee meeting. So that's why I had invited him as a guest speaker, the guest speaker could come to your committee, but full board. We usually don't have guest speakers at a full board meeting the way we can get around it is when they make their presentations for two minutes. If you ask a question, that's appropriate for them to continue, then they continue explaining to you and finish off their their presentation. But if you know guest speakers usually come to committee meetings and not to a full board meeting. Okay. Well because of the nature of the program I, you know I thought he should make a presentation to the board, but it's okay. I can have questions ready for him. What we've done previously the person goes for two minutes, then they're stopped and then does anyone have any questions and then someone I've seen it where a board member says yes, I have a question: can you finish saying what you needed to say and then they can probably go on for another two or three minutes: yeah we're not going to have a problem, getting questions from Edith, Blitzer or maybe Andrea I, don't know! If you'd have a questions, I can or Sandra younger I know. She'll have questions about this place. I mean it. Sorry came up at a parks meeting just from what I know so and historically hazel. If there are enough questions, the board may waive the may vote to waive the time limit or the rules and have more than four questions or comments. That's what usually happens. Okay, that's fine! Jeremy! Excuse me, I have no idea what Hazel is talking about. Sorry, can you see my screen? No, so Sean Coleman who's an organization from destination tomorrow at 2134 Barnes. This is okay, I know. What's going there, okay yeah! This is the new program. I know what's coming in there. Thank you, yeah, okay and it's in the minutes of Hazel's meeting I did send them to the city. I, don't know if you had any corrections hazel, but I will put that I'll have Chris put down the website tomorrow and then I'll reach out to Sean. Okay, thank you. I and I do not have confirmations yet from elected officials. Mark Jonah is maybe coming himself, maybe not I. Don't think anybody's really confirmed yet, so that's really it for the full board agenda. Unless I'm missing something. Should we put attendance in there to talk about attendance yeah under your report now, because that would be fun that is handled by the Executive board yep, and can we put the second vice chair position on there, yeah, which one first Al he does second vice chair first and lastly, I think one more thing: I'm giving a lot of things on this agenda and Al. Do you want to talk about minutes and so I know? We have the leadership. You know committee here, but it's nice for the entire board to know that they can expect to be assigned to take minutes. If no one volunteers, yeah I, could bring it up or you can on the leadership because of the fact that it was brought up to the leadership committee. Okay, I! Don't want to hold it better matter which one you can move it to leadership. That's fine! So, four nine! Do we want to try to get the four nine at the meeting or should I not bother Jerry? We missed it now for a while. Why can't they could send somebody in the captain's place, because crime is up all over? We should be able to ask: what's going on I'll ask yeah I agree with frano. We really need to have them there. We just had a homicide on Barnes Avenue right around the corner from my new office yeah and Jeremy. No one comes from the governor's office right. I, no comment right, I mean he's right in all these executive orders. He should have a representative to hear from us to get some feedback on his executive orders. I know he's king of New York, but at least send us someone that we can. You know, give feedback to yeah I mean I, can try, but yeah I know his Bronx representatives, Tofia I went back and forth with her last week regarding the executive order on the travel that went into effect. I think November 4th, but she was confused and she gave me wrong information so yeah, that's my contact too I, don't know which one's worse, no information or wrong information, but anyway yeah so but I agree with the yahei. We need to let king Cuomo with a second and know that the communities are concerned with his edicts. Well, I I'll push here. Our last state electeds to push down I mean Natalya used to be the governor's rep for our bro, so she should be able to swing that. So do we need to vote on that agenda or no? So, let's just so. Let me just let's just run it down again real quick run down it. Real quick, just make sure everybody's Joe Thompson joined us here. I'm not sure when, at what point you joined us so a moment of silence, 49 Precinct chairman's report, the by the new bylaw approvals, I'll reword, that high word order pass by law proposals, attendance, treasurer's report, secretary's report, October minutes, which I emailed out my report committee reports, leadership motion to publish the conduct, mean statement that was voted on in October but was tabled minutes I, don't know if you want more than that. If minutes is a good enough reminder for you, Yahay Community development ethics, housing recovered for the gallery, parks, public safety transportation. So we have Miss Delgado Sean Coleman, I'm going to reach out to you tomorrow, maybe Joe 9, the rest of the electeds, not sure an old business new business. Is there a calendar for January yeah? Well, that's the agenda first! So everybody, okay with the agenda. It's going to be office suite again this platform. I know it doesn't work for everybody, but it seems to work for more people than web apps yeah, it's fine Jeremy. The only thing I would do. I would send a reminder out to the entire board or the chair people anyway, to keep their comments brief and if they hand in their minutes, have people read the minutes and not have to read them out themselves. So hopefully we'll get out before 11 o'clock, so maybe should I. Maybe I can put that attack that under you, yeah, hey minutes and committee reports- okay, yes, no or do you want to put it in they really there shouldn't be a reason why we go beyond two hours: it's unforgiving. You know, especially now that I think we're past a lot of technological hurdles. Hopefully we'll see yeah and Jeremy. Can you please ask all the board members send them a separate email? If anyone has any issues with that, let me know, but can you send everyone an email asking them to be on by 6:45, so we start at seven o'clock or 705 versus going 20 minutes into it. Looking on who's in and who's, not okay, all the board members by 6:45. any issues with that from the from this committee with that request, no very reasonable, so very so that handles it shouldn't be 7:10. we're trying to figure out if we have a quorum or not, it shouldn't be happening. Okay, all right! Next is the draft December and January meetings calendar so Jeremy. Who else got that email from Ken was it from Ken? Regarding the December general meeting, what email there was an email requesting that we meet in December I, didn't see that I thought you were included in it. So I got an email saying that all the boards city-wide meet in December except hours. No, it's not true that we should meet in December, so to clarify. The city charter gives us a break in July and August. So technically yeah officially we should be meeting December I know, board 10 also does not meet in December, I'm not sure about the other boards. Historically, we used to meet not meet in January. That was partially because of our chairman at the time, but it was also I've learned is that January can be a really hard month and we've actually had to cancel meetings because of the weather, but that aside yeah I mean it's really up to you. It's really up to we met and we didn't meet in December, because we had the the Christmas Party in lieu of our meeting. We had the we usually had a gathering of a restaurant, Ow, Correction Holiday Party, I'm sorry you're right holiday party yeah, but it's entirely unique. You know what it was sent to Darrell for the equity committee to look into it, so it was from David Levitt. He said the community board 11 has not met in December since 2012. I believe not meeting in December disfranchises, the entire community, the city charter mandates that we meet every month except July and August. And that's what he's saying he's also copying me. So I don't know, is it something that we want to put? Can we put it on the agenda? I'm sorry who sent that email, David, Levitt well yeah. In reality, we did have a December meeting. It was how they party was marked the December meeting. So on the calendar, the December meeting was the holiday party, but I don't know how official that was yeah. It's not open to the public right. No, there's no reason not to have a December meeting. If we're not having a holiday get together, I mean it doesn't. It can be short and sweet. We'll leave that up to the board yeah. Can you put it? Can you put it on the calendar? So not I'm sorry, not on the calendar. We might have to go back to the agenda. Can you place that on the agenda? Please? Well. Does anybody want to make a motion? That's the I guess the real question, because so there's two things that should happen. If we have a full board meeting in December, we should also have a leadership meeting in December to go over to make sure you like what we do now go over the agenda and then go over to the calendar for January no yeah. Let's do it I think you know. Committees are one thing if they want to take December off, but if we're mandated to meet 10 times, with the exception of July and August, let's just meet the 10 times, and maybe because we have a lot to cover and we we've already tabled one thing from last month: let's just spread some stuff out. It could be an easy, quick one-hour meeting, so I'm for it. So I'll call for a motion to add a general meeting for December anyone to second it I'll. Second, it okay discussion all in favor all right. Anyone against it any abstentions, all right so that passes unanimously so we'll carry that over under leadership Committee Jeremy for for next week- and you know what league legally, you may not have to vote on that the full board. You I mean I, think that chairman can call full board meeting any time. It's up to you it's up to you, though, if you want to put on the agenda put on the agenda, just put it on the agenda, so we don't forget so everybody's not shocked when we have a December meeting. How about that? That's first yeah I think it would just do it as a statement that we will be having a December meeting this year. That's all okay, good input! Jeremy! Thank you for that. All right, I think! That's! You want to pull up the calendar Jeremy. What hold on so Al just said about making a statement versus a motion to vote on. Would yeah. So do you want me to do it that way, instead yeah just put it under Al? Are you okay under your report? If you can mention it, that's fine! Okay, so I will put the second vice proposal first and then the December meeting and then the attendance that order hell. That's fine, Jeremy! Okay! So let me save that bring up the calendar so then we'll just go over the December calendar versus January I mean we should have a. We should have a a December leadership meeting too right. Let so see this is old. I got ta. Go to this one, sorry, so the only things so I'll just add it after we get done with the meeting so right now, equity is going to meet on the ninth task force. I'm going to have my dsc on the 10th and then so the well. The problem I, don't think we should meet on the 24th. No first I was going to suggest something. I was going to suggest something. If everybody's okay with it go back up a little. Actually, maybe I'm zoomed in. Can you zoom out a little bit? Jeremy I can try yeah I should be able to yeah. Is it better I, just yeah, that's much better. Okay, so can we meet on the 10th for leadership and then meet on the 17th for the general meeting? Do you want an executive board meeting to Al, or do you just want leadership? Just so leadership. Does nothing unless I have something comes up if I have something that comes up, we'll call it, but right now, I, don't foresee anything coming up for leadership for the executive board yeah we could do attendance, but if we can wait, till January that'll probably be better unless you want to do it now that we do in December shouldn't each committee now be informed, while we are here technically to at least put a tentative something in the calendar for our committees, don't put anything tentative. Unless you know you have an agenda, that's because, unfortunately, some committees, they play this game where we schedule it, then we take it down and it's just a waste of our time. So unless you know you have an agenda and you need or want to have a meeting, fine equity is having a meeting. They. You know leadership. We know we're going to discuss the full board agenda. Okay, because, based on one of the emails from my meeting that was sent out yesterday, I might need to have a meeting on the 7th based on any responses which we should be getting some responses. That's on the request and that was made by one of the community people it's up to you friend. If you know you're going to have agenda items fine, but if you're not sure yet I would hold off okay, so you want to hold off or you want to schedule, hold it off, and else I guess you guys going to. Let me know as soon as possible, whether there's a response or not right as soon as we can yeah Jeremy. You can't hear me on this screen sure. Basically, I'm saying you, let me know I think France, you you're, maybe cutting out your audio. Maybe else here Fran on me, fine yeah friend, we'll get up we'll follow up. Okay! Thank you all right. So let me share the screen one more time so equity on the 9th leadership at 7 pm on the 10th. That's a Thursday full board. The following week the 17th go from there may I speak for a moment, yeah, okay! Well this weekend the Parks Committee is going to you know, do some venturing out to check some of the parks and that's the only thing that we would probably have on the agenda. You know if we were going to give a report of what we do, what we've done. You know for that for this month. Well, maybe the next two weeks, two saturdays, so you're having you're, not sure, I'm going to reach out to the Parks Committee and find out. You know, because we did decide to go this Saturday and maybe next Saturday to several parks to check the conditions. So what we will have that to report for December, if we're going to do anything. Okay, so you'll get back to me, yeah, you can always call in the office and just put it on the agenda. That's all okay, honey! Thank you and then I might not be in the office for the next few weeks. Just so everybody's aware, but Harry and Chris will be there so, but you can call myself you need. If everybody heard me, no, you were cut off yeah I, don't when I ever share the screen, for some reason does that so I might be out of the office for the next two weeks, but I will be working from home unless I mean I could use some time off, but maybe after the full board meeting, because there's a lot to do until then I was trying to say keep in mind if you're going to add the meeting that you give a 72-hour notice, so that meeting is published for the public to have access to the meeting. Yeah reality is three business days: oh no, that's 72 hours well! But if it's, if we have a weekend that doesn't count, you know, okay, it can be more than three days all right. So keep that in mind yeah, just as just because of our inability to publish directly to our website. Currently it's really difficult or it can be really difficult, relying on the city to do it for you. So that's the December calendar we will handle the January calendar in December. Right yeah sounds good, then we're on old business, new business public comment, so we're not discussing the second vice chair in this committee in attendance right Al, because we were we pushed it onto this, but we're just going to discuss it at the full board. Yes, okay, so meet and in person versus meet him online for the leadership committee we met in person last month. We got some feedback from folks, so I'm assuming everybody prefers. Does anyone prefer to meet in person? I'll ask it this way: I don't mind doing it in person, but I'm going to go to what the majority of the board is asking I, don't mind meeting in person either yeah neither do I, but I am I'll I'll bow to the majorities and I believe the majority. You know safety first, so for me this Joanne I don't mind, but I have to speak to Tony to find out if it's okay with him and I feel the same I don't mind, but keep in mind all these changes that we mentioned early with the governor making all these changes constantly. So maybe we should just continue like this. Okay, well so we have basically seven people that don't mind meeting in person or prefer meeting in person, but good point by Frano. We don't know what what the what king Cuomo the second is going to bring down on us. So as we go as we continue to go into the unknown, I guess we'll just continue remote meetings, any issues with that any input and then yeah hey, you know I think I told you earlier so we have to if you do meet in person always have a contingency, because the reason I'm probably not going to the office next two weeks because I'll probably be in quarantine. Okay, so that's something to keep in mind. If we, if you meet in person, we always have to have contingencies, because it could be board members too, and not just me, okay, so that was something I brought up from old business, any other old business. Oh I wanted to bring something up for committee meetings. We don't need to call for a motion to adjourn it's only for a general meeting. I think David Levitt told me that it might be in the bylaws somewhere. I didn't check it exactly, but I think that is that holds true. So just going forward, I think I'll double check it and say that everybody, the ref prince, if everybody wants the reference, but usually David Levitt, is pretty spot on with the bylaws. Okay, so is there any that's all business, then our new business, any new business. Anyone from the public would like to say anything we'll open it up for the public speaking portion yeah. The problem is at this type of a meeting. The public is not supposed to speak. This is only for the officers and the committee chairs. This is what's known as your leadership or executive board meeting, and while the public can watch they're not supposed to speak at this meeting. Just to let you know, okay, he's absolutely correct. I would disagree with Bob, although I would like him to be right, I would we. It is a public body and we do have to allow for public input, even though other you know, maybe historically we didn't or other boards don't Jeremy I go along with Bob I would like to. But you know somebody else will probably complain. The public has spoken so I think we can move on yeah all right. Thanks Robbie, we did this on community board. 8. no I understand Committee board. Does things a little differently than a lot of boards, though too? Okay? Thank you good night, thanks, Bob, all right anything else from anybody. Thank you very much. Thank you Hazel for volunteering to do the minutes. Thank you, everybody for your time and for signing in we'll talk to everybody. Next Thursday, all right. Good night, everybody have a good night, have a good night thanks for filling in for Tony Joanna, Good, Night, Hazel.",
            "summary": "I'm recommending that all the chairs, when they start their committee meetings, they assign someone to take minutes just to take the load off of them.\nIt's not you for doing it for every leadership committee meeting anything on that from anybody, or does anyone want to say anything on that.\nWe didn't get a chance to vote on it because we didn't have enough of the committee in order to you know to be able to spread it out, but we did table it and.\nI. Don't see why Harriet should have to do everybody's minutes, and you know, in addition to all the work that she has to do for the office.\nSo mine doesn't matter with me good for you, okay, so well, we'll move on we'll go to item number one in the agenda, which is the October leadership meet in minutes.\nI usually take notes in my other committee meetings, but this one was a little different, so I didn't take the minutes.\nSo I, know someone raised the issue that every committee meeting.\nYou know we may have a motion from public safety, community development or ethics because they're meeting next week, but that aside I, don't think the other committees had any emotions am I wrong about that.\nI invited a guest speaker Sean the same person that came yeah to my committee, meeting.\nOkay, so because I think it's important that he make a presentation for the full board, so I'll reach out to him about speaking in the gallery.\nSo I, don't know if he can do that in two minutes and people are going to have a lot of questions because questions were brought up at the committee meeting.\nBut, if you know guest speakers usually come to committee meetings and not to a full board, meeting.\nI, you know I thought he should make a presentation to the board, but it's okay.\nSorry came up at a parks meeting just from what I know so and historically hazel.\nThat high word order pass by law, proposals, attendance, treasurer's, report, secretary's, report, October minutes, which I emailed out my report committee reports, leadership motion to publish the conduct, mean statement that was voted on in October but was tabled.\nNext is the draft December and January meetings calendar, so Jeremy.\nSo I got an email saying that all the boards city-wide meet in December, except hours.\n10 also does not meet in December, I'm, not sure about the other boards.\nThe December meeting was the holiday party, but I don't know how official that was.\nWe have a full board meeting in December.\nWe should also have a leadership meeting in December to go over to make sure you like what we do now go over the agenda and then go over to the calendar for January.\nCommittees are one thing if they want to take December off, but if we're mandated to meet 10 times, with the exception of July and August, let's just meet the 10 times, and maybe because we have a lot to cover.\nI mean I, think that chairman can call full board meeting any time.\nI think it would just do it as a statement that we will be having a December meeting.\nUnless, you know you have an agenda, that's because, unfortunately, some committees.\nUnless you know you have an agenda and you need or want to have a meeting, fine equity is having a meeting.\nYou know you're going to have agenda items fine, but if you're not sure yet I would hold off okay.\nSo I might be out of the office for the next two weeks, but I will be working from home unless I mean I could use some time off, but maybe after the full board meeting, because there's a lot to do until then."
        }
    }
}