{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB5",
            "channelId": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "title": "Executive Committee Meeting",
            "publishDate": "2020-12-09",
            "shortDescription": "",
            "lengthSeconds": "2:10:25"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB5",
            "normalizedName": "Manhattan Community Board 5",
            "twitterName": "Community Board Five",
            "youtubeChannelName": "Manhattan Community Board Five",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "twitterHandle": "@ManhattanCB5",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "Vi_m9THIV9A",
            "fillerWordCount": {
                "uh": 318,
                "um": 314
            },
            "readTimeFullTranscript": "74 min read",
            "readTimeSummary": "10 min read",
            "wordCountFullTranscript": {
                "applicant": 29,
                "chat": 29,
                "building": 28,
                "land": 25,
                "action": 20,
                "position": 19,
                "bid": 19,
                "street": 17,
                "video": 16,
                "idea": 14
            },
            "wordCountSummary": {
                "applicant": 6,
                "record": 6,
                "chat": 6,
                "land": 6,
                "bid": 5,
                "approval": 4,
                "boards": 4,
                "street": 4,
                "end": 3,
                "attendance": 3
            },
            "fullTranscript": "It's and what's required of us Marisa has looked into this Marisa. You want to talk a little bit about that and what we've been doing and what we either should be doing or are doing already correctly. Actually I think I got the last of the minutes today and what's required of us yeah, all the committees are doing out into this marine. Sorry hang on one, second, what we've been doing and what we either should be doing or are doing sorry about that yeah sorry I was getting the recording feedback. Oh okay, I've gotten minutes from all the meetings. They're, all great! Thank you. If I had any notes for any of the committee chairs I'd, let you know, but basically all the minutes came in. Does anyone have any questions about how they either are doing them or should be done? How detailed they should be? They don't have to be as detailed as full board correct. The most important thing is to note who's at the meeting in terms of who's, presenting on a certain application. What the public comment is and who's made the public comment and then what actions are being taken and that's those prompts are there for you in the minutes template if you want to use it. Okay, one of the things that Marisa and I have been talking about is, and over the years I've thought about. This I may have mentioned it to some of you, and that is whether or not we would ever enter into our minutes. A note about the discussion. If the discussion was in fact, let's say there was a large minority discussion. Would we put it in and not in any detail, but to just say after some discussion, which entailed members of the board bringing to the attention of the board such and such I mean we've never done that, but I personally feel that we miss a lot of what I think is important. That goes into the determination and the final result that comes out of a board a full board meeting in particular I, don't know how anyone else feels about that, and we may want to think about it, but it was always kind of shot down when I suggested it. I'm open to us continuing to not do that, but I do think or I would ask everybody think about it. If you have any comments now you can make it, but otherwise we can talk about it at another time. I think it's a good idea. I think it would be a more thorough reflection of how we reach our determinations, especially given that we don't give minority reports at the full board. That would be a way to capture you know if there is a non-unanimous vote, what was the view of the dissenting minority Craig? What do you think of in terms of doing the minutes? That way, will that be something I know Kim takes it off of the tape? Do you think that's going to be difficult? Do you think this would work? Should we think about it? Should we consider I mean you so you're talking about this at the committee level right not at the full board level, no full board, but the full board level no I got confused. Then I'm sorry I thought you were talking about I, I'm thinking you have both actually but the fact that we don't do any of that in full board. You know I think it's important for the full board, because that's the one that people if people want to know how did community board 5 deal with this they're, going to look at the full board minutes. So I'm thinking of the full board but I think it would apply to committee meetings as well. Would they I mean if somebody wants to look at what Community Board five's position was or discussion with they'll look at the resume right and that's what the res the resolution that was passed, but they won't know what went into the discussion and yeah so I guess. Does that mean if we have a resolution that 10 people on the board support and make comments about in support of it? You know if let's say we were to have a bike resolution and against bikes and 10 people spoke against. You know on the David Kayla's one about bike, so whoever says something about thinking. Would we record that as well or are we just recording the? Why I didn't why I voted against it because then you're getting into a slippery slope of? Why are you reporting just some or reportings just some and not the other piece right removed? I? Don't think I've ever thought about it in it. Quite like that. I've often thought of someone who brings up a point, I'm trying to think of an example. Layla. Can you think of one where we, because you and I've talked about this, where we thought that it was important that something was brought to the board's attention, but it didn't necessarily go into the reso and it wasn't in particular a dissenting viewpoint. It was something that is important, I guess, the more we talk about it, the more difficult, okay, Clayton one second, the more difficult it would be, because the person who's transcribing would have to figure out whether or not it's important enough to put it in. Maybe we should forget about it, but Clayton. What do you think? Well, one example that comes up occasionally is especially for the benefit of members of the public or new board members. Any time that a committee chair might explain or remind the board why it is that we are doing a deny unless or an approval with conditions that whole thing like a conversation around strategy and it's the agency receiving it. That's never going to be in a resolution, but it's it might be useful to have that public record. If somebody is trying to figure out why we worded it that way, what if I could do this as chair and work with Craig on it that during the meeting I just and maybe a couple, others that we could assign to do this, make notes of things that we think might be important to put into the minutes collectively, rather than have it up to one person rather than having to decide, is this important enough, then we can look at what the group came up with again. We don't have to decide this tonight, but since minutes have become not only I mean they've, I've always felt they were important, but they're they've been singled out more so than ever before, on the importance of keeping them and posting them and having them readily available, and so on. So I thought. Maybe we ought to think about that. I mean I generally, don't see that much detail this one says this and this one feels I just don't that minutes aren't transcripts. Two very different things and minutes are really actionable steps. So we passed this resolution and this is the resolution or stuff like that. I, don't traditionally think you know, I can look at like the parliament, parliamentarians guide or some parliamentarians with, but minutes are not transcript, they're very different. They generally don't go into too much detail. Just we did this. We did that. You know explaining policies of the board, you know, I, don't know, that's really what goes in there yeah I know and I. Don't think it would be that often right what I've, what I think where I've always come out on this? The way I have is because when I read them, they say after a lengthy discussion, and then we don't know what that lengthy discussion was so I often thought if we do have, and sometimes we get into a really. You know dig down in discussion that even after the full board meeting people said to me that was really good meeting. We really got into that. Maybe we should think about that kind of thing. I think it's I agree with you, Craig I, don't think that's going to happen. That often, but very often things not very often when things come up that are afterward kind of memorable and that we would like to put in the record. Maybe we ought to think about putting it in yeah I mean what I'm thinking about is the a couple of months ago when we had the resolution on that's upon the police and that went on for a long time. How much detail about that was a very good conversation very long conversation. How much would we put in and that's a recurring question- I'm not expecting an answer right now, which is something that we should think about. That is an example. When we had the homeless shelter discussion a couple of months ago, that was a very long discussion. It was a great discussion, but would you put that I mean that could literally be four pages of yeah? You wouldn't want that? No not at all. Well is everyone, okay with us thinking about this pursuing it and maybe coming up with some suggestions at least I'm curious, whether any other boards do it? Have you seen a model that you like yeah, I'm just thinking of that as well? That's why I was just gonna. I'm I wrote myself a note to check other minutes just to see. If anybody else does the same, I feel the same way all right, I'll check it out and bring it back. Okay, let's see. Oh, we had a case where- and this is unusual, but it may come up more than it has in the past. Someone from the public was at a committee meeting and asked if they could speak on a subject. That was not on the agenda and that's very unusual, and so after talking to a few of you about this, the conclusion that we came to was that we would allow it, but it would be considered new business at the end of the meeting, and maybe anyone could make an a chair could make an announcement and say if anyone from the public wishes to address an issue with us that is not on the agenda tonight. It'll you'll have your chance at the end of the meeting with new business and if they're, you know, if they're really wanna, if they really wanna, do this they'll hang around for the meeting and say what they have to say so I. That was the consensus. Excuse me that was the consensus of those of you that I spoke with and I just want to make sure that everyone is in agreement with that. It was the easiest way to handle it rather than we don't want to tell people that they can not. So where do you put them? You don't want to have a public session at the beginning of a committee meeting. That's not the way we operate and then we always say to them. You know bring your comments to the full board. Meeting. You'll have two minutes, but in this case, if it happens, we'll do it at the end of your new business. The only caveat to that is that the committee can't take any action on that. It's really just to hear the comments, because it's not noticed they can't take any action right. Well, it's not for action. In fact, I think I'm glad to mention that I think it should be made clear by the chair that it's just like the public session, where they're only surprising us they're not asking questions, it's not to be a you know, dialogue and it's definitely nothing with any action and I think that has to be clear. It's very similar to the public session, where it's just to give us information. This happened in particular in parks. The person who spoke was interested in having gardens in parks and she made her statement and Clayton said. Thank you very much, and that was it. So is everybody? Okay with that, okay, all Righty Clayton. Do you want to talk about attendance during Covid-19 and virtual meetings and the things that we've discussed because of the difference of not having a body in the room and knowing who's there at what time? And for how long sure? So this is something that we've been talking about and just thought it would be good for everyone to be thinking about it. Committee chairs, especially on Zoom board meetings. Attendance is a little bit different, especially now that for my committee, for example, we for the last three months have had agendas that are much lighter on action items and some agendas with no action items whatsoever. So the question begs the question: what is attendance based on if there's no votes so Vicky suggested you know roll call just for attendance and that the idea was doing it at the beginning of the meeting and at the end of the meeting, so that you have an accurate snapshot of who was there and another idea was having that roll call happen, not at the very start of the meeting, because I mean it's okay for people to be a few minutes late that happens whatever and in a normal committee meeting. The first vote doesn't normally happen until well into the meeting. So if we wanted to be a little bit more analogous to how it works in the real world, we could have roll call happen, for example after the first agenda item, no matter what it is, a discussion, a presentation or kind of arbitrarily pick a time you know do it at 6:20 or whatever it is. So there's a few different ideas that and I don't know if we have to resolve this right now again, but just for committee chairs and everyone to be thinking about what makes the most sense and what is good for managing expectations for people and also just seems fair and as simple or streamlined as possible would be great too. Now your committee in particular. This applies because you have so many look at last month you had so many discussion items. People can and it's hard to keep saying to people. You know put your video on, but the fact is they can come in beyond for five minutes. Take the video off and leave for an hour, and you don't know that they're not there and they're, not you know, being a part of the listening to or wanting to have anything to do with the discussion. So what does everybody think can I just ask in terms of attendance? What is the requirement apart from I know that we take attendance has to be our name? Is a full board meeting I mean as a you know, as the same requirements for attendance, for full board are the same for committee, so you have to attend. You know a certain number per year. You have to be there for no more than so. Many present part that kind of thing. It's exactly the same. Thank you. For example, you can't miss three in a row, I mean if you can you get a warning, but theoretically three in a row we can start taking action. Thank you bless you Nick. What do you think everybody Renee? Do you think that would work for your committee? Absolutely I mean I like Clayton's idea that in the middle you know, if there's no action items in them somewhere random time in the middle you just chart who's there, I don't know my feeling is if we do 6:30 and then at the end of the meeting, you've really I think gotten the people who've been there full-time. The only problem with a specific time is that you know the chair may not want to interrupt the conversation exactly at 6:30 I think we need to build in a little discretion on the chair as to when it comes within the flow. Well, I guess on that point: do we need to do a formal roll call? I mean, for example, we like on parks, I, never do a formal roll call. I look around I, see who's dating this there's 19 people or whatever 18 people on the committee. I. Do my it's similar to what I do at the beginning of our full board meeting I look through I see who's there, I check, I, take attendance and then I send a text to Clayton and say we're a quorum. We're, okay and I can do that quietly. You know throughout the at any point during the meeting is whether it's 6:30 or 8:30. Without having to interrupt do we need to do a formal roll call, as opposed to say the vice chair. Just looking I mean it's easy to look. You also have the video right. That's right! No, but my point is: there are a lot of people that are not on video. They say they're there to make sure people are paying attention. Maybe that's the problem. We need to address that in order to be present at the meeting. Your video has to be on well, and it's interesting to me that I, don't know about you guys on committee, but we I almost I, don't think we ever have people with their cameras off at committee. It seems to be much more prevalent at full board. I'm not sure if you have the same experience, everybody same experience for landmarks and land use, which did you say it's on or off during the committee. It's only correct. Okay, I have a few I, I'm thinking of Evan, in particular, who watches his kids at that time that he goes on and off and he's texting me the whole time. You know my daughter's screaming I gotta go. You know that thing I know during full board the last few meetings. I've counted, I think at one point, I counted nine or ten people that were on. You know that, were their videos were off and they were off for a period of time. It wasn't like you got to get up and go to the John or whatever it was and I. Think that's why it's stuck in my mind. I'm thinking are they there are they you know. Are they and then a couple of times we wound up with not having them respond to the roll call, because they weren't there so I think that's the problem to solve and I think that you know until while we're having video meetings I think the rule has to be in order to be present, your video has to be on okay, otherwise, you're not present is everybody. Okay with that, yes, yeah, all right! Okay! Well, just out of curiosity, so in the case that Renee puts on sorry to add a hiccup on this in the case that Renee spoke, Evan goes to take his kid to the bathroom. Whatever you know, for five minutes, I mean he's not gonna keep his video on, because you know why would you keep your video on, for that? Is that mean that he's only present apart, even though he's just missing five minutes, because would we say he's present part if he went to the bathroom at Xavier, High School for five minutes, you know what is that? What is the threshold? Well, you can't miss a vote. If you miss a vote, you know then you're not present, and then maybe it's up to the chair. Maybe it's a discretion of the chair. If he's missing a large part of an important part of the conversation, then it might be up to the chair to mark him present part that makes sense to me. Somebody leaves to go to the restroom and Miss misses a vote. Do we count that, as present part I mean very often in the old days? We knew that someone was there and I've heard them say: oh they just stepped out for a minute right. They missed the vote, but they didn't leave the meeting so they're really not present apart. Are they? It's I believe that in the past, when we were meeting in person, if someone missed a vote, even if it was just, you would have a board member who would step out with an applicant to deal with some ongoing issue and they would miss a vote and I think they would be marked. President part yeah, I, wouldn't say a hundred percent, that's yeah of the time because I they might I'm sure there have been pocket exceptions, but yeah I mean I. Think that's the high majority of it. What about a scenario in which people are turning off their video because their Wi-fi connections are unstable in the world in which we ask people up front like keep in the back of our mind? Obviously, somebody who is consistently not using video might be problematic because they are actually leaving, but if there are occasions in which they advise you in advance to advise Marisa that they will be unable to be on video tonight that they're still counted as being present, particularly if they're able to vote my concern would be is if somebody has a problem with connectivity or is with a mobile phone or any situation where they can't be on video because of where they're located. We just want to be careful of that not exclude them. You know I'm glad we're talking this out, because maybe we shouldn't do it. Maybe we should we leave it up to the chairs to I, guess determine in some way. If someone is taking advantage on a regular basis, not one night, it I mean it does have complications for all the reasons that you will. You know that you've all brought up I mean I, think that there has to be flexibility and discretion for all these reasons, and that's important, but I also think it's important to be really clear about the expectation and Vicki you do this already, but maybe even more and more frequently, and maybe stronger language saying you know last full board. We had 13 members or nine members or whatever, whose cameras were off virtually the entire meeting and it's difficult for morale. It's difficult for engagement yada, so that everyone understands that yeah. Of course, there's going to be times when or if your Wi-Fi is bad. There's always going to be cases, but just to set that expectation. So the standard is really clear. Okay, that's a good idea and I will not do that at this board meeting, because I'm giving them a little hubba hub on a couple of other things, I'm not going to overwhelm them with or scold them with too many things so, which takes me to the next thing that I wanted to talk about, which is the chat in our zoom meetings. What I had planned on saying to the full board on Thursday and I? Want you to see if it sounds right and if anything should be added or taken away, the chat is to be used only to alert us to technical difficulties or operational questions or information like an email address or a link. That was already stated aloud on the record during the meeting, in keeping with our mandate to adhere to the open meetings law. Any remarks about CB5 business or questions about agenda topics should be made on the record by raising your hand through the raised hand, feature, and then I'm just going to mention that some boards have deactivated the chat, because some of the necessary discussion that needed to be spoken publicly was taking place there instead, and this is what we ran into last month, actually, which is why I'm now addressing it. So please keep this in mind tonight and for all future public virtual meetings of the board and its committees. We did wind up with a back and forth by a board member, and it wasn't the only one. I've seen it before where they start talking, either to each other, it's a little different and it doesn't. The open meetings. Law doesn't apply if you're sitting physically in a meeting, and you lean over to your part. You know somebody who's. Next to you and say how are you going to vote on this? Can you give me an idea? That's different, but when you put it in the chat- and you start having a banter so to speak back and forth- or you know really things that are supposed to be on the record, which is the discussion that goes into coming to a conclusion and a decision on an application, it can't be done in chat and other boards have found that to be problematic as well. Okay, can I assess a clarifying question, so you'll notice on this zoom meeting that the chat is not enabled, but there are a few different ways to do it, so you can enable chat just for the panelists and not for the attendees, but I think that once you start with the chat you like, we wouldn't be able to disable the chat for panelists in the middle of the meeting, for example, or enable the chat in the middle of the meeting. But we can change folks ability, you know so for attendee we can disable the chat for particular attendees or just disable it in general for all attendees Layla. We disabled it for landmarks, right, yes, and for land use and for land use. Yeah and personally, as you know, chairing a committee I found that it was much more. You know, quiet, I, didn't have the distraction and I don't believe that I missed out on any information that anyone was trying to communicate with me and we still have q and m correct. We don't have the Q&A function that zoom offers. We did not enable that, but we never I've. I have never used it in the committees. There are some boards that use that as the way that they allow people to ask questions only so that, but in our case we call on them and they verbally ask the question: yeah that had I think several hundred attendees it came in handy, but for a normal sized committee meeting yeah. Actually you did Ej. You did all your questions through the chat I mean through the Q&A on that meeting. Didn't you I, don't think you took anybody speaking I think it was all written out. Yes, it was a particularly huge and contentious issue where we suspected that everyone was going to want to weigh in you know it was particularly an issue where bike advocates. You know on one side of the issue were particularly you know. They all want to raise their hand and speak up, even if someone has made the exact same point before same thing on the other side of the issue as well in terms of residence. You know it was a it was you know analogous to when we you know had to move the committee to an even bigger venue, because we knew so many people were coming out. So in that particular situation yeah, it worked out really well for a for one big contentious issue like that, like we knew there were going to be an excess of 100,200 people in attendance. It did work in that situation for them for most other committee situations, I would say that ray's hand has worked fine, so is it everybody's agreement that we keep the chat but make sure that, and maybe it would have to be done once in a while is to remind everyone. The use for I mean I personally agree with Layla I have found the chat to simply be distracting during a meeting. You've got people from the presenting party trying to answer. You know attendee questions in the chat, and so the attendee is getting the answer, but all the committee members might not be aware of the answer and I personally support just shutting down the chat entirely and as with an in-person meeting, you know making sure that all statements are made in succession when recognized by the chair. If all right, you're saying take it off completely the way Layla did at her meetings. Okay I would prefer that in the full board, because I find it distracting. What I think would have to be done, though, is that when it comes time for a Q&A, we could announce that anyone who may have missed a certain information or a link or something that was given to the board or somebody can say, I'll drop a link here and they can. They won't be doing that because the chat will not be open, that they should contact the board office, yeah and I. Think there's definitely I mean, maybe if it was possible to like just limit it to literally the hosts, not even just a panelist but like perhaps Vicky and you if there's something that needs to be distributed to everybody at the meeting. Yeah. That's what's going to be my question: are there ways to actually program the chat so that only maybe you Vicky and you Craig and you Marisa- can contribute? You know like typing in the chat box, but it can be seen by all. Let me look into that I. You know I've looked into attendees versus panelists, but I didn't look at hosts specifically, so let me see if you can segment those out. Okay, because then Ej's suggestion would be really good, so that you know if we need to communicate some information, a link to something or clarify a date for the usual instructions about how to use the raise hand, feature yeah and but then no one else would be able to contribute. Shall I speak about it Thursday and instead of saying that it will be available for that purpose, say for the time being, we're not we're deactivating. It and any questions or information that you may need check with the board office shall I wait for you, Marisa to see I mean well. I can have the answer tomorrow morning, so I can certainly get that to you before boarding anyway, even if we have say the three of us or the committee meeting, the committee chair, the committee vice chair and you it would be the same, it would be deactivated for everyone else. Correct. That's what you're asking Ej and Layla right. Yes, yeah I wonder if just asking people to use their common sense that they can't have cross-conversation. They can't do that. I, wonder because we haven't tried that yet. Has that generally worked in the past I don't know. Is there a reason why you want to keep it Nick? No, but the only things I can think of that are helpful. When you know when the electeds are giving their presentations, they drop a link to the their report in the chat or, if they're referring to something you know a document or something they can drop a link in the chat. Sometimes that's helpful. That's really the only example. I can think of where we would want to keep it. We can give a heads up to all those reps and let them know that if there's anything that they do would want to drop in the chat just like. If you were meeting in person, they would bring their printed newsletter or their report. They can send it to us ahead of time and we can put it into the chat I think it really helps I'm. This is from a personal standpoint chairing to not have to worry about the chat, because it's it is distracting. Well, it shouldn't be your responsibility. I mean we could have. You know, look at that or what I'm nosy? No, but you know we could assign someone to monitor the chat, and if we see conversations then you know Marisa would write in sorry. You can't use the chat for this. You know until people get used to not using it at all or we could take it away any other thoughts, certainly for my committees, I'm totally in favor of you know. Taking it away, I really see no value, it's distracting and you kind of still need to keep an eye on it, because you know something: absolutely gracious is happening in the chat and you don't know about it and you continue. You know you become totally irrelevant, I, don't think and, as you said, Vicky you know, for the sake of you know, transparency and you know it has to be in the record and therefore it has to be. You know, any valuable comments have to be spoken out so that they become. You know, part of the record, Clayton and Renee that, and also if two attendees in any of our committee meetings were having like a side conversation with each other during the meeting we would stop entirely Clayton and Renee the other two committees. How do you feel about it? I? Definitely, don't I don't like being distracted by it during the meeting it annoys me. It annoys annoying and also slows everything down, because I actually have to kind of stop. Whatever facilitation is happening to read it and catch up and it might be important or it might not. Yeah I see a difference. I see a difference for committee meetings because there is really no public session during the committee meetings. The elections aren't dropping anything so I could I can see the logic behind not having it at all at the committee level. So maybe we'll do and Renee is that, okay with you absolutely I, agree: okay, maybe we'll drop it from committee and then think about Maurice's suggestion and just or Laila's also a suggestion about having two or three of us handling it in the way of information. If we want to drop information, you know Marisa you'll talk to the electeds. They can give you information, you can drop it into the chat, but then would everybody see it if we're dropping chat? Well, that I mean that's what I have to confirm? Oh okay, wow right, okay, well, I'll! Let you go with that and on I'll figure out what to do on Thursday, based on what you find out tomorrow, okay last just to let all of you know we did have someone at one of the committee meetings mentioned that they were abstaining because they wanted to be neutral. On a particular position and two other people followed suit, and it was a public meeting and I think it's important, even if the greater majority of the board understands and knows that an extension definitely is not a neutral position. I want to go over it again, especially because it was a public meeting and that was said and two relatively new board members went along well, all three of them were new, relatively new, but the other two went along with it, and so I really think it's important so tomorrow, I want to send out my explanation that I usually give at orientation about how all the yeses go into one box and everything else, the abstentions and the no's go into another. So basically, an abstention is a silent, no and be very judicious in terms of how you use an abstention. You have every right to use it if you want to, but don't think for a second that it's a neutral position, so that'll go out tomorrow as well, and then we have one item before we get to our committee meetings and this one I really tried to put together the pieces and that this is the Flatiron bid. Extension I do not expect us to vote on this. First of all, we haven't noticed it, so we really shouldn't vote on it. I don't think we should anyway I'll try and put the pieces together and Renee. You can jump in and help just so that I explain to everyone, because what I'm looking for is affirmation or discussion on whether or not this should go to the full board as a committee on the whole of the whole on Thursday night. So let me look at my notes, because I was trying to put it together today in March the board office. I guess it was Wally referred the issue of the expansion of the Flatiron bid to the Bex Committee. We're not quite sure why, but we think and I think Renee. This was the understanding that it's because it was going through small business- is that why yeah I believe so, yes yeah, so it went to Bex and basically the committee felt that everything was cup, aesthetic, not no changes and therefore it was a resolution and it was approved by the full board. I couldn't find the reso I didn't have time, but I think it was unanimous. Do you remember if it was I believe it was unanimous at Bex, but I think it was ultimately approved at exact? Am I right Marissa on the resolution? Oh maybe it was good. It was approved at the March full board. Okay meeting, all right and I- think it was. Oh March is the month that we didn't have the full board meeting. So I think it was probably exact, I'm pretty sure the resolution actually was then approved by exec. Maybe that's why you don't remember it layla. You know it didn't go before the full board. Okay, all right! So everything went along for months and in October we were notified that they were coming back and because it was sent to Bex in March it was sent back to Bex in October. It actually came to you in the November cycle when I came to Bex in the November cycle and at that point, at the end of the meeting I was on at that meeting they dropped a little bomb by saying, okay, this is going to go to Euler, so be expecting something from Mueller which set off a you know a big ring in my head saying. If it's going to Euler, why is it going through Dex? Why didn't we put it through land use? It all happened. We got the notice, the actual notice on Friday, the fourth which was last Friday, saying: okay, it's an Euler and you have to answer by January 4th. Now, if nothing had changed, we would be probably content using the resolution that we had in March. However, the change there was a change that came about it had to do with a difference in taxing high residential new high residential buildings. On sixth avenue correct me, Marisa, wasn't that the main reason that I was basically what's that not fully residential, they had to have retail space if I'm okay, but it was a change from what you had heard in March I, don't feel comfortable with us keeping the resolution unless the full board agrees to do so. I want to make sure that you guys agree with that, because I think it has to be made clear to everyone. There have been changes. It may make a difference to some, and the only way to do that is. We can't change the resolution without taking it to the full board. So I'm asking if we as a committee, want to put it on the agenda, which we have the right to do. That's what we're here for I think that's appropriate and I think it would be I think would be remiss not to, and one of the main reasons in addition to just the merits of the process is also that I would hope that, as a matter of public record that the Flatiron bid and anyone else paying attention understands that if something is going to eulerp, you can't just let us know. After it's been heard by a different committee, I mean I, I'm assuming that was just a random oversight, but it's something about it is very wrong, and so we should be robust in publicly writing it. We can't really figure out how it happened. It did and whether or not there's blame it doesn't matter, it happened, it could have been innocently done, I, don't know, I, don't even know how it got to Bex. I mean I kind of understand how it may have, but it did- and so now here we are with this. So is everyone? Does anyone have any comments, or do you feel that we're fine and just moving it on to the agenda and I, don't know who would make the presentation? I guess Renee I just want to point out just to Clayton's comment on the Flatiron bid, while they knew it was going through city planning, I. Think the issue was the timing. They really didn't have a sense of the timing, so at the Beck's meeting they did say that we would be hearing from city planning, but had no idea that the turnaround would be quite that quick and it wouldn't be able to come back to the board to another committee at that point, so they really came to the board as an update in their process more than you know to get any finalized ruling from the board. Marisa do we know when it was certified by city planning, because Euler is extremely codified. You know, usually my understandings, that you learn. We have 60 days. Is it not a 60-day referral? I mean it looks to me like it's a 30-day referral period because it came to us on the I. What is it? The third or the fourth and it came a deadline, is January 4th or it came from the applicant. It came from DCP, okay, interesting the notice came from DCP, not from flatter I mean Layla. Aren't there certain cases where the window is 30 days in like random, weird administrative I guess we just experienced it there's ruler from there like this is a big expansion which I think is a funny little thing in itself, as opposed to your normal course of Europa View right yeah, except that, if it's called Euler, then it should taste like Euler, but I think that's a little bit mercy correctly. If I'm wrong a little bit of a misnomer from what I kind of understand about this process, you know I, don't know enough to say whether I call it a misnomer or not. It certainly doesn't seem like it's the same process as other land use, Euler application. Where is this the this application that DCP sent? Do you have it Marisa I, don't think I have the application I have the notice from DCP? I will look for it while you guys are talking and can forward it to you if you like, okay, yeah I, think you know the original Layla is that what you're asking for whatever is on record with Gcp yeah I, don't know if that would be the original, because it looks like they also filed something with a small business services very confusing all right. So we will put this on the agenda and Renee. Can you walk everyone through it, how it went through the committee and what was discussed and that what has changed I can in more detail right. So originally, if you recall, the Flatiron bid came to the community board and explained that they were thinking of expanding their reach and they had a map that went over to 6th Avenue and up to about 31st street, and that map underwent some iterations once that was finalized, they came to the board again and they presented in great detail. I think I still have the presentation exactly what they were looking for, how they were doing outreach to community members. They were doing outreach to all the apartment buildings or trying to get their approval for, and support for the for expanding the bid, and then they had to do a certain number of mailings. My understanding is to stakeholders and get a certain number back. I'm going to go back and revisit my notes on that and then once they got that certain number of support whatever it was, they moved into the legislative process and that's they had to get the approval from City Council to do that and they reviewed the district plan was reviewed and it went to City Council and then they City Council reviewed the outreach and the planning activities, which is where they did. You know how many buildings they contacted, how many people gave approval and for the most part the numbers are small. When you look at it relatively in Marisa I, don't know if you recall this as well. The numbers are small relatively, but the people who did respond responded positively to the expansion of the bid and the way they posited. It was that they're going to offer quite a lot of benefits to the area they're going to do the street cleaning and the homeless outreach and all of the other benefits that they offer to the businesses and many of the commercial entities were happy to sign on, not all not a ton. You know as a percentage of the whole, but they had done the required outreach and now they're in this stage where they've met I believe they went to the public hearings. Part- and that's part of this Euler thing where they're going to go to the public hearings piece of it. I'm going to go back and review my notes so that I can more fully explain it. But that's basically what happened and they came to us when they came to us back in I, believe it was February. The board was unanimously in favor. I'm talking about backs for this expansion, which ultimately goes over to sixth avenue. I need to bring up the map for you, but it goes up. It almost hits the Midtown. It doesn't quite go to 34th street it's more like 30th 31st, there's a little cutout around 33rd street and then over to Lex. Okay. There was one public comment at the meeting and then a couple of follow-up letters from some folks that wanted the bid to actually extend up to 34 over up to 32nd street I. Think from 31st street, so I will just say very quickly, not as a member of the land use Committee, but as a resident who would be directly impacted by this expansion. That I am opposed to the extension and my building. My condo is opposed to the expansion I find that the lack of a clear mechanism as to how these taxes are levied and how they can be altered I find that to be problematic. So, although today the tax on residential buildings is one dollar, it can very easily and without too much accountability to the constituents of the bid it can be altered and the bid is basically appointed, and you know when like in perpetuity and it's not democratic, you know they're, not elected, you come with them out of office. If you feel that you know the taxes that they are assessing is excessive, and for I'm speaking for the rest of my condo, they feel that we're not gonna get really any value out of the work that the bid does. They certainly see the value to the retail spaces, but you know they and I kind of agree with them. You know feel that having one additional garbage can is no justification for having you know this. You know release of power to an organization that then you know becomes a de facto ruler of the block. So you know I will be voting against the bid expansion all right so we'll have it as part of the agenda we'll have it as a committee of the whole Renee you'll give the background on it. Now, how should we do it? We have a resolution for March. Should we include that in the packet and have it as above it, something like committee of the whole to discuss revision or something like that of the following resolution? The resolution is written. I, have it in front of me it's written to lead you to an approval which might be the way the full board goes as well. So I think in order to have something to look at and to understand or to remember what went on in March. Not only that now that I'm that you brought to my attention that was done by exec, because we cancelled the March full board meeting the full board meeting the full board. Members never saw this. No, so I would suggest that we include it in the packet that we give it a heading explaining what it is and let the you know the questions and comments take us to whether or not we're going to just add to this and still approve it or make it a you know, a disapproval or whatever, but I think we have to have something to work with, especially since no one saw it in March. Does the applicant have the opportunity to present yeah? Well? No, we don't do that. What we do is last time we did a committee the whole. We did not have a presentation now, but they can come and speak the public session and he has to be the head of that bid has to be a prize to this tomorrow morning, so that he has time or even tonight, so that he has what's today, Tuesday well yes time to come, you know and make his presentation during the public session. Do we have any do we have anything that was given to you, Renee that we could include in the packet. I was just going to ask that there's a lot of material that we can include in the packet, including all the outreach, the maps, the services that they provide. You know they do a very comprehensive they've done it for the committee and then just again very comprehensive presentation about this they've done to all community groups. So if I could get that packet and included, it's very informative. Just in terms of the numbers, you know what they've actually done, which they've achieved, how many people they've reached out to all of that. Would that be helpful? Nick I think that would work. It's very comprehensive now that I think about it. I mean I was just thinking more along the lines of enabling them to address questions like Laila had if this was a typical committee meeting Layla would ask her questions and the applicant would be able to answer them if we do it. This way, we deprive the applicant to the opportunity to answer those questions and other questions that other board members may have. So it's not really. You know it's not really a hearing of the matter right, I actually agree because I think had they known that it might have should have gone to land use. They would have definitely my senses. They would have definitely been there as opposed to backs okay jog, my memory. What was the last one we did where it was a committee of the hall. We did that a couple of months ago. It was the harmonious shelter and that wasn't an application. Was it no? So I'm a little concerned I think due process requires that we give the applicant the opportunity to present spoken. Like a lawyer, Nick sorry, you know, but also Nick, you have to apprise everyone that you're present, but not entitled. Yes, I'm on the board of the flat iron bid. So I can't vote on this a real interest there. Well, here's Renee one. Second, along those lines: I am as well I mean. Are you a voting member Renee? I'm not a voting member. So that's maybe that, but this actually impacts my as it does. Layla's impacts my neighborhood where I live, I'm trying to be consistent here so bear with me and those of you who've been on the board. There are very few of us, know: Clayton and Layla, maybe Ej. If a committee doesn't have a quorum and if a applicant goes to the committee meeting and makes their presentation and the committee passes it on to the exec committee for their approval and to bring it to the full board or if it goes from the exec committee to the full board. As a committee of the whole, we have not in the past had presentations. I can not think of one we've. Never had anyone come into to exact, to make a presentation right, but I don't remember ever having a presentation at full board for any. No, never yeah, no I agree with that. The only difference is that the applicant did get the opportunity to present at committee, even though there wasn't a quorum well, so did they presented it back. They presented at Bex last month, and this is the same application. Yeah I thought this is a different application. Now this is your Lord, no be fair. When they came to us, they came to us saying it was an update. We asked them specifically if it was an action item and they said no. This is an update. During the meeting it transpired that there was going to be this action further down the pike and, as Marisa refer explain, the timing of that was unknown. So, but if I'm, if I understand correctly when they came initially, they mentioned that the tax levied would be one dollar and now, when they came back, that fact has changed. So factually the application has changed, let alone the fact that the pipeline process has now been better understood, and we know that it's a DCP action actually just for the record I went on the DCP portal. I can not see the application I just emailed it to you layla what we got in the office from DCP and there's a link there. Oh so check that out see if that gets you to it: okay, I! Don't what I have seen other community boards do and I don't know if community board five has ever tried. This is that when an issue like this comes up, they call a pre-meeting of that particular committee just before the full board, and so that committee has basically a second meeting and votes on the particular application that then goes directly before the full board. After that pre-meeting we used to do that years ago. We haven't done it in ages, but in this case that would be land use yeah, but is there even we have 48 hours? Is that or less I? You know it's not this the application. Well, it's there's a lot of information in their packet. It's not Layla's usual land use stuff. Do you know what I mean, but it is Euler I mean. Let me ask this question because I'm really having a real problem with this Marisa I. Think you told me- or someone told me that we don't really have to weigh in on this. Where did I hear that that's right, I mean it? Dcp doesn't need to hear from the community board to take the action, and so it is, you know not required as it is for normal ulurps as I understand it. So the application can go forward without any community board comment. They are seeking comment from both community board 4 and Community Board 5. Laila. How does that sit with you? I? Guess it's one of those very rare actions that DCP can take without any input from community boards, but typically any action or decision, whether it's you know a chair, certification or an authorization or a you know special permit from the city, Planning, commission. Everything is referred to the community board. I mean that the land use was the reason why community boards were created in the first place. So you know maybe the specific action required for an amendment to a bid a map is, you know, one of those rare instances where community board input is not necessary, but I've I can't think of any other type of action. Where our comment is not part of the process yeah all right, so maybe that needs to be something smart say. That's true. Let's say that's true. The other alternative is to simply retract our previous resolution and not be on record. It seems retracting. It is because of a change of information that we did not have in time to weigh in and we- and if that is true, we don't need to weigh in. Why are we making ourselves crazy? It seems to me- and this is my personal opinion- that this is like, as Layla said, land use is one of the things that community boards were created like this is a kind of a big deal for the area right and for our district I mean they've, been at this trying to expand it for months years, something that should be weighed in on by a community board to punt on. It doesn't seem right to me. That's just a personal opinion. Is there an ability to have it postponed? Our deadline is January 4th. Well, that's what I'm saying I mean. Can the applicant request a postponement of that or how you know can is that of the January 4th, oh yeah, so with any land use action. Unfortunately, when the clock starts ticking short of the mayor issuing a executive order because of you know some disaster, as he did with Covid-19, where he suspended Euler, the clock is ticking and you can't do anything even because this situation seems a little bit different than typical ULURP I, wonder if this is different in that respect. Also I don't know, because I think this is something that should be heard thoroughly. Yeah I mean I, almost wonder if it would make sense and it's ridiculous time of year for it, but a special meeting to be called if land use meets or joint committee or I don't know so that we're not talking about something that's happening in two days after the board meeting, I'm okay with that. If you guys want to do that, I mean this is really convoluted. The way we're trying to go at it. Otherwise, if we were to do that, then would have to rather would have to approve that action and the full board in January would ratify it after the fact yeah. That is what Community Board 4 is doing because they have they're not quite as tight as we are. They will be able to have another, a committee meeting for the application before that, but they won't have a full board vote yet so they are just going to refer it from through exec from their committee and their land use committee. I'm, assuming you know, I, don't know, but I'll double check that, but I would assume yeah but I'll double check with Jesse. So what do you think of that Layla Renee? You want to have a joint meeting, I'm happy to do either. I'm happy if it's easier to go through Layla, I'm happy to do join either, so it would be a meeting that we would convene after the full board. Yes, but before the regularly scheduled committee meeting of January right, okay, yeah, that's fine I would vote for the joint meeting because of the strange circumstance of Bex. Already having heard this it'd be worth seeing, I agree, I really feel if you're a k, Renee I think it should be joined. Yeah involved truly I agree not to mention that with two committees, given that it's going straight to exec, we've already have half the board, having heard it which helps exactly so. That would take care of your concern Nick on the ability for them to present definitely and I think it would give it the hearing. It deserves. Yep, yeah, okay, I agree with that. Okay, shall we convene on Christmas Day? All right is everyone. Okay with this. Yes, all right, yep I'll bring the Chinese Food Clayton is: do you want to discuss the potential day now or so? I can let Flatiron bid no yeah. That would be a good idea. Leila Renee you want to give the Rene you could do it at the end of the meeting. Give them some dates. That would work that you think would work with getting the most members of your committee. Luckily virtue virtual is working out. Well, do you know we had we have 49 members? Do you know we have 49 members in attendance last month? It's pretty amazing, that's spectacular, it is I mean a couple of them left in between, but at one point- okay, that's great! So we do not put it on the agenda. We do not send out the old resolution. We leave it up to the two committees, with a presentation from the Flatiron bid to update our position and it'll go to it'll. Go well. I'll call a special meeting of this meeting the executive committee, because our exec meeting I believe is, after the fourth also so I'll call a special meeting and we will approve it with the understanding that the full board it's has to be ratified by the full board and at the January full board meeting is that it did I leave out anything okay. That was long, but it really worked out well, I. Think in the long run, that's great! Thank you very much. Okay. Now we can go into committee reports. Let's start with landmarks: two applications this month, the first one is 122 fifth avenue. This is in the ladies mall historic district. This is an application that actually came to us last year. We didn't like it at all and for a reason that kind of has nothing to do with us. I, don't think we can take the credit on this one. The applicant nonetheless went back to the drawing board and they came back with a much better proposal, so they're proposing storefront alterations, Rooftop edition landscape roof at the existing building and a new building in the adjacent parking lot at 9, West 17th street. That would be an extension of the existing building. So it's a very large t-shaped building that has frontage on 5th Avenue, 17 and 18th street, and the applicant has an excess of development rights, and originally they wanted to build a very large and very visible rooftop edition, which we really didn't like somehow. This edition was approved by LPC, although in a reduced version and instead they went back to the drawing board and they decided to infill this vacant parking lot and to also build a much more modest, rooftop edition. Overall, we felt that it was good. We had some concerns about two aspects. The first one is the installation of flagpoles on the Fifth Avenue facade, and they want two flat poles and the other issue we had was with a very large canopy that they went to install at the new building and we felt that the canopy was simply I mean protruding, so grossly out of the face of the building. That was not a not appropriate, so those were our two concerns. The rest we felt was really good. We gave a lot of verbal, a praise to the year to the applicant, and the res also, you know, praises the applicant for the you know: good quality of the work that they're proposing. It is a denial unless or two conditions are met because we know that you know those are. This is the semantics that actually carries more weight with LPC, but you know in essence, it is a conditional approval and the vote was unanimous. Okay is everybody? Okay. Does anyone have any questions before we move on right? Seeing none? We don't do that. Okay, the next one 18 east 50th street. This is an individual landmark. It's right across from Patrick's cathedral between 5th Avenue and Madison Window replacement. They have crappy non-historic windows, they're, proposing I, mean they're non-historic, obviously, but much less crappy windows. It's an improvement. It has some restorative components. We liked it approval unanimous vote. Good anybody have any questions. Okay on to land use all right, land use, I thought we were going to need resuscitation at the end of the meeting. We had five items on the agenda. It was a long, complicated, very important application. So, let's jump right to it. Some of them were super technical. So I'm going to skim over all the technical stuff because we really dug deep at the at committee 25 East, 21st street. This is a commercial building. It's actually a commercial condominium located in the ladies mall historic district, because it is a landmark building. Then they are able to use a provision of the zoning resolution that allows for a use change and they want to become a residential building. It is not a BSA permit. It is a kind of one of those non-discretionary applications where, if they fit the criteria, then they are permitted to change the use they wanted to. They are in order to be approved for use change. They have to preserve a certain percentage of the building as a commercial. They want to keep a little less than what is required. Initially, they wanted to preserve zero and we got them to agree to preserve ten percent. The tax says they should preserve 20. We felt that you know we had reached a you know halfway through deal and that it was good enough and we voted to support. The vote. Was everybody in favor, except one Nancy voted against this application? How many did you have Laila I? Don't have the voting in front of me I believe it was 11 to one yeah. Is that the one where she gave no reason, or is that the one yes and she gave no reason yeah? Okay, anybody have any question: okay, 118, all right, so the next one 118 West 28th street. This is a an application for BSA variants to permit the development of a non-conforming 12-story. Mixed-Use, commercial and residential building. This is also in a manufacturing district. Although it's in M1 6 district, this building is not landmarked. Therefore, this provision that applied to 21st street does not apply to this particular site. The applicant wants to demolish the building and build a 12-story tower on a very narrow lot of that is 20 foot wide. The committee felt that so in order to be approved for variance the applicant needs to meet five findings. The committee reached the conclusion that two of the five findings were not met and voted to deny the application. We also raised the fact that a 20 foot wide lot is a would lead to a sliver building. The sliver rule does not apply in manufacturing districts, because residential buildings are not permitted, but given that, if it becomes a residential building, it would have a residential zoning equivalent. Then we're raising we're flagging that you know we believe the this liberal rule should apply so the vote for this application was 10 in favor of a denial and one opposed what the sliver rule is actually a set of two articles of the zoning resolution that prohibits the construction of a residential or commercial building on a lot that is narrower than 25 feet. And so, if you have a lot that is narrower than 25 feet, a building can be built, but it has to be. The height of the building is limited. It has to be either matching the lowest of the adjacent of budding buildings or the width of the street. If it's a narrow street which would be 75 feet, whichever is lowest so in that particular instance, the lowest of the two adjacent buildings is a four-story building. So if DOB decides that the slip that those are the calls apply, because through this variance that they're seeking then they're becoming a r10 like a residential equivalent, then the building could not be higher than this four-story building. That is adjacent any other questions. Okay with that all right, so the next one that was the Fiesta Resistance Grand Hyatt Commodore Hotel- is being redeveloped. It is located in the greater east Midtown special district and the property has been acquired by Rxr and cornerstone in partnership, and they are proposing to demolish the existing building and redevelop a new building that would use all the provisions of the east Midtown sub-district, so they would reach a I think they're going for 30 far. They would incorporate all the remaining available air rights from grand central terminal and they would also seek a special permit for an far bonus because they're going to do transit improvements. What we reviewed was the draft scope of work, so we did not really focus on the project itself. We really focused on the scope that is going to be utilized to determine the environmental impacts of the building. So basically we looked at. You know what you can expect with that kind of development impact on transit, of course, impact on the blocking air and light that the building would cause shadow impact. As you know, the shadow is expected to reach. You know as far as Bryant Park and possibly even further, we talked about pedestrian congestion. We talked about open space, as this building is mandated to create a at least ten thousand square feet of publicly open, publicly accessible open space. So we talked about all these good things. We talked about bathrooms and we talked about you know the radius to which this environmental study should be done. We are so we made a set of recommendations where, basically, you know we're flagging all these issues and asking the environmental study to be done. You know looking at you know specific impacts and broadening the radius. The Tne committee is going to look at the proposal and make some comments which, hopefully, we can incorporate if need be. There is a hearing for this scoping document, there's a hearing of the city Planning commission on December 20th, but we can provide comments, written comments until January 12th, so you know, hopefully Tna can be more granular in the transit. You know Pedestrian Bus, subway, train and vehicular traffic review, so we don't really have a position, we're basically listing the areas that we want to be particularly studied and how they should be studied, beautifully done really comprehensive. It's great, it was I know, along with five six seven six other resolutions to be written, pretty amazing yeah. Does anyone have any questions? It's not often we get a four-page resolution, yes Clayton. So this is not a resolution, though right. This is a letter. Well, it's a letter yeah, but so I'm curious about which a letter is magnificent. I mean it's not only comprehensive. It seems exhaustive that I'm sure exhausting. Will the letter will the contents of the letter be in the reso packet or is that appropriate? This is one of those cases where I think it has to be, unless everyone really like that, it's a way too important project to keep that away from the rest of the membership and I. Don't know how we go about I mean. Maybe we have to put it as a resolution and say you know, whereas the we feel that you know those are the areas that need to be evaluated in the environmental impact statement and therefore be it. We are in favor of our statement. Do you remember how we did for east Midtown? Did we do a resolution Clayton, or did we do? How did we do it? Based on the research that I've done through the website yeah? He did not comment on the scope. We didn't I couldn't find anything. Oh my god, I couldn't find anything. Kim is the wizard at you know finding those loom the scope of the east Midtown resembling yeah. No, I'm sure that we did I mean I feel like I, can I feel like Eric read every page of it at the testimony. No, we commented on the project. Obviously, but we didn't like it but I. Don't know that we put anything in or let me rephrase I couldn't find it on the website and Kim looked as well. I did not ask him, so there is hope, because she she's really the wizard she's. She knows where things are: I still have my whole file. I'm maybe I'll, take a look. I think it's time to throw it out anyway, but I'll take one last look and say goodbye and away. It goes I like Leila's idea of the rezzo, though, why not I do too put that at the end and that kind of covers us with letters. Sorry I have a couple questions Laila. What would you prefer in terms of Tn's involvement, making suggested additions to this letter as voted on Thursday or bringing the applicant into the next Tne meeting I mean now that we know we can submit written comments until January 12th bringing the applicant into the next Tne meeting, get a more specific presentation on the transit improvements and then like T and e writing its own letter before January 12. I think it's better to submit everything at once. It's also, you know more efficient because they need to. They have an obligation to respond to every single one of our comments. So I think that if we present something that is, you know like a binder with everything together all the pieces. All the elements that we want to comment on, it's gonna be more efficient so that you know it doesn't fall through the cracks and then we realize that oh oops they forgot to address. You know one particular comment. So if you feel that your committee can provide all the comments that they wish to and we can vote on it Thursday that would be preferred. I think we can I would get the I would get your draft letter to them immediately like tonight and then I. We also still want to get that presentation with some of the more specific transit improvement proposals, yep for them to review, as well as the scoping document, because those things were not in the scoping document. So as the quick as however fast we can get that from the applicant would be preferable yeah or when is the board meeting in January I. Just looked it up, it's not until the 14th t e t itself meets on December 21st exec meets on the 12th and then full board is the 14th. Although it sounds like we're having a special session of exec for the Flatiron bid item. So we could okay, so here is a suggestion we could review present and review the letter Thursday night Tne would get the benefit of a full presentation by the applicant on December 21st. We would blend Tna's additional comments into the document that came from land use. That document would be voted on by exec. That would become. We would send that as our official comment to DCP and we would ratify this vote at full board on the 14th I guess the only if that I'm sorry when was it again, when was what sorry when's the hearing I guess we wouldn't read the final letter at the hearing. It would be submitted as a written comment. The letter in essence would have to be a different thing and much shorter, because I think we're only given two minutes. So in any case, the letter would be a summary of the documents, so only what you're saying is only the letter that you've prepared, which will really be a result because you're going to add a where, as a result, we'll go to the full board on Thursday. That's what you're suggesting now. No, it would go as a letter and a presentation. Item. Ej and Tne would have an opportunity to review the transit portion would add language to it would be ratif. It would be voted on by exec. It would be delivered to DCP by January 12th before the deadline, and it would be ratified by the full board on the 14th, so Thursday night you'll take questions and comments to be to tweak it on it. Correct, okay and we'll just have to make sure that our additional exec well, the additional exact meeting, would have to come after the Tne meeting on December 21st and before comments are due on January 12th, yes, yeah well, and actually before comments are due on January 4th. If we're gonna do this in one meeting, yes so Christmas day, it is happy holidays. All right is everybody. Okay, with that phew, okay, great all right moving on all right, then we reviewed the citywide zoning tax amendment for the zoning for coastal flood resiliency to update and make permanent the temporary 2013 flood resiliency Zoning tax amendment and you're going to wonder why we are even bothering we're landlocked. We don't have any waterfront, so we wanted to make sure that the tax, which is a city-wide zoning text, would not have any unintended consequences to CB5, and you know some of these provisions overall make a lot of sense and are great and are wonderful and it's you know, city planning really doing their job, but we want to make sure that they're not plugging a loophole that would, you know, come and haunt us and to would take forever for us to get rid of. So we did look at the text carefully, really from Cv5's point of view and pretty much it's all. Okay. The only exception is that the zoning text would allow for diesel generators to be installed in any building or property open space, which you know in outer boroughs in areas that have you know single homes and that type of built environment. It makes a lot of sense. For us, our open space in a lot is basically our rear yard, and that text would basically allow for a developer to install a big, noisy generator that would produce fumes onto this rear yard, which, although you know it would be unusual- and you know it would be- maybe of an unlikely. We could totally see developers actually taking advantage of that, because that would be deducted from any far from any floor area ratio. So we felt that you know having those big bulky things in an area that is, you know, meant to actually provide. You know a little bit of quiet and air was really a bad idea. So we voted to basically express this concern so honestly, after all that time, I can't even I, don't even remember if we did a deny unless this article is taken out as it applies to CB5. But basically this is our concern and it was unanimous vote trying to remember what you did, but it was unanimous right approval I think it was yeah all right. Does anyone have any questions? Nope got one more to go. Layla all right and, as you may know, governor's island is currently undergoing a major land use action that encompasses a number of different actions and upzoning and all sorts of other good things. Community board one reached out to all the community boards in Manhattan, and maybe community boards elsewhere, and I'm thinking of Brooklyn, given the proximity of governors island with Brooklyn, to basically seek comments, so governor's island is part of CB1, but CB1 felt that you know it is more of a city-wide issue than strictly a parochial issue. So we decided to look at the matter and make some comments. Aaron was actually super helpful in working on this, and basically we're saying three things. The first one we're saying is that developing a park is really a bad idea that parkland should we make parkland. It could be developed and enhanced for recreational activities such as you know, ball field or tennis courts, but it has to remain a you know, publicly accessible, you know active and recreational and passive use open space. We are saying that accessibility to governor's island is not properly assessed. In this proposal, and that you know short of a true commitment to accessibility, any proposal, any land use action is gonna, be flawed and then the third thing we're saying, is that the rationale being used for the development of governors Island, which is basically the governor's island trust, is saying that the part has to pay for itself and that currently it cost 23 million dollars and that they need to basically raise 23 million dollars annually. To continue to you know, pay for all this maintenance and programming and whatnot. It is a very dangerous and slippery slope because, if all of a sudden, all our products are required to cover all their operating expense themselves. Currently it's already the case for a number of our parks. But if those parks fail to do so through programming, then it means that they can start building to raise funds, and with that rationale, then, are we developing condos in central park, so the rationale being used is very dangerous, so we're basically flagging that in our comments. Okay, does anyone have any comments on that? One, more questions, all right that ends it for you Layla. Thank you so much that moves us into what do we have one okay, so we have two resolutions, this cycle and the first is our favorite topic, the creation of the position of the director of the public realm. We decided to call this back in order to turn our prior letter of support into a resolution and to add just updates from the applicant, not the applicant, but from the municipal arts society, and given also that we've since heard this at Bex and at full board. So this resolution doesn't really add more to the conversation past. What we heard three months ago when we wrote our letter of a position of support, but we did not end up sending that letter since as full board. We knew we were going to hear this as part of the budget cycle, so we held off on that and now have turned it into this resolution. The idea being that a stronger position to take would be for CB5 to have passed a full board resolution on the matter. So it was a unanimous vote of support and endorsing the proposal from municipal society. For the creation of this position, 17 people- okay, that's great! Anybody- have any questions or comments. Quick comment: can we make sure that this is sent to the department of City planning, as well as the city Planning Commission like to each commissioner, great? Okay? Marisa? Can you note that too? Thank you, okay and the other one Clayton, and then the other one is believe it or not a marketing event application Madison, Square Park. This is their first event application of the year and will be the only as you know they are contractually authorized to have up to four marketing events without any of their normal sources of revenue. This year, Madison Square Park Conservancy has been moving through considerable reserves that they had to keep their staff fully on payroll and with health, insurance, etc. Throughout this whole thing and the park in great shape- and you know it's a real bastion for people, obviously in our district, so they were relieved to get an event application. The event such as it is more of an installation of a big red kettle, which is kind of like a big poster for the Salvation Army to remind people that they exist, that there will be no bell ringing or coins happening this year because of Covid-19 and to encourage people to do online donations. I mean that's the idea. There's nothing about this installation is going to involve any amplified, sound or any handouts or flyers or anything of the sort. It's basically just a big red kettle. It is in the southwest gravel area of the park through our normal matrix parameters. There was nothing about this that really was a red flag for us and we did vote to approve it by 13 with three abstentions. This was the conversation that resulted in the very first abstentions. I've ever had at my committee and I was so shocked by it that I failed to address in real time, Vicky's critical point that an abstention is not neutral. So sorry about that, we had three abstentions, based on the nature of the Salvation Army and people's personal beliefs, about not wanting to do anything to show any support for that organization. We had a very long debate about this, and I will sum up that debate. Basically by sharing with you that, while everyone is of course entitled to their opinion, we have not as a board and certainly not as a committee reviewed the ethical nature of the content of an organization or company's work as part of the merits of a permit application. That's not part of the matrix. It's not been part of any other review or due diligence that we have ever done, and so it became a very strange question of well. If we're going to weigh in on this here, then, where does the questioning stop? Do we ask every applicant of every committee anything we can think of about any corner of their business practices and will that weigh in on any permit application? So that's the short version of the conversation. In the end, those three people did abstain and passed with 13 votes in support. Okay, anybody have any comments on that or questions it was interesting. Is that an issue that could be addressed in the same way that you talk about ex exam abstentions? You know that exactly what Clayton said that this is not something that is looked at because I know this tangentially has come up in landmarks as well: Laila yeah when people start talking about use, Layla's very strong on telling them I'm sorry. We don't do that. We're not discussing that now, as she will do on the whole scoping letter. She will say right, Layla that this is to do with what's in scope, not whether or not we think the Hyatt is beautiful or whatever it's all probably I think that the only time we comment on the character of an applicant is when said character has an impact on the application. You know. Let's say we know that a property owner does a terrible job with their buildings and that they're negligent. Okay, it's totally relevant. If we have a you know a developer, who is a convicted felon we're not going to take that into account that that's not relevant. You know if they're doing a good job as a developer, then or if the applicant is solid, then we look at the merits of the application, so I think that the character should not really get in the way unless it has a direct connection with the application and I think that was the position of the majority of the committee by far and you addressed that at some point too Clayton you did talk about that yeah, we did talk about it. Yeah I think Renee definitely is something that we should talk about, because we do have so many new people on the board and it I think it has to be discussed at the committee level, which, as Clayton did he brought it up and Laila does, but even so I think it should go to the full board. There may be committees that have nothing to do with that thing, and so it's not they're not familiar with the fact that this is not something that we deal with in. You know looking at the merits of the application, but I don't want to do it this week again it looks like I'm scolding, but I. It is a good thing. Yes, Sam I just have a quick question for Clayton out of curiosity, why did the people who had a problem with the Salvation Army abstain rather than vote? No, and this is interesting because it's an interesting conversation about when someone might feel entitled or preferring to abstain versus vote no, and in this case the committee member, who led the opposition to the application based on this. These parameters wanted to abstain, rather than vote no out of support for the committee and out of an acknowledgement that the things that she was opposed to were not within the purview of the due diligence and deliberation that we do of the actual application before us. So she was acknowledging that it was kind of outside of the bounds of the normal way to deliberate when she reached her conclusion and therefore wanted to abstain rather than vote. No, since she did not agree that it was a no vote based on the merits of the application. So it's very, it could be problematic. Even when we talk about it on Thursday night, because people will probably say, could someone who abstain? Please explain why and then you're bringing into the conversation which I'm not going to allow I'll, let them to end I'll. Let them answer, but I won't allow a conversation about their answer. They I can't stop them from saying here's. The reason why but I have to say if anyone else jumps on that and says well I'd like to also you know, talk about that. I have to say: I'm sorry, that's not within our guidelines, purview or how we address this. Just what Clayton and Layla have now said, but they can only do that during comments right. What's that they only do that during conferences. Well, usually what do I do when somebody asks the question then I usually say: I'm sorry, that's something for that person to comment on during comments exactly if they would like yeah, because it's not going it's not a question to the resolution right exactly that helps. But it is interesting because you can't stop someone from you know a voicing their opinion. You just can't do it anything else that was it okay Renee. Do you have a report, mute I? Do we had four items and none of them were action items, although I guess perhaps the flat iron bid should have been our first item. We had presentation from DHS breaking ground and the department of Mental Health and hygiene. The expectation was that this was going to be a really tough discussion and I was surprisingly not DHS really went through the number of shelters in our district. How they were cited. There were questions that were taken some beforehand. Some were presented beforehand to the board office. Others came in on the question and answer that was monitored by Julian Joseph Fuhrer. Basically it just you know, the providers explain what they each did. What breaking ground was seeing on the ground with the homeless population DHS explained why they cited the homeless population in the hotels where they were located generally, not very specifically, but the numbers people were told what to do when they saw behaviors on the street that were frightening or when people needed help. It went pretty well for questions that were not addressed during the presentation. Marisa was fantastic and she followed up on some of the questions where we didn't have the answers at that time, and we followed up after the fact so I think it went reasonably well. The rationale for that was that we were getting a lot of complaints about particularly two of the hotels on the West 50s and two in the west 30S. So that was the rationale for that presentation. Do you want to update the board on that or not? Is your before issues that were discussed? Do you want to bring them as a report to the board? We can I mean I can just do a brief summary of you know what was reported. You want to talk about the number of hotels that are used is that what you're saying you want me to explain that in more detail? No, I'm just not just saying do you want to say to do you want to? We have it here as your information to us on exec right. You are you planning, or do you think it's important, or does everyone think it's important that the full board here? What Bex did what Beck's heard this month? My own view is: maybe rather not I, don't want the homeless issue to start the process again, I think sometimes people ask the questions again and again because they don't like the answers and that could rev up that engine I think nothing. We can do about it right, I think the Flatiron bid issue we're going to be addressing that further, and so there's not really okay, you need to go through that throughout right. The second thing that we had was a film that we had from the great american smoke out, and so it was the high school student students from high school. The future came in. There was a black lives, black lungs movie, a little 15-minute movie that was sent to us beforehand, and we had a quick discussion about that. How communities of color have been targeted by the tobacco companies and that's something they're trying to that message, they're trying to disseminate so that was one of the presentations. They said that they will be coming back to us and it was really great because these kids made this video. That may be one item that you may want me to report on and then the final item is that Zach Behar- and we talked about this with Ej there's some legislation coming online that affects vendors and it's about expanding the number of permits, it's about creating an office or some unknown entity, we're not sure where it would land that will police the vendors. This is something that we've always looked at the bids. Testimony to the New York Council is that net vendors negatively impact their businesses, but the street vendor project notes that you know this is primarily immigrants, people of color, so this was just teasing out. There's there. This is a controversial issue is teasing out what we need to know. One of the things on Bex is that when we get these really complicated issues like police defunding, we rush it through, and so we really wanted to tease this out and work with Ej on this and figure out what we don't know and who we needed to talk to make it more comprehensive when it comes to one of the committees and so we're going to share Zach's report with Ej and his committee. Okay, I would report on the smoke out. That's kind of interesting and the high school students were great. They were, you know, I think it was an. It was something very nice too. May we share that video? Is there some way we can share that to the full board? That would be great not at the full board meeting, because that would open up a hole. You know for other videos, but we could I guess Marie said we could send it to all board members yeah we can. This is an instance where we could post the link to the video in the chat. For example, that's good one thing: I was going to ask about the homeless, I'm following on from what we heard in Bex and I know that we were supposed to look at the website. Is we have something, for you know people who live and work in the district, and we have something about you know. If you hear noises like from Nick's committee for liquor licenses, could we do the same about 311? If we see you know a homeless person or person in mental distress, the exact same thing here, the steps you should follow, yes, planning on doing that as soon as we get through this week, right sorry I feel like I always jumped on you Mauricio. No, we're absolutely planning on doing this. So it's on my list and just want to format it nicely and put it out as a one-pager. The other thing Renee just to let you know we are Luke and I- are doing a follow-up meeting with some residents on 35th street to kind of clarify some of the things that DHS talked about at the Vex meeting again I think they didn't necessarily like the answers and want to hear them a different way, but the answers will be the same. Always right. If you like the conversation just is it too early Renee or do we want to talk about the public toilets and that what where you know, maybe have Julie, give her an update, or is it a little too early now, Jul Julie? What do you think I think it's a little too early D.O.T has been non-responsive when I follow up with oh okay, I know Clayton, you you're trying to push it for January 4th, but yeah they don't provide information. Okay can I just add to that in terms of public toilets. What we're talking about between Julian Clayton is the apts right and so they're the automatic public toilets that are in storage, but public toilets as a general rule, like there's other ways of doing that, whether you know and maybe that's something that the board should start consider like in the way we've done. The director of the public realm like public toilets, is a huge issue. I mean it comes up again and again when we talk about homelessness and people on the streets, and all of that you know it's a huge issue, and maybe we shouldn't be constrained to the apts and getting parks, approval I, don't know, I'm just putting it out there and that just also talks something I got a very I. Think strange phone call from someone asking well. Let me ask the question they wanted to know. If public those public toilets the ones that we have, that the city has that are waiting sitting around, can they be put inside and the reason they're asking is they wanted to know? If no, the answer is no okay and they have to be hooked up to utilities to work electrical water because the question was they watched, Laila's meeting and said: why? Couldn't we put those toilets in the redo of the grandpa? You know the subway upgrades and so on and I had a clue whether we can or not. It doesn't sound like it works. But the answer is no okay, good to know all right. That's it Renee! Then you'll report on the smoke out and write everybody a link and really encourage them to watch. It was I thought it was a really good one. It's one of the nicer things that we deal with, especially when it's with the kids, so that was great. Was there anything else, I think those were the four issues and the three of them are kind of being worked on right now, right, okay, Nick! Do you have anything you want to update the board on for psql, not the full board, but I did want to update the exec committee on something if I may. So. If the committee remembers, we dealt with the glass ceiling events, application, which is a rooftop application right next door to guilty house. We denied their full liquor license application, and this the SLA supported our denial of that license. The applicant reapplied for a wine and beer license and over our objection, the SLA today granted that license they severely restricted it. They restricted the hours to 8 pm outdoors 9 p.m indoors. They imposed some significant restrictions, but still they did grant the wine and beer license. Is it true that council member powers like changed and then supported it? Yes, and the SLA did refer to that as a reason? Why that they were granting a license and what was that? I'm sorry, Keith powers supported their application. Oh my god, why did we what the real reason we're being recorded? The applicant hired a lobbyist and I suspect that the lobbyist was influential in you know we do yeah, we do they contacted us as well several times, and the other thing that was disturbing is even though we're recording, I'm going to say it. The fact that it almost went through without going to us Nick, if you want to explain how it was caught yeah, we were caught by surprise this hearing the skit. They scheduled this for the full board of the SLA I think it was a week two weeks ago, without giving us notice without giving the guilty house notice without giving anyone notice and the attorney for the guilty house saw that it was on the calendar literally put on the night before, and we all had to object because we weren't given notice, so they postponed it for two weeks, but it was interesting that it wasn't really calendared in advance and none of the people who were on record opposing the license were given notice of the hearing. This is very disappointing and this is really where distrust stems from and it's a problem. It's really a problem. I was just trying to think of those instances where CB5 in particular has taken a position and an elected has gone against us. You really have to think, and then my question to myself is: should we say anything, I'm gonna jump right in I think that this can not be left unaddressed. It can not be left unaddressed, especially given how sneaky you know. Everybody ended up, trying to act and I'm referring to the applicant and the SLA, and you know somehow that kind of Mo manifests itself after the applicant hires a lobbyist. I think it is really very problematic and I think it has to be. It has to be said, I agree as well, especially how much public outrage there was not meeting I mean that was a terrible meeting and for them to you know for them to move forward. I almost think it's almost on you know. Notification of the community that that's happening is almost key because, like you're saying, if no one knows that's happening, no one's gonna, you know object, it's it feels like almost you know shady that, there's that it's so quiet you know definitely Nick. Do you want to draft something sure I think we should say something. I really, you know we might even want to. You know make a call to Keith Power's office yeah. Are you sure that we, you don't want to give that report to the full board Nick I can, if you like, if you think I mean the board did weigh in on this I would love. If we're going to do it, then I would love to hear about it. I think that you know they should know yeah. Absolutely that's the only power we have you know bringing stuff out in the public. That's the only power we have yeah and on this one it is just it is so disappointing. It is so unfair of the applicant. You know it really reflects very poorly on their business ethics and their character, and it is very disappointing of our council. Member to you know, take a position that goes against our recommendation. I can certainly stress that point. I'm wary about saying anything about the Slas being failing to notify you know and assigning any suspicion to that. I can certainly state the facts. I also don't know you know how relevant it is to disclose that they hired a lobbyist. Although I could probably say that you know we were contacted by a lobbyist and we suspect- because we don't really know you know, I, don't know it's really conjecture, I. Think sticking to the facts is absolutely damning enough. Okay, you know you don't have to editorialize in any way shape or form you state the facts and I. Think the only part where we can comment is that it is disappointing that our council member decided to vote against the position of the book. That's a fact, yeah and I think that again, if we're going to write the letter, then the full board should know and hear exactly what went down, because that letter will not go back to the board for approval. But if everybody has heard it and no one has said, hey wait a minute, you know I think it's a great idea that they got their. You know that they went against our recommendation. Then you know it just makes it a stronger reason for us to send letters and to make our as Layla says. Our voice is heard, because that's really the only thing we do have you're absolutely right. Also, to put a fine point on it about the council member, it's not just going against the position of the board. It's if memory serves changing his own position in contradiction of the board's position as well, because at the time of our initial opposition he also he backed us up, then one of the. So this was a different application. He was supportive of the wine and beer I think he continues to oppose full liquor. I see so there's some gray area there Nick do we have a position on the wine and beer we decline. We denied the application on the same grounds, got it. Okay, great, so that'll be a report that goes on the agenda Marisa as well. You want to give a heads up to member power's office, I'm afraid I'm going to answer too quickly. I'll, let everybody else answer I would say: yes, I think so, you're a better person than people in the front. We don't stab them in the back, say that again we stab people in the front. We don't stab them. Okay, it's a personal comment. It's just you know, I agree too. Everybody I'm prepared. What's up I said I'll, let them know to come prepared. I agree as we were sorry, okay, the worst thing they can do is explain themselves and if they explain themselves in front of the group, that's not a bad thing. If we hear why he changed his mind, I mean I'd be curious. Quite frankly. So if they know ahead of time, we might get some answer. It might be a political answer. It's at least something so I mean speaking as a former rep for an elected official. The worst thing you can do is go to a meeting. Have the wrong person at the meeting to answer questions. So if you can just make sure the right person is at the meeting and they will explain themselves or not, but you at least have the person there that can explain the position. Okay, I'll go along with group all right. We need order the order of the reports. I'm sorry I have to jump off. Okay, you doesn't matter where you are I, don't think so. I think the public might be interested in commenting on Keith powers, but early or you want, maybe because the public has been very vocal about this. You want to go first, I, don't know if this deserves to be first, but whatever you think Renee's shaking her head. I say: yes, yeah me too. Okay, all right goodbye, I gotta, go sorry! Thank you! Okay. So we start with psql report, which means that I think what Nick was saying was that it'll be on the agenda and people might come and speak about it. Isn't that what he was referring to yeah? Okay, that's good, okay, and then you want to do landmarks with Layla you like to break in between yours, so you want to put Renee in the middle of the report and then yeah. Maybe we can start with land use, because we did have a large attendance to the land use committee meeting in the end, not that many people spoke, but certainly there were lots of people who were interested. So maybe we put land use after psql, okay, so psql land use, then and sorry just what's. The order for land use. What do you want to talk about of those applications in what order is it? Okay? If maybe I, send you an email a little bit later this evening with the order? Okay, great okay, then Clayton. Do you want to go or do you want Renee I? Don't care, I'm happy with whatever okay either she'll be. Third marks will be third, okay and landmarks, Layla yup? How about we do Renee's report and then landmarks? Is that okay, yep? That's fine! Okay! Is that all right, Renee, perfect? Okay, all right Marisa! You have that esql land use, Parks budget report and then landmarks and Clayton does it? Do you want to do those in a particular order? I would do public realm first, thanks. Okay, guys, a lot of other boards done the public realm. Now at this stage, do you know I, don't think so? I don't I, actually, don't think so, and I'm hoping that changes I know and we keep talking about it at Bro, Boarding Dale keeps bringing it up and I keep saying you know, ask for it. Go I, don't know why I don't know. We can't do it for them, you know, I, don't understand it and they're all like kind of a Gog. Oh that's great, that's wonderful! Let's do it and then they do nothing. I, don't know all right. Gang I got a hot all right. Thank you! So much guys this was a long good meeting. I appreciate all the input. Thank you. Bye on Thursday, see you Thursday.",
            "summary": "Most important thing is to note who's at the meeting in terms of who's, presenting on a certain application.\nSuch and such I mean we've never done that, but I personally feel that we miss a lot of what I think is important.\nI, don't know how anyone else feels about that, and we may want to think about it, but it was always kind of shot down when I suggested it.\nI think it would be a more thorough reflection of how we reach our determinations, especially given that we don't give minority reports at the full board.\nYou, know, I think it's important for the full board, because that's the one that people if people want to know how did community board 5 deal with this.\nBut I, think it would apply to committee meetings as well.\nThat mean if we have a resolution, that 10 people on the board support and make comments about in support of it.\nCan, you think of one where we, because you and I've talked about this, where we thought that it was important that something was brought to the board's attention, but it didn't necessarily go into the reso and it wasn't in particular.\nIt was something that is important, I guess, the more we talk about it, the more difficult, okay, Clayton, one second, the more difficult it would be, because the person who's transcribing would have to figure out whether or not it's important enough to put it in, Any time that a committee chair might explain or remind the board why it is that we are doing a deny unless or an approval with conditions that whole thing like a conversation around strategy.\nSomebody is trying to figure out why we worded it that way, What, if I, could do this as chair and work with Craig on it that during the meeting I just and maybe a couple, others that we could assign to do this, make notes of things that we think might be important to put into the minutes collectively, rather than have it up to one person rather than having to decide.\nI mean what I'm thinking about is the a couple of months ago when we had the resolution on that's upon the police and that went on for a long, time.\nThat was not on the agenda and that's very unusual, and so after talking to a few of you about this, the conclusion that we came to was that we would allow it, but it would be considered new business at the end of the meeting, and maybe anyone could make an a chair could make an announcement and say if anyone from the public wishes to address an issue with us.\nYou want to talk about attendance during Covid-19 and virtual meetings and the things that we've discussed because of the difference of not having a body in the room and knowing who's there at what time.\nCommittee chairs, especially on Zoom board meetings.\nBecause I mean it's okay for people to be a few minutes late that happens whatever and in a normal committee.\nAnd I, don't know if we have to resolve this right now, again, but just for committee chairs and everyone to be thinking about what makes the most sense and what is good for managing expectations for people and also just seems fair and as simple or streamlined as possible would be great too.\nI mean as a you know, as the same requirements for attendance, for full board are the same for committee.\nAbsolutely I mean I like Clayton's idea that in the middle you know, if there's no action items in them somewhere random time in the middle, you just chart who's, there.\nOnly problem with a specific time is that you know the chair may not want to interrupt the conversation exactly at 6:30.\nIf, you miss a vote, You know then you're not present, and then maybe it's up to the chair.\nI believe that in the past, when we were meeting in person, if someone missed a vote, even if it was just, you would have a board member who would step out with an applicant to deal with some ongoing issue and they would miss a vote.\nMeeting, because I'm, giving them a little hubba hub on a couple of other things, I'm not going to overwhelm them with or scold them with too many things so, which takes me to the next thing that I wanted to talk.\nLaw. Any remarks about CB5 business or questions about agenda topics should be made on the record by raising your hand through the raised hand, feature, and then I'm just going to mention that some boards have deactivated the chat, because some of the necessary discussion that needed to be spoken publicly was taking place there instead, and this is what we ran into last month, actually, which is why I'm now addressing it.\nYou know really things that are supposed to be on the record, which is the discussion that goes into coming to a conclusion and a decision on an application, It can't be done in chat and other boards have found that to be problematic.\nOkay, can I assess a clarifying question, so you'll notice on this zoom meeting that the chat is not enabled, but there are a few different ways to do it, so you can enable chat just for the panelists and not for the attendees, but I think that once you start with the chat.\nAnd I personally support just shutting down the chat entirely and as with an in-person meeting, you know making sure that all statements are made in succession when recognized by the chair.\nYou know, part of the record, Clayton and Renee that, and also if two attendees in any of our committee meetings were having like a side conversation with each other.\nThat, okay with you absolutely I, agree: okay, maybe we'll drop it from committee and then think about Maurice's suggestion and just or Laila's also a suggestion about having two or three of us handling it in the way of information.\nOkay last just to let all of you know we did have someone at one of the committee meetings mentioned that they were abstaining because they wanted to be neutral.\nAnd I think it's important, even if the greater majority of the board understands and knows that an extension definitely is not a neutral.\nIf you want to, but don't think for a second, that it's a neutral position, so that'll go out tomorrow as well, and then we have one item before we get to our committee meetings and.\nYou can jump in and help just so that I explain to everyone, because what I'm looking for is affirmation or discussion on whether or not this should go to the full board as a committee on the whole of the whole on Thursday night.\nI believe it was unanimous at Bex, but I think it was ultimately approved at exact, Am I right Marissa on the resolution.\nThey dropped a little bomb by saying, okay, This is going to go to Euler, so be expecting something from Mueller which set off a you know a big ring in my head, saying.\nSo I'm asking if we as a committee, want to put it on the agenda, which we have the right to do.\nThat, as a matter of public record that the Flatiron bid and anyone else paying attention understands that if something is going to eulerp, you can't just let us know.\nI. I just want to point out just to Clayton's comment on the Flatiron bid, While they knew it was going through city planning, I.\nIt wouldn't be able to come back to the board to another committee at that point, So they really came to the board as an update in their process more than you know to get any finalized ruling from the board.\nMarisa do we know when it was certified by city planning, because Euler is extremely codified, I mean it looks to me.\nI, think you know the original Layla is that what you're asking for whatever is on record with Gcp. We will put this on the agenda and Renee.\nSo originally, If you recall, the Flatiron bid, came to the community board and explained that they were thinking of expanding their reach and they had a map that went over to 6th Avenue and up to about 31st street, and that map underwent some iterations.\nLike 30th 31st, there's a little cutout around 33rd street and then over to Lex. There was one public comment at the meeting and then a couple of follow-up letters from some folks that wanted the bid to actually extend up to 34 over up to 32nd street I.\nThink from 31st street, so I will just say very quickly, not as a member of the land use Committee, but as a resident who would be directly impacted by this expansion.\nNo, So I would suggest that we include it in the packet that we give it a heading explaining what it is and let the you know the questions and comments take us to whether or not we're going to just add to this and still approve it or make it a you, know, a disapproval or whatever, but I think we have to have something to work with, especially since no one saw it in March.\nI mean I was just thinking more along the lines of enabling them to address questions like Laila.\nIf this was a typical committee meeting, Layla would ask her questions and the applicant would be able to answer them if we do it.\nIf a committee doesn't have a quorum and if a applicant goes to the committee meeting and makes their presentation- and the committee passes it on to the exec committee for their approval and to bring it to the full board.\nSo factually the application has changed, let alone the fact that the pipeline process has now been better understood, and we know that it's a DCP action actually just for the record I went on the DCP portal.\nIs that when an issue like this comes up, they call a pre-meeting of that particular committee just before the full board, and so that committee has basically a second meeting and votes on the particular application that then goes directly before the full board.\nI mean that the land use was the reason why community boards were created in the first place.\nThis is like, as Layla said, land use is one of the things that community boards were created.\nThey will be able to have another, a committee meeting for the application before that, but they won't have a full board vote.\nYes, but before the regularly scheduled committee meeting of January right, okay.\nI would vote for the joint meeting because of the strange circumstance of Bex. Having heard this it'd be worth seeing, I agree, I really feel if you're a k, Renee I think it should be joined.\nI agree not to mention that with two committees, given that it's going straight to exec, we've already have half the board, Having heard it which helps exactly so.\nOkay on to land use all right, land, use, I thought we were going to need resuscitation at the end of the meeting.\nThe committee felt that so in order to be approved for variance the applicant needs to meet five findings.\nWould you prefer, in terms of Tn's involvement, making suggested additions to this letter as voted on Thursday or bringing the applicant into the next Tne meeting I mean now that we know we can submit written comments until January 12th bringing the applicant into the next Tne meeting, get a more specific presentation on the transit improvements and then like T and e writing its own letter before January 12.\nThese parameters wanted to abstain, rather than vote, no out of support for the committee and out of an acknowledgement that the things that she was opposed to were not within the purview of the due diligence and deliberation that we do of the actual application before us.\nThe reason why, but I have to say if anyone else jumps on that and says well, I'd like to also you know, talk about that.\nRight, I think the Flatiron bid issue we're going to be addressing that further, and so there's not really.\nOne of the things on Bex is that when we get these really complicated issues like police defunding, we rush it through, and so we really wanted to tease this out and work with Ej on this and figure out what we don't know.\nI think they didn't necessarily like the answers and want to hear them a different way, but the answers will be the same.\nWhen we talk about homelessness and people on the streets, and all of that you know it's a huge issue, and maybe we shouldn't be constrained to the apts and getting parks, approval.\nI mean that was a terrible meeting and for them to you know for them to move forward.\nI almost think it's almost on you, know.\nI almost think it's almost on you, know.\nI can, If you like, if you think I mean the board did weigh in on this I would love.\nAnd I think that again, if we're going to write the letter, then the full board should know and hear exactly what went down, because that letter will not go back to the board for approval.\nYou know I think it's a great idea that they got their.\nYou want to go, first, I, don't know if this deserves to be first, but whatever you think Renee's shaking her head.\nSo, we start with psql report, which means that I think what Nick was saying was that it'll be on the agenda and people might come and speak about it.\nWe did have a large attendance to the land use committee meeting in the end, not that many people spoke, but."
        }
    }
}