{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB2",
            "channelId": "https://www.youtube.com/channel/UC5pIWJ7JS12PLCAkwIoa8ig",
            "title": "Manhattan Community Board 2 July Meeting",
            "publishDate": "2020-07-24",
            "shortDescription": "Manhattan Community Board 2\\nThursday, July 23, 2020\\n6:30 PM"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB2",
            "normalizedName": "Manhattan Community Board 2",
            "twitterName": "Community Board 2M",
            "youtubeChannelName": "Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC3kEY0n-RPRYE6rOlfstFDQ",
            "twitterHandle": "@CB2_Manhattan",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 521,
            "um": 373
        },
        "wordCountFullTranscript": {
            "people": 97,
            "community": 65,
            "board": 64,
            "fire": 60,
            "thanks": 57,
            "lot": 53,
            "city": 49,
            "resolution": 48,
            "time": 45,
            "committee": 44
        },
        "wordCountSummary": {
            "community": 22,
            "board": 20,
            "people": 19,
            "resolution": 14,
            "streets": 11,
            "school": 10,
            "members": 8,
            "office": 8,
            "issues": 7,
            "lot": 7
        },
        "fullTranscript": "Our numbers are rising, huh david. Can you mute yourself? I can't okay, brad is gonna, be joining us. Correct, doris! Is that you I'm here okay, good technological hurdles. Here I think we've got just making sure we don't have any board members that have registered in the public side of things. Thank you. How are we doing valerie yeah? I was just going through just to make sure we didn't have any other board members who all right. Sorry, since we're doing we generally start our meetings with attendance and valerie is going to be valerie de la rosa. Our secretary is going to be taking attendance and I'm going to put into the chat a link to the documents that we'll be discussing tonight. Valerie. Do you want to start sure thanks carter, susannah aaron here? Thank you. Akilah asqui, william banesh, here, keane, burger carter, booth, katie bordenaro here, yeah katie- is that you that katie bordenaro is here. Thank you. Amy brenna, yes, ritu, chauchary tom connor, valerie here, doris diether. Is she on the phone? Perhaps she is. I had muted her. Let me just hi doris thanks bob ealey cormac flynn, joseph gallagher, here thanks wayne cawadler here janine kylie here patricia o'leary here. Thank you, michael levine, here janet left here. Edma here awesome, matt metzger, here thanks daniel miller here, brian pape, I'm present donna raftery. Here, thanks lois rachael bo rick cabono here lois rackluff is here. Thank you. Lois got you bo as well robin rostin here, thanks sandy russo here from rocio sands, here great scott sartiano, shirley, secunda, yeah kristen shay, I'm here thanks, roderick siegel here, georgia, silvera siemens, here shirley, dr shirley smith, president thanks chanel spence, here, kathy sullivan eugene, you here and susan wittenberg, here anthony wong here and adam zeldin mara's here. Thank you mom! I'm here sorry thanks, adam yeah, you hear me keane, I'm here hi kane nice to see you. I got you now valerie, I'm here too. It's anita! Oh! Thank you! Snuck in yeah! Hey! Do we do? Is everybody had a chance to register their attendance? I'm going to just start off by muting everybody just so we have less background noise. Okay, I'm here for the time being, valerie, it's david! Thank you, okay, all right, so I muted everybody thank you valerie, so we you're complete correct all right. Thank you. Now we're going to move on to the public session dan miller, our first vice chair is going to run the public session thanks very much. Do we want to let senator boileman speak first brad. You want to jump in. Thank you for joining us thanks for having me we're just back from albany, literally carter and dan just finished minutes ago. The wonders of virtual technology, I'm here in new york city, but I passed 13 bills over the last three days. So I'm proud of that including bills that I think have some impact on our daily lives. One would prevent these so-called slack lawsuits from going forward in the state of new york. A slap lawsuit is a strategic lawsuit against public participation and people like donald trump and harvey weinstein and the you know. Powerful corporate interests often file them against advocates who are speaking up, who are critical. Sexual abuse, survivors newspapers, journalists and they drag them into court on really thin grounds of on issues like defamation, and they basically try to intimidate critics by these lengthy lawsuits that bankrupt a lot of small organizations and advocates so there's a higher threshold. Now that we've instituted through our new anti-slap statute- and it's gonna, I think, protect the first amendment and I'm very happy about that. The other bill, the other big banner bill that I passed is called the protector quartz act and that's going to prevent ice agents from hanging around courthouses, which they've been doing all across the city. Waiting for undocumented immigrants to show up who might be a witness to a crime might be there on behalf of their own matters such as domestic. You know abuse case or just be with a family member, and they will hone in on them and arrest them for attending court, and that obviously, is a huge barrier to justice, because we need people to go to court and court is a is a should be a sanctum where we, where we pursue justice. So no longer will these types of civil arrests be able to occur in the state of new york without a judicial warrant or a court order. So I'm very happy about that. Another bill I passed is going to ban a very dangerous chemical called pfas. It's a forever chemical, it's the kind of chemical that is often found well, it originated by the dupont company when they made teflon it's a non-stick surface and lo and behold it turns out. Teflon is a carcinogen and extremely dangerous, especially when it seeps into drinking water and I've been on a tear in albany, I banned it from being used in firefighting. Foam because upstate firefighting foam is used by volunteer firemen unbeknownst to them and endangering their health, but when they practice on like tarmacs and airports that firefighting foam, when they, for example, undertake a scenario that a plane might be landing with, a fire they'll spread it out on the tarmac and then it seeps into the water table and it doesn't disappear and it's connected to a whole host of issues, including cancer, but also hormonal issues and others. So we're banning it in new york state from food packaging. It's used as a non-stick service in pizza boxes, believe it or not and can easily be transferred to food items, therefore, and ingested by all of us. So we're banning that in the state of new york, I'm proud about that. I passed legislation that will require the mta if they're gonna, if they're, not gonna, keep the 24-hour service. My bill says: either you keep the 24-hour subway service or you have to take a public vote on it. It's the very least the public deserves to know where the mta and how they're making the decisions. I don't think we should use the pandemic as an excuse to reduce service. Notwithstanding the fact that we're having an enormous financial, you know crisis at the mta, we need a public hearing on service and that's what this bill would require and then another bill I passed just today is banning ghost guns. I don't know you may have heard about those are. Basically ghost guns are basically guns. You assemble at home without serial numbers, so they're not traceable by law enforcement and because we have such tough gun laws in the state of new york, which is a great thing. Ghost guns have become more popular by people who want to traffic illegal guns. Some of them are printed, you know through 3d technology, but a lot of the parts you can buy on the internet and you can buy, for example, a semi-automatic gun, that's 80 percent finished and you take it home and you have a kit. You have a screwdriver and milling devices as they call them. You can get a youtube video and continue to finish your semi-automatic weapon at home and never register it. So it's a glaring loophole under gun laws and with this legislation we'll close it, we pass it in the senate today. So those are a few of the bills we pass over. This kind of you know, very, I would say productive last several days in albany, we'll probably be going back shortly. Once we hear what the federal response is to additional need by the city and state, we know it's great everything, ranging from tenants to small landlords to to our small businesses, our hospitals, our public schools and our mass transit. We're gonna need federal aid to dig ourselves out of this crisis, not to mention you know the health crisis that still is ongoing and then a final word carter on my legislation to make permanent the governor's order for alcohol to go and as well as deliveries. Thank you for your input, here's my conclusion, and I think some of you share it and I appreciated the calls and emails and meetings that kendall had with you. I we're putting that we're putting that bill on ice right now, given the really disappointing response by many patrons who are violating social, distancing laws and causing havoc on our blocks, we're going to you know continue to evaluate the governor's order. Still stands we'll have time to reassess it once we get a more clear sense of how enforcement is going to be handled, there's a lot of concerns on both sides. Some restaurants are, being you know, issued summonses, you know and it's a very difficult situation for them. On the other hand, we have constituents neighbors friends of ours who are afraid to go outside of their home because the crowds have become so large on some evenings and they're concerned with their health bottom line is public. Health has to come first, so we'll see how the governor's executive order continues to unwind and how enforcement proceeds and then reassess that on a later date. Well, thank you very much. Do we have any questions for state senator homan? I just want it's not quite a question, but those slap suits that you started out talking about are used and have been used very aggressively around tenant organizations and the expense of having to defend those suits from large and even not quite large landlords is a very effective way of defeating the tenant association. That's great thing, you're doing. Thank you if I could just yeah. Thank you for saying that, because you know I was in part inspired by that very scenario. Michael mckee, some of you may know, is the longtime head of tenants and neighbors and and a friend of many as on this call, including katie, and he has been in court for more than a few years as a real estate organization has dragged him and his organization on trumped up charges, trying to silence them and really bully them and to you know as some sort of act of retribution. So this new standard, I think, is going to help exactly what you're envisioning. Can I ask a question? Yes, hi senator great job having a very productive last few weeks after this last week here I understand why you would put the drinking on ice at this point. Just a friendly observation, the street closures allowing for restaurants to serve outside. I felt as such a nice experience. I don't know, that's a pivot that may be worth considering in the future, maybe during summers and months. They continue to allow this, because it's just so wonderful you know get out there. I think no right. I appreciate that and I think really you know I think I heard some. The situation is evolving right on many fronts, as it pertains to restaurants, alcohol to go and bars. I basically need to feel more comfortable about enforcement, but not not indiscriminate enforcement. That kind of punishes you know, restaurants, who may not have you know who may not be responsible, there's a lot of responsible restaurant owners who are doing the right thing and a few bad apples, as is often the case, but it's a lot of it's a lot of the patrons. You know the bottom line is you know when you give someone a cup, you know with a straw and you know and sell it to them. You know what are you expecting so we've looked at potential amendments that would tighten the the governor's executive order in that regard, but I think I'm gonna leave it to the governor to step up enforcement or at least make it more routine and predictable for everyone before we try to pass a bill at this stage, great I'm gonna, I'm gonna ask everybody to please be recognized to not just speak. If that's okay, because we have a number of hands that are being raised, is that also some of these beepers going off somewhere, not sure? That's my daughter's chicken nuggets I'll turn that off sorry, okay, we do have three more questions from you from the community board. So let me I'm gonna recognize, no, not you yet not yet sorry, I mute matthew and then william and then ed okay. So let's wait in that order. Let's wait for senator boilerman to get back to a c and then ed, let's go ahead and meet you, because we can mute ed for now and then unmute matthew. Thank you. I can't see whether the center is back. I'm back! Oh, you are there. We go so, first of all, thank you so much second and katie really exceptional work. As always. I am not one frankly for hyperbole, so it's always been annoying when people talk about the destruction of the democracy and you know, fears of a totalitarian state. I think those people may have been more right than I were would have admitted previously. I'm deeply concerned about the idea of federal agents being deployed to new york city new york, state buffalo anywhere. Is there anything at the state level that's being discussed? Is there anything at the state level that can be done in order to prevent some of what I would consider pretty horrific constitutional violations being occurring on the west coast? Well, at the state level, I think it's a continued. You know focus on I'd like to think they protect our courts. Act sends a message to the federal government and to our judiciary to keep our courts. You know free of that type of harassment of litigants and witnesses and family members, but I honestly think most of these bigger picture issues are going to be decided in november and you know urge everyone to participate and in elections, no matter what their political preference is. This is. This is a crucial time as well as fill out the census. You know we are it's a bit of a non-sequitur, but not we are less than half of where we were 10 years ago in our district census count, and that is really frightening because we're losing you know for every person who doesn't fill out the census. You know it's a few thousand dollars that in direct federal aid that we that they were going to lose. So I would you know, I'm going to be stepping up my public campaign and in connection with that, I sent out mailings and put it in my newsletter to my newsletter this week, but we have to do I think in all hands on deck approach before we lose out on lots of federal aid and then and then finally, I would say that you know new york's doing a you know. The issues around policing, I think, are important. The reforms that we've instituted, such as the repeal of 50a just this session to make no longer will police personnel records, be secret. I think, goes to the issue of trying to instill more trust in the local community. So hopefully we won't end up with a situation like you have on the west coast. Great, thank you so much and then william, yes, hi, senator hoyleman. Thank you so much. I was really glad to hear about the bill that you passed banning pfas and packaging. Thank you something that people don't know enough about and haven't studied necessarily as much as they should, but my question's in further regard to that. I believe in 2017. The clean water infrastructure act called for further investigation into pfas contamination in water, and I was just curious whether in this latest discussion of pfas for packaging, was there any further discussion of enhancing our water infrastructure kind of to better filter out peak mass. You know: well, speaking of pfas, there's a great movie called dark waters which I think is streaming now starring mark ruffalo and it really encapsulates the whole fast environmental crisis takes place in a town not far from where I grew up in rural west, virginia parkersburg, west virginia, which was contaminated by a pfest plant. But here in the state of new york, we had our own pfest debacle in a in a small town and and resulted in you know a lot of people who may develop health conditions down the road, including infants and children. But one of the things we did pass this session is a bill to make illegal dumping a felony and to really toughen those penalties. You've seen this kind of you know wanton dumping in places like along long island, where it's sometimes just seems to be the cost of doing business, but we've now made it a felony and do we know we have to protect our water infrastructure through those types of efforts. We passed a mother nature bond act that is going to be on the ballot in. I think two election cycles that will, if approved, provide billions of dollars. In addition to you know what we're doing already in terms of environmental efforts to protect water infrastructure. So those are a couple of things on the horizon. Thank you. Great channels is next. I just want to let everyone know that questions are only reserved for the community board members and it won't be open to the public. So if you do have your hand raised it's not that I'm not going to call on you, it's because that's not what we do on a community board full board, but I encourage you to write directly to senator wellnet channel. You have a question. Yes, the question is old masks and it relates somewhat to the bars and less to the restaurants. It we see every day from dr fauci on down about the importance. Yet it's simply not working to say it's a good idea. Why not compulsory math squaring in public by everybody all the time? It is a law through executive order. You are required to wear masks in public places. Is the street a public place? Yes, it is a it is. It is a good. It is an executive order by the governor. Then it's the enforcement and it's and, as you know, as you know, chanel it's always it's always the enforcement, and- and we saw that in some places you know enforcement has been. You know indiscriminate targeted at certain communities on the lower east side, a young man of color, like was thrown down by some cops, apparently because he wasn't social, distancing or wearing a mask. So it's tough. It's a really tough issue. Some colleagues of mine had legislation to you know to criminalize it to basically codify what the governor has said through executive order. You have to wear a mask together on a subway train. That's in place, you have to go. You know you have to wear a mask in a in a public place. They it they're if you're, if you're, if you're beyond six foot of someone, the executive order, does give you some some leeway there, which I think is reasonable, but essentially we already have that law, but it. But you know it's not work. It's not. Working and I'll. Tell you what you know. I saw a group of cops tonight. We were walking through union square with my daughter and out of the mouth of beige. She turned to me and she said daddy. Why aren't those policemen wearing masks and none of them were and it sets you know it's just. I think it sets a really bad example. I gotta be honest. Well I yelled at the mannequin outside teachers, we're gonna we're gonna keep moving on because we have a long session tonight, but we're gonna put you on mute. Okay, we got ed ma. Has a question. Yes. Thank you. I think I think senator hoyme already relate to the has answered the question relating to federal troops. Overstepping the local autonomy, I think, has a clear answer. Yes, thank you. Thank you senator hoyoman for help, so many legislation instituted by you in the past few weeks and regarding the local, the public health. Thank you very much. Thank you. Okay, so, actually you know senator holman. We actually have two speakers, public speakers that are speaking about a bill that I believe you wrote that might be interesting for you to stick around since we're going to talk about senate bill 8392. We have a leslie clark if we can make her live. Oh, I know leslie we've spoken about it great, so leslie you wanted to speak publicly, I'm giving you your chance if you're around. Yes, can you hear me? Yes, we can hear you I just want to let you know the rules are that you have no more than two minutes: yeah we'll be keeping a timer on you and I don't want to be rude, but I will interrupt you after two minutes. Thank you, I'm not going to talk for two minutes. I believe that the that the agenda item was the resolution that you had written on this subject, and so I have prepared just comments on that resolution that was written by the sla committee. I wanted to support the resolution because I think it very accurately reflected the testimony in two different sla committee hearings against the bill: the union, the unanimous opposition by residents at both of those hearings. I also supported the resolution because it admits that new york state liquor authority currently has no ability or legal mechanism to enforce transgressions by patrons drinking in the public domain, and I hope we can also admit now, after four months experience that there won't be any enforcement mechanism under any future bill, such as the one that senator hillman has proposed. There simply is no enforcement mechanism. The only way to control take away drinking is to not allow take away drinking. That's why we have alcohol beverage control laws in the first place, I believe the governor's executive orders have basically gutted the abc laws, and I am opposing senator heyman's bill and in favor of the sla committee resolution, because I think that bill would also gut the abc laws. Thank you thanks very much, and then one other speaker on this issue is elizabeth. Saba. Oh, can I just say something is: isn't everyone glad that jeans is going to get a lifeline by having an outdoor cafe? I wanted to thank the speaker, the speaker, for his efforts in that regard. That's really great one more speaker and then we're going to go to gail brewer after this one public comment: hi everybody, yes, hi elizabeth here hi, I just I'll, be brief. I want to offer my support to the very clear and detailed resolution that you've prepared that so emphasizes the problems that this particular bill offers up. I just want to add for the record that I find that this bill is so egregious not only in terms of health and safety, as we've all been witnessing and detailing, but also in terms of going forward. I think I think that it really holds the potential for an expansion in alcohol-centric culture. I have visions of potterville and it's a wonderful life for bourbon street and I don't think that we need that. I think that there are other ways to secure revenue for new york state that do not involve alcohol, and I think that if we were to put this to a referendum on the ballot that most of new york city residents would agree, so at any rate, thank you so much for the clarity of your resolution, and while I appreciate that this bill right now is on ice, I would prefer the language in this particular case that it's tabled. If you follow my visual there, so thank you very much great and we have okay, it's tables. Okay, thanks brad, any any other comments before we move on yeah. I think I you know. I hope I hope my neighbors and the board members recognize that new york state is in his 15 billion dollar deficit, and what I was trying to do was provide some sort of economic lifeline to these businesses. Many of them who are so cherished in our neighborhood, like jeans, like knickerbocker down the block from me, for example, some of them have been here a century or longer and are disappearing like nyx, which is a great vegetarian. Restaurant university place through no fault of their own, but so this was an idea to try to you know, formalize what was in place, which was which was working. You know initially, and then we saw the explosion of violations of social, distancing and people not wearing face covering so like with a lot of legislation. What you do and what I did you introduce the bill and you get public input, you don't introduce a bill and just plow ahead, and that's not what I was trying to do, but I think, though, it's a bit of a fantasy to think that there's going to be, you know, checks from the state of new york given to struggling small businesses. It's just not going to happen that way and that's a sad reality of the economic situation unless we can get something from the federal government, but we're going to keep fighting for that, and I really appreciate the feedback from everyone on this legislation. Well, thank you very much. You understand thanks! Thank you. What you're doing and our president gail brewer. Thank you very much. Can you hear me? Yes, we can hear you loud and clear. Thank you. Thank you. Thank you very much board too. So I do want to follow up on the census issue. I know we're sick of it, but just a there's, a wonderful cuny census, hard to count map, and I think, you've heard that the state of new york is around 57.9. The city of new york is 53.7 Manhattan, it's 55.3 and here's the bad news. Some portions of board two are at 46 47 49 and where your office is 62., but it is the lowest in Manhattan, and it's partly because people aren't here: it's not harlem. It's not washington heights, it's the east side and board too so on July 31 with the us census and people who have ipads from four to seven we're going to be walking around the soho community and we will make sure where we meet. We will let you know, and we would love to have people join us, but we will have people who have the census on their ipad so that people can fill it out right then, and there now. This is not an easy. I don't know if it's going to work, we have done in harlem. We did a huge drive-through last weekend and we got quite a few people because of the noise and the hoopla, but we could use all the suggestions, but you really are very low and it's just because people are not filling it out because they're not here, so I'm letting you know you're at the bottom of Manhattan and we certainly need to get it up because you're, bringing not just you but people have left, are bringing the whole borough down number two. I just want to respond to this mass drinking without being specific, but I sit on the governor's recovery task force along with other presidents and labor and business and the mayor's office and the speaker and the governor is pretty serious about what you're describing in terms of the drinking and the no mass that's not supposed to be happening. So in the past, sla has been doing education and quote unquote. Visits they're, not put they. The governor's office is now putting together a very serious interagency tax force. I must admit if I was a business. I would not be messing around and Manhattan and Queens seem to be the epicenter of not doing it right. I am all for the small business I'm all for outdoor. I want these businesses to survive as much as anybody, but this is a no joke task force with about seven or eight agencies involved. Just so you know that that's happening. I just want to talk about schools and child care. I just got off the phone with a friend of mine who's, this principal and I'm very concerned. I have you know some hope for the chancellor and the mayor and everything, but I'm worried. I was worried last semester, 178 000 summer school kids and I believe 36 have not opened the device, so it seems to me- and you are educators on the community board and there may be principals and teachers listening, but my friend who's, the principal said that he's not sure most of his teachers are not coming back. It's a very large high school. Most of his teachers are not coming back. He thinks that his students will mostly be doing arts and you know, support activities in the school, but not necessarily any academics. I don't know if that's true, that's very different than what you've heard from the governor and the mayor, but I know that you are interested in and you have a great cec too, but I just between the child care issues and the health issues. He said that his custodian again, a very large high school that should be listened to, has not had direction and I've heard differently so that they have not had direction on the number one issue which is health. So I bring this to you as information that I find a little challenging, but the schools and what we're going to do is a community to try to supplement the education. I personally am going to call in my office every principal of every school in the borough, Manhattan just to find out what they're thinking and if there is hope for something outside. If that's the only way to address this very challenging health issue, I know that you know that we did the black lives matter. Street mural is actually in board one and it is on fully square from read to work. But if I say so myself- and if you go to our newsletter today, I hope you get it. You will see also in the chat, the most amazing, perhaps the mural ever done. It's got three black artists who were selected by the department of cultural affairs. They might actually they were featured in the new york times. They were featured in architectural magazines across the united states and they deserve an award and they might get one. So if you have a chance to go see it, you should because it's very extraordinary. I also wanted to talk about food. We had one point: it's not necessarily on board too, but this is. I think that catherine garcia, as the food czar has done a great job, but I do think that we have extra million people who don't have necessarily food compared to what we had before the pandemic. We've been focusing on NYCHA and the seniors and to the credit of the city, they just extended the fresh direct contact contract that we start at the top of Manhattan and go to the bottom of Manhattan every single week. We've been doing this since the middle of March and we have staff that meet the truck and distribute and work with the NYCHA leaders. The nicer leaders have really stepped up, it's a pretty amazing and very fabulous, but the seniors are still struggling all across the city. I'm sure you know that while we talk about food, I also just want to talk about garbage. As you know, there's no sunday pickup on the litter. I see the litter baskets piled up and the week they cut to sanitation is 65. So I know that in the communities this is a huge issue and I think we have to find a way to reinstate the budget. I know that's a challenge, but I'm just bringing it up and I'm bringing up organics the city cut the program completely. I understand that, but to the credit of new york university and a group of solid waste advisory boards, Manhattan and two other boroughs, they are doing and have raised funding for a year-long study of how to make the organics something that is able to produce revenue, and I think if the board wants to have a participation in that we would love to have your input. It is incredibly important if you know organics now wasn't making money cost the city money et cetera, et cetera, but it's heavy and it's going right to the landfill. So I just bring this up as something that we're working on in terms of schools. Also, as you know, there's something called the ebt card and it's basically for people who get food stamps people get food, stamps people get funding in terms of public assistance and the reason I mention it is that there is now a pebt which means that every parent and every student at DOE will get 420 added to their card automatically. And if they are not getting food stamps, then they will get a check in the mail. Please, no matter what your income! Please do not throw out junk mail that, in the month of august, might in fact be a check for 420. Now, if you obviously have a card, then you are going to get it added to your card. But if you don't have a card you might throw out 420, because every student is going to get 420, not every family. So I throw that out to something that you should not forget. Finally, we're working on the issue of housing, affordable, housing. I know that this is an endless story, but with europe starting again in august, as we understand it and the issue affordable housing we're talking again to all the people and the groups who have been working on this issue forever and just trying to see if we can have a real, clear understanding of what is or isn't possible. It certainly came up in the discussions of noho soho and all the rezoning and it comes up every time anything gets discussed in terms of land use and I don't feel like. We have a solid understanding, particularly the bar of Manhattan, and if there are challenges like hotels that aren't being used, could they be something for affordable housing, as opposed to just sitting there empty. So these are the questions that we are asking ourselves. Our newsletter just came out today we're doing a weekly basis. If I say so myself, it's excellent. I hope you sign up for it and thank you very much board. So thank you so much manhattanburg president. I do have a couple questions for you. The very first one is from georgia of georgia. If you could unmute georgia, please yes, hi good evening. Thank you, madame president, I'm really glad that you mentioned the outdoor options for schools and it would be there's this really rich conversation happening on social media about this, and it was mentioned in several threads with reyes folks from uft, and I'm wondering if you could bring up this concept in your conversations with principals in Manhattan. I think it would carry some weight if it was mentioned by you and in particular, perhaps schools in close proximity to each other could mar hi bro president. I see that you are hosting an event with the cc and ben kaylos on the 28th that advocates for admission screens, and my question is: do you in fact advocate for these exclusionary screens and if so, what to you is their their value? Well, I'm one of these people that I didn't know. I know what my schedule is tomorrow. I hate to tell you I go I survive day to day today I can barely know so. My like today, I talked about ccrb and I got oh goodness I didn't know. I was doing that, but I survived on screens. I am you know one of these people that actually is very supportive. Often I'm a gnt, I believe in gnt. That's me I'll be honest with you, but I want it to be more diverse and there are schools that are doing that. So I haven't, you know, spent a lot of time on it because I have so many other issues that I'm trying to deal with, but I am somebody who generally I want to change. Perhaps the way the screening is done, but I'm not against screening. Just to answer your question, thank you, katie. You have a question katie you can we hear you? I don't know if I see a mic on you, I'm going to come right back to you, I'm going to go first. I think no here I think you're here. Yes, it just takes a minute to click in hi gail good. To see you again, I just wanted you to repeat what you said about the education. Every new york city, public school student is going to get 420. Yes, sir, yes ma'am great news, new york state introduces the state program is called p e b, t p for pandemic and it gives every new york city, public, school, family, 420 per child fact. Well, that's very that's very important and will be very helpful to people and you is it. No is it in your? Is it in your great weekly update? Yet it was last week but I'll we'll put it again next thursday and we'll put it on the chat, okay and now so what we can get it out. I we can share it on our different platforms. Thank you so much gail. Thank you, katie amy, brennan hi, thanks hi, madam precedent, I'll call you that too. I just wanted to know when you're talking about reopening the schools. Have there been any conversation about split sessions that was proposed by the education committee? The task force that the mayor called together and it's based on something that happened in the 50s and 60s here in new york city would allow for students to have in-person education every day and combined with outdoor schooling. It seems to be a scenario that might work. I've heard every I've heard everything I don't know what I don't have any information. I mean I've heard split sessions that people advocate. I've heard that I called the abcd. You know tuesday, on wednesday off child care on thursday. You know that you've heard also. What else have I heard I've heard everything I have no clue and let me tell you nor do have the parents, but when the principal says he doesn't know, then I really don't know. I don't know yes, I've heard about sessions. I've heard that it is being it's in the mix. Okay, great! Thank you great and janine good evening. Bro president wanted to get you know. We have a resolution tonight, so cb2 will be discussing it, but we wanted to get your support for really helping to fast-track open streets or play streets for schools. We have a lot of different ideas in our resolution, but this is one that is essentially budget neutral because you know other than staff putting an NYPD barrier on there, there's obviously opportunity costs, but there is no cash outlay to open up streets adjacent to schools, to create additional space for social distancing, but we need everyone's help to cut through the bureaucratic red tape and make sure some of these things can happen by september. 10Th yeah, I'm very supportive. I've been a little surprised in some community boards because it has come up when you have a specific street. Sometimes you get some pushback from the residents, as you can imagine, but I'm very supportive personally, very supportive. We already know that ps3 ps41, cydia's school and likely 75, morton and I'm sure others have specific streets in mind. So I'm 100 supporters. Okay, thank you! Okay, let's see it doesn't look like oops. We have one more question: we're out of time, we're out of time: okay, good. We are out of time. Thank you, susan, so we're going to move on to our public session as a reminder, if you, if you want to participate, you need to write to our district manager, bob gormley by 5 p.m. If you don't we, you can always write for the following months, full board meeting, but we're not going to be recognizing any attendees without you have to email, and you can find that email on our website. So the very first speaker tonight and please keep it to two minutes- is going to be jane carey of the whitney museum jane you with us. Yes, I just here we go hey! Thank you! Hi! Everybody tough act to follow the bird president in the senator, but it was great to hear all those updates. So I'm jane carey with the whitney museum are the museums community affairs manager and I wanted to check in and share an update on the institution and talk a little bit about our reopening planning. So, first and foremost we're following all government guidance and we're looking to new york state in the city, first to say: it's safe for museums and our industries to reopen and after receiving that authorization to reopen the whitney, we'll take a look at the underlying conditions in the city in the state and make a decision on a reopening date, prioritizing the safety of our staff and visitors. So, in the meantime, we are preparing so we'll be ready to reopen safely once that time comes, and I wanted to share a little bit more on that collaborating with other cultural leaders. Our chief operating officer, amy, roth, has launched and is leading a museum reopening task force with 25 other institutions across the five boroughs and together. This task force has developed a set of procedures on topics like capacity management, ticketing strategy for visitors. What the visitor journey will look like, but before they arrive and once they're at the museum facilities, management and cleaning and staff training to all have a uniform, safe experience for people that choose to visit the museum once we all reopen, and these procedures are guiding the museum's reopening planning with safety top of mind. So once we receive that approval to reopen and the institution decides on its reopening date, we plan to share out our reopening plans more on those procedures or hours, exhibitions that we'll have on you and the opportunities for new yorkers to come into the museum, so I'll be in touch with the community board at that time and in the meantime, we continue to fulfill our mission by offering virtual programs I'm grateful for the board president for including in her newsletter that our summer studios program for six weeks this summer, we're offering free online classes for kids of all ages to experiment, create and learn together with at-home art materials. So more on that at whitney.org see, I've got one second left thanks all good timing jane. Thank you. So much for the update, darlene, lutz, darlene you're with us. Should I go to the next speaker. I am with you dan, oh great, perfect, hi everybody. I just wanted to give a quick update about what's happening down in this southwest corner of soho, regarding and listening to, the all, the chatter about liquor, licensing and bars, and restaurants et cetera. So I did speak at an earlier meeting earlier this week about chitano, which I have spoke a lot about during the last two years. They are in full swing operation and I think the best way I can put it is that I have been listening to the governor and I'm gonna go on what the governor is saying right now about how restaurants are supposed to operate. So I hope we can all get on the same page. The governor has stated in unequivocal terms that patrons going to restaurants because they're all outdoor now the a patron sits in a seat at a table to dine alcoholic beverages are up to them whether they want to order one, and there is no, he said no milling around, so that pretty much cuts out having parties et cetera, et cetera just so we can all get on the guidelines because we really have to deal with this issue in the next few months. This is a quality of life issue that a lot of us are dealing with. So if I think, if we're all clear on that and when people call into the community board the law of the land is that right now? So that's about it, I'm you know I'll keep fighting my good fight down here, because I have a very large party bar that is persisting and I'm really dealing with the enforcement issues. Thank you good night. Thank you very much darlene. Our next speaker is colleen o'connor grant hello. Thank you for indulging me tonight. I appreciate your time. My name is colleen o'connor grant, I'm quite new to speaking in public, but I am a public school parent. I'm aware that there is a proposal for providing schools with access to public streets, and I cannot stress enough how much of a an information vacuum our public schools are operating within currently. So I'm just here to advocate for providing all our public schools with access to the open streets program. It would be a crucial planning tool for our schools, which lack for space and I'm looking to local authorities such as yourselves, who are familiar with community needs, and we need your help. You're a governing body you're already familiar with the open streets application program, and I'm asking that you please survive. Please support providing access for our public schools to the streets that are right outside their doors. In brief, we in theory would need the streets for queuing up for drop off in the morning. We assumed there would be temperature checks and information to fill out before entering the building. So you can kind of imagine what the line might look like in theory. If public school busing is not cut, we need to maintain students six feet apart just to line up for the buses, so in brief I'm not advocating for any particular use. I'm just saying: please support our public schools in giving them this low-cost logical tool for planning that they need, and I thank you very much for your consideration. You there we go. Thank you very much, the next speakers of which we have five that are registered. I think let's go ahead and meet you there we're all. These are all testimonies about the women's shelter at 27, west 11th street, and I'm going to invite jim walden to be our first speaker on the subject. Thank you. Can you hear me? Yes, we can hear you. Thank you, jim thanks, so much daniel, and I recognize many of you because you might remember on the attorney that represented the community when we opposed the nyu expansion years back. So it's nice to see so many familiar faces, I'm here representing a group of community members who are people of good heart and conscience who want to support the city's attempts to deal with the homeless crisis, but they are here to say to you one very simple message: please slow down. There is a lot about this property that needs to be evaluated, and that would be true if it was on any street of any community, and it applies no less with no less importance to this community. For those of you who don't know, this project was only vetted by the committee in June, there's been very little debate, public debate or input about it at all. The building has 23 open violations. It has no fire exit, it's landmarked, it's not compliant with the americans with disabilities act. We are not aware of any asbestos remediation that has occurred and we believe the community board owes it not just to the community but to the potential residents to slow down and take a closer look to see whether or not this building is in fact an appropriate one. I don't think that there's any chance that you would be able to squeeze 90 people plus 25 staff members in that building, even if it did get approved, but there is a way to bring the whole community together. But the way to do that is to give people a little bit more time, more diligence, more information and make sure that it's an informed choice by this community board to approve the project and with that I just want to thank you very much for your time and attention and hello to all my friends again. Thank you harmon skernick good evening, and thank you for allowing me to speak tonight. My wife and I were surprised recently to learn of a proposal to convert the former larchmont hotel at 27 west 11th street, to a shelter for homeless women. We live in the building just next door to the proposed shelter and are greatly concerned that this proposal seems to be quietly and swiftly moving through the approval process without many concerned residents in the neighborhood. Having had the opportunity to voice what are valid serious comments, we of course are sensitive to the need for housing of the city's large homeless population, but we just don't understand why, with the city's vast inventory of buildings, it owns that it chose this small building dead center in the middle of a quiet, residential landmark street in the heart of greenwich village. For this project, renewal's proposal to house beds for 90 homeless women in this small building, plus a staff of approximately 15 to 25, will have a severe impact on all residents of west 11th street. This is a very narrow street, with only a few commercial businesses on it and the prospect of multiple delivery trucks holding up traffic on the street for long periods of time, delivering supplies, food, etc. On a daily basis is of great concern, as is the proposal for a 24 7 security detail residents, smoking outdoors, impacting the buildings on either side behind also behind west 12th street, plus the egress and fire hazard issues are a great concern. In addition, the owner of this building, whom we understand, will be responsible for all renovations, has a laundry list of ignored building violations with the city that go back many decades past history suggests that he absolutely cannot be trusted to follow through competently with any plans. The city approves this project, which the mayor and the city, by all appearances, are fast tracking, has a host of troubling and unanswered questions surrounding it. With regard to issues of community safety, public health and fire hazards, therefore, I would like to suggest that the community board delay their recommendation in order to give time for the community to fully evaluate and have input into this situation. Thank you very much harman. Thank you. Our next speaker on the subject is danielle epstein, very good. Thank you for telling me it was 10 seconds left. I'm glad you just skipped to that point. Did that sound good? You sound great thanks, danielle danielle, you ready to speak okay, so we're gonna, we're gonna move on to the next speaker, which is nathaniel weiss. They control that I can't control carmen. I just unmuted myself yeah there you go so we're gonna, we're gonna I'll, come back to you in a second danielle, but nathaniel you're, it's your floor for now. Thank you, okay. I I'm thank you for the opportunity to speak in support of the program. Good can't speak. No, I think what we need to do is actually yeah we're going to mute, harmon and we're going to start the timing of fresh for nathaniel. So why don't you go ahead and kick it off right now? Okay, good! This is like a rehearsal. Thank you very much for the opportunity. I was delighted to see that the social services committee voted to, I think strongly. Support was the language the proposal. I agree with that. I lived just a couple doors down to 15 west 11th. There are three town houses between the apartment building where we live and where the where the shelter would be. I understand it would be unusual for community board to usher in a shelter and perhaps unprecedented in new york city history, but I think this is an opportunity we can seize for the village in downtown to show the way to do right by our distinct cultural legacy and to strengthen our community's sense of purpose by welcoming project renewal and the women it will serve. We all know the stakes every one of us, it's more than mere optics. Just last month, all 50 members of community board 2 declared unanimously. We must commit our collective efforts to fostering diverse and inclusive neighborhoods by proactively implementing anti-racist policy that is informed and supported by the lived experiences of our community members. Now is the time to align our actions with our intentions, that was the equity working group letter that was issued on June 19th, all 50 of you signed it. I don't see how you can hold those words against this project and not strongly support it. I think this is something that we can work together on and it's a project that our whole community will be proud of. Again. Now is the time to align our actions with our intentions. Thank you very much, thank you and, let's one more one more chance for danielle, but I need you to introduce yourself right away if you're going to speak, if not we're going to move on to another speaker, okay, hello, okay, there you go it's your floor. Thank you so much for giving us this opportunity to speak with you and to listen to everyone's thought. We live right next door to the larchmont. Basically, our walls touch each other, so we are specifically impacted by it. I have worked in the shelter system for over 25 years and I am very aware what the idea is versus the reality of what happens in a shelter and to put 90 people in a building that can barely fit 70 and the sidewalk can barely hold five people in front of it is completely unrealistic and actually not fully thought through. I would think that to give some time to think about what would be the best way to move forward and give a little bit of space for the community to come together and figure out a way to work this shelter in our community, which of course, would be amazing, but 90 people is a little bit too much for the space and I'm concerned about that. Thank you for giving us your point of view eric rosenbaum president and ceo of project renewal. Hello. Can you hear me yeah? We can hear you great. Thank you thanks. I'm speaking tonight on behalf of myself, our executive vice president and ceo judy, jodie rudin, and vice president of programs, kayden grinnell, who are also here with me this evening. Project renewal is one of the city's oldest largest and most well-respected homeless service agencies. We serve over 14 000 individuals every year with housing, health care and employment. We shelter a thousand people every night across seven shelters, another 1, 000 individuals and permanent, supported and affordable housing, we're one of the largest providers of direct health care to homeless, new yorkers, with over 100 doctors and nurses and clinics throughout the city. We're also one of the largest sources of food for homeless people, serving 3 million meals annually at shelters throughout the city and we're experts in helping homeless people enter employment through specialized training, internships and employment relationships. The shelter at west 11th street we'll combine our shelter and housing expertise with employment programs to help women exit homelessness through work, we're happy to discuss programming in greater detail offline and we can share with anyone the presentation that we gave to the social services committee, which the rest of the board members have. We care deeply about establishing meaningful relationships with the neighbors and all the communities in which we operate, and that's why we've been meeting in groups and individually with many of you. We commit to deepening those relationships through the process of developing opening and operating the shelter which we believe will probably take about two years. We've heard a lot of concerns about density, quality of life, fire safety, smoking, noise and congestion. The building will undergo a lot of work and then it two years before it can open and that work will happen in consultation and under the supervision of fdny and and the department of buildings with the limited time I have. I can't respond to those concerns here, but we've addressed them to the extent possible directly with people who've raised them and we're certainly open to more feedback as the plans move forward. Thank you great. Thank you very much and richard geist are you with us? I had a question. Oh I'm sorry marika! Please! Yes to the last speaker, can you tell us how you determined the number of occupants the certificate of occupancy for the building actually allows more than 90 occupants, but there was an architectural study that was done, we're subject to regulations for all shelters that regulate how far apart people have to be that plus the architecture of the building really set the terms of this. The city, the city, of course, for economic purposes, wants to maximize the occupants of any shelter because it's what makes it economically viable but the they are certainly constrained by the regulations of shelter and the department of buildings and the fire department, all of whom have been a part of the process of setting that number and is it permanent housing or temporary housing. It's shelter. We expect that the women who are there will probably be with us for a year to a year and a half before they move into permanent housing. Thank you any other questions. Seeing none, I'm going to ask richard geist if you'd like to have a couple minutes to speak. Moderator can tell me if richard is in our attendance hello good evening. Can you hear me we can hear you great. Thank you very great good evening. Thank you so much I see so many friends on this board, including brad who's just left. I just want to say that to start, I'm scared. I'm scared to talk. I'm scared to talk in this turbulent time. I'm scared that I may brand it incorrectly. I'm scared to stand up for my community. This is the village where the inventors of human rights were born. That we are, this is being steamed, run right through and the people, I'm speaking to, I just got off the phone with billy abramson. He didn't even know this was going on and he sat on your bored last week for a committee. I feel that we have to slow down as jim said, but I feel that this has to be discussed through and we need to find a mediator and not negotiate with the people that are actually doing this. They have their dream, they have their vision and it's very hard to find the middle with the people that are that want what they want. We need to find a way to find a legal moderator and find out what we want to welcome these people into our community, but we want to make sure they're, safe 90 people in that building I've been the building, it seems terrifying to me. We want to make sure that they're welcome the noise in the back. Are they using outside space? Is there smoking issues? I, when I'm on my phone, I know in his desk. I won't speak in the backyard because I have neighbors. Will this be respected? How brad talked about enforcement? How are we going to enforce this? The sixth precinct is so overwhelmed. When we have issues, do we call the sixth precinct, so we this should be put on ice, like other things, because we just we're not ready to deal with it. There's too many issues. People's lives are at stake and we have to take this very seriously and slow down, and I really again appreciate you guys listening to us and again, I just want to sit down with the people that want this to happen, because these people deserve this and we need to make something very safe and welcoming for them. Thank you very much stay safe. I just want to jump in richard. We can get that information to you directly on who you can reach out to you, can contact bob gormley and he can provide you with sure. I spoke to bob and he told me to speak to project renewal, but right, I'm looking for a middle person to work the problems through someone with an impartial middle I'll reach across the aisle, but I want there's someone to be in the middle to kind of negotiate. The complication is it's an as a bright project and I think that we all support the endeavors. You know of this project and obviously there's some issues, but I think project renewal has given a pretty strong indication that they're willing to work through those issues with the community and certainly follow all the rules and regulations of the city and I'm looking for the middle person just to guide us all through this. Okay thanks, we have one more speaker and if she's not here, I have, I can summarize her written testimony just making sure that amy chang is not with us. I don't think she is. Unless someone sees her, the moderator could tell me she's in attendance, no all right. So I'm going to summarize her letter that she wrote to the community board, which is very much a lot of the points we just heard from richard and other speakers that were not in favor of this particular development at this very moment, but is welcoming of homeless, shelters and affordable housing to our neighbor and neighborhood in general. This feels like there needs to be more discussion. One of the key points in her testimony was that teachers at ps41 and medical workers at lenox hill can't afford to rent a studio, our neighborhood, let alone Manhattan. So maybe we can use this for other purposes. The impact of the redirected traffic from 14th street closures had a huge impact on her block, as well as the city bike station lanes and operating of lennox health, which narrows the block and their concerns. That way, also there's ongoing drug activity and homeless encampments on the north side of the street. Next to the first presbyterian church, which continues despite calls to 311 over the last eight years, amy respectfully asked that more thought and planning goes into our community's investment in project renewal and seeing no other questions that ends the public session. Handing it over to chair carter, booth, hey thanks dan. Is there a motion to adopt the agenda she's distributed to all the board members good mode back end great thanks everybody. So the agenda is adopted. Now we're going to move on to reports from the public. Excuse me for reports of the public from the elected officials representatives, all the elected official representatives. If you could raise your hands as the attendees and we can we'll have you speak in the order that you are called all right, I'm going to start off with luke wolfe from the controller's office. Hi, everybody lukewool from controller scott stringer's office I'll. Try to keep this brief. The first thing I want to mention is that we have an upcoming town hall with your local representatives, including state senator brad, hoyleman councilmember, coronian rivera as well as assemblymember, linda rosenthal, in it on monday, July, 27th, 6 p.m, the chance to listen to and ask them questions of your local elected. I will drop the link to the event in chat, which is disabled, so I'll make sure to circulate it to the board. I hope to see you all there. We are also focusing in our office on the reopening of our city to make sure we get back to the vibrant city. We all know and love focusing on two things really. First, in the economic side, thinking about the paycheck protection program, we did an analysis and what we found was that if new york city was a state, it would be 49th out of 50th in terms of the amount of businesses percent of businesses that were able to access the program. So 52 of manhattan-based employers were able to access it, and those numbers are worse for our mwbe throughout Manhattan. So we need federal support. We also need to make sure our businesses know how to access that federal support on the school reopening side. Another real point of focus for our office. We released our own set of guidelines, many of which echoed some of the community board's recommendations. So thank you for that, but we also sent a letter to the mayor because we have some concerns about what the DOE is planning now and that our concern is really centered around four questions. At the moment, number one is really expanded: child care options for working families, because we know this is not possible without expanded child care. Number two is expectations and standards for remote learning, with a focus on live learning, synchronous instruction, number three: how are they going to increase staffing to make sure the they can support students and the plans can go in place and number four? What are the health protocols access to nurses? What happens if someone gets sick? So I think there's still a lot of outstanding questions. We really do want answers to. So those are two things we're working on and thank you for your time. Great thanks. Luke next looks like I've got anthony, drummond anthony. How are you anthony? Can you hear us? Can you hear me? Yes, okay, all right! Thank you doing well good evening. Everyone, I hope, you're staying cool today, just want to start off with some of our office updates, with upcoming events related to workplace protections. Now that folks are coming back to work so the first one, thursday July 30th at 3 p.m. Councilmember chen will be joining the new york city commission on human rights, on a forum on legal protection against workplace age discrimination in the face of kobe 19. She is leading on legislation relating to the age discrimination for older workers, but we know it's an issue that impacts new yorkers across the generations. So that's going to be taking place. July 30th at 3 p.m. The second monday august 3rd at 6, 30 p.m. Councilmember chen will be joining the department of consumer affairs and worker protections along with council member rivera to also discuss workplace laws and protection, and that's taking place august 3rd at 6 30 pm. Another item on outdoor dining, the outdoor dining program, has reached massive success over on a few weeks off to successfully advocate an expanded outdoor dining to bleeker between mott street and bowery. This one is an important tool to help our small businesses recover, but we all need to work together to make it work, so we all need to stay vigilant and responsible about social distancing. If you have any questions or concerns about social discipline in outdoor dining restaurants, you can reach out to our office email at chen at council.nyc.gov. Next item: real quick. I just want to touch on our small property owner's tax relief bill with small businesses having to shut their doors and rent burden. Tenants in need of help. Councilmember chen has been exploring the tools to help make sure tenement buildings in chinatown little italy and the lower east side stay, affordable, housing, rent stabilized tenants, we're facing rights and operating expenses, family of small property owners and family associations have been asking for some relief, so council member chen passed legislation to help small property owners who have been affected by Covid-19 19 at to defer their July 1 property taxes to October 15th at a reduced interest rate from the 18 percent that was originally down to 7.5 and my last second last item. As everyone know, the passage of the fiscal year 21 budget. After months of negotiation, the city budget was passed by the council on July 1. met with the preliminary budget that zeroed out the summer youth budget and threatened seamless cuts to safety net programs. Council number 10 worked with their colleagues to make sure that funding for seniors education, health services and food pantry programs got to communities who can't afford to wait for release. So we were able to restore senior service funding summer youth programming, like syep q, e, a staff program and domestic violence services. There is much more work to be done to achieve parity amongst all our city agencies, but councilmember chin is proud that we were able to start a road map to redefine future policing and public safety in our city through this budget and my last item and lastly, in regards to our cooling centers. Obviously, given the hot weather, they are back at the start of the summer council number 10 fault to bring back the cooling centers in some capacity to help seniors beat the heat in advance of any heat emergency OEM. The office of emergency management will update its website with the full list of centers, so you can find one near you and that concludes my report, and I also just want to mention just real quick. I know at last month's meeting I think susan and frederica, if you're there to. I know they asked the question to me to respond back on. I definitely want to get that back to you. So just let me know, please feel free to shoot me an email or call me either way, and I will drop my contact information in the chat box for you. If you anyone has any questions but I'll be happy to take any questions from the board. If you have any okay. Thank you very much and to the board. I know you guys are not meeting in august so enjoy your month summer. Well, actually we may. Oh, we may oh okay, because I understand some boards are not meeting in august, so I thought we're going to make that decision in the next few days and okay, let everybody know, but what we may ask is that the elected official offices not provide updates, if there's nothing of too much substance in order to allow it to be a business only meeting okay, we can move it along for all the board members in a timely manner, but that was one of my few items during my chairs report, but you beat me to it: I'm by bringing it up thanks, anthony and next I've got tracy. How are you all right? You hi, I'm tracy jackson, I'm deborah glick's chief of staff and deborah is in session as we speak. The assembly is having a busy session week and charlie anderson is on a well-deserved vacation. So you have him this month. Instead, it's nice to see you all I'll give we did send a written report and I just wanted to highlight one of deborah's bills that passed it's a study bill that will direct the state department of health to conduct a study of limited service, pregnancy centers, there's ample anecdotal evidence of women visiting centers that present themselves as full-service clinics, when in fact they are not licensed medical facilities and instead they try to shame or dissuade women from seeking abortion care. So this is a study bill that would allow the department of health to collect data and get a clear picture of what services they actually offer. Secondly, I'd like to call your attention to a series of hearings that the assembly is hosting over the next several weeks on the impact of Covid-19 on a range of topics, including hospitals, voting, the mta and next week, deborah is hosting one on higher education, particularly relevant, as colleges are trying to implement their Covid-19 related plans now in the coming weeks. So all of those hearings are available to be live streamed on the assembly website and I urge you to check the schedule which I've provided the written report or it's on the assembly website, and we encourage you to view these hearings and then finally, I know we've talked a lot about the open, dining and I just wanted to say: we've been hearing a lot of concerns about a lack of clarity, inconsistent enforcement of concerns about which city and state agencies are in charge, arbitrary decisions by inspectors about who gets a violation and who doesn't so we're working with the governor while we're talking with the governor's office and then with our city and state partners, including the borough president's team, to try to get some clarity. We have a briefing tomorrow morning from city hall and if you know of any egregious violations that have been issued to a small business, please feel free to email me at glickdnyassembly.gov and we'll try to bring it to tomorrow morning. Thank you. Thanks tracy. I think that we've got a cory on cory. Can you raise your hand, I'm trying to locate your calling number and I'm not seeing it here? Okay, we're gonna, come back there, technical difficulty, okay, claudia we're gonna! Have you go next, claudia, oh sorry that you should be there hi. Can you hear me? Yes, we can awesome. This is actually siobhani from eulen's office. I just wanted to provide a cup. No that's totally fine! It usually is claudia, so we're pulling a little switch today, but I just wanted to provide some legislative updates. As you guys know, assembly and senate are in session, which is good we're getting a lot of stuff done. So the first thing I wanted to say is that yulin introduced her new cancel rent bill which focuses on canceling rent for tenants and mortgages for homeowners, as well as providing relief for small landlords and small homeowners legislation, because it assures that there's no future repercussions for those who do have their rent cancelled. So that's a big one, and then today in the assembly we passed both this small font or the big font legislation. Sorry, I should say, as well as the rivington act, so this big font legislation makes it so that debtors, debt collectors have to contact debtors with the option to have larger size fonts because oftentimes these debtors target vulnerable communities, especially seniors by providing a lot of information. A really small font that they're unable to read. So this legislation would make it so that they would have the opportunity to get that same information provided to them, but in a bigger font so that it's more understandable and then the rivington act, which is named after the rivington house in the lower east side, basically sets up a system in which the community is informed and that the state is able to ensure that the same resources are available if they're going to shut down something like the rivington house. So those are two really great wins. We hope to see them pass in the senate as well, but passing in the assembly is obviously a great first step and then the last thing I just wanted to quickly say is that we are continuing to do our PPE distributions and food distribution. So if you know of anyone who needs help or you need help, please feel free to contact our office at any time. Our number is 212-312-1420 and we'd be happy to help with anything that we can, and I think that's it for me. Unless anyone has any questions. Okay, I don't see any questions. Thank you. Next is eliana. Would you like to speak eliana? Okay? I don't have eliana and how about jeremy? Are you with us yep I'm here. Can you hear me? Yes, we can great. I am my name is jeremy under I'm councilwoman's legislative director- and I am here covering for iraq, who is unavailable today, but really excited to talk to everybody. Give a couple of quick updates not to beat a dead horse about the open restaurants, but you know we've heard many of the same concerns we're actually working on a response to DOT and the administration in a letter kind of talking about all the different aspects of open streets, open restaurants. I saw you're working on the resolution on open streets for schools, so really excited to kind of see more of that and again any more thoughts. You can share that. I really appreciated. In addition, the councilwoman has been working on a couple of different issues over the last few weeks. One issue obviously was the election we just recently had that, I think, is having votes still counted as we speak. We at the council and actually met with the new york city board of elections. Commissioner, mike ryan today to voice a number of concerns to him directly regarding the the operations that happened and basically calling for a number of changes, teammates that we don't have the same issues happen in november, particularly providing more early voting sites, drop-off boxes, if possible, for absentee ballots and more. I may most importantly, a tracker so that people can identify where their absentee ballot is in the process, so they make sure they get it on time and that it's getting heard and actually counted and then finally, a quick update on a local issue. I work on a lot. I work on transportation for the councilwoman. I know there's been a lot of concerns from folks in cb2 about the bus way and the way that DOT went about making that permanent. We conducted a walk through a bunch of cbt residents in december, brought up a lot of improvements that we wanted made to the program street sign changes marking changes. Some potential traffic pattern changes that residents brought up that we communicated DOT. We are continuing to follow up with them about that and really making it clear that those kinds of things need to really certainly be implemented, especially considering that the program was implemented. You know much earlier than the deadline previously, so you know we are continuing to advocate around that, and you know if anyone ever has feedback on that program. Please let us know, that's all for me thanks jeremy. Unfortunately, the public session is closed. Now I see some people still have their hands raised. The deadline was 5 pm. Today, people had to submit had to submit their request to speak by then, but do we have any other public official reps that are on the call, if so raise your hands that we missed barbara hi? I wanted to say please that I support the large schmont. I live on western world past that time period. Okay, so it looks like we've had all the elected officials have spoken. I mean it's summertime. Some number of different people are on vacations and andrew we've already heard from from bro president brewer, so we're gonna move from that and now on to the chairs report, it's already 804, which has been quite a while since we haven't started our business session, I'm going to keep it brief next week is the census week of action as you've heard from a few people, the census is a very important is described. I think it was a brad who had mentioned the amount of money that each each person that signs up in the is that the monies that's contributed to the city. I'm going to drop a link in here with further information for everybody for the census. Week of action, if you want to promote that on your on your own groups, list serves, and it's got a full tool kit for different information that you can share. As you also heard from a few people, the open restaurant program, all the various iterations has been a great success in our community board. I think it's worked out really well for quite a few restaurants. There are some issues number one that we had identified this week in the reopening working group. Is this equity issues? There are quite a few restaurants that have no frontage are located on corners at bus stops in front of them. Have fire hydrants are have moving lanes of traffic and unfortunately, the city hasn't provided an opportunity for them to participate, at least in the any of the closed street programs, and we're hoping that the city might re-evaluate that aspect of the program or d.o.t. As far as incorporating some restaurants, there have been. You know there are a few bad actors. I think that slowly but surely those issues are being addressed if you have any restaurants that you believe are set up improperly right now, if you can just drop an email to bob gormley and we can follow up on that. There have been some questions raised with respect to enforcement, which is a very complicated topic. I think that there's been from what I've heard, not necessarily judging whether it's appropriate or not the violations that have been issued, but it seems that there's been some overzealous enforcement of establishments that are trying to follow the rules and have been working really hard in limited enforcement on places that are blatantly breaking the rules and that's raised a lot of issues within the restaurant community. I think responses, and rightly so- that it's a very big imbalance- and I think a big part of that is because we have people are not from the city who are coming in to do enforcement as opposed to enforcement being done by city agencies, which are more familiar with the complaints that they received through 3-1-1. So it's been very difficult, having conversations with people as a result of that. But overall, I think the program is running well for the people that are able to participate in it. The small number of bad actors that that I think have been very high profile and, let's see at the borough president or excuse me at the at the borough board meeting this week, there's a presentation by revel scooters which I think is going to come to us in the fall. But I know rebel scooters it's interesting in the last week, since we had this presentation, I was almost hit twice and you know the level of the operators, skill level, their class c motor vehicles, a lot of those people don't realize they could lose their licenses for some of the actions in the manner in which they're driving and that doesn't have anything to do. On the top of that, the people aren't wearing helmets and a lot of the safety issues. I think going forward bob we can find out some more contact information. I think that I read in the newspaper. They suspended 20 000 riders, but it's dan miller told me that he just saw somebody riding down the bike path on the hudson river park. I mean it's there's some messaging that needs to significantly be improved, but it's it's whatever is going on right now, it's a huge issue and it's just it's not safe, and so I think it's really on revel to improve significantly either their education, their ridership, the screening being able to track how their users are moving around. Apparently, they automatically suspend accounts of people who ride or drive the scooters through parks, which is something that I guess has been happening in certain areas, but that's really a big issue that just seemed to really expanded dramatically in the last in the last couple of weeks. And lastly, even though we don't have any resolutions in front of us this month, I just wanted to acknowledge that our three working groups that are currently running right now- the bylaws working group, the equity working group and the reopening working group. Since I know that a lot of members have been spending a lot of times on those issues and a lot of other board members have been participating with that. I'm going to move on to the treasurer's report, anthony hey everybody, just a quick update for this quarter's treasures report. We have an updated expensive expenses of eight ninety eight thousand dollars from the April report till now. The bulk of it is basically staff expenses and also equipment expenses for the office to work at home, av equipment for the office painting services for the office and also the workshop facilitator that we paid for earlier a couple months ago, and that's it for this quarter's treasurer's report. Okay, I see I had a question from dr smith. Yes, thank you. I have a question. I noticed on the treasures report. You mentioned professional services with the little three. What national services are you referring to here? Oh it's listed in the bottom footnote, oh the ones at the bottom. Yes, the one at the bottom. Okay, let me just ask this question: carter were: was that a gratis? Well, we did well. We charged for the professional program meeting that training session yeah. Did you that's something that you we paid for from the budget, or that was that's correct? We paid for it and just it's the services, the total was office, cleaning live streaming, the workshop facilitator, painting and paper file storage, and how much was the workshop, and is that was a one-shot deal? Are you did you negotiated to have more and what did it cost it was? It was one time bob: do you have those numbers, six thousand dollars for two sessions? Six thousand for two sessions, there'll be a follow-up session sometime later in the year. Okay, and just for information whose decision how was that person chosen and whose decision was that the person had worked with a number of different community boards, and we had solicited the feedback from community board three at first and then community board. One also worked with the same facilitator. So what the reason that we chose them was because they had already attended community board meetings, so they were familiar with the process in which we worked, and I think that when they first went to cv3, that was something in discussion with their district manager that she had indicated being familiar with. Our process was a very important part of being able to really work with us. Well as far as how our meetings work, so we decided to go with that facilitator. I don't mean to belabor the issue, but I don't recall seeing a survey: did you send a survey around to no? We made the decision, effectiveness bob and I made the decision about selecting them. I mean about the effectiveness of the workshop. Absolutely yes, no, we did not well that's something. I think we should do sure we can do that bob. You want to do that. Okay, sure. Thank you great thanks, shaw, so anthony you're finished with your report correct. That's it yep all right. Thanks and now bob district managers report. Okay, just a few things. I just want to start by just touching on something that brad mentioned, which was the removal of the city bike station in front of jeans, restaurant, and it was also it was reported on the in the press. I think on channel 7 abc, but what I wanted to mention and brad did give credit to corey corey johnson's office deserves a lot of credit for having that removed. They did a lot of heavy lifting, even corey himself got involved and it wouldn't happen without his intervention. I don't think for my report. I just want to let everyone know that, like many other people, the staff are still working from home, we're trying to get work done by phone email text and zoom. I don't know like a lot of folks, but I don't know when the staff will be coming back to the office, certainly not before a month or two ago I would have said maybe after labor day, I'm not sure, if that's even an accurate projection right now, tomorrow, at the borough service cabinet meeting department of citywide administrative services will be giving a presentation regarding reopening city offices, so I guess they'll. Let us know well, certainly to let us know what the considerations that we need to concern ourselves with before we can open the office, and people can come back for our situation. It's not just coming into the office it's since we all live far enough away where we need to take the train, it's also getting here in a safe manner. So these are some of the things that are on my mind, leading up to that. However, I will say that when they come back to the office- and this falls under the category of some of the expenses that anthony just mentioned, the office has just been totally repainted and there's some some repairs been made, so they'll be entering a much cleaner, well-lighted space to do their work. Secondly, the Manhattan district managers have met twice in the past month to review questions that will be submitted to that have been submitted by now to the various city agencies in advance of the budget consultation meetings in september, which is part of the the budget process that the community boards are involved with related to that is, that is our district needs statement and I've reminded or asked the chairs, as they do every year, to take a look at the district needs statement, particularly with regard to the areas of concern or areas that their committees oversee. But I was, I wanted to extend that to all the board members, and especially the new board members, and take a look at that statement, also with an eye to the committees that you serve on, but also, if you can, if you see anything that looks out data that needs to be changed or added, you should let your chairs know so that we can. We can incorporate that before we submit the document in October and lastly, I just want to remind everyone to not that you wouldn't do this anyway, but take a look make sure you take a look at the august calendar because usually there's just two or three committees that meet in august and we don't have a full board meeting but, as carter's already said, we're almost certainly going to have a full board meeting in august and there's several more committees than usual will be meeting, so your committee may be one of them, so you don't want to miss that all right. That's it thanks bob and now I believe that we have speaker johnson with us. So can you hear us corey? Are you there hi carter? How are you good? How are you thanks for joining us? I'm good, I'm sorry! I was trying to get in for a while, but my technology is having the best of me tonight. I just wanted to call in and say thank you all for your really hard work throughout these last many difficult trying months, and I just wanted to give a brief update on some of the things that we've been working on my team patrice and eric and everyone in my office. You know it was a really painful, difficult budget. We had a nine billion dollar budget hole without help from washington without help from albany, in the way that we needed financially, and so it put us in a position to have to make some extraordinarily painful, difficult choices that you know. I never thought we would have to make, but some of the things that I'm proud of is that, even in the midst of all of that, we were still able to save a lot of critical programs, social service programs, education programs. We restored hundreds of millions of dollars, 700 million dollars in cuts from the mayor's proposed executive budget, to education, to social service, to mental health, to seniors to all the things that we care about, and it's going to help countless people. It didn't get a lot of headlines at the time, but us restoring all the money for guidance, counselors and social workers in schools, us saving a hundred million dollars in fair student funding. Just countless programs like that are things that I'm really proud of, and you know we were also able to get some resources locally. So you know we were able to get 1.5 million dollars for upgrades and repairs to the bleeker street playground, which we all care about and love so much. We were able to secure over 600 000 for technology and local schools for computers and ipads and things that are going to be more important than ever. Now we were able to get 87 000 dollars to greenwich house to provide senior programming and case management, including at west bath and west village houses. We were able to get some money for the newark at west bath thousand dollars and then all of the local money that we give out every single year we're able to keep that money basically whole to all those organizations, those nonprofits those providers. So I'm really proud that, in the midst of a unprecedented economic situation in the midst of a global pandemic, which all of us know how the last difficult the last five months have been, we were still able to do some of those good things in the budget a few weeks ago. A couple of other things that I just want to highlight quickly, and I don't want to take up too much time, because I know I'm jumping in the middle of your meeting. I just want to say that we have been working. I've been working, and I know my team has around the clock on trying to help gene's restaurant and I got on the phone with the mayor personally last week and made the case of how we needed to help them. So jeans is going to be helped. They did come up with a compromise. They are going to be able to open up outdoor seating. I similarly have been trying to help bus stop cafe over near abington square, and we have been trying to help these small businesses that are just trying to keep their doors open, jane street, between eighth avenue and hudson. They requested to be a street that could be open. Four restaurants. There are three restaurants on that block tomorrow. The mayor is going to announce that is going to happen. That's at the request of the jane street block association. So that's going to be a very good thing for the jane street tavern and some of the other small businesses and restaurants on that block on jane street and then. Lastly, I want to just mention that we are getting some more bus, countdown clocks. There are two more bus, countdown clocks that are going in one at west, 10th, street and 7th avenue and the other one at bleecker and 8th avenue. Those countdown clocks should be installed soon and be functional. It builds on some of the earlier bus, countdown clocks that we've put in. I know that. There's a village block association cleanup day on saturday august 1st that I hope people will participate in and then. Lastly, my office has been working closely with the department of health and sanitation and parks on rat mitigation efforts in the west village and in the south village, and during the upcoming months my team is going to be doing a series of walk throughs with those three agencies: the residents, the building owners, the block associations. Of course, we want the community board to participate to try to help prevent some of the rampant, rodent infestations that we've seen in some of the local parks and on the side streets. So there's a lot more. I could talk about, but I just wanted to give you some highlights of some of the things that we've been working on and some of the things we're able to do in the budget and, as always, I'm on cb2 for your leadership during these hard times and your partnership with my office to continue to work on behalf of the residents in community board 2 and for the small businesses. So I just wanted to thank you so much for having me tonight and again I apologize for interjecting in the middle of the meeting and not making it earlier thanks corey. I wanted to really thank you for jane street, really working on that we've been discussing sort of some of the inequity for a lot of restaurants and that's a case in point. As far as a you know, place that hasn't been able to participate with tavern on jane. I think we have a few questions for you here yeah. So if I could just ask people if they've got just brief, one-sensing questions that would be great georgia, it's more of a comment, I guess, or a request, in the same way that we're going to bat for small businesses and open streets. I hope that the speaker and our elected officials will go to bat for open streets for our public schools. Thank you. Thank you, georgia yeah! You mean, I won't speak about it for too long, so we can have more questions, but you know there have been a bunch of interesting proposals about trying to do some of the teaching outdoors depending on the location of the school for some of the older students. So I think we need to be creative about that so and open up space outside of these schools, so that we could do some of these things depending on the building location and what surrounds the individual school building. If you or members of the community board have suggestions for us on particular schools or particular streets feel free to pass them along to my office and we'll speak to the chancellor's office in the mayor's office about some of those suggestions. I'm really concerned, of course, that we may have a secondary spike of infection later this summer or this fall, but I'm also concerned about not having kids in school and how do we balance these things to make sure that they're safe and that the teachers and principals and faculty at the schools are safe and children are safe while at the same time not having them miss classroom time, which is so valuable and so devastating they weren't able to have it for March, April may and June. So thank you, georgia for bringing that up. Thanks, susannah, hey corey, thanks for being here and and thanks for your hard work. I wouldn't want to be you right now. I just wanted. Since you raised the subject of rats, I wanted to bring your attention to a funny thing that I came across last year. As you know, rat ice is incredibly effective and yet the parks department, as at least as of last year, was limited in its use of it, because in order to get rat ice, it had to spend an entire day going out to the one distributor in Brooklyn or the Queens and getting it, and I asked even mitchell silver why they couldn't make the rat ice come to new york because I'm sure it's a pretty big contract and I was given a quizzical look, so that might be something to explore as you look at the rat infestation. Thank you. That's very helpful. Suzanna. If you could give some of the information of what you found out on that to my office, we will reach out to the parks department to the mayor's office and see if we can make any headway on that, and I hope I hope you and gary are safe and well during this time. Thank you, susannah. We're all good thanks a lot, and I will do thank you, ritu hi corey. I just wanted to give you a big shout out of thanks. You got a big commendation from andy slavitt, the other day for being well ahead of the curve and calling out the seriousness of Covid-19 and screaming and shouting trying to bring people's attention to it earlier on this year, but now that we're several months into it, I wanted to ask you to comment just on some of the threats that the trump administration has come up with in terms of sending in federal troops into cities, including new york. Thank you ritu. That's so sweet of you, I'm so funny that you saw andy slavitt's tweet the other day, so kind of you. You know I'm not gonna mince words. I mean this president is evil. He is an evil, autocratic, fascist dictator and what we're seeing in portland and now what we're seeing in other cities in this operation that they're conducting the comments that the dhs secretary wolf made the other day I mean this is like a really bad movie, what we saw when they cleared lafayette square so that he could take a photo with a bible in front of the church in June I mean this is all very orwellian in so many ways and you know they've stacked the judiciary. The republicans today with everything that's going on in America, the only business that the senate took today was voting on more right-wing conservative republican judges. That's what mitch mcconnell decided to do today in the capital, and so typically an independent judiciary would keep them in check. They're stacking, the courts, everyone better be praying for ruth bader ginsburg to hopefully make it till. Hopefully we have a biden administration and you know we have to keep fighting back. We need to make sure that joe biden wins that chuck schumer's the majority leader and take the senate, and hopefully we will be able to see big change in this country, but until that happens on november 3rd, and even after that, until January 21st, when the next year inauguration happens, you're gonna, I think, keep seeing these unconstitutional fascist police state policies that I think are unconstitutional, but that are key that are going to keep being pushed. You saw that tisch james, our attorney general and the corporation counsel for the city of new york, john johnson, who is the city's top lawyer, have said that they will sue in federal court in the district court here, which is a little more left of center and the circuit court here, which is kind of split right now. If they try to do what they're doing in portland to new york. So that's really our only recourse right now with the courts because they control the senate and you have these fanatics and the white house ain't controlling many federal agencies. So I think that's sort of my overview of where we are and that's why these next few months are so critical. We need to protect voting rights to make sure that everyone can vote freely and fairly, and we need to beat these people in november so that we can start to hopefully turn the page and and really live up to the ideals of our constitution. Great thanks and I think I'm beau we've got one more question from beau ricobono yeah hi, corey hi. I haven't seen you in a while, thanks for all the work you're doing, I know you're tirelessly running all over the place. Good luck just get very quickly to the schools. I'm just wondering I mean we all know how things work in new york. Critical, I think, to the school's reopening is the uft's position, which of course, you know, and I'm just wondering if you could share any of your- I mean nothing. You know: what's your opinion about what the uft will decide because, let's face it, you know if there's any threat to the health of teachers, no matter what the mayor comes up with they're not going to do it. The teacher is just not going to do it. So I'm just wondering yeah I mean for months. The uft has been telling the chancellor and the mayor way back in may. They were saying we need to start to have not just a city-wide plan for schools, but literally school by school plans. What the facility looks like how big it is. Are there? Is there outdoor yard space? What are the cafeterias look like? How much space is there in the buildings? Do they have gymnasiums and then try to come up with a plan school by school? So you could have social distancing? You could have staggered schedules, you could have the adults wear masks in the schools, you could have the janitorial staff and I think their opinion is the uft's opinion is that the DOE and the mayor's office have not really done what they need to do to create that type of plan. To give people the peace of mind that there would be a safe possibility of reopening, I mean, I think, the we have not seen fatalities amongst children very few, not just here in new york but around the world in the united states, but we do know that children can pass kovid to each other and to adults, and so, if you're going to ask teachers and staff to go in, you need to make sure that you have a plan, and then you need to make sure you have to be concerned about if kids can bring it home, what does that mean for their parents or grandparents? These are some of the things that need to be dealt with and I think the uft is concerned that it hasn't been managed in that way. Yeah. Well, thanks. That's I mean we all know, that's the critical thing and I doubt the schools are going to open, that's just sorry to say, but thanks corey. Thank you robin. Do you have a quick question? Super quick, sorry, just jumping in with this corey. I was just wondering if thank you, of course everything ditto everything's. Everybody said about how great you are: are you involved your office with any of the ongoing discussions about the safety protocols and reopening plan reopening for broadway, NYC and co tourism? If not, those groups are, you is you're, often involved in any of those sorts of reopening of new york, fluid discussions. I sort of titurally sit on the governor's task force on reopening and you've seen the governor speak pretty regularly about his concerns about not reopening too quickly. My friends who are involved in the broadway community have told me that they don't expect to get back to work until next, March or April, and that's not from government sources. That's just, I think the community feeling of what would actually be safe. So you know no one, I think, has started to sort of plot that out we're kind of looking at the other type of industries and seeing if we have a secondary spike in infections over the next many months and that's what will determine some of the other things that are gonna impact. How we have these broader discussions thanks, okay sandy, you got one brief question, then we've got to move on to unmute yourself, hi corey, it's sandy russo! Is there oh hi sandy hi honey? Is there any way the city can do some public information stuff about people wearing masks? You know people just don't wear them they're under their chin, they're in their hand, they're. You know not over their nose if they're running they're not wearing if they're riding a bike they're not wearing. If they're you know, picking up dog poop they're not wearing is the. Can we get some public service announcements and try and sort of beef up the advertising on this issue? I'm happy to look into it. I mean, I think you know. The message is clear. I mean not just here in new york, but around the country around the world. You have to wear a mask, but if people aren't doing it, you know, I think we kind of have to use some peer pressure a little bit on folks I mean luckily- and I don't want to jinx us- the number of infections have remained low here. The spike that we've seen in the last couple of weeks have been from younger people and people think that has been them sort of slacking on wearing masks and being able to. You know, protect themselves and protect others, but the fatalities and the new infections have remained low. Unlike many other places, as we've been slowly reopening, I will talk to the mayor's office into the department of health and see if there's going to be a continuation or a new effort, as well as the governor's office about more public service announcements related to mask wearing. But you know we've done pretty well. We need to make sure we keep doing well and the best way to do that is to socially distance and continue to wear masks thanks. Thank you thanks carter for having me thanks for checking in with us. Of course, thanks take care bye. One thing I forgot to mention during the chairs report is I had alluded to when andrew was speaking, it does look like we are going to have a a brief and what we're full board meeting in august we're going to try and make it a business. Only session there are a few items it's looking like it will confirm it next week, but it should be the same second to last thursday of the month, which would be august 20th, but we'll let you know as we move forward. You know I've been alluding to this as for the last few months. So with that we're going to move on to a business session, is there a motion to approve the June minutes? I see some moves, all right, a number of hands up susan and mar. I see it specifically. Second, okay, the June minutes are approved, we're going to move into the standing committee reports before we begin that I'm just going to ask if there's any objection to moving all of the committee reports the votes into an omnibus vote. Unless somebody would like to specifically call out for a specific vote, they can do so at that time. I'll ask each time. Is there any objection to handling the voting in that fashion? Okay, I'm looking through the screens and for everybody who has their cameras on. I don't see any objection. Okay, so we're going to move into our first standing committee report, janine kyleigh for schools and education committee hi good evening. We had three resolutions this month. The first one is a resolution in support of open streets for schools and the addition of outdoor and indoor school sites to support the safe reopening of new york city. Schools. Therefore, be it resolve that community board. Two I'd like to add the word strongly under one strongly urges the new york city, department of transportation and the department of education to implement a fast-tracked and streamlined open streets program to close streets around schools which will provide much needed recreation space and, if tinted instructional space for new york city students, two recommends that the new york city department's department of parks and recreation, hudson, river park, trust and other public and private open spaces provide priority access for public schools for additional recreational and instructional space. Three calls upon the DOE to prioritize the search for indoor space to expand school and after school capacity, including the leasing of recently closed schools such as our lady of pompei school in greenwich, village, non-profit institutions, vacant office, co-working, hotel event and retail spaces and trailers and four urges the DOE and department of youth and community development to identify a potential funding source for community-based organizations to rent space, to increase their capacity for out-of-school and after-school programs. The second resolution is in support of immediate solutions to reduce the digital divide by fall, 2020 for new york city public school students, and this has been identified by many advocates as one of the most important equity issues. Now, therefore, be it resolved that community board 2 insists that the DOE implement immediate and short-term solutions for fall, 2020 to reduce the digital divide, including one deploying mobile hotspots on school buses. Two creating free guest accounts in all DOE buildings, so that students can complete homework assignments on site after school. Three, in conjunction with reopening public schools. The city should simultaneously reopen the new york public library system, allowing students to access free, wi-fi and prioritizing access for middle and high school students during school hours. Four, extending free and low-cost broadband programs through internet providers prioritizing low-income communities, students living in transitional housing, that should say transitional and families, facing financial hardship due to Covid-19 and five, ensuring that every student has a remote learning device, including providing keyboards to students who already received an ipad and purchasing laptops with keyboards from middle and high school students. Our third resolution is in support of new york, university and trinity, real estate commitments to new york city for the bleeker school in hudson square, school and public recreation space and therefore be it resolve that community board 2 urges our elected officials, new york, university and the department of education to ensure that the bleeker school option is exercised and continue to explore the possibility of creating a DOE public school program for dyslexic students at the bleeker school site. Two looks forward to a formal presentation from trinity real estate and the school construction authority on preliminary plans for the hudson square, school and public recreation. Space and three encourages the new york city, department of parks and recreation to factor in plans for a new public, elementary school adjacent to duarte square park as it designs and implements renovations for this public park, and these were all unanimously passed by our committee. Great thanks, janine. Is there any discussion all right? I want to encourage everybody to really read this report. If you haven't read it in depth, it's a great report. Thank you very much, janine, I'm not sure the advent of footnotes I attribute to the starting use of those to matt, but I know he's on your committee, so I don't know if something she did it well before me. Okay, but the footnotes are, are plentiful and and it's great thanks janine- is there any unwillingness to move these three items into the omnibus vote? Is there any unwillingness? I don't see seeing none. We will move those three items: the three resolutions we're moving them into the omnibus vote, which so we're gonna do a roll call at the end of the end of the meeting, unless somebody'd like to call it out was that was that was that rich yeah? That's! Okay! No we'll note you're! Right generally, we do a roll call right now, valerie, I don't know if you can go through the attendees and can we take a roll call from the signed in names? Is that possible just for our records, as opposed to going through all the names? Yeah, okay, great and so? Moving on to our next committee is land houston housing committee federico hi everybody good evening. We have two unanimous resolutions. The first is for blink fitness at 692 broadway, it's a re-up of a existing pce with no changes to operations or operator, and we have no objection to that. The second one is 246 spring street to allow a 472 square foot open-air cafe, part of the dominic hotel development, which was previously trump soho to be located within an existing through block privately owned public space. The committee was, as I said, unanimous therefore be it resolved. That cb2 recommends denial of this application and asked to be notified if the applicant makes other requests for a private cafe, temporary or permanent on this public plaza. Be it further resolved that if this or any other certification for privatization of public space, for any reason, is granted over the recommendation of cv2, the local council member be encouraged to oppose it finally resolved that in general, cb2 encourages our electeds to oppose turning over privately owned public space to developers for commercial infill purposes. And yesterday, at the end of the day, we got a letter from the developer offering to explore our suggestion. That would allow customers to enter the cafe area from the plaza rather than directly through the restaurant, and they were willing to explore the feasibility of a walk-up window that would a restaurant and they were willing to explore the feasibility of a walk-up window. That would allow the public to purchase items directly from the plaza and a brief canvas of the committee members didn't change any minds about our decision. To deny great thanks federica, I had one friendly thing: I've just in the very end and the be it finally resolved, maybe at the very end of that within community board too. Just that be a final result that, in general cb2 encourages our elected supposed turning over pop space to developers for commercial infield purposes within cb2, because I think that the resolution lays out the case for that with our very limited pop spaces within our community and we're just adding within cb2. Is that right at the very end? Yes, okay, great hi, it's john, the berna frederica. I had abstained on the blink fitness. One just wanted to make sure that was noted. That was noted. Thank you. Thank you. That's it from us. Okay! Is there any other further discussion? Okay, seeing no discussion. Is there any opposition to moving these two items into the omnibus vote that we'll be voting on at the end? I don't see any opposition to doing that, so we will move items one and two from the land use committee next committee is sla licensing one and two donna. Are you going to be presenting I'll? Go? First, on the application so good evening, everybody we had 12 applications of them. Only three were applications. The others were all layovers or withdrawals. All the decisions were unanimous. The first one was soho grand at 310 west broadway. That was a corporate change within the organization, and that was a deny unless the second one was 44 bedford street dadios, that was for an op. The space was previously licensed. That was also a deny unless unanimous and the last one was mary 95 7th avenue south. That was for an op with mariachi bands that was a deny, and that was unanimous and the rest were laid over withdrawn, oh and that one, the last one mary was withdrawn after our after our meeting so okay, so that was one through three. That was one through three and then bob. Do you want to present number four yeah sure number four is the review of the senate bill that was discussed earlier today? There are a few speakers and brad holman talked about it. That was also sent back to committee last month. The committee heard a bunch of additional people coming in against it. Just like they had the first time we thought of ways to provide suggestions to see ways in which it could work. I think that's reflected in the resolution and the ultimately. The therefore be a resolve. Sections are I'll, read them. I lost them, therefore, be it resolve that committee board 2 Manhattan submits that the vagueness of senate bill 8392, as proposed and written, represents an unacceptable risk with regards to public health and safety at this time and therefore be a further result that, should the senate bill be revised to permit the sale of take out alcohol beverages for off-premises consumption in the future. It is critical that such law be accompanied by acceptable mechanism for legal enforcement, for open containers of alcoholic beverages in the public domain, for protecting public safety, for protecting the quality of life of existing residents and therefore be a further resolve that committee board. 2 Manhattan recommends that any revisions to the bill incorporate the suggestions detail above to limit off-premise takeout sales to certain hours, the size of the container, the amount of alcoholic drinks per person, the ceiling of the container, the label and warnings to be placed on the container and the types of alcoholic beverages placed in the community, okay, so and then on, and then we have also items five through twelve. So does anybody wanna, which were layovers no shows or withdrawals? Does anybody wanna call out any of the items for discussion one through twelve? Okay? I don't I see silence. Is that correct, so everybody's? Is there any objection to moving these into items just like to call out bob for a great resume? Thank you. Yes, it's a very good resolution and definitely, I think, captures much more of what the sentiment was at the last full board meeting. So with that, is there any objection to moving items, one through 12 from the sla licensing committees into the omnibus vote? Okay, seeing no objection we will move votes. Are excuse me, resolutions 1 through 12, from sla licensing into the omnibus vote. Our next committee is social services, susannah aaron. This is regarding we had one resolution and that's regard as regards the proposal to create a shelter for homeless women who are employable at 27 west 11th street. We heard comments on that at the public section today. Tonight, therefore, be it resolve the community board to Manhattan strong number. One strongly supports project renewals plan to operate a shelter at 27, west 11th street for homeless women, with no significant barriers to employment and to recognizing that its district houses. No shelters currently welcomes the opportunity to share in the city's efforts to provide assistance to women in need and three looks forward to opportunities for engaging with shelter residents and helping them form bonds within our community and four expects dss and project renewal to maintain, as promised, continued dialogue with neighbors and to mitigate potential quality of life impacts from the shelter's construction and operation and five looks forward to frequent visits to cb2 by dss and project renewal at every phase in the shelter's development, and our boat was five four and one against carter. You're, muted, thanks susanna and I have some footnotes there too. The footnotes- that's it's great! It's it's nice to see the research behind it. We've got a number of speakers from the michael levine. I see. You've got your hand up first, okay, thank you for an excellent report and I'm just seeking a little clarification. If I understand correctly from what you have stated in your comprehensive report and resolution, there is no formal review process to which this community board would be responding. So am I correct in saying that there is no formal action by any city agency that will come before this community board for approval that everything that we're doing here is for information of the board and to indicate the support of the board for this project. We heard testimony earlier during the public session from residents of the area who felt as though there might be a way that community board would be opining on this of this proposed use. But, as I understand it, we have no official role other than to try and play some sort of a position that would help ease this facility into the neighborhood and make it acceptable to all the neighbors. Am I correct? There is no formal review to which this board is responding. Thank you, michael. That's, a great question. It is our understanding that, because there are no variances, this is not a euler process, so it would not come before the community board. We were asked to host this meeting. We were also told that they did not need a resolution from us. We chose to write one because we wanted to express support and we also wanted to express the concerns of neighbors. Both of these are valid. There was a lot of support both from immediate neighbors and from neighbors in the wider community, as you can imagine, and there are also, as you heard tonight, a lot of valid concerns about the operation about the density about you know, impacts to quality of life. There is no from our understanding. There is no reason that this needed to come before the community board. We understood this as a proactive effort to engage the community to begin a conversation. I mean this isn't supposed to you know. There's about this is about two years away at this project, so the promises to that this is just the very beginning of outreach that project, renewal and dss will be doing to address concerns and to make this as successful a project as possible, and I assume you will be reporting back to us on a regular basis, how well you're doing with project renewal and in helping this facility to fit into our neighborhood. Thank you for your report. Great thanks, michael puerto rico, hi. We heard tonight from people who are opposed to the shelter who feel that the process requires more time and we heard from people who are in favor of the shelter who felt that more time should be taken. So my question is: how do you feel about that susanna and do you think, perhaps that the resolution should encourage more dialogue between the neighbors and project renewal before going ahead? I want to say the project renewals is offered just I don't mean to interrupt, but they've offered to fully engage with everybody on this on an ongoing basis and the extra time doesn't preclude any of that discussion. The discussion doesn't include the community board where you know again we're weighing in on this, because we want to support this project and we want to outline the concerns and that's what the resolution right. So I'm just suggesting yeah there's no there's no euler, so there's no clock ticking. You know it has decided to do this. The process is in itself a slow process because of getting the building. They don't have a contract with the city project. Removal does not yet have a contract with the city they're in the process of getting a lease with the property owner. I mean the process itself is going to take time, and actually I think it was pretty good that dss pushed us to have this meeting to me. It expressed a willingness to be very proactive early on and to start a conversation with the community early on. There is no built-in clock ticking at you know for this process. It's not a ruler, and so it's all just part of I thought the way we interpreted. It was transparency and communication and trying to get this project to be successful right, but there does seem to be a lot of nervousness about the speed of it, and so perhaps the reso, since it is voluntary, perhaps that brezzo should reflect our hope that they will continue to dialogue. But yes- and I hear carter- that's why we wanted to do the resolution. Now I mean generally when you the time you can impact projects is early on and that's why we wanted to have. You know a very thorough resolution outlining issues so that they're specifically outlined and they can be addressed. I mean a lot of these are the mechanics of the operation of the facility, and you know if the city is approving the safety. These are all the different city agencies and it's already an sro. You know use it's already a hotel use, which is which is precisely why they went and chose this facility. And frankly, one of the biggest impediments is that we don't have any affordable. I'm not I'm not getting into that part of it. I'm just remembering so many resources that we've done on land use, encouraging the parties to work together to the mutual satisfaction. This doesn't say that I'm just suggesting it, but I'm fine with the majority frederica. Actually, where therefore number four does it expects project newland dss to maintain continued dialogue with the neighbors and to mitigate potential quality of life impacts from construction and operation? Thank you. We thought that was important to include. They made a promise to us that this is part of what they want to do and we would like to hold them to it. Dr smith, yes, suzanne! Thank you very much for the meeting. Thank you also for that great resolution and, more importantly, for the report and the support. Thank you. You're welcome. Okay, I see keane is waving her hand, so I'm going to call on keane. You need to unmute yourself. Okay, now you can hear me. I was at that meeting I'm on that committee. What you all don't know is that there were about a dozen neighbors who spoke very strongly in favor of this, including some people who live nearby. So tonight was just other people I mean they were in terms of the total picture. There are a lot of neighbors who say this is just what we should be doing and there were specific questions about the smoking about the people on the street and they were answered. I mean it was very interactive, so I just want everybody to be reassured that we are not doing anything precipitous here, but just to clarify, because we also received some letters today. Some of the many people with concerns are also nearby residents. Susanna. Do you want to or bob do you have that summary? Just since the summary of well the letters you know it's hard, I I'm reluctant to summarize, because these are all things that arrived recently and we had 77 people at this meeting and many people spoke, but not everybody spoke. Many people spoke in support. Many more people spoke in support, rather than you know, in opposition and the letters. So it's hard. It's really hard to gauge, I think, what's fair to say, is there's a lot of support for this and there are a lot of concerns about it. Both of these things are true, and I think that both of these things can be are likely to be resolved if project, renewal and dss maintain dialogue and accommodation as they're promising to do, and if they run it as well as their problems. Katie I've just muted myself can hear me now. Yes, I I'm coming through now. I think I noticed susanna that it was not a unanimous vote on the committee. What was the objection from the committee member about this kathy? Do you want to address that? Yes, I just want to address this briefly. I am definitely in support of shelters and lowering the shelter population which has 200 plus. My concern was how this was stated as an employee or employable residence, and I have my own personal belief. My legal research has a concern that would block people who were disabled from being able to be admitted to the shelter somebody who is disabled is defined by the court as not being able to work so having a shelter, that's employed or employable could potentially not allow somebody who's on social security disability for a medical reason to be able to go in there or somebody who is defined as ssi, which is that you don't have enough work history, but you're defined by the court as disabled. So my reasoning was more from a point of view of the employed and employable, which is not even that reason. It looks real professional. So you know I don't want it to be. I guess that's it. It's just a bottom technicality. It's almost anything and if anybody wants, if anybody wants any other information about it, my email, you can contact bob or anybody can contact me, but it was. That was the reason. Okay. Thank you. You're welcome, janine. I support this resolution in the, and one of the concerns that was raised tonight was the density in too many people and I've had relatives stay at the former hotel there and I looked it up online. It had 66 rooms, I don't know how many of them are double occupancy, so going to 90, isn't necessarily changing the density. So I just sort of reject that as sort of a reason to oppose this, and I think there's we have an applicant who's really interested in working with the community, and I also want to call the question since I don't unless there's other questions, but I don't see any I don't. Nobody else has has raised her hand, and so I think that that's a point, I don't. I don't see any other discussion. Is there any objection to moving this item into the omnibus boat? Or does anybody want to call this out separately? Okay, I'm not seeing any any objection to moving this into the omnibus vote, so we're gonna move the resolution from the social services committee into the omnibus vote. Our next committee is traffic and transportation committee shirley secunda. Now can everybody hear me now? Yes, unmuted, okay, three resolutions all have to do with making public transit safer for use and encouraging use. The first one refers to running 24 7 service back on the subway, which is what brad referred to. That was unanimous, and I will read that okay resolve that cb2 requests that mta in new york city transit, restore 24 7 service as soon as it is safe to do so. A further result calls upon mta new york city transit to explore additional options for effectively cleaning subway train interiors that promote safety and security in a potentially more efficient, productive, reliable and relatively inexpensive manner, such as uv systems like fresh air that are installed in the hvac ductwork and are designed to disinfect surfaces in the air as it circulates through the ventilation system. And finally, we urge mta new york city transit to investigate closing some local stations along each subway line during slow hours, in other words overnight and posting cleaning crews at these sections to clean subway cars on a staggered schedule, which would then allow for other subway cars to keep on riding it's in the 24 hours, and I would like to just extend the thanks to ritu chatri for her information on the particular uv system. That would help to clean up the ventilation system and to will banish for his suggestion for closing some local stations to allow for cleaning that little lab for 24-hour service. That was unanimous. The second this one is from adam zeldin, and this is asking for a standardized policy and procedure related to maintaining open windows during bus operations and again for ventilation and therefore be it resolved. That's the wrong one hold on okay here we are cb2, urges mta to establish a standardized policy to guide the operation of buses with open windows where possible further resolve. Such a policy should define operational parameters and guidelines relating to weather events such as rain, high humidity and high temperature. To provide for the comfort of passengers and finally, we recognize the need for safe and comfortable bus transit to facilitate the reopening efforts in our region. As I said, that was unanimous too. The third one we had one abstention, and this is in support of getting social distancing on the buses. So the resolve cb2 urges mta in new york city trusted to thoroughly investigate approaches to achieving whatever maximum occupancy on buses will maintain safe social distancing in an efficient and effective manner, and to implement suitable strategies as soon as possible and further resolved. We encourage mta new york city transit to consider the following suggested: approaches to achieve the desired distances, add more buses and increase their frequency, increase the number and use of articulated buses and extend their lanes when possible, block off seats, for example, cordon off every other seat and block off every other row of sea insert markings decals on bus floors to indicate where to stand for safe distance, and, as I said that was one of the same and that's it so. We've got three resolutions. Would anybody like to address any of them or call out any of the items one through three to discuss further robin? I just have a question about the last one about what the last one that's number, three, okay, I don't see anything mentioned about. There's the mta app now mentions on the buses, how many people are on the buses? Yes and I'm wondering if that should just be mentioned either in a whereas or if that should be in the resolved as far as being part of the ways of enhancing the social or you know enforcing social distances. Well, actually, it's being done. The app is has been at least halfway developed. That is it's covering at least I think. Half the bus stops at this point. It's not completely done they're doing it. They had not been doing it when the mta representative appeared before the committee and gave us all their updates and information on what they are doing, I don't really think it's necessary. It's an operation right now right. I guess I was just thinking that, since that is, I use the buses a lot now and I don't know if seven means it's still like in your I'm trying to sort of see how that might be woven in since it does seem to be an important facet of preparing whether or not one is going to go on a bus. It probably would be very helpful. I have no objection if you want to add that point. Just you know just tell us what you want and sure I'm just simply saying it's out there. This is kind of telling mta what we'd like them to do, what to consider a chirp so just to clarify what robin's point so that the app provides the information, but it doesn't limit the occupancy, and so the information is so that your gives you the choice of whether you want to board or not based on how crowded the bus is, but they haven't determined an occupant, a safe occupancy right on the bus, no right, okay, so that just I think, the more I think about it, robin we're asking mta new york city transit to do certain actions. This is an action they're doing already. I think I think I mean just if I'm hearing robin wright she doesn't know when too many people are on the bus because they haven't determined what a socially distanced maximum occupancy is, so that if you were threat, you know, if you had some health issue, that you really didn't want to get on it. Okay, would you like to phrase that in that way, I understand what you're saying carter, in other words, a request to mta new york city transit, to determine what the safe number of occupancies or save social distancing right? Well, because the app is wonderful, but, like carter said, I don't know if seven like, if it hits the max, they should say it in the app or at least I would know ahead of time. If it says nine, then that's considered the max I'll know not to get on the bus. If I'm, if I'm concerned robin, just give me your wording and okay, let me let me think about it would be in that, in that sense, right carter, right yeah, I mean whatever it is, but I just wanted to clarify. Otherwise, it's yes carter is not asking them for the right thing, but yeah asking them for to try to estimate what the safe capacity is, your social distance intervention and it would be translated in the app since they have it and people use it. So it's a communication issue. Okay, I will come up with something to ensure okay. Did anybody else want to discuss any of the other resolutions, one through three? Okay? Is there any objection to moving resolutions, one through three with three is modified in the manner suggested by robin into the omnibus vote carter? Yes, I I, if you're going to vote against something you can't be in the omnibus right I mean if you need to vote differently on it than you would otherwise, and we will. We will allow okay, but we're just trying to enough the roll call votes because of the amount of time that it takes, but thank you allow you just keep track of which one. So if you wanted to vote against one two or three in traffic or transportation, if you just keep track specifically, thank you. Okay. Is there any other questions or any objections to moving those three resolutions, including the third one, that's modified into the omnibus vote? No okay! I don't see any objections, so we'll move those three items into the omnibus vote and now we're moving on to the last committee report, which is landmarks and public aesthetics, chanel spence. We have three resolutions of first is 351 canal street to worcester street application to remove the fire escapes on the worcester and canal street facades recommend approval of the removal of the two fire escapes to restore the building to its original appearance. Six in favor and two opposed those opposed wanted, one removed and the other one not removed. Do you want to deal with this one, or do them read them all? Let's just read them all out and we'll. Let people guys follow 250 blaker street to update the storefront with new infill new signage and awnings approval of the infill included, the frosted glass and the louvered bays signs and awnings, and that only one awning of the leroy street facade have the name and logo 468 broadway to remove an existing occupied, penthouse structure and add a new route. Deck and pergola recommend approval of the application. Then 462 broadway is laid over by 41 hudson street to remove the rear, facade out of the garden and install new fire escape renovate. I'm sorry not removed resolve, recommend approval of the windows, the lights of the garden approval of the fire escape, provided that the mesh covering is replaced by simple metal railing. They sent a message after the meeting we had suggested this change of the fire escape and they are changing their application so that all of the approved resolutions conform to of changes that were made during the meeting about the applicant. So the resolution reflects that correct. The resolution. The thing of the glass and the bleecker street is something that was agreed at the meeting. The fire escape thing only happened after the meeting, so that the resolution is a point of information that they later did what we asked to be done in the second recommendation. Okay, so we have items one through four and I see that I've got a handout from beau who, I think, is going to address the issue of calling out the first one. Is that correct bo? I need you to unmute yourself. Yeah sorry thanks carter, the 351 canal and worcester street. It's an absolutely stunning building of tremendous architectural significance, and you know I understand why they want to remove the fire escapes two things on worcester street the fire escapes had been in scotl installed in the 70s. They weren't particularly significant and they were late. It sort of came late to the party, the on canal street. They were the typical installed. You know after the triangle, shirt waste, factory fire, probably around 1920 or 30.. The situation is that- and I think most people will agree that when you land mark a building, it's you of course reference the original condition of the building, but there are other factors that sometimes enter into landmarks decisions and, in my opinion- and the board has held this. For you know, some of our decisions have held this position in the past. Soho fire escapes are iconic and it our fire escapes, are very much part of what most people think of when they see soho cast iron buildings. So I'm suggesting that we allow the removal of the worcester street side fire escapes which are from the 70s, but on canal, that we retain them as a nod to the mid 20th century soho, which I think is important historically, and I also will note that there are nine window bays in the canal street facade that the the fire escape only covers two of them and doesn't even cover it. Just is on two of them and I think it it's an important important characteristic of soho buildings to have certain fire escapes remain, so I don't know how china wants to handle this and how parliamentary procedure would dictate that we do this, but I I'm suggesting that we allow the removal of the worcester street fire escapes but maintain the canal street small fire escape. I can speak to the view of the majority vote. Okay. Why don't you go ahead? The one principle is that it's the landmarks, not regulations, they're guidelines of permit a building to go back to an early period. This was already there with the fire escape or to be restored to the original condition, which was with no fire escapes at all the other. In further support of that, there are many of buildings that must maintain their fire escapes for safety reasons, and there are ample examples of that period in soho. That will not in fact cannot be changed. Okay, I'm sorry go ahead. There may be others on the committee who wish to speak well. Let me just add to this that during this committee meeting I was I could hear the whole meeting and I spoke at the beginning of it, but toward the end, when we were in executive session the I was unable to be heard by the committee, so I wasn't able to make my full points. I just want to throw that out. It was. We did understand what you said in the beginning, and the point was much discipline during the executive session, which you heard I'm sure it's true that bo didn't have a chance to reiterate his point, so I I'm not sure I'm asking what I'm not sure. I'm understanding, though, what you're asking for what are you asking for? I'm just asking very simply this is this resolution allows the removal of both sets of fire escapes, I'm suggesting that we allow the removal of the worcester street fire escapes, but not the canal street fire escape and the reasoning for that just so that people, the reasoning is that this is this. Is you know what we, in my opinion, as a long-time resident of soho fire escapes, are essential to the to the to the the streetscape in soho and it it's rep. Fire escapes are representative of mid 20th century soho buildings, and we can use the guideline from the landmarks preservation committee that we don't necessarily have to harken back to the original condition of the building. If there's a significant historical reason to not do so, and I say we should keep the as a nod it just it's a very you know. I wish I had a picture of it. It's a lovely building, and this is a very small fire escape and touching two bays of nine on canal street. I think that sort of outlines the issue right and the reason just so I mean, even though this is not a reason that we're weighing in on. We only weigh in on the aesthetics, but the reason that these can often be removed. Correct me, if I'm wrong is because the building buildings become sprinklered and become count as the means of egress right and that's well, no, that's the case here, yeah right now, but listen so people understand. But you know what the whole point is to beau's point. Is that just because you can doesn't mean that you should right and also let me just add that I, when I in the discussion, I really felt that the architect who was who was presenting this agreed with this position. But you know it's there's a rehab of the building and for various reasons, he's put in the scissor stairs, or there are a lot of reasons and ways in which you can eliminate fire escapes, and you know that's that happens all the time. So I think it's important that we maintain those fire escapes that we can okay. So I think we've laid that out. We've got a number of people who want to speak on this bob ely yeah. I would echo what bose says, but also I mean it's very easy for any community board member to look to see what it is. An amazing building and the fire escapes are very cool and all you do is go to the community board website and push your button on the on the application, and you can see it for yourself, and so I guess I would take it one step further than what beau is saying. It looks like the second fire escape is almost identical and as the first fire escape that was put up turn the century. The second one that was put up in the 70s was is an identical, but on a different street, it's equidistant and they both shoot be out there. As far as I'm concerned, I think they are iconic to our community. I understand the concept that that when the building was first built originally it didn't have fire escapes, but the fire escapes are part of our history and you know that's in a very interesting history, but also it's our streetscape and it's very. I just think these things are very important and I think on this building, especially they are very interesting. If you take a look at so I would take it one step further. I would I would suggest that we save both of them. Okay, so we've got a few different positions here. I think we should hear from a few more people hold on I'm just okay. Sorry, I'm just moving around a couple of things here. Next I have brian pape thanks carter, the discussion at the at our meeting was very thorough and we really covered these opposing viewpoints very carefully and there. Although there was a lot of sympathy for the history of soho and the fire escapes in this building, there was no compelling reason for that to not be restored to its pristine condition, as it was originally built and there's so it was. It was very thoroughly covered and the majority voted, so I it it's it's beyond me what we can do at this. What we want to do at this point, so that's my question. Well, I think I hear three different things that are going on here right now. I hear the committee's position, which is allow the removal of both the other position from the two from the two we're opposed to the to the full committee's, which is to remove one fire escape and leave the other and then what bob had suggested, which is to keep both. So those are the three things that I've heard matt. I can't help myself what are the two means of egress, as required by the fire code, and then it's not relevant. That's not right, it's not relevant, it's not, for I mean I say this with all due respect, but for my vote I get to determine what is relevant and what no you don't, because this is a landmarks committee meeting and egress is something that is not covered under landmarks. This is, this is aesthetics. It has nothing to do with egress or zoning or building code or DOB requirements has to do with this. It was aesthetics, that's it, but it is as a point of order. I think that that's a legitimate question to ask whether or not it weighs the representative, the applicant represented that the remodeling of the building no longer requires fire escape and they were unusable or usable the unusable. Those were no unneeded, not needed. That's not the question of usable. It's a question of whether it's needed to comply with the egos egress requirements of DOB and they are not and with the change mat, is that it's sprinklering a lot of these old buildings. The sprinklering system counts as a means of egress. Thank you, dr smith. Why would you be amenable for the two people who've spoken and given what they think? Why is it do? Will the committee still keep decide on what you guys are going to do? Are you willing to accept one or the other, or if you are not, then I think you need to let us know so we can move on. I don't think it's in order to have a friendly amendment for either of those because it directly contradicts the it doesn't amplify or modify. It contradicts the resolution, it's just a so. Are you saying that you want the you want your decision as a committee to stand? That's. What's before the I can't properly accept something that contradicts the committee's decision. I mean I think, cheryl is right. It's not! You know it wouldn't be a friendly amendment. I think we'd have to vote this down and have a substitute resolution or have a substitute resolution either way. Okay, so can we move on and also let me just point out again that you know because of technical difficulties, that I difficulties that I had. I wasn't able to make my point as forcefully as I would have in the executive session, which is relevant, and you know these are crazy times with a lot of technic technology glitches, and you know I think that's that should be considered as well. I think that's. I think that people have heard that I mean I'm letting them hear it again, two more speakers, georgia. Is it appropriate to call the question or do you want to cut? Do you want to shut off the conversation? I have one more speaker we'll have to vote on it. To do. I know, but I think, to frame my question as shutting off the conversation I just asked if it was appropriate to call the question so yeah. No, I mean that's what calling the question is and that's something that, with the zoom meetings, has been a little challenging. Is it someone who's already spoken? It is I'd like to speak. Okay, can I speak yeah? Well I mean, if you want to continue it or not, because I'll just remove the question. Okay, thank you I'll call on you, anita. First, since you haven't spoken. Yes, thank you. Can you hear me all right? I think again, this is an opinion. The they're no longer necessary. It has nothing to do with fire egress. This is a crazy busy street canal street. The fire escapes require a lot of maintenance and yes, they're kind of sentimental, but on a street like this, I think it's lost and I must say I really enjoy seeing the building without it. So I support the the committee's resolution as presented. Okay and then bob yeah, so I'm gonna, I'm gonna ask for the substitute resolution on keeping both the fire escapes. Okay, so you want to just do a substitute where you just change it to both. Yes, all right! Okay! Is there a second on that one susan? Are you seconding that, or is that just I'm actually saying I support bo very quickly? I think that so I'm not my heart right now. Okay, I was just. Does anybody? Second? What bob is put forward? Okay, so I don't see any seconds all right now, susan now I just wanted to say very quickly. I support bo in this I mean sometimes I we all understand living there that we're not using the fire escapes anymore. If there's a fire where the buildings are fire, proofed wonderfully the cast iron, you know we have sprinklers everywhere, but to me they're iconic, almost in the realm of the water towers, and so I think it would be sad to lose all the fire escapes. I think they're so what's on the floor, though, is the removal of both of them just so, if you want to substitute or say we move one okay, so no, if you want to put a substitute, is that what you're suggesting as a substitute resolution or we vote on what the committee recommended? I think we can vote on what the committee recommended, because that's what we're debating, which is removing both of them right, we can vote yes or no to that, got it all right. So I don't see any other discussion. I'm not are there enough people who are who are voting in different ways on this, that we should just do this now and call this out for item number one yeah, okay, so what I'm gonna do if there's no objection is move landmarks number two and three into an excuse me two through four into the omnibus bill and we're going to have number one we're just going to do a separate roll call vote on number landmarks number one now and then we'll vote on the omnibus. Immediately after that, so everybody's good excuse me carla. It's been so much back and forth so that I'm not confused. Yes, we are going to be voting. I was going to get now. Let me just finish my question. What was the committee's vote is mike with what I'm asking yeah? That's what I was going to review. So the resolution that chanel that was voted 6-2 at the committee level was that the board recommends approving removal of both fire escapes. Thank you, okay! So valerie, are you prepared to do your role? Everybody comfortable voting on item number one on landmarks. We don't have any other questions. Procedurally, okay, great we're gonna, do four against abstain or recusal right, susanna, aaron or akilah esqui against okay, william banesh or keenberger, or carter booth against katie bordenaro against anita brandt, four 54 amy brenna, no against rich cacapullo. In addition, or see her on here, okay, valerie de la rosa, yes, john paul de verna, thanks doris dieter. She can you just help me out thanks, doris, yes, thank you. Bob ely mark fitzgerald against cormax flynn for joe gallagher against wayne, kawadler or okay susan kent, again, janine kiley against all right, patricia laria for michael levine, poor, janet leff or edma. I don't know if he's still on or not oh four or four at the moment. Thank you! Matt metzger, I'm sorry daniel. You say four set against okay! Thank you! Brian pape. I am four great donna raftery again thanks lois rakhoff against bo riccobono against robin rostine against andy russo, sandy she's, still on or not yeah against. Thank you, rocio sans in favor. Thank you! Shirley secunda, charlie secunda. I see she's on yes, thank you, kristen, shea, against rodrika seagull against george's silvera. Siemens, no dr shirley smith, abstain, one second spence or kathy sullivan against eugene. U, against! I got you kathy eugene in favor, susan wittenberg, no anthony wong, no valerie's back sorry about that. It's ritu! Okay! What's your vote and I'm in favor, okay, one! Second thanks: ritu adam zeldin, correct abstain; okay, so it is 21 in favor, 21 against and two abstentions. Okay, so that does not carry all right. So we need a substitute resolution bo. Did you want to yeah I'll just make the substitute resolution that we agreed to remove the worcester street fire escapes but maintain the canal street fire escapes is a second to that I see. Susan kent has her hand up and donna. Second, it, okay and a lot of people have raised their hands to second, it is there any discussion. Do we need to change anything else in the resolution? To have that? I have a question, so I voted for that result. The committee's resolution, if I were to vote against this now and this didn't pass, where would we be left well we'd- have to get there first before we can okay discussion [Applause], I haven't looked at this resolution too carefully. Do we need to change other aspects of it in order? No, that's it! That's it just a fire escape on maintaining the fire escape on canal. That's it yeah! I just reviewed that the there was nothing in the, whereas is that slanted either way, just stated the facts? Okay! So, and I'm am I sensing that we need to do a separate roll call on this one again I see a bunch of heads nodding. Okay, all right, we will do do another roll call. Valerie! Okay, can you just say this? What the substitute resolution is? I'm sorry? What is it is for 351 canal street to worcester street. The application is to remove the fire escapes on the worcester and canal street facades. The what's being presented now and therefore be it resolved that community board to Manhattan recommends approval for the removal of the fire escape on worcester street and for the canal street fire escape to remain and with that's not exactly. You know word for word, but I think that I captured, that is that correct. That's correct! Yes, that's right! Okay, so it's the removal of the worcester street fire escape and retaining the canal street fire escape. That's correct because the application was to remove both of them. So this makes clear that we're recommending it against the application. Okay, susannah! Is that no? What was that I was vote against the substitution? So surely the it's? The recommendation is to remove the worcester street fire escape. I understand what the recommendation was. I asked china, what did he say what he just mentioned? He is the chair of the committees and he wrote the result. What is his resolution, what you said, but his resolution isn't what we're discussing we're discussing a substitute resolution? What did you just say is what I ask it has it's been a lot of back and forth you just if you want to. I just said that, though necessary go right ahead, go right ahead. I said that those changes were necessary of the, whereas okay, thank you. Okay, are we ready to vote great susanna aaron? I will vote against the substitute resolution. Thank you akilah as queen for william banesh against keenberger. Thank you. Carter, booth for katie bordenaro for anita brandt, nita, yeah, four thanks, amy brenna or rich cacopolo, again, ritu chauchary, or thank you, valerie dela rosa against john paul de verna, poor, okay, doris diefer, no thanks one second, one second, bob ely or mark fitzgerald, or thanks cormac flynn against joe gallagher. Yes, wayne kawadler, yes, susan kent, yes, janine kiley, yes, patricia aleria, no michael levine! Yes, can it lift? Yes? No, I'm sorry! No thank you ed ma, yes, great matt, metzger, nay or yay; I'm sorry, no right daniel miller, yes, brian pape, I'm against donna, raftery or lois rackhoff. Yes, oh riccobono! Yes, robin rothstein! Yes, I'm for it sandy russo, yes, rocio sands against shirley, secunda, hello, kristen, shea for frederica siegel, yes, georges silvera, siemens, yes, dr shirley smith, abstain, chanel, spence, no kathy sullivan, yes against, yes, correct thanks eugene you against susan wittenberg, yes for anthony wong, yes, adam zeldin abstain, all right that is 27, 4, 15 against and two abstentions, thanks valerie and thanks for the quick numbers you clearly you this rodeo technology, quick results. Okay, so we can all. We were all learning how painful doing roll call voting is and now moving on to our omnibus. So the motion carries for removal of the worcester street and retaining canal street for the numbers that the valerie had read off there so now going back to before. If we I'm just gonna hold on a second here, so I should be 22 in the omnibus vote. Then right hold on one. Second, I'm just gonna mute. Okay, I'm just muted everybody. You can unmute yourself as we go into the next time. Just so we can all hear each other. So as I'm reading off here, the omnibus vote consists of items one through three on the schools and education committee on the land use committee. It's items number one and two and we need to specifically just make sure that there might be an abstention on land use. Item number two sla licensing committees, one and two. We have 12 resolutions with excuse me, I'm sorry, social services. We have one resolution traffic and transportation. We have three resolutions with a clarification on number three. Within addition to the therefore be it resolves and for the landmarks committee we're voting on items two through four: does anybody need any clarification on anything on what we're voting on the rest of the resolutions? I don't is anybody raising their hands for further clarification or I don't see any hand waving or anything? Okay, so we're going to vote on all those items valerie whenever you're ready all right ready now: okay, susannah yep? Yes, william banesh, yes, keenberger! Yes, carter, booth, yes, katie bordenaro, I'm just gonna, give her a second sorry katie. Yes, I'm voting. Yes, can you hear me now? Yep anita branson? Okay! Thank you. Yes, yes, rich pacopolo, he's on a plane taking off. He said that he votes yes, but I told him to write directly to you: chauchary, yes, valerie de la rosa, yes, john paul de verna. Yet yes for all the land use regarding blink fitness, not the spring street one, the other one you're abstaining on number, two, just to be clear: yeah, the yes, the cultural pop space, yeah, okay, yeah, the pc, yeah. Okay, that's number one! You got that valerie! So yeah one he's abstaining, but it was a recusal. Not an abstention. Oh see corrected. Yes, I just got it and then- and that's because you're a member there is that correct, yeah, exactly great jim, all right. Okay, great! I have that noted. Thank you. We could just mute everyone- doris ether, yes great, bob ely, yes, mark fitzgerald, yes, cormac flynn, yes, joe gallagher, joe gallagher, wayne kawadler; yes, susan kent, yes, janine kiley; yes, patricia laria; yes, michael levine; yes, janet leff, yes, edma, okay, matt, metzger, hi daniel miller; yes, brian pape; yes, donna, raftery, yes, lois rackhoff, yes, bo riccobono, robin rothstein; yes, andy, russo, yes, fans! If she doesn't yes, okay, if you're, not speaking of your commute, please valerie, I'm sorry! It's beau! Yes, shirley secunda! Yes, kristen shay! Yes, federica siegel! Yes, georgia, silvera siemens, yes, dr shirley smith, yes, chanel, spence, kathy sullivan, yes eugene! I got it. Okay, great eugene! You yeah susan wittenberg. Yes, I don't know. If he's still on the call, we look. Oh you're, muted, someone's, muted ed. Are you still with us edma and joe? We got your vote. I got joe I'm just missing ed. I saw him, but now I don't okay, what is 43 4, with the exception of one of those 43 having a recusal on land use, rezo number one, and so the four are not voting or didn't. I'm sorry. What? Oh? No! I said that, as in their votes were four, I thought. Sorry, oh yeah, no 43 4 with one of those, including a recusal on land, use, rezo. One perfect that sound correct. Did anybody not vote that we didn't hear from so we got? Everybody should be everyone, except for ed ma, because we had 44 in the last two votes. Okay, that's what I've got on the agenda? Is there a motion to adjourn? Yes? Is there a second right bob, even though he's taking it off here, everybody needs to clean up after themselves. Thank you areas around them, thanks everybody and thanks for your patience, and we will let you know when we send out the next calendar with all the details for the coming month, and that is the last month. I have a full board meeting. Thanks, doris, I see you there, carter valerie great job. Thank you so much. Thank you mark moss. Yes, you.",
        "summary": "Here I think we've got just making sure we don't have any board members that have registered in the public side of things.\nSexual abuse, survivors, newspapers, journalists, and they drag them into court on really thin grounds of on issues like defamation, and they basically try to intimidate critics by these lengthy lawsuits that bankrupt a lot of small organizations and advocates , I think, protect the first amendment The other bill.\nYou, know, abuse case or just be with a family member, and they will hone in on them and arrest them for attending court, and that obviously, is a huge barrier to justice, because we need people to go to court and court.\nThat kind of punishes you know, restaurants, who may not have you know who may not be responsible, there's a lot of responsible restaurant owners who are doing the right thing and a few bad apples, as is often the case, but it's So we've looked at potential amendments that would tighten the the governor's executive order in that regard, but I think I'm gonna, leave it to the governor to step up enforcement or at least make it more routine and predictable for everyone.\nWould you know, I'm going to be stepping up my public campaign and in connection with that, I, sent out mailings and put it in my newsletter to my newsletter, this week, but The issues around policing, I think, are important.\nHere in the state of new york, we had our own pfest debacle in a in a small town and and resulted in you know a lot of people who may develop health conditions down the road, including infants and children.\nI just want to let everyone know that questions are only reserved for the community board members and it won't be open to the public.\nI wanted to support the resolution, because I think it very accurately reflected the testimony in two different sla committee hearings against the bill: The union.\nI, also supported the resolution, because it admits that new york state liquor authority currently has no ability or legal mechanism to enforce transgressions by patrons drinking in the public, domain, and I hope.\nThat's, why we have alcohol beverage control laws in the first place, I believe the governor's executive orders have basically gutted the abc laws, and I am opposing senator heyman's bill and in favor of the sla committee resolution, because I think that bill would also gut the abc laws.\nIt's a wonderful life for bourbon street I think that there are other ways to secure revenue for new york state that do not involve alcohol, and I.\nMy neighbors and the board members recognize that new york state is in his 15 billion dollar deficit, and what I was trying to do was provide some sort of economic lifeline to these businesses.\nYou, know initially, and then we saw the explosion of violations of social, distancing and people not wearing face covering so like with a lot of legislation.\nIt's the east side and board too so on July 31 with the us census and people who have ipads from four to seven We're going to be walking around the soho community and we will make sure where we meet.\nLast semester, 178 000 summer school, kids, You are educators on the community board and there may be principals and teachers listening, but my friend who's, the principal said that he's not sure most of his teachers are not coming back.\nI know that this is an endless story, but with europe starting again in august, as we understand it and the issue affordable housing we're talking again to all the people and the groups who have been working on this issue forever and just trying to see if we can have a real, clear understanding of what is or isn't.\nEvery new york, city, public school student is going to get 420.\nWe have a resolution tonight, so cb2 will be discussing it, but we wanted to get your support for really helping to fast-track open streets or play streets for schools.\nThere's obviously opportunity costs, but there is no cash outlay to open up streets adjacent to schools, to create additional space for social distancing, but we need everyone's help to cut through the bureaucratic red tape and make sure some of these things can happen by september.\nWe already know that ps3 ps41, cydia's school and likely 75, morton Thank, you, susan, so we're going to move on to our public session as a reminder.\nPlease support providing access for our public schools to the streets that are right outside their doors.\nSo, it's nice to see so many familiar faces, I'm here representing a group of community members who are people of good heart and conscience who want to support the city's attempts to deal with the homeless crisis.\nI. Don't think that there's any chance that you would be able to squeeze 90 people plus 25 staff members in that building, even if it did get approved, but there is a way to bring the whole community together.\nThe way to do that is to give people a little bit more time, more diligence, more information and make sure that it's an informed choice by this community board to approve the project and with that I just want to.\nResidents, smoking outdoors, impacting the buildings on either side behind also behind west 12th, street, plus the egress and fire hazard issues are a great concern.\nWith regard to issues of community safety, public health and fire hazards, therefore, I would like to suggest that the community board delay their recommendation in order to give time for the community to fully evaluate and have input into this situation.\nIt would be unusual for community board to usher in a shelter and perhaps unprecedented in new york city history, but I think this is an opportunity we can seize for the village in downtown to show the way to do right by our distinct cultural legacy and to strengthen our community's sense of purpose.\nWe shelter, a thousand people every night across seven shelters, another 1, 000 individuals and permanent, supported and affordable housing, we're one of the largest providers of direct health care to homeless, new yorkers, with over 100 doctors and nurses and clinics throughout the city.\nThe shelter at west 11th street we'll combine our shelter and housing expertise with employment programs to help women exit homelessness through work, we're happy to discuss programming in greater detail offline and we can share with anyone the presentation that we gave to the social services committee, which the rest of the board members have.\nWe need to find a way to find a legal moderator and find out what we want to welcome these people into our community.\nI spoke to bob and he told me to speak to project renewal, but right, I'm, looking for a middle person to work the problems through someone with an impartial middle I'll reach across the aisle, but I want there's someone to be in the middle to kind of negotiate.\nThink project renewal has given a pretty strong indication that they're willing to work through those issues with the community and certainly follow all the rules and regulations of the city.\nSo I'm, going to summarize her letter that she wrote to the community board, which is very much a lot of the points we just heard from richard and other speakers that were not in favor of this particular development at this very moment, but is welcoming of homeless, shelters and affordable housing to our neighbor and neighborhood in general.\nNext to the first presbyterian church, which continues despite calls to 311 over the last eight years, amy respectfully asked that more thought and planning goes into our community's investment in project renewal and seeing no other questions that ends the public session.\nWe also need to make sure our businesses know how to access that federal support on the school reopening side.\nCouncil number 10 worked with their colleagues to make sure that funding for seniors, education, health services and food pantry programs got to communities who can't afford to wait for release.\nIf there's nothing of too much substance in order to allow it to be a business only meeting okay, we can move it along for all the board members in a timely manner, but that was one of my few items during my chairs report.\nBut you know we've heard many of the same concerns we're actually working on a response to DOT and the administration in a letter kind of talking about all the different aspects of open, streets, open, restaurants.\nI saw you're working on the resolution on open streets for schools, so really excited to kind of see more of that and again any more thoughts.\nI think that there's been from what I've heard, not necessarily judging whether it's appropriate or not the violations that have been issued, but it seems that there's been some overzealous enforcement of establishments that are trying to follow the rules and have been working really hard in limited enforcement on places that are blatantly breaking the rules and that's raised a lot of issues within the restaurant community.\nAnd- let's see at the borough president or excuse me at the at the borough board meeting this week, there's a presentation by revel scooters which I think is going to come to us in the fall.\nEven though we don't have any resolutions in front of us, this month, I just wanted to acknowledge that our three working groups that are currently running right, now, The, bylaws, working group, the equity working group and the reopening working group.- I'm going to move on to the treasurer's report, anthony Hey everybody.\nWhat the reason that we chose them was because they had already attended community board meetings, so they were familiar with the process in which we worked, and I think that when they first went to cv3, that was something in discussion with their district manager that she had indicated being familiar.\nI just want to let everyone know that, like many other people, the staff are still working from home, we're trying to get work done by phone email text and zoom.\nThe considerations that we need to concern ourselves with before we can open the office, and people can come back for our situation.\nWe, restored hundreds of millions of dollars, 700 million dollars in cuts from the mayor's proposed executive budget, to education, to social service, to mental health, to seniors to all the things that we care about, and it's going to help countless people.\nMy office has been working closely with the department of health and sanitation and parks on rat mitigation efforts in the west village and in the south village, and during the upcoming months my team is going to be doing a series of walk throughs with those three agencies, the residents, the building owners, the block associations.\nI could talk about, but I just wanted to give you some highlights of some of the things that we've been working on and some of the things we're able to do in the budget and, as always, I'm on cb2 for your leadership during these hard times, and your partnership with my office to continue to work on behalf of the residents in community board 2 and for the small businesses.\nIf I could just ask people if they've got just brief, one-sensing questions that would be great georgia, it's more of a comment, I guess, or a request, in the same way that we're going to bat for small businesses and open streets.\nIf, you or members of the community board have suggestions for us on particular schools or particular streets feel free to pass them along to my office, And we'll speak to the chancellor's office in the mayor's office about some of those suggestions.\nTo give people the peace of mind that there would be a safe possibility of reopening, I mean, I think, the we have not seen fatalities amongst children- Very few, not just here in new york, but around the world in the united states, If you're going to ask teachers and staff to go in, you need to make sure that you have a plan, and then you need to make sure you have to be concerned about If kids can bring it home.\nYou know no one, I think, has started to sort of plot that out we're kind of looking at the other type of industries and seeing if we have a secondary spike in infections over the next many months and that's what will determine some of the other things that are gonna impact.\n, You, know people just don't wear them We get some public service announcements and try and sort of beef up the advertising on this issue?\nYou have to wear a mask, but if people aren't doing it, you know, I think we kind of have to use some peer pressure.\nUnlike many other places, as we've been slowly reopening, I will talk to the mayor's office into the department of health and see if there's going to be a continuation or a new effort, as well as the governor's office about more public service announcements related to mask wearing.\nFirst one is a resolution in support of open streets for schools and the addition of outdoor and indoor school sites to support the safe reopening of new york.\nStrongly urges the new york, city, department of transportation and the department of education to implement a fast-tracked and streamlined open streets program to close streets around schools which will provide much needed recreation space and.\nThe second resolution is in support of immediate solutions to reduce the digital divide by fall, 2020 for new york city public school students, and this has been identified by many advocates as one of the most important equity issues.\nOur third resolution is in support of new york, university and trinity, real estate commitments to new york city for the bleeker school in hudson square, school and public recreation space and therefore be it resolve that community board 2 urges our elected officials, new york, university and the department of education to ensure that the bleeker school option is exercised and continue to explore the possibility of creating a DOE public school program for dyslexic students at the bleeker school site.\nThank, you very much, janine, I'm, not sure the advent of footnotes I attribute to the starting use of those to matt, but I know he's on your committee Is. There any unwillingness to move these three items into the omnibus vote?\nThat, in general, cb2 encourages our elected supposed turning over pop space to developers for commercial infield purposes within cb2, because I think that the resolution lays out the case for that with our very limited pop spaces within our community Is there any opposition to moving these two items into the omnibus vote that we'll be voting on at the end?\nI lost them, therefore, be it resolve that committee board 2 Manhattan submits that the vagueness of senate bill 8392, as proposed and written, represents an unacceptable risk with regards to public health and safety at this time and therefore be a further result.\nIt's a very good resolution and Is there any objection to moving items, one through 12 from the sla licensing committees into the omnibus vote?\nSo am I correct in saying that there is no formal action by any city agency that will come before this community board for approval , that everything that we're doing here is for information of the board and to indicate the support of the board for this project.\nWe heard testimony earlier during the public session from residents of the area who felt as though there might be a way that community board would be opining on this of this proposed use.\nMy question is: How do you feel about that susanna and do you think, perhaps that the resolution should encourage more dialogue between the neighbors and project renewal before going ahead?\nThe discussion doesn't include the community board where you know again we're weighing in on this, because we want to support this project and we want to outline the concerns and that's what the resolution right.\nI think there's we have an applicant who's really interested in working with the community, and I also want to call the question since I.\nSo we're gonna move the resolution from the social services committee into the omnibus vote.\nWhat to consider a chirp so just to clarify what robin's point so that the app provides the information, but it doesn't limit the occupancy, and so the information is so that your gives you the choice of whether you want to board or not based on how crowded the bus is, but they haven't determined an occupant, a safe occupancy right on the bus, No right, okay, so that just I think, the more I think about it, robin we're asking mta new york city transit to do certain actions.\nWould you like to phrase that, in that way, I understand what you're saying carter, in other words, a request to mta new york city transit, to determine what the safe number of occupancies or save social distancing I'll know not to get on the bus.\nAny objection to moving resolutions, one through three with three is modified in the manner suggested by robin into the omnibus vote: If you're going to vote against something you can't be in the omnibus I mean if you need to vote differently on it than you would otherwise, If you wanted to vote against one two or three in traffic or transportation, if you just keep track specifically, thank you.\nI, don't see any objections, so we'll move those three items into the omnibus vote and now we're moving on to the last committee report, which is landmarks and public aesthetics, chanel spence.\nWe've got a number of people who want to speak on this bob ely I mean it's very easy for any community board member to look to see what it is.\nI think we should hear from a few more people hold on There was a lot of sympathy for the history of soho and the fire escapes in this building.\nI support bo in this You know we have sprinklers everywhere, but to me they're iconic, almost in the realm of the water, towers, and So no, if you want to put a substitute, is that what you're suggesting as a substitute resolution or we vote on what the committee recommended?"
    }
}