{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "title": "CB7 Housing Committee",
            "publishDate": "2020-10-27",
            "shortDescription": "",
            "lengthSeconds": "2:22:25"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "VMa0mgsCfdA",
            "fillerWordCount": {
                "uh": 201,
                "um": 319
            },
            "readTimeFullTranscript": "81 min read",
            "readTimeSummary": "8 min read",
            "wordCountFullTranscript": {
                "housing": 57,
                "building": 48,
                "buildings": 37,
                "money": 37,
                "guys": 29,
                "work": 29,
                "development": 28,
                "management": 26,
                "problem": 26,
                "leaders": 25
            },
            "wordCountSummary": {
                "housing": 11,
                "leaders": 7,
                "building": 7,
                "tenants": 6,
                "buildings": 6,
                "work": 5,
                "government": 5,
                "state": 5,
                "tenant": 4,
                "development": 4
            },
            "fullTranscript": "Well, I hope I hope everybody can connect. I tell you that test run really underline the digital divide that seniors and low- income people have yeah. Well, hopefully everybody will be able to get on and say their piece yep, oh god, okay! So where am I here I go so we are live streaming now, just Fyi, okay. I should probably Jesus nobody from the committee on the robbers here, but the chairs are not here. Well, it's not 6:30 yet so! No, I guess not. I started hoping the federal aid folks, the Ta presidents would try to log in early since they all had problems. Yep we were standing. I urged our staff summit we're having a staff conference in lieu of being able to get together over zoom. So I said we need to start a half hour early to get through all the technical difficulties before we officially started. Did you have another speaker to talk about nature? Related issues can be part of the agenda. Nothing, no yeah! I'm not sure my inbox is filling up with people who want to be heard on the on the oh anyway. So it's a little hard to access my email right now, yeah, where is everybody Melissa, hey, Melissa, good? We are live streaming and I'm going to start the recording too. So I can because there might be people in the attendees who need to be promoted so I'll start doing that now. I know that you do not have a quorum yet, do you guys have somebody picked out to do minutes? I usually do some intense multitasking, but okay a little bit harder. However, you want to do it. I I alerted mark that it was just a coincidence, but the Da's office and the local police precincts. Actually, the commissioner has convened a meeting of NYCHA leaders from Manhattan south that was meeting at started at 4:30., okay, so that included some of the federal aid folks, so they're going to have to be coming back home from down at police plaza. That includes margarita from Amsterdam cynthia, so there's a possibility, some of our federal aid folks might be running late. Accordingly. Okay, let's see polly joined us hi good evening, everyone. How are you hi, Paulie hi mark how you doing hi Sylvia? I was just mentioning that there was that meeting with down at the one police plaza for some of the leaders who might be running late. I saw Council member Rosenthal for a moment. Yeah. I see him there. What was the subject of the meeting crime and safety? It was following up in the meeting that the Da's office had up at Frederick Douglass, I guess two months or so ago. So it's a follow- up to that. So I understand that folks from Frederick Douglass was there polly? Do you know who else was down there? I think it was ten leaders I heard well. I know I had gotten an email from vladic to attend carmen had called me as well, so I can't really confirm who attended, but basically it's just about police reform. You know the governor requested that there be community feedback. So basically that's you know the topic of the meeting and the discussion. It's just a forum for everyone to give feedback, so they had different dates for different groups. I was my understanding that 40 individuals were physically invited to attend at police headquarters, but then there will be several virtual meetings for every all of the nine council districts through zoom. So I know that a few resident leaders did not want to be in a room with 40 individuals, so they prefer to participate online yeah. So I just sent around today the link for that. By the way I sent her on the link for a virtual meeting right, there's several links and emails going out about the meetings that are being held at police headquarters, and I saw a mona Lisa yesterday and she said she would be here this evening. Seven meetings, hi Sylvia. How are you I'm? Probably I'm good? Thank you. Okay. I think we have a quorum from the committee, so I'm going to kick us off and then you know as folks join, especially our NYCHA tenant leaders. That'll be great just so to start us off, I'm Melissa Rosenberg, I'm co-, chair of cb7's housing committee meeting, I'm joined by my co-, chair, louisa, craddock, and it looks like I do not know. If madeline innocent who shares our nature task force might be stuck still poll working because of the intense interest in early voting, which is fantastic. So tonight, we're joined by a number of NYCHA attendant leaders in our community district to hear from them a bit about what's going on at each development as well. As you know, any issues or needs they want to raise and to discuss ways that we can be helpful and just talking through issues or elevating them, and I also just want to start us off with a few ground rules. We are all colleagues and neighbors, so I would appreciate if we can all speak to each other with respect and try not to interrupt each other or use disrespectful language. I'm going to hand it over to our ngta leaders, we're going to kind of run through our agenda, which is focused on the issues and niger development in our district and the end of the meeting, we'll open it up to the public. If people wish to speak, I ask that if you do wish to speak, you please keep it to the specific topic of tonight's meeting, which is public housing in community district seven and if you're here, to speak on another issue. I'd ask that you please hold your comments until the Appropriate Committee or full board meeting of community district seven. So with that Melissa. Can I jump in and just amplify that for one quick? Second sure thanks, because I see some folks in the attendees and of course we welcome your thoughts about NYCHA and public housing and all those issues, but I'm suspecting that perhaps some of you are here for a different issue, and this is not the meeting for that issue. Probably the right meeting will be the full board or the budget. The community boards are required to have a budget hearing at some point before we vote on the budget priorities. That's going to be next Wednesday at 5:30 to 6:30 and then we'll have the full board meeting at 6:30 there'll be an opportunity for public comment there. So if you want to be heard on any of the budget priorities prior to the vote on them, those are your opportunities. That said, there are 100 people signed up for this meeting, that's probably more than we can ever hear in one meeting, but we will do our best to get to as many folks as we possibly can and I'll continue to work with the leaders of groups who identify themselves as interested in those issues. But again, this is not the meeting to talk about the budget priorities. This is a meeting. That's long been scheduled with our tenant association presidents from the NYCHA developments to hear from them directly about their needs and how we can try to marshal resources meet them. So with that I'll give it back to the chairs, with thanks for everybody, who's coming and advice, to look at our website to make sure that we, when we schedule those meetings, you'll be able to find you know how to access them and to be a part of that discussion. Thank you and I invite you all to whether or not you came up this issue to stick around and listen because you might, you know, meet some people. You would not have otherwise or learn about a topic you might not have otherwise. Also just want to thank our elected officials and representatives who joined Us council member Rosenthal's in attendance. I see Hannah from Representative Nadler's office, sawad from state Senator Serrano's office, not sure who else I'm missing, Eric from Councilman Mark Levine's office, and then of course thank you. Larry wood from goddard, Riverside who's, always a helpful housing guru. Louisa do you Wanna, say anything before we hand it over to our nature, Ta presidents to kick us off? No, I think that was good, great okay mark. As the person who issued the Invites, I mean we can start with Cynthia. I feel like Cynthia's at many of our meetings and would be happy to give us a quick update. Oh and sorry, I hope, okay from Robert State Senator Jackson's office Cynthia, do you want to kick us off yeah, so we're running late? We were at a meeting at one police plaza. That's why we karma will be on ernesto, we're all just now getting back. That's why we're running a little late does carmen have the link because she was not on my list. I sent her the regular CB7 on registration and she registered from the bar very good, very good there. She is yeah, see we're all getting back. So where are we? What do you want me to kick it off with just a brief update of just whatever is going on at your development that you think is important for us to know any issues you wanted to flag or discuss with us. I know when we last spoke. We spoke a lot about the pact program, so I understand that there are some updates around that you might want to discuss. There are all right. So, first of all, let's start with the fact that I currently have 11 brownstones without gas since last Sunday. So that's one major issue over the brownstones. We are once again faced with no gap. This happened in 2018 the week before thanksgiving. They never got the gas back until two days before thanksgiving. It was out an entire year, and that was with four buildings, and now we have 11 out so once again, I do not expect the gas to be resolved anytime soon, Cynthia, quick question, sorry to jump in, but just quick question: we've been hounding NYCHA, since I think Thursday or Friday. Have they even spoken to you or gotten back to you with any information they're communicating. They said that they're waiting on a vendor to be approved again that has to go through mixed finance. That's Carl, Walton and you know, dealing with him is like pulling teeth, very frustrating this man, but we have to get a vendor first and then there are many cracks. The main line to all 11 buildings has a crack, so the main line that runs from 22 to 42 in the middle of 36.. There's a crack in the line. There's a kraken 36, there's cracks in building 40, so you know you have to first deal with the asbestos around the pipes. Then you have to deal with the cracks themselves. None of this is going to be dealt with until they actually get a vendor. Okay, thank you for that update, sorry to take a little time there. Thank you, cynthia yeah we're going to need turkeys next year. Helen we're going to need turkeys again, but you know it depends. It takes a long time to get gas on, but when you have a mixed finance acting director, who is very difficult to work with and communicate with, it makes the matter even harder, also as far as ernesto, he should be getting on soon yeah. They did meet with Prc this week they had a meeting hi hello hi. It's me Mona, I'm here they do have a meeting. Rc and Prc wants to hurry up and get the leases signed. So they're more focused on that, but they have people in the building. They have one woman who has not had a sink in her apartment. In six months, ernesto himself from a tenant above him that has now leaked on him and underneath him, and he is very frustrated that management is ignoring them. He actually flipped out on the superintendent regarding the the situation over there and getting some results done and that's not happening so wise is going through a lot. There's some more concern with getting police assigned than they are with getting apartments up to code, so the pack can even go through anything else. No, that was helpful polly. Do you Wanna Larry. You had your hand up when it's my turn I had. I was going to give a little overview of the whole all of the numbers to try to put in context because you're going to be hearing from at least one of the resident leaders from hopefully each development if they can all get online anyway, I work at goddard. Riverside I've been there 33 years. A lot of my work has been with rent, regulated, tenants and SRO tenants, but I've also done a lot of work with the so- called federal eight, which is the name that a number of the nature leaders have taken for the developments and just to help bring people together for mutual aid and support. God and Riverside has been working with the leaders to help facilitate just communications and for mutual aid and support just for context. You know we have over four thousand buildings in community aboard seven 131,000. You know residential units, five percent of them are public housing. 22 properties have about 6,000 units here in Community, Board 7. and where they are, we have a group. Amsterdam houses in Amsterdam edition is down by Lincoln Square and that's where guarded Riverside at Lincoln Square is now located. We merge with Lincoln Square Neighborhood Association, then you have Weiss towers and a variety of buildings around in the west, 80s and 90s. You just heard from Cynthia. She made reference to the Wursura, the West Side urban renewal, brownstones, that's a collection of 36 buildings, they're all walk- ups and they're all buildings, and they have a lot of issues, but collectively that's 370 units in there were brownstones and then the other big chunk of public housing is Frederick, Douglass and a mix of other buildings and that's between 100th and 105Th Street, and you know going back to Ronald, Reagan Hud and his cutting the national budget for producing housing and for maintaining it. Public housing has been under assault for decades and there's been a lot of abandonment and demolition across the country and in my talking with NYCHA residents over the decades that fear of gentrification and displacement and privatization runs deep and there's always a lot of suspicion. When new programs come up what it would mean, everybody wants their buildings renovated and maintained, but there's always been a lot of concern and mistrust and fear of displacement and privatization, and the issues that you're going to be hearing is climbing crime and safety has been a big issue in the communities. Obviously, repairs the fact that the federal government has largely abandoned nature of public housing, as well as the state wise towers which is going through. The Rad Conversion now was built with state capital, money and state operating money. Governor pacquiao, he cut all the operating money, so the public housing, the state used to run was abandoned. So NYCHA is now the federal build buildings, the federal money, the state money and they have far fewer resources to keep those buildings maintained, which has led to the current state where there's 40 billion dollars in backlog, capital, improvements and overcrowding and a lot of issues within NYCHA. So that's just a little context and God of Riverside is committed to keeping these buildings and keeping affordable housing on the West side, whether it's rent regulating, sros or nature. You know we think it's vitally important to maintain the cultural economic diversity of this community. That was extremely helpful larry. I should have let you kick us off. I think. No, it's fine! So I'm going to abuse myself and hear from my friends, okay, so basically Larry. I know you spoke about us meeting together as a group, so the federal eight basically is a group of NYCHA buildings who were federally funded. So that's why we started out with that name federal eight because of the eight complexes here on the upper West side, so we have been meeting with God at Riverside with Larry. I just want to thank you for being supportive and you know having discussions with us on how we can work together. You know to resolve some of the issues that we're dealing with right now. Yes, weis towers is going through a transition, so I do know that Cynthia and I believe ernesto, who is the president at wise towers if he gets online. He wants to speak to those issues. So I'm not going to take up time talking about that, because that's something very serious that you know needs to be addressed. Okay, in addition to that, we have Ramona miner online who's online by phone from the host, though so I might want to give her the floor so that she can speak to issues going on in her building right now, and we also have Mona Lisa from the dome site who's online, so I rather give the time to them and then I'll speak after they're finished thanks good afternoon yeah, oh yep, we heard you go ahead, ramona, that's ernesto! Yes, okay, good afternoon, Ramona miner, the hostos! How are you it's just about? Basically the same thing that Larry has covered? It has been very stressful for me for the last few months they were supposed to be fixing my Ta room that never happened. They are cut wires that have to be installed from downstairs, and I have to get permission from Carl Walton before that exists when he is the one that told me, the room would be fixed a couple months ago. So it's been very stressful. Dealing with that, because we really do not have a place where the boy can sit down and come together and it's getting cold and we do things for our kids during the holidays. So I'm hoping that after they finish, fixing their room that maybe they'll get to the Ta room have going in your building. That's not correct! There's a whole bunch of things. That's going on in the building is not correct the safety issues where people can just get into the building, and I actually was going down staircase one day and some strange person was coming up no math, I saw I went down the other staircase when I seen him coming. It should be some kind of way that they secure the back door as well and make sure nobody's in the roof there's a lot of graffiti. So we already know that this was not happening before, especially in the hostels. But now the hallways are full the elevators of Graffiti. What about your front entrance door? Well, I, as soon as it seems like somebody's getting ready it gets loose or whatever I always put a ticket in to try to keep it working anything else. You Wanna, let us know! No. Thank you. Okay. Thank you tonight, Ramona, I'm sorry, Melissa hi. How are you it's good to hear your voice? Ramona, always yeah. The Graffiti definitely sounds new yeah, so it was not like that before. Actually, there were tenants moved into the building that we were not aware of, and a lot of things begin to right change have a lot of new people moving in. We do not know who's who one time you just got to sit there and kind of it's a lot of new people in this building. Believe me, do you think transfers, or I mean by New? Do you mean I mean there are always people coming out in and out? You know: what's no, these people that are putting these apartments that we have here. So it's some apartments need to be done, they're not being done, and that's also an issue because they've been sitting for years and I'm quite sure, they've been recorded about it, but nothing is being done. You mean they're, just sitting empty, not renovated exactly along with the people that moved in that the Ta presidents used to have a list, so we could kind of get to know the neighbors and we're not able to do that. We have not had to listen a long time for all the Ta leaders. Is that a new thing that's happening: polly Cynthia management's no longer giving us access to the list of the names of the tenants, not neither the new ones or the current existing ones. They've stopped that all together, they're also not filling the apartments. A lot of the vacant apartments are staying vacant which is not filling them, especially in wise towers. Okay, thank you. Well Helen. You remember that the door, because we went through that process that the host, though so the support I mean, I'm just sick yeah. It's I mean we have spent so much money on that frigging door and well enough, so that it's not just broken the next day. Exactly and one of the things that I want to bring up because wise towers is going through a transition, you know management will be moving over to the host cells right so that physical space and you know Ramona- has lost half of her meeting room because she had to turn it over to management. Okay. So that's the other issue, that's going on at the hostels. I did not realize that so right now, you know this. That's a dilemma because, once you know wise towers, transition is finalized and management moves over to that space. You know, there's other issues that will cause a domino effect. Okay, such as having access to our files, recertification issues. A lot of residents have not received any leases, so you know everything's up in the air right now, so we really do need to sit down, and you know, have some dialogue with management and determine what is that going to look like once wise towers, finalizes their transition because, as far as I know, there's a timeline where they are saying that leases must be signed by November of this year. So you know for why this is something yeah. So how would that impact the westeros right, like Jack's, building my building, the hostels, 589 etc? Jack is not here right now, but he did ask me to speak about his elevator situation, but I'm going to hold off and because I know Mona Lisa's on the line, okay and then yeah. I see him now, Mona Lisa. Why do not you go next? If you do not mind everyone, I'm hope everyone's been well. You and your family. Well, one of the things that I want to talk about that with the dome site, we're really having a bad rotten problem, the apartment's getting infested construction on the buildings next door. I mean the rats and back and forward during the day during the night, especially and the apartment's, getting so infested that it's affecting our stoves. You know for cooking, I had to have mine replaced because it was so infested. I mean I think I catch one or a few every day. Those are the things that I wanted to speak about, and you know let you guys know that it's affecting our development, the road and problems really bad and the management is not really. They have a guy come out with stickers and that's it that's all. I know from the exterminator we have a cross management overseeing our development. They just oversee. We've been under that for about 20 years now or more we've been here 24 years since the building opened and we have scaffolding, I do not see any permit. Only half of the building was done. Apparently Victor knows about this because he's been trying to help me with this as well. Apparently the management that's overseeing the development claims that they do not know. They know that they would put up style folding. So NYCHA is not communicating with us to let us know about any business going on to do the brick work. I mean we want things to improve in the development yeah, but we would like to be notified. You know those are the things that we have if we see them once in a blue moon ever since the Covid-19 nobody's been in that office since March, so we're basically alone, they do have those people that come three times during the week to disinfect for the Covid-19. I do not know how who's overseeing them, because I do not. You know from nice, just no one. You come no one, okay and then there's the mold and mildew that you know. I think all night tenants have been having that problem throughout New York City Housing Authority, but this building is 24 years old and we've been having a lot of problems with it. Whether we've been having a lot of problems with leakage, electrical problems, I've had the boiler broke down here like twice my whole apartment got messed up and it goes on and on so those are the type of things and the repair tickets. Things do not get done, and Silvia Rivera, who also sits on my board, and she gives me where Mono and together with the development for everything, she'll be a rebel in the prince. So that's what I wanted to share with you know, and these are the concerns that we have and yes, I'm with I sit with the federal age. We've been doing this for quite more than 10 years. You know we support each development and I worry about weiss towers too, and they do have a lot of empty apartments that are not on the rent. Road people need homes, you know, and this is not going on, but you know that's what I'm here for to speak on that to speak on all those situations of my development, because there are some things I just had a fight with them. I got everybody mad at me because introduce yourself yeah. Well, I'm sorry, I'm sorry, I'm sorry, my name wise is and how you doing lobby. Thank you for that, and it's just so many problems that wise with the really knows when this conversion is going to go down, they keep saying oh we're going to do it in November. Oh we're going to do it in December. Oh maybe January they're, not really because of the closet and the things that are going on. They do not really know, but yet they want us to sign these leashes. These new leases right. I just had a fight with them. A young lady had a broken pipe in her kitchen, so thankfully they found the problem. They found the problem right away, but this was a month ago, so I told them. I was going to call Helen's office, I'm going to call Dale's office. I was going to get all hands on deck and oh, they were very upset with me, but I did so anyway because it should not take a month. If you find the problem, why would it take the money? So in my apartment, all my child is coming up in the kitchen. I'm being attacked by knacks and flies everywhere, as are the best of the apartments from six on down. It should not take a month to get that squared away. You have to prioritize, what's an emergency and what is it and they can't keep throwing things on top of the rad BRC, because they've not taken over yet so you know it's just a number of problems and thanks to me for Helen and Gail, and people like Larry Wood, who has stepped up for us and advocated for us and helped us out it'd be a whole. It would be a whole lot worse if these guys were not able to back us up, but the problems are crazy. I hear about what's going on in all the developments and it's a dying shame. My fear is that within the next 20 years, nature is not going to exist as we know it and that's my fear. You know we got people. You know me and Victor Gonzalez go back over 40 years. Everything that I learned from NYCHA. I basically learned from him now he's with the with the CB7. So I hang out with the cynthia tibbs, that's my buddy and she's very knowledgeable, and I learned a lot from her, but it it's a joke. What these people are doing to the tenants in nature. Can I interrupt just one more just to give two more things and then another thing is that at night here- and I know, I should probably bring this up at another meeting- I'm not sure the lighting in this block as well the building. That's on the corner, where, like 154, 56, 60 62, I do not know if there's 164 or what there's like no light through there. So you know it's very dangerous at night to even walk from the corner going toward brandeis of Amsterdam, it's horrible. I mean Pitch black pitch black there's like no lighting in that building, even the business that has the beauty parlor that's connected to that building and a lot of the rodent problems are coming from those buildings that are next to us, which is 160. I believe in 162. people working on the building over there and we're getting like. I said a lot of the rodent problems and inside the apartments as well. Besides, that the issues with dogs nobody's picking up after they come to this block, but they do not do it in front of their own. That's it for right now. I think I said enough, but just to ask a quick follow- up question. 16,162 are those are just privately owned buildings that are yes, okay, neighboring buildings? Okay, have you ever reached out to the building? Yeah I've even been with the super next door. He just you know the way they do their garbage too. It's like horrible and they just have not. Sometimes they dump garbage where in front of my building, you know items that do not even belong to this building and I caught them one time even and had, and the super put it right back in front of theirs. You know we're going to get they're going to get the ticket. You know. I have to say that we do have good maintenance here thank God and we take care of our building. It's very clean, but it's riding it's rotten on the inside and the wall. I'll tell you with the leakage the mold and the ropes you can hear them in the walls and the electricity problems that we have here and the foundation of the building cracking so and, like I said, they've got scaffolding out there only on half of the building. I do not see any permits on the side or anything and we're worried about that and that and on some gate that they put in front of the some fence they put on the side of one of the gates on the west side of the development here. So they do not tell us anything they like up in the air and now I know that they do not. They do not communicate with us about anything wow yeah. I absolutely complained to this one and that one and then I start getting calls right, and so you only have 35 units here. This is a 35 unit development and if it was not for the good tenants that live here, because we take care of ourselves right no and we take care of each other, and I advocate for everything for them and then some people, the outside yeah. Well thanks for watching hard work. Even if management is not, you know living up to their past. Sorry and you guys were never informed why the scaffolding was erected and you're, not aware of any work being done on the outside of the building. Exactly and it's been there, it's going to. Oh it's going to be it's already like a year. It's going to be half of it. There, okay came to the building and they were putting. They were put some ladder like to go from the roof down with the ropes, and this was like at two o'clock in the afternoon. I took a picture that was on August 26th and the management says that they did not know anything about that. No super did not know. Nobody knew anything these people just coming in here I do not know. Is it because of the building? Next door? Is it going to make they're using it to make it easier for them to work over there? I do not have the fetus idea, something is not going right and there might be something illegal going on right. If naisha is not aware- and neither is the man if there is work next door, they have to extend the scaffolding, I think at least 10 feet in front of your building to protect it. It's very annoying, but that's it. What I do not understand, but they have not. They did not communicate with us at all. That's what I do not understand. It should be simple, so we should hear from so many other buildings. Is that there's a there's a lot in each site? Almost okay? Maybe you know one time the scout. They had a bunch of the pipes there, and this was in the winter time in the evening like in November or something like that, and they had these pipes down. We almost tripped over them. I do not know if they fell and they were in front of the building. I know that the fire department came after or whatever, and I think they might have gotten a fine and then they stopped working trying to come in the building and it was night time after 6:30., okay just to get some of the other leaders also okay, so I have no more to say thank you for listening to me. Thank you so much and I want to kind of return to the bigger issues after we hear from everyone and discuss exactly maybe be helpful. Okay. Thank you. Carmen Melissa make a comment about scout flink because Jack's building, which is at 74 west 94. He could not be here this evening, which also shares the same space as God at Riverside. This scaffolding, outside of that building as well, okay and he's having a lot of problems with the elevators. Both elevators are always out and he's saying that you know there's people who are disabled. You have elderly that are waiting in the lobby to get upstairs and he's consistently wrote letters to NYCHA and sometimes the elevator has been out for days and whoever comes to repair the elevator the next day. It's broken again, so if we could do something to address, that would be great because it's very important, no one should have to wait in the lobby for hours to get upstairs. I think it's like 22 floors in that building and he's telling me that the elderly in the handicapped can't go outside. You know, because if they do, they can't get back upstairs. So if we could, you know do something that would be great and there are problems with elevators at all of the buildings. To be honest with you, but I know he's saying he has a severe problem with what what's the address of Jack's building 74 West 92nd street. I just put it in the chat box. Oh thank you. Thank you. Okay, good yeah, but all of the buildings. You know 120 west nine, Ford, the wholesales, 201 west, nine three. They all have problems with elevator breakdown. We really need to get on the elevator division of NYCHA to get people in this area on Standby, because the elevators are old and they're breaking down constantly yeah. How long does it take polly from the time that an elevator breaks to the time that it eventually gets fixed? Sometimes it can take days? Okay, I would say the quickest turnaround has been like six hours. Okay, when a call is made the ticket goes in, especially on the weekend. Emergency services would have to come out. You know but say Monday through Friday at least six hours. For someone to show up do we have a list running anywhere? I guess I'm looking at Larry now a list running of elevator averages and and their frequency that well, I know Jack has kept a list and we can you know we document, so we can get whatever we have and send it to you. There is a paper trail, because these are high- rise. Buildings elevators going out is not just an inconvenience, you know yeah exactly it's a safety issue, it's dangerous for senior citizens. Yeah holly. Can I oh sorry, but ramona we've gone back and forth a lot on elevators in your building. So polly just said that they're all the buildings are still going out, that in your building is it because of leaks from the rooftop or why do you think your elevators are going out like elevator? A, for example, has been going out every week, all right, I hear them banging on the roof downloading patching up there. Whatever I live near the roof, my bathroom is full of molds, so I do not know- and I believe that those parts, if they're going to keep it running, they need to invest in those parts, the waterproof parts for the elevator yeah maddening. It does not make the point that so many residents have lived in NYCHA properties a long time like a lot of housing, the upper west side, some of them have naturally occurring retirement communities. So a lot of seniors in this housing and there's children and grandchildren living there as well. But there are a lot of those elevators being out, is very critical. Yeah. Definitely that's right. The thing that's bad is that you call them and put the ticket into the 60 elevator. A couple of guys will come a couple of hours later. You'll get a call from the order made it from the 707 numbers. Oh, this is to inform you that your elevator service has been restored and it's the furthest thing from the truth. They're not restored. I know for a fact I'm in a wheelchair right now, because I've had some health issues and I could tell you that people literally wait hours before they can get upstairs. It's a joke what's happening and then, when you go to tonight they say: oh, you got ta talk to Prc. Why would we have to talk to Prc? They have not taken over anything. Yet it's a total joke. What's going on in that office, and you know people are just you know, there's no confidence, it's not even skepticism anymore. It's just plain frustration and you know, like I said before, thankfully, for you guys that at least you guys listen to us, you guys help us you advocate for us and truly I do not know where we'd be without you guys. You know, but it's a shame. You know Paulie Cynthia, you know these. Ladies. They go above and beyond what they're supposed to do. I know a perfect, I'm a Ta, I know what's going on, but I'd be lost without them. I lost. I love getting my input from them, because these ladies and knowledgeable know what's going on, but let me tell you something: we need somebody that is dialed in to when they talk to the office and talk to the people in charge. They move their butts and get things together, but I know for a fact: in my apartment I was attacked by a swarm of gnats and flies from that dirty water coming from another apartment and that should not take a month. Could that take a month. I do not care what anybody says. You got ta prioritize their system and when they move the 201, I wish them luck, but what they're doing to the community room over there just outright took away their community room is I believe that the younger folks can speak up for themselves and do what they got to do, but I'm really worried about the elderly. That's what I got to say. I'm really appreciative that our elected and representatives are here tonight, so we can all kind of think through this together and I'll, be working with the same information and try to discriminate. I voted today. I voted just for you I'm going tomorrow, but just for you we got ta, go, we got ta, go you got ta, tell everybody! You got ta vote. I have a question for everybody. Can you call 3- 1- 1, I'm sorry for my ignorance, but I am learning and trying to catch up fast. Can you call 3- 1- 1 for various things that you always have to go through nature and the ticket system must go through NYCHA and the ticket system? After that, you do have an option to report it with three one. However, three one automatically refers you back to 1912, that's right! Thank you. I was afraid of that. Okay, yeah 100, okay, Robert yeah hi. This is hi helen. How are you doing, and I wonder if you can give us an update or some insight into these earmarked millions that are in HPD for NYCHA, and I do not recall quite what the number was one of our, but it was upwards of 14 million dollars and I'm not going to dare say it was 90, but it was a substantial amount that is earmarked for NYCHA. No one has disputed that the money is there. The only issue is, how do we get it? You're saying it's in HPD, yeah polly. Can you spot me on that did? Do I remember that correctly there was money. There was Helen he's speaking to the money that collegiate allocated for affordable, wow right yeah, so you want something from the store: 14 million dollars left yeah right. Yes, okay, that was earmarked for Nitro. I understood no right. I do not know that it was earmarked for NYCHA. I thought it was earmarked for new, affordable housing, but Helen that's correct and it's 14 million. That's left. It was 50 million to begin with, it's 14 million left. It was not. It was never for NYCHA. It was always for a new, affordable housing in the community and okay. That was part of the restrictive deck when Riverside center went online and some of that money has gone right, five or six buildings so far. Yeah I mean I think, ernesto to your point about voting that we do not know about yeah. I mean at this juncture. You know it's over it's nearly it's there's NYCHA is screwing the federal government. You know yes, basically held back all this money that should be gone and a new administration would change. All of that I mean the problem with the federal aid, of course, is that you're, the stepchildren of NYCHA, because you were initially state funded in this state, then withdrew all their money and it's crazy that NYCHA treats the federal aid. That way my building is not state, it's crazy that they can get away with it. Helen, that's to Robert's point. I think there was 30 million in the state budget that has never been that was allocated. I do not remember when I have to go back to look at my notes, I'm back to New York City yeah. I mean it's definitely worth advocating for that. The thing about the state money is that it's usually you know it's very specific about what it can be spent on the governor really ties. I mean Erica's here from Linda Rosenthal's office. She can probably answer it better, but the experience that we've had is that it's always been tied to something frankly, not helpful to the buildings. It's been tied to like gardening and stuff like that. But Erica is the expert on this. I do not know. I am not. One is housekeeping. Whoever is if you're, not speaking, please mute yourself and then unmute when it's your turn to speak because there's a lot of you know it interferes with everybody else's ability to hear. So. Thank you for that. The other is there's a lot of talk in the chat about elected offices and running for office and and criticism of elected officials and so forth. The purpose of tonight's meeting is to try to get at issues that are confronting our neighbors who live in public housing, and the chair of the meeting at the top of the meeting reminded us that it's important that we speak to each other and to all of those here with respect, and I we really need to insist upon that, and that includes the chat as well as what we're saying live on the air. So please forgive my interruption, but I wanted a reminder on that, because we are all neighbors here. We are all confronting issues. I think a lot of us are having our hearts break about hearing about the conditions that we're hearing. Let's focus on that, and let's make sure that is the outcome that we end up with in this meeting. Thank you sorry, Roberta hold on. Let me just drive that point home, whoever continues being inappropriate or hostile in the chat. I have no problem removing from the meeting, especially if we warn you please be respectful. This is an extremely important issue. I know you have your own axe to grind, but this is not the place for it. Thank you. Sorry. Roberta. Do you have something you want to add? No, I'm glad you said that. Thank you. Okay, thanks, sorry Erica you were giving a quick response on some of the state money allocated yeah. I was in the middle of the thought. I do not know exactly to the council members Point, I'm not sure exactly what was tied to what I know for capital funding. There is a new boiler that is slated for Amsterdam houses. I believe shortly for capital, as well as the assembly member had capital funding that was given that I think amounted to. I want to say about 150 million dollars where every we sat down with the Amsterdam houses, tenants and the harborview tenants and went through all of their all of the things that needed to be done, and so there were new doors, replaced new lighting, I'm sorry new Lighting and harbor view. There were more security cameras that they had asked for and the like. So I can get more. I can get more information on the other part. I just know that our capital funding has sailed through and I'm sure, there's a lot of other outstanding funding in general, but I just do not have that information right now. I can get it to you mark and Melissa yeah. Thank you. Erica sorry did not mean to put you too much on the spot. No, it's fine, okay and then polly. I think you had something you wanted to add in yeah yeah. What I wanted to backtrack on is the money regarding collegiate, because as a member of the Housing committee and a coach here at the time with Nick, I remember that one of the recommendations that we made was that money would be utilized okay, either at Amsterdam houses in lieu of the apartment units that would have been lost. Okay, and so my whole concern is that I have never seen the documentation as to how that process led to money being allocated to West 108Th Street through Wishfish, and we are federally funded entities as well, and I know that some of that money went to a building on 94th street independent houses under the Mitchell Llama Program, which is a federally funded program. So I did not understand why some of that money could not be allocated, as I said, to Amsterdam houses and the other complexes on the upper West side, because we're all federally funded okay, so the 14 million dollars that is left all right. I would like to see that money go towards the complexity on the upper West side, because we do need it. Okay, and I would like to see the paperwork on what happened to the money, because, as a board member, I've never seen it and other board members have asked also how that money was spent and allocated yeah polly. I do not. I do not know the answer to that. This is before my time, and I think we had promised in a previous meeting to like address this as a specific agenda topic and I'm happy to okay. Roberta, and I know you probably have a lot of background, and I just I do not want to get into it too much here, like I agree with you I just want to. I just want to put that on. We need to look at the restrictive deck, okay, yeah, let's put that on our future yeah. I just want that on the record. Thank you thanks paulie. I do not know that we got to all of our tenant leaders in attendance. Sylvia you're here, along with who are you here with, I can't remember, I think margarita from Amsterdam houses could not join with the video, but I think she's here with me. I she's from the north side, Silvia Rivera, Le, Prince, okay, no we're talking about margarita curette from no. I did ask that Mark. I asked who's what you came with Mona Lisa, so, okay carmen sorry, I had asked you to speak before. Do you want to speak now sure, good evening? Everybody? I hope everybody's having a beautiful time. I just wanted to tell you a little bit of what we're doing. I have an organization, that's called occupy NYCHA. There is just so much going on in these developments that I've gotten together with like 10 different presidents, and we put this letter together for Mr Gregory Russ, the chairman and CEO of New York City Housing. I just wanted to tell you what we're thinking and maybe you can elaborate or whatever, and it says dear Mr Russ Occupy NYCHA is composed of 10 community resident councils. Our organization has been meeting for the last several months to discuss the options for these developments for their collective future. On a combined basis, we represent approximately 20,000 units of public housing and about 28 million 28 million yeah residents. Most of these individuals are committed to the life and welfare of our communities, the place where we live and want to thrive. Over the decades the New York City Housing Authority has attempted to provide us with a basic standard of housing. Many issues have prevented NYCHA from providing even a minimum standard of living for our families. The com, the combination of burgers and bureaucracy, competing priorities and the sheer scope of maintenance and upkeep, along with the resulting violations and essential deficiencies, continue to manifest in our housing developments. The city and NYCHA are right to want to redefine public housing in New York City. This process, however, must include the residents of those developments and what they want out of this process as the residents leadership of our public housing developments. Our primary concern is to our fellow residents, however, if public housing is to survive as a form of affordable housing and become operationally and financially viable public housing needs to incorporate and of on a fundamental basis, guidance and direction from the residents themselves. For far too long, the residents of public housing in New York City have been ignored and treated as second- class citizens. Indeed, it appears that individuals and families who are part of the homeless shelter programs seem to live under better circumstance, circumstances throughout the city. While it is the goal of some of the residents to leave the projects, not all residents want to go. Many res residents want to stay within their neighborhood, even if their circumstances and status of our family structure changes. The design of public housing should be not as low income, but rather affordable housing for the public, whether people decide to stay or move away, should be a choice that they have as a function of their advancement of careers and not because they automatically they automatically. This is disqualifies based upon their income level. We intend to evaluate it. We think our developments too one make better use of existing space, two to reconsider unit alignment and configuration three to redevelop resize our unit as appropriate for our resident profiles to better reflect their needs and a minimum standard of quality and consider opportunities to offer ownership interest. At these sites. Nycha has invested hundreds and thousands of dollars impersonal to contend with issues such as quality compliance and daily operation. This management structure have not been effective. What is significant is that the residents getting together and investing in their development, the concept of cooperative apartments owned by the residents fits into the mindset of many of our residents. It will contribute to both the operational financial stability of the development. It is also our intention to develop small town center, where appropriate, within the free space of our developments, to provide additional and diverse revenue in some support of daily operations of the development. The upshot of this is to establish the following: a the stability of the development financially operationally b, provide a stable environment for the existing population, Nc enabled the resident population access to ownership opportunities which significantly contribute to the operational financial stability of the development. And, to accomplish this, we are bringing an operational financial cons. We are bringing operational and financial consultant engineering and architect firms, along with a legal firm with expertise in public housing developments to assist us in the following manner: one: the creation of a formal com, a corporate structure to effectively manage borrow, develop individual projects as appropriate and as needed, two established of a formal maintenance structure which will provide us with appropriate prior visitation relative to issues as pertinent to the management of a day- to- day operation of the building structure. Three add on to the nitrous planning document to determine the best type of redevelopment process and select the type of developer necessary to fully and appropriately love the properties which, in turn, would enable a level of social efficiency and Minimize substantia substantiation associated with public house through the assistant of NYCHA and relic related city, state and federal agencies, secure the appropriate capital necessary to redevelop the individual projects. We believe that, on a three count county basis, Manhattan Bronx, Queens economics of scales associated with the combination of all three projects, will enable us to achieve some savings. Despite the distance between the various projects. As our final thought, we recognize the political nature of this process. It has become extraordinary clear to us that, as it is the case with many other elements of society, we must take action on our own and determine our fates instead of waiting for the good liberal establishment to take notice of our situation and engage in meaningful action. As such, please cease any activities, actions that you might be undertaking to place our developments in public trust and outsourcing our development for growth to an outside developer. To do so otherwise will result in us taking legal action against any such activity. Indeed, we would like to meet with you to explain our position on a more grandeur level. To that end, we will call you to arrange for such a meeting. In the meantime, please do not hesitate to contact me with any questions. You're sincerely carmen quinones CEO of Occupy NYCHA, and I am extending this to all developments if they want to join, they should because enough is enough, they won't do anything for us. We have to take control of our own destiny and our own homes. Thank you carmen. Could you share that with us and our committee? I will be actually sending this to all elected officials. This one is for gregory Russ. I wrote one for all elected officials and we will be putting everyone unnoticed. Okay, thank you. Thank you. You're welcome, okay and so carmen. That was really helpful. Is there anything additional? You want to say just about urgent conditions. I mean get a lot better. The only thing I can tell you is that you know we have some beautiful people that are Ta presidents, that sacrifice their life, their livelihood and also take away from their families, and they take care of the people in their development and they're not being respected. There's scaffolding everywhere I have scaffolding everywhere. It looks like spaghetti, it looks like we're locked up. Okay, and enough is enough. All I can say is this is that we need to take control of our own development and we can, in the 964 wreck, says we are allowed to have ownership. We need to look for those plans we need to ex. We need to do what we have to do for each other. I have 10 different presidents that are on this program that want to do it. That's fine, I'm looking for more, I'm looking for more presidents, because we need to do this. We need to stop them from doing pack and rad. We need to stop them from coming in here and doing what they think they can do. Okay, and the only way you can do that is by fighting right. So I do not, you know, listen, nothing be safe, then a try right. So I have to try everything that I can because my residents deserve the best, and I know that every president on here feels the same way they fight every day and are being disrespected every step of the way. The stuff that I've heard tonight is disgusting. You got ta go around rats, you do not have an office, I mean all that is to hold you down and elected officials know that the that they have monies that I still have not been allocated. Why are not we fighting for these things? You know I'm not here to go against anybody, not anybody, but I am here for my resident, and I know that every president on this call feels the same way. Most of these presidents are getting sick. Most of them have forget about it. You know I mean come on just alone, since March that I have been giving out food, I caught a hernia from picking up boxes. Man, really I'm getting ready to you know to see if I can get operated on. This is not right. This is not fair, it's not right. Everybody's getting sick and people are laughing and making jokes and being disrespectful even on CB7. You guys do not belong here. Doing stuff, like that, that's horrible people are really suffering, and I really thank you guys for you know for staying on and really listening, because I know that some of you really do care and I really appreciate you guys mark. I appreciate you. Melissa man, listen y', all rock, but you know what we got Ta. We got ta stop this. We got ta, stop hitting each other over the head like this, because our society is upside down. We need to start thinking about our children and our grandchildren how we we're conducting ourselves really. That's all. I really got to say any president that wants to get on board with occupy NYCHA we're going to have our own. Believe me, our own lawyers and everything please get in contact with me. Thanks for your advocacy, and I mean that to all the tenant leaders on this call- and it was not on this call. Obviously sorry roberta, you have your hand raised. Did you have something you needed to add? No, my hand was raised. Okay. Is there anyone I missed? Who sorry louisa? Were you no? Okay? Okay, I do not see anyone who has not gotten a chance to give us the overview. Sorry Lourdes Camacho from Amsterdam houses is in the attendees. Oh, is she speaking for Amsterdam or hi Lord, as I just promoted you do you want to speak on behalf of Amsterdam? I do not mean to put you on the spot if you're just attending hey, lordless, it's Larry. Why do not you talk about all the scaffolding in the work that actually is going on down here? I know Margarita wanted to join us, but she's trying to join by phone. I do not know if she's been able to connect yeah. She must not just it kind of say something about Amsterdam houses, because the assembly member just wrote a letter yesterday for a tenant who, just like give a picture view of rehab issues that we face when we are calling NYCHA and advocating for tenants here they had a leak two years ago that was never addressed. They called NYCHA. Put in many tickets they were completely shut, nobody did any work on it and then all of a sudden, the leak still persists. Years later, the entire wall has crumbled, they two tenants go to NYCHA and NYCHA still does not fix the wall, even though there is a gaping hole inside of it. So the man sleeps on the floor in the living room because he does not have access to his bedroom. They call us in September, we get the wall fixed, we are getting their cabinets fixed, but it should not take. People should not take people in NYCHA to call anybody to get anything, listened to be heard or to get basic repairs done, and so now we're fighting to get rental reviewers back for them, because they have lived in they've lived in an inhabitable apartment for almost two years. He caught Covid-19 in March and slept on the floor and also has probably been exposed to black mold for, however long and long after, and so just just, we do a lot of work in Amsterdam and at harborview and so and in the addition, and that's just a little picture of what just recently happened. But for years it has been that way and we have gotten money but, and we have written endless letters to gregory, Russ and Brezzanov and the chairs before, especially when there had been lead poisoning that was kind of just skipped under the rug there but yeah. I just wanted to bring up the Amsterdam part since margarita could not be on and just so global view of what was happening at Amsterdam. And yes, it is it's rodents and it's scaffolding, but it's also people are living in squalid conditions and because there is not enough because the federal funding is not there as well stay in cities. I did speak to Margarita the other day and she kind of relayed a bigger report. There have been bad conditions down there, but there is actually a lot of money being poured into Amsterdam houses and a lot of work underway. Other groups are almost all like there's a lot of work, there's good work happening. It's just that I was just a microcosm, sorry Larry, of what no, but she was also making a point that some of the tenants are afraid to provide access right now because of the Covid-19 and do not want a lot of people in their unit, particularly some of the seniors, but the place is covered in scaffolding because of all the asbestos removal and it's being done very comprehensively and across the whole place. She said the number one issue, though, also because of all the scaffolding and the shadows and the lack of lighting is crime and safety is a big issue there. Right now, western beef will no longer do deliveries into the complex. She said she had to buy a smaller shopping cart because the big shopping cart. It was too much for her to push back to her home because she's got a heart condition, so here's a little shopping cart and has to make two deliveries to get her supplies in from western beef. So she said crime and safety is the big issue from her point of view right now, and that means working with the 20th and working with PSA and doing vertical controls and doing whatever it takes to make that development a secure place. Larry. Just to ask about that, I mean I walk by Amsterdam houses a lot. There is some lighting. You know your. The city is required by law. Anyone putting up scaffolding must put up lighting, but if it's not adequate, that should be low- hanging fruit that we can go after yeah. I was. I was through the buildings myself as part of encouraging people to reply to the census, so I was in every single lobby and in and out of every entrance way to hang up signs. Well, do you mean that, and inside or under the scaffolding, if you're sliding in between the buildings, as you go from place to place, it's just hard, it's you have to do it safely. So you need scaffolding. You need all the drapery to keep asbestos and dust from blowing around. So it's just a very difficult situation. It's very dark. It's very dark there. Okay, thank you. Thank you, larry for something this margarita could not join us. Okay, I I'd like to sort of pivot a bit to talk about. You know how the community would potentially be helpful. A lot of these issues obviously need Nycha's attention. Many it sounds like have the attention of our elected officials, and I want to think both on the micro kind of repair level skill, but also the more macro scale of like of solutions that we could put in place to maybe elevate issues more quickly. At a past housing committee meeting, we discussed maybe some kind of working group for the NYCHA developments in our neighborhood that could include a representative from elected officials and from NYCHA to sort of just get everyone to the table. It sounds like Larry, you guys already have some great infrastructure in place with how you guys run the federal eight. So just to you know, idea to kick us off would be you know. Is there a way to sort of attach onto that existing infrastructure and bring in more representatives, but also, I guess a fundamental issue to talk through with the committee is: how do we get nature to the table which seems like such a such a roadblock to have them actively and helpfully participate in conversations? I do not know if any committee members Wanna sorry Robert, I see you waving your hand madly if you Wanna weigh in on that. Yes, so well, I was chair Louisa and I think you were involved. We had meetings with boards, 9 board, 11 board, 12 boards, six aboard eight for six and board three and I think board four and we had three or four meetings at different locations and we tried to have a meeting with Greg Ross through Gail's office. It never happened. We felt that if we had, you know we had eight boards. At that point, we felt that if we had that many boards, we could actually make a difference with niger. Unfortunately, it fell through the cracks and we never got the meeting, but I think and each of the each of the boards there are only one or two boards that do not have a lot of NYCHA housing, but each of the boards was really interested all of the housing committees and some had NYCHA committees. Some just had housing committees, and I think we should go back to that model and I think we need to really put a lot of pressure both on the local electeds, the state electeds, and we had many meetings. Jerry Nadler has been very helpful. We had many meetings with jerry, we've had meetings with some of the local elected, certainly with Helen and Mark and Corey Johnson, and I think now is the time to really put the pressure on thanks. Herbert hello. Can anybody hear me this is Mary from Sandra Thomas anybody hear me yeah. We can hear you. Yes, we can hi. This is my sixth call. I've been listening, but I have been unable to speak. So I'll make it quick, because I'm waiting on cable tomorrow to fix the internet and the phone, I heard people talk about the elevators Neil Meyers. I do not have his gmail in front of me, but he is the head of this elevator problem here I can email tomorrow. I can't use the internet, but Neil Myers is the person to contact for elevators and regarding Sandra Thomas here we're a senior building and was built in 1994. One of the biggest problems that I find is that some repairs require contract work and once it goes into contracting, you can wind up with a year later before, there's any response. We have a situation here now where a worker broke the mailbox trying to get the cylinder out. The woman for two weeks now is waiting for a contractor to come fix repair the box, because this is not housing work. So that's a big problem, so that's a big problem once they take it out of the their housing computers, it goes into oblivion and it becomes contract, work and all repairs. They tell you, oh if it's not a cobit emergency, they won't come and they won't even give you dates for repairs or individual apartments unless it's an emergency like a toilet or a stove, and we are a separate contract here in Sandra Thomas we're senior building. We have tenants here, who've had stoves for 26 years and they come and they put parts in and they even have the nerve. When Conn Edison puts a red tag on it to come and try and fix it, which they're not supposed to do, and then they want to bring an old stove in you know. So that's some situations here, but I can email Larry in the morning and give him Neil Myers email. Can you still hear me yeah? We can hear you okay, yeah great, I'm so glad you raised both issues. Yeah, it's my numbing leaf infuriating, I'm looking around, not sure. Maybe polly was in this meeting in and Cynthia hi, one Sec. If polly, maybe you were in this meeting where we were down at the central office for NYCHA sitting on the table talking about their systems for elevators, and I think it was a two- hour meeting and can you put yourself on here- yeah sorry Ernesto, I'm going to have to keep muting the background, but we spoke for two hours and louisa, especially for you, because I can hear you really learning and listening. You know about the NYCHA stuff it after two hours. I think I was more confused than when the meeting started. It just went around and round in circles. You know they say that the operation manual or the rules for NYCHA require that certain things happen and then I'll say, and you know, and nothing it does not mean they'll do it does not mean they'll fix it. I mean the issue with the elevators at Ramona's. Building with the roof leaking, all the time was insane and what we figured out was that if you put a waterproof box around a certain electric fixture, if you just had an electric box around, it would no longer break whenever it rained. So we suggested they do that in lieu of spending, if I have it right and ramona. If you remember this, it was something like over twelve hundred dollars for the electric plate that they had to fix every single time they had to replace it every single time it rained, because every single time it got wet and shorted out. I mean it's nonsensical over there, just nonsensical right. So one of the things if I can speak on that too, is that you know communication is key. Okay, I think we need to have better systems in place. You know when you had your town, Hall Helen. I feel that we had a better response in the short term to be honest with you yeah, because it basically focused on issues that were happening immediately. That could be addressed. Okay, as in regard to the covis situation, you know we had someone there for quality assurance yeah and when issues were raised about, you know the personnel who were hired to wipe the buildings down. You know that was taken care of, so I just feel that it's better to work in a focus group, because when you have too many voices too many boards and too many people you're not going to get anything accomplished. I do feel that a town hall or smaller focused group, depending on the area, but right now we're talking about upper West side in this area. You know, I feel that the town Hall model is more effective and then as a board. Okay, you have all the resident leaders here. You have an idea of the issues that need to be addressed. You mentioned the elevators, that's something short- term that can be addressed, but we really need to have communication mechanisms in place. There's no accountability! That's the problem! Yeah, okay, yeah! There's no paper trail of setting up that town hall again and we told them that we were going to do it again, especially if these you know types of problems arose over and over again, so we're in the process of getting a date with him. Yeah. Okay! Well, that's good! That's a start! So I'm just saying as the board. What can we do? I just feel that again having good dialogue right now, you know, communication is key. You know maybe write a letter to local management. You know asking okay. This is this. Is the problem with the elevators? Okay? What's happening? Are you short on staff personnel? We do not even know how many staff members are available. Okay, to fix this situation in our area we used to have somebody on Standby a unit, a person, a division on Standby for this area, because geographically we're spread out over 20 to 30 block circumference area. Okay, one person can't handle if all the elevators are breaking down at one time all right, so we do need something set up to find out. How many times are the elevators breaking down? As you mentioned earlier mark, okay, we need to have information, so we know how to address this problem and come up with a solution. I mean the one thing I'll say because I talk with my colleagues quite a few of my colleagues across the city, every NYCHA building that I hear my colleagues talking about the same thing. Many NYCHA buildings are suffering even more since Covid-19, and you know part of the problem is that there's a hiring freeze on so anyone who leaves the position's not filled. So if you have maintenance workers who leave, who used to cover a certain building, they're not being replaced if they leave and yeah so you know and the budget constraint as now a number of people have mentioned, you know, is in the tens of billions of dollars, and you know the chair of the committee on housing is eliquid empress. Samuel is working so hard to get them to be more cost efficient, more efficient just in terms of their management, but this is city wide. Just you know to give it some perspective Cynthia, I saw you waving your hand wildly for a while. So let's talk about the small contractors, first of all small contractors, whether they be roofers carpenters, all come through mixed finance. Only knows this up in Manhattan for wise and for Amsterdam. That's acting director, Carl Walton blocks all funds or all contracts from being completed. Now going to gregory Russ is not going to solve this problem. All gregory Russ likes to do is talk about himself and his many accomplishes in Massachusetts. That's not helping us here in New York. If you want to see bring or bring someone to the table, you need to bring Vito Tolino to the table. Tell him girl, Brian in from NYCHA yeah done. You have to know exactly who to talk to gregory is an empty he's, just a face that likes to look at himself. You go girl and as far as contracting go, if you can get this man at least the money, then it's going to go to the same contractors. Deals with that do shoddy work that do not complete, so they can come back again as long as the contract is under 5,000 NYCHA bids out to their friends, these little mini contracts and they do half the work they say is complete something breaks again. Nature gets to re- bid with them again and that's why we keep winding up with the same crappy work because it stops at mix finance acting director, Carl Walton. When it comes to the wise consolidation, we have had six managers and six different superintendents in the span of two years. Every time they come here, they come with an agenda on how they're going to better our buildings without asking us our input. Lack of application again continues to happen in the wise developments. The only building that seems to be getting more care than the rest of us is. The senior building senior buildings always get preferential treatment over the rest of the buildings, but the rest of us have just as many seniors occupying apartments as the senior building has so you should pass. Management is not going to communicate with you. Mr Walton is not going to communicate with. You have to play leapfrog and go over that man's head or we're never going to see any change in these developments. Absolutely right, not the right man for the job. He's not excuse me. I just want to say something and at one time when well, when I lived under on Wasura before I came to the dome site development here, we were able to participate with choosing the right contractors to come in and do work at the developments and like she said they do not speak to us about anything. I mean right, and that goes to show you now, the new businesses everybody's, putting up scaffolding and that's some money, that's going somewhere where no work is being done, and we know that. There's no specific, I think, deadline on how long you're supposed to have scaffolding in front of a building. It's enough, all these homelessness that we have and the business is closing in our community. You know that we have to keep dealing with the same thing. You know we're trying to have quality of life on the inside and then on the outside. It's getting all rotten as well right, well, they're, making a lot of money Thomas. Here we have scaffolding here for almost two years, not one bit of work has been done. The whole backyard is all fenced off can not be used, and I called this cynthia said this veto marcelino. I called him personally. He could do nothing, he could. He was very flipped. I told him this scaffolding has been up here almost two years and nothing not one bit of work has been done and he was of no help with trump. I got ta say that Vito masterchellas is a very good person, always hands on always hands- on he's better than the CEO himself, and if you all need me to reach out so he can reach out to him. I would love Mark. I will tell him to reach out to you, but he me Vito does I mean he's hands on and he's always willing to talk with residents? That's one thing: I really tell you. I agree hundred percent two years here with the staff all the time I was talking to me for a second. I just want to respond to say carmen, please. Whatever you share, please also share with Melissa and Louisa they'll be the first lines of contact too. Okay, no problem, you got it Babe. Thank you. Listen can I say something I my basketball court, that wise towers got six a couple of years ago when the job supposedly costed, 150,000, okay, the job they did- was so scotty and so terrible that supposedly they did not pay the contract just 150,000. So I asked management well, why do not you put that 150,000 to getting a credible contractor to do this work that 150,000 disappeared? We never saw it again and nobody wanted to give me any answers. So you know this is a crazy problem. I do not know what the answers can be. I listened to carmen. I listened to Cynthia. I know I know these women, no colleagues, these women know what they're talking about, but still things go down that do not. It do not make no sense, because I used to work in the department of deeds where they do all the bidding for the New York court buildings and all the buildings. I worked there for many years and I know that if you low bid you're going to get that bit and Cynthia's right if they want to give the bridge to their friends or their buddies or whatever it is they're going to let them put in a low bid and they're going to get that job and they're not going to do the right thing by the development. So that needs to be stopped. It needs to be stopped and on top of it, they never have the correct people overseeing these people to do the work where at one time they would hire people within the developments. Also, like community service aides, to oversee these work, this job being done. I know because I was a community- oh no you're, basically nicer. It happened over here, you're right, you know when we had work done that Cynthia and I worked together, hand- in- hand, and it's not happening like that anymore long gone longer, but you are right hundred percent. The worst thing they did was take the a- rock committee out because the Arak committee, when we had the Arak committee, we were able to sit and talk to the people that were coming in our development, so that we know who was coming in our developments right now, they're putting anyone and everyone in these apartments. The biggest problem I'm having now and everybody needs a place to live- do not get me wrong, but I have nothing but young people that are in these apartments, some of them. We do not know why they're there or how they got there, but these are the people that leave garbage and all this stuff on in the hallways, I mean I'm always on it, but that's beside the point. The point is that NYCHA is placing people in here without our knowledge and if they we are federal officers. Every president, that's on this call is a federal officer and we have the right to know what's coming in our development, and that is not being done and that's why I keep saying we need to start. We need to stop the complaining and we need to get together and get into it. Yeah hell, yeah thanks a few of my colleagues have their hands up roberta. I do not know if you still have your hand up or again have your hand up and then same to paulie and Jim that okay Jeanette do you want to we even heard from or paulie sorry I see you're on meeting now. No, I think I had my hand up from before, so I did not put my hand down thanks. Jeanette. Do you want to say anything around my hand up right before polly started speaking last time and she actually covered a lot of the comments I was going to say I mean I wanted to understand like who is NYCHA supposed to be accountable to like who, because I think account, the lack of accountability is obviously why we can't make any progress. We know there's problems with funding. We know there's problems with the structure, the organizational structure and the processes and communication, but it just seems over the years that I've been on this housing committee. We can't make any progress because there's no accountability and I'm I've never understood exactly like who is NYCHA supposed to be accountable to you know if it's not the mayor, you know who they're supposed to be accountable to Hud, because this is where you know where it all began. You know, because it is federally funded. You know and they're not following through. We need people to from Hut also to participate with all the issues that were brought there from repairs to infestation the elevator everything even part of ownership like what carmen was talking about. You know, or you know at one time when these resident buildings were not getting fixed through HPD, the tenants were taking over their buildings, and this is what's going on in nature and now HPD is participating also with NYCHA. So you know who's going to be liable. Like you said who's going to help us get there, is it going to be HPD helping us to get there, because, if they're not doing what they need to do as our landlords? And here we are spending our money, fixing our apartments, our floors, Refrigerators stoves, you name it. You know that we have to get somebody to come in here because they're not coming in you know even before the Covid-19. You know what's going to happen, how are we going to get money back? You know as well, or you know, let us own our place, then affordably. My thought was that maybe with hopefully you know new administration coming in at the federal level. This year we could put together. Like some basic I mean, I think, some basic sort of principles for having direct communication so that we could start the conversation to address some of these issues. Yes well said demonstration, Project, Sorry Jeanette, do you mean communication between who and who I mean if Hud is who's ultimately responsible, then say for instance, who is it sean Donovan when he was like the Hud person? Did we have better communication, then? Could we establish some sort of a month monthly meeting to start to develop a structure that trickles down, so we have communication at the local level between the development and the issues that are happening on that site? You know at the community level like let's start building on what the new structure will be. Hopefully come January yeah Yay, I was just wondering, does New York City have any input into nature, or do we just kind of skip the city completely near? Has input into NYCHA? Is the boss? The man is the one that's controlling the journey of everything. Actually, the mayor is the one that's controlling the things of everything and as far as these people for their positions as far as getting the electeds involved, you know it's weird, because we are facing term limits and most of our electives are going to be gone. It's going to be really kind of hard. All I can say is that we need to get together and stop complaining and do our own thing girl, guys we got to. We got them. Excuse me, this is why the federal aid started existing, and this is what we're doing, and this is why more people there is no more federal eight. We got more than eight people involved. Eight. You know resident leaders and what have you because we are, and we do not sit anymore with the Manhattan south good with housing. You know, because we were on that board. You know, polly would tell you and because of us we stopped that because nothing was happening there. Everything in- House was not going on that resident engagement engaged to what for them to fulfill what they need to fill in their department. So they can keep those positions going on with funding money. That goes there that we need to, you know, be able to take over and control. Well, you know, as you, as you know, I uncovered a lot of that stuff and that's how I got rid of Mrs Missy Mrs Isaac's, because that was horrible. When I was on that blog a long time ago before you know I'd like to start guiding us towards, you know pulling out the common threads we've heard from everyone, and thinking through I mean not that we're going to solve anything right this moment, but like some concrete next sketch that can come out of this meeting, you know a lot of what I'm hearing is that we're not having the right people at the table that we need to keep a hyper local focus which seem like good next steps and that we need some kind of way to communicate some kind of set structure that we can work within some of the other pieces about accountability? I you know I do not. I can't pretend we have the answer to that, but I feel like the communication piece. Maybe the board and our electeds can be helpful with and we can keep it very focused on the upper West side. Sorry- and I do not want to speak over my colleagues doug, you have your hand up. This is something you wanted to add. That's more in this kind of lane of solution- oriented thinking. This is a long- term question and perhaps but the question I know I realize that we have an issue with 3- 1- 1 does not work for NYCHA right and my understanding that we have a real black hole in and void in the data, and I guess the question on a legislative level, and perhaps now we can answer this or Erica or remember what can we do to make sure that the NYCHA is included in? What can we do because I think the transparency, accountability and communication correct me if I'm wrong, but I believe a bill. I get you from our legislative team. There is a bill and I think it was introduced. I want to say a year ago, maybe a little bit longer where they would and NYCHA residents would be enfolded in the 311 process. So that's not separate because it's literally NYCHA policing itself and inspecting itself. Of course you do not find anything wrong, and so I have to look that up. I, oh now I'm annoyed because I'm it's on the tip of my tongue, of who this Senate person was but I'll get that for you guys and I'll. Look it up tonight, thanks Sarah thanks, Sir Doug, I'm looking out for thank you, oh sorry, but for the oh sorry go ahead. Squad! Oh, I was just going to say: I think it's bill, S 7798 he was introduced. Actually is it it's New York City Housing authority in the department of information technology and telecommunications of the city of New York to establish a 311 hotline to receive public housing complaints. I think so I think that's the one that they could now yeah. So I what I'm on the center website right now and it seems like it was introduced by Senator Klein. I do not know if anybody took the bill, but I can look into it and see if it's been passed on to another senator and get back to you guys thanks that'd, be great at the city level were not it's. You know the city Council can't pass legislation to force NYCHA to do anything because it's a federal organization, a federal agency so and similarly we're. We can't as much as all of us have tried. You can't write a bill to basically tell the city to operate NYCHA, you know in a fiscally responsible way or efficiently or good. You know we're preempted from doing that is not there a way to unilaterally receive the data from NYCHA residents. Even if we can't do anything, it's three well, it's I mean it's a lot of work and it falls on the tenant leaders, which you know always you know one needs to be really respectful of, but the tenant leaders do collect a lot of the tickets and work directly with the management of their building to get those repairs done and hold their feet. You know to the to the fire on it. Part of the problem has been cobit, and so those meetings that used to happen monthly with the management are not happening anymore. The fact, thank you, helen yeah. Thank you for that. Have there been any, if I could, can I jump in on that for a second real, quick sure thanks? I just wanted to add to what Helen was saying that let's not lose track of the fact that we still are in Covid-19 and with the get food program and it's the tenant association leaders who are tasked with getting the food from the truck to the people who need it, which is an amazing amount of work done by volunteers, and I hope they'll, forgive me for saying not the youngest of their volunteers either, and so before we start adding tasks to Tenant association leaders. I think we need to have a little bit of a triage thanks yeah. I was just going to say the fact that these meetings I mean, I guess it sounds like these meetings were those of just the tenant associations and their leadership and have they have they been able to go online at all, or is it just too much of a digital divide to get a lot of tenants on these meetings? That's exactly the problem. People do not have computers, so someone in the chat is sort of who does not know about NYCHA is saying to stop blaming Kobet, but if you on, if you've worked with NYCHA for a long time, you know there's a serious economic and digital divide and you do not want to you know just have the people who have computers be allowed to work. You know with management and not really fair, very nice and that our elected officials and Larry wood and guy Riverside have been totally amazing for this entire process, and I think we owe them great thanks. They have been front line, they have been working. I mean it's just amazing how much how hard they've been working to help with all of these issues without funding without any help from outside you know, and how frustrated we have been as a community board to try and help, and I really want to issue a thank you for Larry wood forgot to Riverside for some of the other agencies for Helen, for all of our electeds for Jerry Nadler, for every state, senator every state assembly, member, every all of our city council members. It has been a yeoman job to you, can't imagine how hard this has been, and it's just it's so frustrating I mean you know we know about these problems, and yet we can't fix them, and I can't tell you how frustrating that is, and yet we go to Helen we go to Larry. We go to our other electives and they're there for us, and they are just amazing. Thank you so much. Thank you roberta! That's really kind of you. You know when again, someone in the chat is saying well just give people laptops. This is actually a very serious, intractable problem. So far for city government, you know we're trying to make sure that all students have access to laptops and what the principals are saying is sometimes the kids get the laptops but or the ipads, but they have no connection to the internet and then their parents, you know sometimes do not speak English, and so the parents can't really the kid can't get set up on the right and so on. The internet, so what's happening is that the parent associations at each of the schools are together working to get parents who will volunteer their time to help the parents of students who do not have do not have knowledge about this to help those students get going. But it's not a small problem, and you know as much as the mayor wants to say that all computers have been delivered. They have not as much as he wants to say that all of them who need it, the computers have internet is absolutely not true we're doing a survey now among the schools in our district, there are hundreds of students who do not have laptops and helen. Of course, we have two and a half million new yorkers who are food, insecure yeah. Thank you and community Board seven. I mean really appreciate your having a whole hearing on this tonight. You can hear the frustration in all the Ta leaders, voices- and this truly, you know- has been decades worth of problems and Larry's done an amazing job pulling people together. Yes, over the last year and it's been, it's helped to move the ball forward, but really appreciate the Community board, showing interest and you know mark. Maybe we can talk about next steps. Offline yeah, just to you know, add on to that. I appreciate everyone coming tonight and speaking, and I would love for this to be more a regular thing. Even if you do not, you know, if we're not able to solve all of your problems right away. I just you know the community board is meant to be here, especially the housing committee as a place for you to feel heard, and for you to be able to elevate issues and know that you know your neighbors and your leaders are listening. So you know if you can come some months every month whenever I would love to you know, make sure the committee is a place where you feel like we're listening and trying to elevate that says the federal late. This is what we wanted to do and we will be here at every meeting. We were just having problems getting in before, because I was not able like myself, but it's been fixed right mark so far so good, and this has been great we're so glad to have been here that you guys are listening to us on the issues that we're having and moving forward that we will have a solution. Thank you, yeah. I mean I can't emphasize enough and then again sort of in response to some of the. I think sarcastic comments in the chat. Nycha is shortchanged over 40 billion dollars from the federal government wow. When I started the number was 30 billion. So these are not you know. Yes, they need a lot of money. There's a reason the buildings are falling apart and there's a reason. There's no broadband, there's a reason. There's mold and mildew. I mean it's 30 years of neglect, so you know, I think everyone is trying their damnedest, especially the Ta leaders. You know, walk a day, walk a day in their shoes yeah. Thank you, Helen. Thank you. It's a big job. We have a big job to do to take care of this. It's not going to be easy. Perhaps a new administration. Sorry Louisa! Oh okay, I mean what we're talking about is really trying to establish what the lines of responsibility are on the local level and on the national level and to strengthen them and clarify them. If we have that, we would be able to get repairs done and just the things that make it decent to live in nature, yeah, and I think, like Erica, has said you know just to amplify or let residents know to you know, call our offices. I feel like just you know I've I deal with constituents who do not have kitchen cabinets or who do not get repairs in a few months, but they end up getting them after they call our offices. I know it's it's unfortunate to take an extra step, but they do listen to us, so maybe flying I do not know call your local elected. Yes, that's right! Well, put that's what we have to do. That's what we have to do. We got to do it, that's it. We've got all be together on this one and work hard together and that in that vein, I wonder if it could be helpful to kind of like combine what data the Ta presidents have, so we can have a more holistic look on like whether issues are being addressed or how quickly or I mean I do not know if that's a herculean task, but I do not know, I feel, like things are so fragmented Larry. I do not know if that's something you guys have considered or try to do. Looking more holistically on what issues are verbal? Are you still on and I think you're right I mean we certainly need more documentation and facts, a good step in the right direction. Just so people know how many units we're talking about what are the issues? Who are the players involved locally, but this issue and certainly homelessness in New York? These are not issues that manifested themselves overnight or decades in the making. So we have to be patient and in this for the long haul, because it's not going to turn around overnight. We need partners in the state government and the federal government with the city to work with the residents and with community members to turn this stuff around. We have such a huge housing shortage and problem in this city and we're spending a fortune on emergencies and using FEMA money because that's what's available, we need a commitment from the federal government to build and maintain housing. It's not there and it's not going to turn around just with New York City. There's statewide coalitions that we work with in national coalitions. Addressing these things, we have hundreds of thousands of people not going to be able to put the rents when housing court opens. We need new rent subsidies to keep people from you know overwhelming the shelter system, so I'm not being pessimistic because I'm telling you we have a deep problem, but we also have solutions that work. We need the political will to get it done and the resources to get it done. So we have to work together locally and we have to work nationally to really turn this. The housing situation around. That's what Fdr wanted when the first housing was built in the lower East side, we saw housing as a right and not strictly as a commodity, and we have to live up to that yeah. Sorry that right has been lost, really need to. They really need to follow that brook Amendment, you understand and also that NYCHA has a lot of apartments that are empty that are not on the rent road. You know that people could be moving into that. There's people double up on other people's apartment in their family's apartment because they can't get housing anywhere and we want to talk about the housing connect right now, because we're talking about NYCHA, but all these departments- and you know they could be having these apartments. You know opening them up and they're not being open. You know there's a lot of empty apartments in Amsterdam a lot in Douglas a lot in unwise. You know not my development, because we're only 35 units people can't wait to get in here and if they put themselves on the waiting list. Here it's never going to happen and you have all these other empty apartments available around us within Amsterdam, wise and Douglas. So you go figure exactly and we all need to work together, and this was a great meeting thanks to mark Melissa and Louisa, and we need to do this again. Thank you so much everybody yeah before we wrap. I promised in the beginning that if members of the public wanted to speak on topic, they could briefly make remarks if anyone's to do that, raise your hand but again, if it's not relevant, then I'm going to have to mute you and that will be that. So I see it looks like Tanya has her hand up, you should be able to unmute Tanya. Okay, perhaps we lost her. Yes, hello, hi. We can hear you. Yes did. You call me yeah hi hi. How are you I can't see you all I see? Is you guys? Oh, you have a question or comment on you. Yeah tanya. I just made you a panelist, so we can see you did you have a comment or question you're, muted, myself and view myself. Oh okay, there you go. We hear you hi. I was just wondering what the difference was. My first question I mean I had a few questions in the chat room, but my first question was the difference with if they privatize or do cooperative with NYCHA, what do you? What are your thoughts are because it seems like the government is failing us. I mean I'm all for government, but if they're not getting the work done, you know, what's the balance the equilibrium between that you're, asking like the Community board's opinion, yeah or electeds, I mean you guys in on the panel right because they have talked they. I remember a few years ago. They were talking about buying into private housing, and things like that I mean. Maybe that would be more money, because my rent still goes up. I pay enormous rent and I'm still here in the same place and there's people next door, or you know the floor under me that are paying less money, which is fine. I get that but they're not doing any improvements to the building they're, not even cleaning up a little mess. They're, not even fixing like a broken tile they're, not doing like little simple things. I know about the elevator, because I have the same issue as most of you guys have but they're not even doing that. Thanks tanya, I mean that's where that's where Hud comes along, you know, because they do these inspections every year and they're supposed to notice. You know the things that need to be fixed like a tile or whatever. It is and come back, and they do not. So you know when they pick these apartments randomly of the ones they need to go to, and they usually go to the apartments where the people are taking care of their own, because nice is not doing anything yeah so, and we did speak about that. We, you know- and that's where I was talking about. Where does HPD come in on this with Hud, because then you know what they're the ones that are responsible to oversee these people that are working in NYCHA and getting things done for us and if they're not going to do it, how can Hbd help us so that we can talk about taking over ourselves? That's right. I appreciate your comments, the question right there. I appreciate your comment in Commons letter, which brought a whole new light to the situation which we think about like we have to have more power, but they do not give it to us. They ignore us. They just do not pay no mind and you get to a point where you just give up. I'm sorry, I'm new to this. I've lived here for 32 33 35 years, and I was busy with my life and my career and everything else. But it's like it's a hopeless situation and I love my building. I love my community and Helen is wonderful. I've met you Helen a few times at the senior center. It's great and I know you're trying, but what's another solution I mean we have to be realistic, yeah! That's all I have to say thank you and thank you for coming. I do not, I think the committee should, you know definitely think about. I do not know looking into having a speaker writing a resolution about exploring ownership and NYCHA, and I mean you guys are all right. You've cited the example where HPD has done this in the past, with buildings that were poorly managed and yes, yeah. Thanks for using somebody brought up meetings, can you hear me yeah hi? Yes, my phone keeps going in and out. That's why I keep saying that somebody brought up meetings. I sent the suggestion to our manager because they do have office help over there and there's no reason why someone, a housing assistant which has the title of a housing assistant, can't call a Ta president once a month and just talk with them, you know and they can update them on the issues of their building. This is not such a big deal, because we can't have these meetings anymore. You know, and so I think you know, there's no reason why they can't do that yeah. Thank you, Mary. That's a really good point. Good idea have a representative for each of our buildings and we can voice it out to them instead of you, because you guys have to handle it. Why should you handle it? You got to look to the legal codes and everything let them that was the purpose of this meeting, also because we do need them. You know we have reached out and we are community leaders that are doing this since you knew about it. You know, and then you come on board with us, so that all of us, together, putting all our tools in this and having the community board seven backing us up on top of it and all our official people that we have elected and to participate and help back us up with this and we're working on so that we can have a solution to all the issues that are going on, whether you pay a dollar or 1500 a month. You know what Hud is still get they're still getting their money. You know because they subsidize the ones that give you more or less it do not matter they're still getting their money, they're still getting the same amount of quality of life yeah. But you guys, I see you guys as being a tenancies association who who's advocating for Us tenants, but I want to see somebody who's managing the place. The management come on board and spend what we're talking about. That's what we yeah. They should call those housing assistants should make a call to there who could make a call once a month to every Ta leader and just spend some time with them, so they can relate what the problems that are going on and on is not that right. Larry. Can you please say something I I'd like to piggyback off Ramona. We speak to our managers daily. At least I do. We only have housing assistance that are currently consumed with doing the annual reviews for tenants and to be very honest, there's nothing, a housing assistant can do for me. They are clue they have to run back anyway. So why spend my valuable time but a housing assistant when I can go straight to management, which I do every single waking day? So do you get a reply? I mean the thing: is management? Is one manager over there? Does she reply to your every contact? I do not think so problems, that's my problem. The management does not the manager does not I've done it before and they vote hey. I have her number. I speak with her. I do not need to go through a housing. This is where Naisha comes in, overseeing these people being responsible for their positions and what they need to do. And yes, we do speak to them and many times we can talk to them and then they can vote with the information to the head. People in Niger and they're not doing anything. So it's making them still look bad, whether they're there or not. So but again, we got to be after. We got to get on top of Hud and HPD to get on top of these people to work on what's going on with the New York City Housing Authority yeah, but our management should be there just like our representatives are there and they do not live in housing, but our management, our management, should be there just to speak to us to. Let us know this that, what's going on because they're in between trying to say something tonya, let somebody Paulie is trying to respond. Let me know what I was going to say is: let's take away from me tonight in tonight's conversation, because there's a lot of issues that need to be addressed, and we can't do it all tonight. Okay- and I want to thank you, know for listening, because now you have a clear picture, but what I find as key is communication accountability. I like Jeanette's idea about crafting some principles. Okay, we need transparency. There is an app called my NYCHA app that has a dashboard, so maybe there's a way we can mine that information and that data, because on that my NYCHA app dashboard, it indicates okay when tickets are put in the system online, okay, and we can maybe use that information just to get a picture of what needs to be done for our area, because I do know when I go on the dashboard it'll tell me which buildings have issues with elevators, any kind of way water shut down, etc. So I think we need to think in terms of using that, as a starting point to extrapolate a pattern for our area. So you know we can start and take baby steps. I call because we're not going to fix everything overnight. Communication well, Helen has already said that we are going to have a town hall we're going to continue to communicate with community Board seven. So this is a starting point and the federal aid coalition. Basically we work regarding Riverside, so I think you know just tonight alone, we've learned a lot from each other, okay and we do have a safe place where we can learn from each other share and support each other and coming up with some viable solutions. Thank you that's my comment for tonight and I want to say thank you to larry, of course, to Helen and all the elected officials and all the board members. That's my comment for tonight and of course they know how to close. Thank you really quick. I've experienced that, but thank you guys. Melissa can I say something before I leave yeah. Of course it's not me. I do not know where y' all getting that. It's not me, I'm sitting in a quiet room all by myself. My wife is in the living room. It's not me, trust me. No you're, okay go on yeah, it's not me, but anyway, what I'd like to say. First of all appreciate meeting you Melissa, I hope to see you in person one day and talk and everything, of course, my federal late crew polly, I miss you have not seen, have not seen you in a while. I mean she told that stuff. I know I have not seen none of my people in a minute, but you know I'm getting better every day and sooner or late sooner than later, we'll see you all. You, ladies, are strong positive women that are driving in the right direction and I'm proud of that. I appreciate it larry. You know, I love you and we'll see each other soon, we'll talk soon, because it's time to get medicated and I'm going to say good night I'll see you guys soon, Larry I'll talk to you sooner than later, Mr Dillon. Thank you for having me hang on. There's one more, I think, is not there yeah I'll, allow Erica Gerson to speak last and then we're going to, I think, call it a night because I am hungry and exhausted right yeah eat as you as you watch. I got Ta Cook. Am I joining video or I should just start give me a second I'll. Do it? Okay, go ahead: okay, hi, good evening everybody! It was really great to join you and I learned so much from so many of the speakers, and I want to just reiterate a few of the things and I think there were some things in the agenda that did not really get as much air time. So I wanted to just return to that, but I really appreciate all of the specifics and I think that this was a great example of a community meeting where we really heard from the people on the street about what the realities are in your local moment, so whether that's contracts that are not getting properly vetted or calls that are getting complaints and then they get closed out when they have not actually been fixed. So yeah. Sorry, I'm welcome. So anyway, in particular, one of the issues that I heard that was raised, I think it was Mona. Lisa morales- talked about the chronic scaffolding, which is really a challenge for the whole city. But in particular I know it's being abused in NYCHA housing, where it goes up with absolutely no expectation that any work is going to be done and my heart breaks for all of the difficulties within the building. But unfortunately I do not think that most of us locally have the ability to fix it. But we do have an ability to change their experience of what happens when they step outside. So, as she said, they're suffering in their houses and our and our local neighbors on the upper side are suffering when they step out and in particular, as Mona Lisa morales, mentioned that when they're scaffolding we get the businesses underneath them are much more likely to close, there's much more likelihood of homeless coming in and encampments coming in, and it's just a very unsafe environment for everyone. And so I think those are important issues that were on the agenda in terms of safety and crime that need to be addressed, and we should certainly be trying to get more help with dealing with all the other issues, with NYCHA with the abuse of spending and the lack of accountability. But I think that our community board can really step up and be a part of advocating that we get enough officers in and law enforcement and lighting and help clearing out homeless, who are causing hazardous in situations. So I just wanted to say that, and I hope that we'll be able to do more for you guys. I think it's terribly unfair, that you're suffering with incompetent leadership. Well, thank you. Thank you. Thank you. Absolutely. Okay. With that comment, I'm going to thank you all, and I'm also going to say I think next month we want to kind of do a follow- up and talk more about concrete, next steps. So you know this is again the beginning of a conversation and I really appreciate everyone showing up and speaking so thank you and thank you so much thanks for having us good night, everybody.",
            "summary": "Yesterday I think we have a quorum from the committee, so I'm going to kick us off Then you know as folks join, especially our NYCHA tenant leaders.\nChair of cb7's housing committee, meeting If madeline innocent, who shares our nature task force, might be stuck still poll working because of the intense interest in early voting, which is fantastic.\nWe're joined by a number of NYCHA attendant leaders in our community district to hear from them a bit about what's going on at each development as well.\nThat's long been scheduled with our tenant association presidents from the NYCHA developments to hear from them directly about their needs and how we can try to marshal resources meet them.\nSo with that I'll give it back to the chairs, with thanks for everybody, who's coming and advice, to look at our website to make sure that we, when we schedule those meetings, you'll be able to find you know how to access them and to be a part of that discussion.\nI sent her the regular CB7 on registration and she registered from the bar Do you want me to kick it off with just a brief update of just whatever is going on at your development that you think is important for us to know any issues you wanted to flag or discuss with us.\nI was going to give a little overview of the whole all of the numbers to try to put in context because you're going to be hearing from at least one of the resident leaders from hopefully each development if they can all get online anyway , I work at goddard.\nLot of my work has been with rent, regulated, tenants and SRO tenants, but I've also done a lot of work with the so-called federal eight, which is the name that a number of the nature leaders have taken for the developments and just to help bring people together for mutual aid and support.\nThat's a collection of 36 buildings, they're, all walk-ups The other big chunk of public housing is Frederick, Douglass and a mix of other buildings and that's between 100th and 105Th Street, and you know going back to Ronald, Reagan Hud and his cutting the national budget for producing housing and for maintaining it.\nPublic housing has been under assault for decades and there's been a lot of abandonment and demolition across the country and in my talking with NYCHA residents over the decades that fear of gentrification and displacement and privatization runs deep.\nEverybody wants, their buildings renovated and maintained, but there's always been a lot of concern and mistrust and fear of displacement and privatization, and the issues that you're going to be hearing is climbing crime and safety.\nThe fact that the federal government has largely abandoned nature of public housing, as well as the state wise towers, which is going through.\nOkay, in addition to that, we have Ramona miner online who's online by phone from the host, though so I might want to give her the floor so that she can speak to issues going on in her building right now, and we also have Mona Lisa from the dome site, who's online, so I rather give the time to them.\nThe safety issues where people can just get into the building, and I actually was going down staircase one day and some strange person was coming up.\nIt's some apartments need to be done, they're, not being done, and that's also an issue because they've been sitting for years, Is that a new thing, that's happening, polly Cynthia, management's no longer giving us access to the list of the names of the tenants, not neither the new ones or the current existing ones.\nJack, is not here right now, but he did ask me to speak about his elevator situation, but I'm going to hold off and because I know Mona Lisa's on the line, Okay You and your family.\nWell, one of the things that I want to talk about that with the dome site, we're really having a bad rotten problem, the apartment's, getting infested construction on the buildings.\nI think all night tenants have been having that problem throughout New York City Housing Authority, but this building is 24 years old and we've been having a lot of problems with it.\nGoing toward brandeis of Amsterdam I mean Pitch black pitch black People working on the building over there Besides, that the issues with dogs nobody's picking up after they come to this block, but they do not do it in front of their own.\nI know that the fire department came after or whatever, and I think they might have gotten a fine Then they stopped working trying to come in the building.\nWe really need to get on the elevator division of NYCHA to get people in this area on Standby, because the elevators are old and they're breaking down constantly Buildings elevators going out is not just an inconvenience.\nMy bathroom is full of molds, so It does not make the point that so many residents have lived in NYCHA properties a long time like a lot of housing, the upper west side.\nHe's speaking to the money that collegiate allocated for affordable, You want something from the store: 14 million dollars left I do not know that it was earmarked for NYCHA.\nI want to say about 150 million dollars where every we sat down with the Amsterdam houses, tenants and the harborview tenants and went through all of their all of the things that needed to be done, and so there were new doors, replaced.\nThere is just so much going on in these developments that I've gotten together with like 10 different presidents, and we put this letter together for Mr Gregory Russ, the chairman and CEO of New York City Housing.\nThe city and NYCHA are right to want to redefine public housing in New York City.\nThe properties which, in turn, would enable a level of social efficiency and Minimize substantia substantiation associated with public house through the assistant of NYCHA and relic related city, state and federal agencies, secure the appropriate capital necessary to redevelop the individual, projects.\nDoing stuff, like that, that's horrible people are really suffering, and I really got to say any president that wants to get on board with occupy NYCHA Believe me, our own lawyers and everything please get in contact with me.\nTalking about their systems for elevators, and I, think it was a two-hour meeting You know about the NYCHA stuff it after two hours.\nYou know that was taken care of, so I just feel that it's better to work in a focus group, because when you have too many voices too many boards and too many people, you're not going to get anything accomplished.\nMany NYCHA buildings are suffering even more since Covid-19, and you know part of the problem.\nI, just want to say something, and at one time when well, when I lived under on Wasura before I, came to the dome site development here, we were able to participate with choosing the right contractors to come in and do work at the developments and like she said they do not speak to us about anything.\nWe know, there's problems with the structure, the organizational structure and the processes and communication, but it just seems over the years that I've been on this housing committee.\nYou know a lot of what I'm hearing is that we're not having the right people at the table that we need to keep a hyper local focus which seem like good next steps and that we need some kind of way to communicate some kind of set structure that we can work within some of the other pieces about accountability?\nI know I realize that we have an issue with 3-1-1 does not work for NYCHA right and my understanding that we have a real black hole in and void in the data, and I guess the question on a legislative level, and perhaps now we can answer this or Erica or remember.\nYou know one needs to be really respectful of, but the tenant leaders do collect a lot of the tickets and work directly with the management of their building to get those repairs done and hold their feet.\nI just wanted to add to what Helen was saying that let's not lose track of the fact that we still are in Covid-19 and with the get food program It's the tenant association leaders who are tasked with getting the food from the truck to the people who need it, which is an amazing amount of work done by volunteers, and I hope.\nI mean it's just amazing how much how hard they've been working to help with all of these issues without funding, without any help from outside you know, and how frustrated we have been as a community board to try and help, and I really want to issue a thank you for Larry wood forgot to Riverside for some of the other agencies for Helen, for all of our electeds for Jerry Nadler, for every state, senator every state, assembly, member, Every, all of our city council, members.\nJust you know, the community board is meant to be here, especially the housing committee as a place for you to feel heard, and for you to be able to elevate issues and know that you know your neighbors and your leaders are listening.\nNycha is shortchanged over 40 billion dollars from the federal government They need a lot of money.\nWe need partners in the state government and the federal government with the city to work with the residents and with community members to turn this stuff.\nWe need new rent subsidies to keep people from you know overwhelming the shelter system, so I'm not being pessimistic because I'm telling you we have a deep problem, but we also have solutions that work.\nI mean I'm all for government, but if they're not getting the work done, you know.\nWhere does HPD come in on this with Hud, because then you know what they're the ones that are responsible to oversee these people that are working in NYCHA and getting things done for us and if they're not going to do it, how can Hbd help us so that we can talk about taking over ourselves?\nThey should call those housing assistants should make a call to there who could make a call once a month to every Ta leader and just spend some time with them, so they can relate what the problems that are going on and on is not that right.\nLet me know what I was going to say: is, let's take away from me tonight in tonight's conversation, because there's a lot of issues that need to be addressed, and we can't do it all tonight.\nWhen tickets are put in the system online, okay, And, we can maybe use that information just to get a picture of what needs to be done for our area, because I do know when I go on the dashboard it'll tell me which buildings have issues with elevators, any kind of way water, shut, down, etc.\nBasically we work regarding Riverside, so I think you know.\nI know it's being abused in NYCHA housing, where it goes up with absolutely no expectation that any work is going to be done and my heart breaks for all of the difficulties within the building."
        }
    }
}