{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB2",
            "channelId": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "title": "2020.06.15 - CB2 Parks \\u0026 Recreation Committee",
            "publishDate": "2020-06-16",
            "shortDescription": "Brooklyn Community Board 2 (CB2)\\nParks \\u0026 Recreation (P\\u0026R) Committee\\nMonday, June 15, 2020 // 6:00pm\\nremote via Webex\\n\\n00:00:00 - Welcome \\u0026 Meeting Protocols\\n00:02:10 - Introductions\\n00:06:24 - Approval: Agenda\\n\\n00:07:33 - Intro: Davey Ives, Chief of Staff, Brooklyn at NYC Dept. of Parks \\u0026 Recreation\\n00:11:55 - Parks Dept COVID-19 response\\n00:24:32 - Committee Q\\u0026A\\n00:44:46 - Parks Capital Projects Updates*\\n00:59:23 - Committee Q\\u0026A\\n\\n01:09:29 - Discussion: FY21 CB2 Statement of District Needs \\u0026 Budget Requests\\n01:36:20 - Community Forum\\n01:36:49 - Approval: February 2020 Committee Minutes\\n01:38:40 - Chairperson's Report\\n01:40:33 - Motion to Adjourn\\n\\n*As noted by timestamp there is a brief segment where visual capture does not match audio. This is due to technical failure alone; this video has not been edited or modified in any way. Please contact the District Office if you would like a copy of the Parks Department presentation slides. Thank you for your patience as we operate with reduced capabilities during the COVID-19 pandemic.",
            "lengthSeconds": "1:41:08"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB2",
            "normalizedName": "Brooklyn Community Board 2",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "VOWykNjXjuw",
            "fillerWordCount": {
                "uh": 1,
                "um": 11
            },
            "readTimeFullTranscript": "49 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "parks": 31,
                "moment": 26,
                "park": 24,
                "guys": 22,
                "staff": 20,
                "projects": 18,
                "project": 17,
                "bit": 17,
                "capital": 16,
                "member": 14
            },
            "wordCountSummary": {
                "parks": 4,
                "park": 4,
                "bit": 4,
                "topics": 3,
                "place": 3,
                "projects": 3,
                "staff": 3,
                "event": 3,
                "guys": 3,
                "moment": 3
            },
            "fullTranscript": "Five, and also for purposes of transparency, all of our microphone, all of your microphones will be muted when you're, not speaking, and we're going to be monitoring that so we're trying not to have too many interruptions as we go forward and we're asking all committee members as I mentioned, because it is the policy of CB 2 to have your cameras on during the meeting, and we encourage all the other attendees to leave their cameras on, particularly if you're given to the floor to speak. I think that is not. It really enhances your ability to make your point. If people can see you at the time, you're speaking so I will let you know when topics are open for comment by Committee, Members, Board members and the general public, if you, as you know, we're doing this through WebEx. So if you want to speak, use the WebEx feature in the participants panel to digitally, raise and lower your hand, and we will call on you in order if you have questions that do not get her during our public comment. Time. You're welcome to type them in the chat panel and we will get to them if we can and as they pertain to what we're talking about. So, if any, if anyone experiences any technical difficulties as we proceed, you're encouraged to consult help WebEx comm and after the meeting you can always reach out to the district office. So also an important notice is that we want to provide access for all our neighbors, regardless of their physical ability or any limitations. So if you require any accommodation or assistance or you know of anyone who needs those things for full participation, please contact the district office at least 72 hours before any public meeting takes place. So I'm going to we're going to go around and start the meeting by having the committee members and reduce themselves if I failed to mention it I'm, Barb, Rizal or Gregor, one of the co- chairs of the committee and rule SOS key is the other co-, chair and hope. I do not see him, but hopefully he'll be joining us in a moment or two Suzanne. Would you like to be next Oh, Suzanne, you're, muted, you can unmute yourself, just move your mouth and you'll get the choices I ever done it. What's your name, I know it's there, but I'm Suzanne, Quint and I'm, a member of the committee, as well as a member of the community board, Jennifer I'm, Jennifer, Melb and I'm, a member of the committee when Caruthers a member of the committee I was hoping everyone would introduce different names. I was just so they were not all talking at once. I was heroin. You have to unmute Carolyn coming on weary I'm, a member of the committee and of the board Candace hi. My name is Candace Harrison and I'm. A member of the committee and a resident of Clinton Hill Lennie is Lennie on the call I am here, but my camera is not working. Do you hear me? Oh I see I see your letter. Yes, so you want to introduce yourself all right: I'm, 11110 I'm, a member of all right. Well, thanks have we heard from Andrew I have all right, so we're going to move on then. Normally at this point in time. After we've introduced ourselves or right before that, I like to go around myself personally and shake hands with everybody who's here and welcome everyone. We are very fortunate. I can't do that in person tonight, but we're very fortunate that we have a very really good, large crowd interested in what's going on tonight. So I think if anybody has the opportunity to speak, hopefully you will introduce yourself at that point in time. So I want to take this moment for those both the committee members, who have not had this chance yet and everyone else on the call to welcome our new liaison, who we are very fortunate when it comes to tech. Not only is she interested in parks? Not only is she great, but she is very highly skilled when it comes to technology, so Taya Mueller is our new liaison working with the with the Parks Committee Caroline Church has done a phenomenal job. All these years and I have every I'm totally confident that taya will follow suit. So thank you for being here tonight taya. We really appreciate it we're going to be talking tonight both about Commodore, Barry, Park and perhaps capital projects in general about the parks and also work on our annual update of capital projects. So if anybody who is not a committee member has something that they want to say about those things briefly, at this point in time in a moment, I will give you the opportunity to do so. As soon as we approve the agenda. I just have one change to the agenda. It talks about Landmarks Preservation Commission. That is not for tonight's meeting. Instead, we're I have an update on the parse Department capital projects, so with that I think I can amend that on my own Rob and then ask for approval of the agenda based on that change. With that change, I should say: promote Quinn as first have a second all right. So with that, if anyone now wants to talk about the two subject matters I mentioned, this is a time for you to briefly talk about those all right during no one. At the moment, you may have comments later we're going to move on with the agenda. I am- I'm always delighted to have people from the parks Department here I think we work closely with them and we really I think they listen to us. So we tonight we're very fortunate to have the chief of staff for Brooklyn, Davie, Ives and I. Think he's brought some of his colleagues with him and he usually introduced them and so Davie I think is going to he I know. The topic is capital projects in general, but I think your focus is going to be on Commodore Barry Park, which is something that's very dear to everybody's heart on this committee and put a lot of focus on it and as well as the other Park, so I'm going to turn it over to you Davy, and thank you again for being here great Thank, You Barbara and thank you thank you. Everyone at Community, Board to for hosting us tonight, Denise Palmer, the regional manager for West Brooklyn, so covering Kamini Board to could not join us tonight. But you know she sends her regards, as does Andrea keys. I do not believe in Ria's on at the moment now, but with me is Chrissy and Olli from my staff. Chris handles capital projects for the borough, so he's kind of he's helpful in our office too. You know you've seen him at scope, meetings and behind the scenes you know he's the one. That's organizing a lot of the kickoff meeting for construction supervising a lot of construction work that happens in the borough, so just wanted to introduce him. I do not know if you would want me to give an update, maybe on some of the virus related things in parson. I know that we mentioned that earlier. I can spare I could start with that and then what I was planning on doing? Is we have a you know? We have our capital project. We have our update on capital projects that I could go through. I could run through that and then we could discuss potential sites that are on kind of our needs list. I think last, oh man, it feels like so long ago, but Prague last summer we did a band tour with you guys and we rode around the district and looked at different sites. So I can tell you which ones are still on our list and which ones you know on have been, and then the capital update will tell you which ones have been funded and where those I did not know. If you I did not think to ask beforehand, but hey I may have whether you have a PowerPoint or you're going to share a screen tonight at all. I do not know how I have a PowerPoint for the capital update the status. One do not have one for the needs at the moment, but I could, if it's possible I could share my screen. But so, if you just coach me through that, when we get to that no problem, you actually you have Presenter status right now. So you just want to go up to the top left text, menu and click on share, and then you can share content. I got it share my meeting window. You could do either if it's, if it's a PDF or a slide deck I, would recommend share content. Ah, okay, so I can figure that out, but I just want to maybe go through the Covid-19 response. First I do not have a presentation for that, so yeah, so Covid-19, 18, right, I, think the formal shutdown started sometime in mid March or, and maybe before, I start. Can everyone hear me okay? So just if you can give me a thumbs- up, if you have any issues, just let me know put it in the chat or otherwise. So Cove at Nike happened about mid- March. We had the shutdown take place and you know so the parks apartment. This is new for us as it is for everybody else. So you know we kind of scrambled and put together and put systems in place. The best we could and kind of our whole approach to this was being flexible, being responsive things are changing on the ground every day, and so we just want to figure out. You know how do we maintain? How can we do everything to protect the safety of you as park? Users and the safety of our staff, as you know, members of the community that also service parks and help maintain that. So with that in mind, you know we are staying flexible as we can. So you know initially when people needed to stay home because of childcare issues. We work through systems with that you know kind of incredibly, we went from no preparations for a work from home arrangements to suddenly a large portion of especially our administrative staff working from home in order to reduce people kind of being on top of each other in the office, which was a big feat for some of our IT work. But now you know we're still working remotely I've been in the office every day as how are our field staff, so they are essential workers. You know I, think I think you know I do not know if in community board, to your people clapping at 7:00 o'clock every night, but you know parts workers are also in that. So you know these are people putting themselves out there they're taking the train to work, and we have not stopped coming into work since March. So you know we are trying to be cognizant of that as much as possible and, like I said trying to be flexible for our workers. That said the important stuff for you guys as the Parks Committee is kind of how does that shake out in parks? So, obviously you know again. Safety is our eyes, our chakra, so things like face coverings things like social distancing. Those are our paramount for us to keep parts open and to keep parks functioning. So you know, we've handed out face coverings. I, forget the statistics exactly, but you know I think we've handed on a bunch of face coverings. I'll also say that some of our Rec centers have kind of adopted and turned into food distribution hubs acrosss the city, so we've gotten out millions of meals. At this point you know our recreation staff have been incredible. They have kind of responded to every task possible. You know they've gone from basketball coaches and you know, and fitness instructors to now distributing food for New Yorkers. So it's been an incredible endeavor in that respect. We've also, you know, launched this program called the parks ambassadors. So you might see some people walking around in green jackets in your parks. Those folks are recreation staff, mostly that are patrolling the parks, handing out, masks and trying to educate people about social distancing and keeping people there. Having people keep their distance, so I think that's kind of the. You know some of the better things that have come out of this. Unfortunately, you know I, think in the interest of safety, we've had to close a lot of parks, amenities and I shared in the chat, the link to the parks website web page. This has a more detailed list of all the amenities that are closed. If you need that link, I can send it again. Just let me know, and maybe try a weekend that we can distribute it. So you know from the event perspective, all special events have been cancelled through the end of this month. That will probably get revisited as we evaluate whether we move into Phase two or not of the recovery. At this time, I do not think we're taking any applications for special events: leap, sports, leagues, similar things, sports leagues have been canceled through the end of the summer season. So August the end of August news on that front, actually I think just this week, applications for the fall season have opened up so if you say, run a football league in copper or berry Park. You might want to think about putting your application in you know. So at the at the moment. We do not. We do not know whether the fall season is going to go forward. Obviously this thing is changing everyday, but what I can recommend is if you're thinking about it, get your permit in and if you have any question, Nancy and her staff are amazing in the permit office, so Nancy Jose, Joe Darnell, all those guys can help you out so feel free to give them a call Nancy's in the office most day. If you do not get them, send them an email. If you still have trouble speak to me through Taya or Robin, and we can we can work something out. So we're hopeful that we can get back to work in the in the fall in terms of sports, but you know. Obviously it depends on how things go with this virus and you know like it like: I started this off with we're being flexible or being responsive to the conditions on the ground, and safety is our most important thing. I mean you see it all. The big national professional leagues are also grappling with this. So, as you can imagine, it's pretty tough now for facilities that are closed again it for more comprehensive list. I'll try not to bore you guys on this, but look at that website that has it and that will be updated as we evaluate things, but right now, I think one of the big ones is playgrounds or clothes. So if you have kids I'm sure you know you already know this playgrounds are closed. Dog runs. Are closed. Skate parks are closed. I'm, probably going to miss some things here, basketball courts are closed and we took that we had to take the hoops down actually, which was a painful thing for us to do, but it's something we felt it was the thing that could guarantee that you know we could maintain social distancing. Hamilkar Chuck was tennis. Courts are closed. Golf courses are closed, nature, centers and a couple other amenities, bocce court, volleyball courts are closed and again that the rationale for us behind this was in the interest of safety. We're trying to maintain that we're trying to enforce social distancing the best we can- and this is these- were the measures that we felt were most appropriate. Another big one for Commodore Barry is the pools are closed. At the moment you know, we've had trouble hiring like getting lifeguards trained part of the lifeguard training. You know that takes place and you normally I think we start this around February and obviously we could not do this training with the virus happening. You have to be in close quarters. You have to be swimming. There are just kind of inherent risks for lifeguard training, so we're trying to get like our training back but I would say. I would not super optimistic that the pools are going to be open for the season. I know that the mayor said he's still looking into it, but there are just a lot of logistics in terms of hiring workers getting them on board and in addition to the lifeguards there's, you know, if there's a lot of our seasonal staff that works at the pools, as you guys might encounter during summer. Similarly, on swimming city, beaches are open, however, swimming is not allowed at the moment. This is another lifeguard thing again, so we do not have lifeguards at the beach. So if you're not allowed to go swimming at the moment- or we ask that you do not go swimming, we're hoping that this can change as we get more lifeguards trained up and staffed of the beaches. But you know pools are open, I'm! Sorry, beaches are open for passive recreation for walking. You know and I think acrosss I'm bringing up now but acrosss the board. You know we're trying to take actions that will limit the net amount of team sports or activities where people you know just because, due to the nature of the recreation, will come into contact with each other. So you know something like soccer is something that we're seeing that people are. You know maybe playing a pickup game that we would love to. Have that prevent that if possible. So you know it's another reason why we're keeping some of these facilities close? You know all of our Rec centers are closed at the moment and as a as a result. All the programming that goes along with wrecks images also closed. I will say that our rec staff has done amazing work, trying to bring some of that program online, to parks at home, its NYC parks at home, maybe Chrissy and Olli. If you could look that up online, maybe Sheriff to the chat so that we can add that otherwise I'll share it with you guys later. It's just you know. So there are activities just to keep kids occupied about drawing about fitness about. You know nature. There are virtual nature walks. Virtual talk, part tours another class with part staff and I. Think the last thing I'll say that community gardens have been closed, but what we've been allowing through our green thumb program is for some people to you know for a kind of the minimal amount of maintenance to happen in order to keep these Gardens alive and well so green thumb gardens are closed, but you know some maintenance can take place. The last thing I'll say and then maybe I'll open up for questions. If anyone has any is we've entered phase one, what amenities get opened in the phase, one phase we're taking our cues from City Hall, so you know we initially thought it was going to be a little bit more. It's not! You know it is what it is so, but as part of that phase, one we're relaxing the restrictions on volunteering. So if you have groups of volunteers of ten or less and you'd like to volunteer, please you know reach out to your OC, your so your outreach coordinator, you know I, think we're looking to allow groups that regularly volunteer. So you know for Creme Park. You can work with Dave, Barker I think he's starting some of these programs up as well, but for the most part, it's just very small, kinda self-, sufficient volunteer groups are allowed to come back from the park. Additionally, I would say we're only alone enough to happen at parks that are open. So if there's a park near you, but the whole site is closed due to you know some amenities that might be in it. That's just going to be, unfortunately, not allowed until that amenities allowed to be opened back up with that I think Barbara I'll open up to questions. If you want to moderate that first committee members any questions from committee members Suzanne, you can hear me yes correctly. A couple of questions but I've, seen on a couple of chats and also I, saw Brad Landers cut out a communication on this about garbage in the parks. Yeah and you know, garbage is piling up more, you know. Can you share sort of the dynamics behind that, and you know the suggestions that I've heard have been proactive, like people should take their own garbage out so which exists in a lot of parks. You know around the country today, I was in a park in New Jersey yesterday and there were no garbage cans. It was, you know, clearly garbage out with you, so just what sort of creating the dynamic and then are there efforts to put signage up or otherwise to direct people to take the garbage out with them anything you can share on that and then I have a second question after others have gone. Sure. Thank you. Yes, garbage has been. You know. I think garbage is a challenge. We struggle with all the time, even the most robust of budgets for seasonals this feature. Our seasonal plan was cut significantly so where we are worked on operating with the Skeleton group. So you know about garbage. You know we do not put the garbage in the park. We just try to take it out, so anything that you can do to help with that. You know is huge prep. You know if you can take stuff out and not throw it out in the park. It might seem little okay, you know it might just be a coffee cup and you know a couple napkins, but over time, if everybody does, it does add up so yeah. Obviously you know, if you guys can you know, carry and carry out that helps us. We do not have any plan to do any signage about it at the moment, but you know I. Think one thing we're grappling with is not having our full summer seasonal staff and at that hurt a lot. You know for this budget season yeah. Is it a deliberate decision not to do signage or it's just has not been fully these? Are they considered? Yet we have a large sign committee, so you know it gets. It gets vetted through our agency and we want to avoid. You know we'll do one thing at Commodore Barry, but it would be a different sign at another Park or a different. You know or the signs in Brooklyn or we try to do it as a citywide. There's, no okay! You can thank Marty for that. One I think he just kind of hopped on it did it before he has permission so yeah. That was that was a good one. Yeah I think we've had a lot of success with that and you see it replicated. I think Candace might have had a question, but I do not know she disappeared. I'm still here, I do not know. If you can see me, though, but I'm sure we can hear you. Oh that's somewhere my camera's on wait. Am I back my camera back, bring it all right. Sorry about that. So now that Suzanne's question was a little bit about the garbage you touched on not having a seasonal stab, but with all of like the protests and the March that are happening, a lot of them start or end in our district, like a cabbie Plaza or tree park. So what is the Parks Department doing in terms of still making I? Guess a parks, I love? The word is usable, you know, or after these protests or like witnesses, the staff doing. Are you hiring extra staffer or your current staffers doing overtime to make sure that the parks are still clean after everything happens, I mean like how you I guess ensure the safety of the workers like during these protests and March, and things like that. That's a great question, yeah I mean I. Think with these with these protests has definitely been a challenge for Park staff. Again, you know I think they've done an amazing job just being flexible to and responding to the situations on the ground, as I mentioned before we're not issuing any we're, not issuing any event permits of at this time, and so all the most, the organizers, I, think, are dealing directly with the police with respect to the trash, and you know that just comes from any large gathering of people. We are just kind of where we're just being cognizant of the event and trying to send our people back out once the event has cleared out so like admin once they go, acrosss the bridge or for once they come down so we're just trying to be as responsive as possible, make sure the bathrooms are cleaned. You know, and you know, and definitely trying to try to keep in the park as the best of the clean as we can. After these events, we've had a lot of issues with Graffiti. You know and I'll also say you know some is graffiti and some are you know: ad- hoc monuments, you know like, and so we've instructed our staff to try to be as careful and cognizant as possible. I know if there was something I think in Manhattan, where you know I, think Park staff kind of did not read the room in terms of you know what was what was kind of more of a money from the temporary monument or lunch you could think of it in the lines of you see those like white ghost bikes around the city, so some of them you know so we've instructed staff. They see something that has a little bit work here, put into it to just kind of check to make sure before they just remove it. That's it I think you know. If we just see you know some graffiti tag or if it's vulgar we're going to do our best. Remove death but all of our staff have been coached to you know just give it an extra look over before scrubbing it off. Thank you all right, Suzanne. You had another question and I wanted to just acknowledge. You know. The pandemic has certainly shown us, however important the parks are to the city, so I'm, specifically Davie with regards to Bridge Park to over in Dumbo. So that's a park. That's been closed. You know quote-, unquote because of the playground, so I just wanted to raise that to you and I do not know if it has been raised to you. Specifically, they are so that's the pavement area and then there's a playground. There appears to be a gate between the two that could be changed so that the pavement area could be open for people as another place for people to use, for example, my kids and everyone else in the world who now buycks who did not before was in the city. You know it would provide another place where bike riding could happen or whatever the activity might be like. Are you aware of that, and they say the opportunity for the pavement area to be opened? Yeah I think we've had this issue at a number of sites, I mean I, think you've got the district. Six we've had requests for Carroll, Park and Washington Park. You know you know. Obviously, if you've ever been down there, you know how that Jam, those places are in the summer. You know, and also we got a number of sites in Williamsburg and Greenpoint. That kind of also put that whole, but unfortunately, I think we're. You know we are just keeping it the whole site locked off at the moment there. We do not have any plan at the moment to open up the large pavement area, but I wish I had a better answer for you, but at the moment there's no point: are you trying to envision Carroll Park, because I have been there yeah and in his jams, but I feel, but I do not know how many has anyone with? Has anyone with authority been on a site visit of Bridge Park to because it appears like there's a like very tall, serious metal gate that could separate the two so to the right to what seemed to be a reason why it could I just wonder if it's actually been closely looked at or if it was just sort of you know, part of it, especially since the park is going to be renovated. You know, maybe it was a carefully considered, but, as we all know, every spin asked our staff to look into it and I can try to get you a better answer after the call yeah. So we can, we can definitely into it. I think I have to check what the barrier is between the playground and I'm going to call a multi- purpose. Flight area and PPA is the technical term for it yeah so I can I can check and look into that to see yeah. You know what rats out mind closing up understand. You guys have had a lot going on, so it made you know an extra piece of attention. Thank you. Davey I wanted to thank you that we appreciate and applaud the fact that the Parks, Department and Conjectural Tod has not removed the temporary monument at South, Oxford and Fort Greene Park, which is which is good I, wanted to ask if the last three weekends I have parks being utilized. So much do we plan. Is there any plan to put social distancing markers in any of the areas where people are gathering I noticed you know in Seattle they had done something where they had mowed circles into the lawn there's. Obviously the huge issue with Domino Park yeah, not in our district, but that you know they had introduced the social distinct circles I. Could it be something as simple? It's like one of the markers that you put on top of a sprinkler or something to sort of get folks separated, yeah I mean I, think we we've thought about it. We're definitely impressed by the things that they've done at Domino. You know I, think there's a bit of an enforcement issue with respect to like mulling circles in it. I, do not think we're just the number of people that we have available to mow things. You know I do not I do not think it's feasible for them to you know, do anything, but you know the quickest shortest route. As far as social distancing goes, we do not have any other plans to roll out at the moment. You know if you have suggestions, we're open to them and we can listen to them, but nothing's planned for at the moment, I think did you bring up sprinklers as well? I just thought. You know those little tiny, knee and flags that you like that you put down to mark a sprinkler so that the mower does not hit it. Oh, if you could Spence the 10 feet apart and tell people that that's where they can sort of set up their little picnic, you know it might just without enforcement. It might just encourage folks to cluster and separate yeah. We yeah I know we have not. We have not really planned anything like that at the moment. So yeah we can, if you have suggestions like I, can bring that back. Anyone who is not a committee member before I, just with us, Carolyn I, think I've been meaning to say hello to you. A recent way to thank you personally and now. I can do it publicly for all you've done for the parks Committee while I've been the chair and how much I appreciate it and I did not mention you at the beginning of the program, but I do not think you had joined at that point so, but thank you for being here and for all you've done. So. Thank you, I'd like to make a comment. This is Lenny Levington, like cameras was still not working, sure Davey, you were talking about the beaches and pools and lifeguards I was a lifeguard and I do not want to be like that. The beaches and almost all the lifeguards do go in to make rescues every year. I do not almost all of them and they will obviously be in direct contact with whether they're pulling out whoever they may have to give CPR to etc and as much as I love swimming in the beach I really think that it would be putting the lifeguards in harm's way. While this disease is out. That's just my comments. I do not think for their safety that the beaches should be open. The swimmers his life was some dude just looking. How do I share my screen, so I could just show you guys the power, blink, hi, baby, HK yeah amazing, look on the upper left corner of the WebEx window. You should see the words file edit share click on share and then select share content. I, it's grayed out actually I can only click share. My meeting window o said: try that try now not getting. It might be a universal access issue that we have on all of our meetings. Then, ok, is there any way I could share my that's a right. That's the only way I could share my screen right. Yes, unfortunately, ok so I mean I. Think I'm happy. Just to talk through it, I mean and I can send out the presentation and we could- and you know you guys- can look at the details later. They just mentioned. If you move your cursor over the screen, there's a box of an arrow pointing up yeah, it's going out on my computer. That me that's odd, because you actually have presenter privileges, which might be my laptop I'm. Not sure I gave it permissions to just someone. If someone else in your office on the call has access to the file and is able to share content, maybe they could run the visual while you provide audio or you know, let me I can try to email it to you guys right now, so it's a bit yep, and so, if you guys could just bear with us for a second sorry about that, I'm going to send it to the bko to email address. Is that the right one I'll actually send you mine directly one second, okay, send me an email and I'll just respond to you. Sorry guys, thank you for bearing with me I've learned when you close the chat box. You have to be careful that you close the chat box and not to exes are near each other. You Rahm I sent it to you as well. So if you can, did you sorry everybody tie up? Let me know if you got that thing doing there. It is okay, so while tire loads us up I just want to give a little bit of a disclaimer about the timelines on all these projects. So during the shutdown all construction was halted. So you know only a very small number of construction projects were able to go through I. Think in Brooklyn I think we had 30 active construction sites throughout the borough. I think only maybe one or two were allowed to proceed. I have to check that number, but those only like one or two were deemed essential projects. So, as a result, a lot of our timelines for those jobs that are in construction is quite delayed. You know I think only this week are we seeing construction sites getting back to business and I think you know I think one conception that people have is that you know you just need to get the guys to the site and they just start putting things together. It's actually a pretty complicated supply chain that they're they have to go through perfect I can see it so there's quite a there's, quite a complicated supply chain that goes into this into parks. You know all the playground is built by one manufacturer somewhere, the safety surface is from different manufacturer, etc. So it's kind of this delicate, orchestrated dance that has to take place in order for construction sites to cope affected to working. So you know those sites that were scheduled and then that's just for a concise that you know, we've had the budget approved and it was in construction for those sites that have yet to start construction. I think the timeline is even more delayed and we're looking at you know we're looking at projects that we're supposed to start in the spring, getting pushed back to late summer or even into the fall, if not sometime, in 2021, because you know some of these projects made it through the procurement cycle to the point where they were bid out and they and we had a contractor on board ready to go some projects, never even made it to that point, and so the Office of Management and Budget is kind of telling us to just slow down a little bit and to hold back from releasing new bids until they can kind of inventory how much? How much damage I think the lack of revenue for the city is going to impose out people, that's a little bit rambling. Does anyone have any questions on that before iced? To begin all right? Do you Wanna advance for the all right, so Betty Turner Park? This was finished last summer we had a great event in the park. I know: we've had a lot of issues with trash collection, which was a tough one for us to work out when the Park first opened so well. We tried our best to get a handle on it, but obviously there are still concerns about that. We're working through it, but it does not help when you have a whole high school that just kind of ends up in the park on their breaks and on their lunch breaks and dumps all sorts of garbage. So we've been trying to work it out with different community partners, including the flat the Fulton Avenue bid. So we're hoping that you know we can figure out how this part, you know, operates a little bit more consistently in the future. We also got all the lighting to work in the park that was a bit of a struggle with Quixote and kind of ascent, but I think everything should be up and running at the moment next, so Cadman Plaza. So this is the project and you can see on the side of the building and Cadman Plaza for the elevator. This is the idea to make it a DA accessible. You can see at the bottom of this of this chart. Construction began 2020, so it did begin in the spring. Actually, whether it will complete next spring I think is up for grabs. You know what a month delay to agenda, so we hope that they'll be back up and running again, but yeah we I would say. I would take that spring 2020 with a grain of salt next. This is it's not a great picture for this project, but this is. These are the bathrooms that are in basement of this building they're kind of the only game and not with respective bathrooms. So you know the idea is to bring these up to up to code, to make them accessible. They're kind of you know a relic of the forties when this building was built, so you know just kind of modernizing it that that's all that this project is, we hope we were hoping that it would start in the spring. You know we will determine where you know we can give you updates. You know once construction starts clicking along a little bit more next continuing on the bathroom mmm. This was so this is on the east side of Cadman Plaza, so just to the left, you're looking at this building to the left is a synthetic turf lawn in front of Calvin baza. We brought this to the community board a couple I think, maybe last year it's we're hoping that it can start this fall, but you know again, I would say you know. Probably more realistic is next spring, but we'll see what happens. You know how the procurement gods look upon this project next. So this is the cabin closet. This is the lawn, so there's a lot of work Avenue at Calabaza, War Memorial. This is a project to renovate the lawn. You guys might have seen that the art installation that handball wall was recently removed. That was planned. That was just a temporary installation through I think the public art fund, but anyways. This is a project to update the lighting to redo the paving I. Do not think the bathing has ever been redone in its lifespan. So it's you know a lot of the pavement. The drainage lines underneath are broken and cracked, so this is going to be redoing that fixing some of the sinking and in some of the pavement and make it a little bit more a little bit easier for our operations to get around it and hopefully clear up some of the pedestrian vehicle conflicts with this design. Next, for each part too, and so breach part two is supposed to start this spring. Unfortunately, you know it looks like it will probably be pushed back. You know probably I. We do not have a date for it yet, but we can let you guys know whenever we get that next Fort Greene. This is a this is obviously I. Think you guys are all familiar with this project. I think this one is I, do not know if this is the I think this one. Yes, this is part of the parts without borders package right now, I think this one in them, and probably the are both on hold for the moment. You know as I think the people in the Parks Committee are aware. There's a lot of you know. This project has a lot had a lot of dialogue about it right now, Heights it's being litigated in court, so you know the Parks Department will follow whatever the courts. You know we're taking our cues from the court. So that's where this project is, there's no real update on it. At the moment, thanks yeah same thing with this one, this is kind of the main plaza area now I'm at the bottom. You can see the steps are shown at the bottom right of that image and then that's the plaza heading out to Myrtle next common or berry. So this project is still in designs. The design has been delayed a little bit to do some. You know something we found in the design, we're still figuring out what the right solution for it is. There might be a little bit of a budget shortfall but I think it's something we feel we can. We can resolve without slowing down the project too much, but that's all to tell that we have on this one for now next, so this is kind of encounter, a very that northern phase that the big asphalt, multi- purpose play area. You may hear me say: MPP a that's this area and the playground that we're currently working with the state as and the downtown and other partners in downtown Brooklyn for something called the downtown revitalization initiative. I believe the anarchic acronym is but anyways we're. Looking for the state to fund some of this project. The council member has put other money into this project at the moment you know, but keep in mind it's a twelve million dollar price tag to redo that whole section. This is only 3.2 million. So at the moment it's not really going to do it's not going to do much we're looking for you know whether we can redo some pavement and see how far we can get with 3.2, otherwise we're trying to figure out ways we can scheme about ways to get this blue. This playground redone. Next. This is the building commoner Barry. We have designs to bring this up to code and to make it more accessible. You know it is going to be a men's and women's room. However, you know I just want to say: I know that last time when we talked about the other comfort station, you know this building will be you know, whatever gender, you did, you feel most comfortable using you can use. The main goal of this project is to rework the interior of this building so that we maximize with baseboard users, while also getting enough for the staff that means getting the site they're not going to be locker rooms or anything for the field for the league's sorry to anybody on the on the call that was looking for that. But you know this is dependable, getting it up to code and allowing everybody to use this building next Washington Hall Park, so just acrosss the street from Commodore Barry. You know this is a simple basketball court reconstruction. It's probably it's in the procurement phase. You know, I think this one is probably further back in performing queue. So you know, depending on how LMB feels about registering new projects at this time, I would say that you know this project is probably more likely to begin in 2021, and then you know, obviously a year to complete after whatever day that starts right next I think that might be it yep. That's the last letter. I have David, that's the last time. Okay, does anyone have any questions on that? That's a lot of information I just threw at you. This not unexpected. You know delay in the timeline. So we'll start here with many members and then everybody a chance to ask questions right now. I can't see people raising their hand, Susan Suzanne, you're, muted, hi yeah. You know we might. We may need to reference it Barbara, okay, yeah, David, bridge part 2. So what I heard in general was tell me if I misheard that obviously their delays until the city can figure out the budget impacts from coal bed and have a sort of floats down to Park but Bridge Park-, given that the funding is in place from the Jehovah's Witnesses like is that Ana different you know? Does that create a different circumstance? I think the procurement was meant to be done around now. I do not know Joseph in general, there's impacts to the procurement department or process, but in terms of actually funding the construction. My understanding is the budget is not coming from the city, so perhaps this one can be on a different. Is it impacted by Covid-19 schedules? I think that's true, but I think in the city budget at the moment. So you know I think Columbia's held off doing anything whether they relaxed that in the next couple months or when we give it money. You know: phase 1 gets more established and entering phase 2 everything's kind of up in the air at the moment. So I do not know. Sir know what they're thinking in terms of releasing projects yeah but I mean Yin. We would have started this spring. I do not know if we had any I do not know how far along in the current cycle, it got I, think Chris and Olli. If you can share a link to the capital tracker just so people can reference that-. There was a bit of a take- on procurement as I recall. I, do not remember the specifics, one of my guys they might have had to throw out the first bidder you know, or maybe they did not get the bids. Something like that. I would say that one thing you know if from lessons that we learned from the recession in oh wait where that actually bid prices came down because a lot of private sector work stopped. So you know if there's any sense, silver lining of this. Maybe that could be with, but you know, I would not I think it's. You know we're going to just wait and see what happened yeah for those of you, who've never been on the capital tracker website, Chris Campbell, just shared it. It's a good resource to Steve. Far along projects are moving labra any I had a comment. I noticed that you mentioned that the comfort stations in Cadman Park would be before whoever wanted to use it not necessarily by gender, and we could not seem to get that before and I was wondering what the change was. I mean. I know that's more of a programmatic thing to that part of it, but yeah I apologize if I misspoke there, you know they're still going to be immense in a women's side. Labeled as such on the plan. However, you know we do not have bathroom police we're. You know. However, you identify your you're free to use that bathroom. You know and it is a multi stalled bathroom. So you know by state laws. You know you can use what, whichever stalls or besides you identify work. Okay, thank you, I think any other committee members all right. Anyone who's, not a committee member yeah, hi I, had a question. If you can hear me. No, that's not me. This is a Kevin I'm with the Brooklyn Paper sure yeah hi Davian, you mentioned with the Commodore Barry Park. There was some design issue. Could you say what that what that is or what there was we're? We've done some design testing and we're trying to find what's the condition of the soil, whether we can build on it and whether we can make it I think there was desire from the community to make it match. Filter and we're just trying to figure out what's in that's in the soil, and if it's good enough, where we can, we can build what we need to originally intended boy. Did you have a question? Yes? Are you doing you guys hear me yeah, okay, so I did hear you say that there won't be any locker rooms, anything big look for sports teams at the present time, I have three containers in the park that I maintain and to make sure that really free and keep them very clean. My question is: will there be a location? I dispute, commissioner, is their location and his plans for me to have that same facility. You know, even if it's a mobile facility inside the park and design I believe so I do not see why, but I do not think there would be any reason that we would boot those containers out of the park. We might ask them to be removed temporarily during construction, but I think that the new design calls for this Chris and I can follow up with you and just to confirm as well. Thank you yeah. Any other questions from non committee members all right so I think at this point we can take down this display and now that we have it I assume we can share it. Among the committee, Oh David you'd be okay, with that yeah among the committee would be fine, yeah I would say. Barbara I would just say that you know we're listing a lot of dates there and a lot of the dates are going to change. So you know all of that. Just take you with a grain of salt that it's going to be. Those dates are probably not going to be accurate in a couple of months from now. We've all been affected by that unfortunately, but thank you so much I really appreciate it and give our regards to Marty. We know how busy everyone is, and the parks have been a wonderful respite during this time it just it's so great to be able to go out and enjoy just being walking through a park yeah very fortunate well day, and thank you guys for being advocates. I think you know. We realized that you know in the absence of music venues and bars, and all the other activities that make New York City great, you know, parks are the only game in town. So thank you guys for sticking with this with us. Through this, you know in any way that you guys can keep advocating. You know we appreciate it. You know whether it's for more funding in capital or expense money. You know I'd also say you know like going into the summer. You know our staffing numbers have been hit pretty badly. So what that's going to mean? Is it's going to mean more garbage in parks? It's going to mean more weeds and gardens more. You know both the grass is going to get longer because it's going to be less frequently we mowed. You know these are the types of things that how I think the budget cuts will start manifesting themselves in your neighborhoods, so just be mindful of that, and obviously we're doing the best that we can. If there's any way, we can be more responsive. Just let me know, and we can work with you guys, I'm trying please reach out to us. If there's anything, the committee can do to help you. So thank you. As always, you're welcome to stay now. Look at the need statement or, if you need to leave, we understand that. So at this point taya, can we take this down. Barbara I am sorry to report that since Davey first stopped speaking, we've all been trying to get rid of individual. No, it does not seem to be working. However, the recording is still going and we can still see you talking, so we will continue to try to close this window. Somehow, okay, let's say I can't see myself there we go. Thank you know now that we I realized. We should have also put up here the statement of community district needs and that would make it easy to go through it as we do that. But this is the part of the meeting where we're going to turn and look at the annual update. Rather, the look at this statement of community needs, so I hope people have looked at it. I'm open to changes or do we need to remove anything I have something I'd like to add when we get so is there anyone who wants to start that discussion right? Okay, I can't see you but go ahead right in the other section age 23 the question: first, you speak up a little bit, no okay, calling about talking about the other. Why? What is this? Listen all the others called other I. Do not quite understand that as a section head rock. So then going on in the paragraph just a couple of the draft, the theater line from the bottom of that paragraph. That starts with lists of its facilities at the end that line I'm. Sorry, are you talking about the paragraph on needs for parks, the no, the under other you're, still under other okay support lines in the bottom under other? It's the it's the line that starts with lists of its facilities and ends with start de, and that should be start by I, think, yes, sure, okay and then two lines down which start with Commodore Barry end with member. Should that be members, if the bread, the borough, President Council members to sure, okay and then I wonder in that second life from the bottom, where it's the full sentences starts with the result, is often deferred maintenance? Do we want to make it long deferred maintenance, since so much of this takes so long, I do not know if the emphasis is necessary, but that's a question anything and in the needs for parts session, section three lines down from the top starting with he talked about the southern portion of Clinton Hill. In this section on page twenty five we talked about the eastern portion, which is it that has scared. We there's no dispute about Boerum Hill. Is it the southern part of Hill or the eastern part of Clinton Hill just to conform whatever side this on with a age of twenty five in one of the assets, you are not going. Third, like third line firms which do you think it is, should be. Oh I do not know. I do not live in Fort Greene, Boram, Hillis, Sun and West. Note that of Clinton L. Pardon me Boerum Hill is south and West. Oh yeah, no we're not defining it! That way. It's the next group, it's hell, Linton Hill this and it's either the southern portion of Clinton Hill. As stated on page 23 in the needs for parks, section or Carol Anne said it's the eastern Extreme on the southern edge. How do we conform? One of the two? We only used one word, eastern or southern, in each of the descriptions. Let's we want to add Carol Ann's language that that'll make it clear her. But just the way it's written here is that we've said that it's the eastern part of Clinton Hill on page 25 in the southern part of a tree. Well, it sounds to me I'm doing what it's a turn. Southern would be. The more purchase, choosing one- third southern would be more appropriate Carolyn. Well, thank you. Caroline, your muted, okay, so or would just again highlight that all resolution, and then we can move on it's literally. So, on the end of the district on the eastern edge, it is the southern edge as well. So not the southeast would be a proper southeast portion how's that okay, that's fine, that seems accurate, southies, okay, anything else, Dwight and yeah in this section did on the page, twenty four, the heading of needs or community boards is, it needs for community board space instance talking about. Is it her new office space and it's not it's? This is all related to community Board truth. So it's Community board in any event, and the question is it needs for Community Board office space again for thirty purposes in other word, I do not I've read that section, but I do not have it in front of me. You're saying section really just feels right. The section called needs for community boards is references only the need for office space, a community board too, so the heading I'm suggesting ought to be need. Each for Community Board office, a community board to office space, our community board space. Can everyone hear me? Yes, so tackling the last question and the first question what I think a lot of people do not realize is that these headings there are specific sort of buckets. If you will, where you can put in content, either narrative for budget priorities and those are predetermined for us by the by the system itself, so he is heading and we have no control over. Similarly, going back to your first question right, you said: why does why does it say other at the at the top I'm because and I'm? Sorry, there are different subheadings that could be put at as the most important issue, your request or the community boards request does not fit into any of those specific titled buckets, and so many questions other the bucket that slept over I just want to say thank you, I think we're going to we're going to take off. So if you have any questions, just feel free to reach out to me and I'm happy to respond the best we can. Thank you. Thank you, everybody. They say it's the issue of the location of the district office still a matter of still pending or has it is it that we're just going to stay where we are well Lynnie Singletary and when Jordan met with a Deputy Commissioner from PCAST from the citywide administrative services? Is the city's real estate agent, if you will and very generous of them to schedule a meeting with someone, Frank I, think Lenny and Lamb burger comments a little more optimistically I did you know one of the big takeaways is that whenever Dee cast is looking for space in downtown find boss a real barrier that they have trouble surmounted, they think that will police on 350, J Street is up in a few years and there may be a lot of moving around at that time with potentially Community board to damn, but that's a few years away on the board. Yes, thank you wait. Did you have something else, I think you said? No does anyone else have something I do this? Is Lenny 1110 again on page 25, there's a the second item, creating grading and drainage plan to address erosion problems in Fort, Greene Park the other day when I took that walk that I told you about Bob, please just it was just after maybe a 15:20 minute rain, thunder story, confirmed and I walked up from the stairs at St.. Edward's place said Abel Street up and passed the hospital on that path. That path is badly broken up and it was puddled or that there were countless numbers of puddles. No other path had any puddling problem, so there's a there's, a real need for leveling and repaving. There also Saint Edward Street itself, but I learned by one of the big head gardener actually in the clock. Max Webb tells me that the street, the sidewalk in front of what looks like in front of a car, is really controlled by the park and that Street is very badly broken up and it's a hazard, the kids people pushing baby carriages, there's a rehab, an old- age home directly acrosss the street over there. So it's obviously not safe for those people and I. Think that should be also on those priorities is probably added to it. I mean to write it clearly. I think we should check what's already included another stroke support. There are two: there are three phases of perimeter and pathway and image work. First phase is completed, the other two may be politically and a lot of community discourse that was a useless euphemism for there's an ongoing lawsuit yeah is holding up, but he showed he showed that when this woman showed the work areas, that Lenny is talking about. The comment that the sidewalks immediately adjacent to apart are the parks departments. Responsibility is a Rexton. Did you retreat? It is one a correct statement. Okay, thank you. Sir. Is there a way any way of expediting that court action? So there's a question true in this climate, in any other climate, though, because this has been going on for a while could be a banner in the future anyway, a lawsuit is to settle it. So if you know of a way to settle it, that would expedite it. I can't answer that sure that comes off and can I just clarify for the minutes. Lenny you're, just affirming that the drainage issue should stay on the list. I have one. Why had two one was removing the tennis courts so we're aligned on that? Okay, you may have my other one as well so Golconda skate park. That's my other one. Oh I think I need a little guidance in terms of capital versus expense. There's a drainage issue there as well I do not even know if that's in a as to whether thought we should concentrate on the need to winterize the bathrooms. That sounds to me like a big- ticket item. That would be a capital yeah. That's good, Barbara! That's good I'm with you on that! Okay! So that's as the person taking the minutes you can put in there, we want to add upgrade of Golconda skateboard part to winterize know you can I'm just asking yeah. There are bathrooms in that skate park. Yes, but they're, not in the width they're, not really for wintertime and the park is except obviously now the park is closed, but otherwise it's used year- round yeah. So the bathrooms are closed. They're closed in the winter, because they're not winter ice right we discuss where that would be placed on the list. Well, the rankings are done by commune only by all the Volga welcome, and at least then, when the process works right, it's done by mode of all board members. Last year we just carried over the rankings from the previous year because so few board members part we could put this one in. Instead, it's not that simple. Okay, it's earth, it's more democratic! How about that? Okay or any anything else? Suzanne I! Do not there's a resurfacing issue in that park. Barbara remember, I, do not know that needs this list. I mean there was yeah, I. Think probably not I. Think that's the one for this list, as you said, I think anyone else have some comments about this and I had an observation. Sure and I do not want people to overreact to this, but in my previous job, I allocated about eight and a half capital funds for parks every year and I have lived through, what's known as the program to eliminate egg. You know Davey said they do not know. What's going to happen, but there is a very real chance that some projects will just disappear entirely as the entire capital budget. On page three of 22, which talks about Commodore, Barry I, think it would be filled, but I think it would be, especially after what we heard earlier tonight funded. It does sort of say you know what it does. The first sentence really does address, obtain additional funds, so I do not think we have to add I hope it's clear that we do not want funding just for the field, which tonight was the first time we heard they may not have sufficient funding for the field. Let's know what I heard problems, but I will say that my divided between meeting itself and sort of the technology of the meeting but I think that the area where funding is perhaps a little weak is the playground area of north right but the but the playing fields themselves. I could very much people because I was surprised to hear it because I thought it was fully funded. But maybe if they identify this problem- and it is a problem- then maybe they will need more funding, I do not think we have anybody else. Have anything why I was just robbed. Just in response to what you've noted about you know the budgets, obviously being impacted coming out of Covid-19 I mean that makes total sense. You know, I, just I, think it's important that hot items on the list it may take longer in more years for the items to get attended to, but that's why I he's going over yeah, no I'm, not overreacting yeah like it feels to me like Commodore Barry. You know part of why it eventually got done. I'm sure there were other reasons, but part of. Why was because it was on this list for a really long time, making its way up so and I'm happy. We also made a number of statements and I think this is the other statement that White pointed out earlier. We have projects of this side. You really need to convince we're as mayor that they need to put much behind because you know smaller projects. The borough president, the local council member, they can each chip in get it done, but when you're talking about a project, it's 10:15 20 million dollars, I have to have the mayor 29:13 of 22 towards the bottom. We also need to correct they're the same one. Other thing I noticed a lot of is Lenny Levington again, I noticed a lot of comments. A lot of categories throughout this list have to do with racking the station problems necessarily in the park, said notice, they're also in the commercial areas and when we discussed it a while ago and I mentioned having those stainless, galvanized stainless steel cans. They're very cheap is the best word of use, economical, they're, cheap at 20 or 25 dollars, each for a$ 31 gallon can and if it could be just suggested or recommended to businesses up and down the streets in the commercial areas or any areas that may fall into public domain. To put these plans out there, it's a simple solution to urge these people to check into it's called Barron's Beh E and s is the company I do not work for them. I do not get any money for them. It was just a good product that they Walker put in him in his Park and is working out very well. So if it's, if these business people can be urged to look into it, it's for their own good as well as everybody else early. Obviously it could go a long way to solving this problem. So one that's a comment. I have because I see in many of these lines right infestation, problems here rather than station problems in other places, I mean that's my two cents on this. So all right we're going to turn to again I can't see who still are not. Well, not my picture. I can't see who's still on. Here we turn to community forum. I am right on track at the moment. I hope we stay that way to finish up by 8 o'clock, but a community forum does anyone who's, not a committee member have something they want to share. That brings us to the minutes. The first thing, I noticed, looks like where it says: committee Members, Present Committee has three T's in it-. That is incredible. Catch Oh. What Thank, You Barbara I'm someone who's been made fun of for using a ruler to read through documents so and I certainly did not see. That looks like else all right, so I'm going to assume welcome everyone, and you have delighted I- was that we're happy meeting we have not met since March or no I think was. We have not met. That was one of the first things that got cancelled was our March meeting during this crisis. It's really their business I. Think then, we've gotten through here with little glitches and did you make it onto the call I know you were here at least part of the time, but we'll have to work on that with Andrea, and so I am delighted to see everybody, even if it's this way, rather than in person and I'd love to think back in September I mean going forward to September that we'll be meeting in person, but there are no guarantees at the moment. As we heard Davey say you have to be flexible and things change by the day, so we may be doing it this way again. So, but what you could do is start thinking about topics for on the fall while ways looking for new topics and I. Think Suzanne and I have an idea of at least one topic has to do with the skateboarding. Park. Have them come in and talk to us? Hopefully that will happen, and so I at this point will entertain a motion to Adjourn and just a shaking her head, I assume she's. We have a second Oh Carolyn. Okay with that again, hey I, want to thank you pulling this off and putting up the graphics that was wonderful and I hope everyone stays safe and take care. You stay safe. Everyone. Thank you.",
            "summary": "If people can see you at the time, you're speaking so I will let you know when topics are open for comment by Committee, Members, Board members and the general public, if you, as you, know, we're doing this through WebEx. If you have questions that do not get her during our public comment.\nIf you require any accommodation or assistance or you know of anyone who needs those things for full participation, please contact the district office at least 72 hours before any public meeting takes place.\nNot only is she great, but she is very highly skilled when it comes to technology, so Taya Mueller is our new liaison working with the with the Parks Committee Caroline Church has done a phenomenal job.\nI'm, always delighted to have people from the parks Department here I think we work closely with them.\nThe topic is capital projects in general, but I think your focus is going to be on Commodore Barry Park, which is something that's very dear to everybody's heart on this committee and put a lot of focus on it and as well as the other Park, so I'm going to turn it over to you Davy, and thank you again for being here great Thank, You Barbara and thank you thank you.\nYou I did not think to ask beforehand, but hey I may have whether you have a PowerPoint I , do not know how I have a PowerPoint for the capital Ah, okay, so I can figure that out, but I just want to maybe go through the Covid-19 response.\nUsers and the safety of our staff, as you know, members of the community that also service parks and help maintain that.\nSo, you know initially when people needed to stay home because of childcare, issues.\nYou know I, think in the interest of safety, we've had to close a lot of parks, amenities and I You know from the event perspective.\nThis thing is changing everyday, but what I can recommend is if you're thinking about it, get your permit in and if you have any question, Nancy and her staff are amazing in the permit office, so Nancy Jose, Joe Darnell, all those guys can help you out so feel free to give them a call Nancy's in the office, most day.\nThe last thing I'll say that community gardens have been closed, but what we've been allowing through our green thumb program is for some people to you know for a kind of the minimal amount of maintenance to happen in order to keep these Gardens alive and well so green thumb gardens are closed, but You know some maintenance can take place.\nYou can work with Dave, Barker I think he's starting some of these programs up as well, but for the most part, it's just very small, kinda self, sufficient volunteer groups are allowed to come back from the park.\nCan, you share sort of the dynamics behind that, and you know the suggestions that I've heard have been proactive, like people should take their own garbage out so which exists in a lot of parks.\nYeah I think we've had a lot of success with that Now that Suzanne's question was a little bit about the garbage.\nYou touched on not having a seasonal stab, but with all of like the protests and the March that are happening, a lot of them start or end in our district, like a cabbie Plaza or tree park.\nThe organizers, I, think, are dealing directly with the police with respect to the trash, and you know that just comes from any large gathering of people.\nWe are just kind of where we're just being cognizant of the event and trying to send our people back out once the event has cleared out so like admin once they go, acrosss the bridge or for once they come down You know, and you know, and definitely trying to try to keep in the park as the best of the clean.\nIf there was something I think in Manhattan, where you know I, think Park staff kind of did not read the room in terms of you know what was what was kind of more of a money from the temporary monument or lunch See , those like white ghost bikes around the city, so some of them They see something that has a little bit work here, put into it to just kind of check to make sure before they just remove it.\nWe do not have any plan at the moment to open up the large pavement area, but I wish I had a better answer for you, but at the moment there's no point: Are you trying to envision Carroll Park, because I have been there Anyone with authority been on a site visit of Bridge Park to because it appears like there's a like very tall, serious metal gate that could separate the two so to the right to what seemed to be a reason why it could I just wonder if it's actually been closely looked at or if it was just sort of you know, part of it, especially since the park is going to be renovated.\nIs there any plan to put social distancing markers in any of the areas where people are gathering Obviously the huge issue with Domino Park Yeah, not in our district, but that you know they had introduced the social distinct circles.\nYou know I, think there's a bit of an enforcement issue with respect to like mulling circles in it.\nYou know if you have suggestions, we're open to them and we can listen to them, but nothing's planned for at the moment, I think.\nI think one conception that people have is that you know you just need to get the guys to the site.\nI think the timeline is even more delayed and You know we're looking at projects that we're supposed to start in the spring, getting pushed back to late summer or even into the fall, if not sometime, in 2021, because you know some of these projects made it through the procurement cycle to the point where they were bid out and they and we had a contractor on board ready to go.\nWe've had a lot of issues with trash collection, which was a tough one for us to work out when the Park first opened so well.\nSo you know just kind of modernizing it that that's all that this project is You know once construction starts clicking along a little bit more next.\nWe brought this to the community board a couple I think, maybe last year it's we're hoping that it can start this fall.\nYou know as I think the people in the Parks Committee are aware.\nWhat I heard in general was tell me if I misheard that obviously their delays until the city can figure out the budget impacts from coal bed and have a sort of floats down to Park, but Bridge Park, Given that the funding is in place from the Jehovah's Witnesses like is that Ana different you know?\nWe might ask them to be removed temporarily during construction, but I think that the new design calls for this Chris Any other questions from non committee.\nYou know these are the types of things that how I think the budget cuts will start manifesting themselves in your neighborhoods, so just be mindful of that, and obviously we're doing the best that we can.\nLet me know, and we can work with you, guys, I'm, trying please reach out to us.\nSo, but what you could do is start thinking about topics for on the fall while ways looking for new topics and I."
        }
    }
}