{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB8",
            "channelId": "https://www.youtube.com/channel/UCQTI0s1zVv3FN6s7ujr-oVg",
            "title": "Housing (Advocacy) Committee Meeting Oct 14",
            "publishDate": "2020-10-15",
            "shortDescription": "",
            "lengthSeconds": "1:28:20"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB8",
            "normalizedName": "Brooklyn Community Board 8",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 8",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPsRKFds5RmAx05fqHLE66g",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "vpA4oUto87c",
            "fillerWordCount": {
                "uh": 92,
                "um": 166
            },
            "readTimeFullTranscript": "38 min read",
            "readTimeSummary": "5 min read",
            "wordCountFullTranscript": {
                "rent": 26,
                "tax": 23,
                "state": 21,
                "housing": 16,
                "eviction": 15,
                "property": 15,
                "land": 15,
                "moratorium": 14,
                "properties": 14,
                "lien": 12
            },
            "wordCountSummary": {
                "tax": 6,
                "state": 6,
                "housing": 6,
                "budget": 5,
                "moratorium": 5,
                "lien": 4,
                "land": 4,
                "rent": 4,
                "sale": 3,
                "property": 3
            },
            "fullTranscript": "Hi Adam Hi Miss Granville. How are you I'm good now that I'm in I'm good yeah? It took me a few minutes. I do not know what first time it was not letting me it told me I needed some sort of a password or something I called Julia. She said, oh no, you do not need that in my defense. The meeting did not start until 606 as I was trying to prepare dinner, which did not work but okay. Julia do you have birds? I do and they are just being a nuisance, so I'm going to be muted as much as possible. So Adam, I see two other people, but I do not see their faces. It's possible they're, waiting till the meeting to start or okay, I'm ready, I'm just keeping a log of who's. Here, though, the meeting is going to if everyone can hear me or the meeting was going to start at 6:15, so I understand that we're going to have a presentation from HPD tonight. Oh really, okay, no presentation, just an announcement, no presentation announcement, I'm sorry! I put it wrong, but they're going to speak and tell us about a future informational, meeting[ Applause] good evening we're going to wait a few more minutes to get started, because I guess some people have not come back to their screens yet huh, yes, foreign. I see we have 12 participants so far. Thank you for being on time. This is Ms Granville, the chairperson of the Housing advocacy committee. You, okay, Mischief. Sorry, I think, I'm you know I'm coming, I'm going to switch off a car. Is there anyone on from HPD? Yes hi? This is catherine tavares from Hpp and I'm joined here by Addison waters as well. Okay, nice to have you! I understand that you all have an announcement for us. Yes and I'm sorry. I have no visual I'm at the office and I do not have a camera, but it's lovely to see you all so. First, thank you for letting us have a few minutes of your meeting for this announcement. We wanted to. Let you all know that the internet, interactive website for Bergen and Dean is now live, as you may recall, from a few months ago, when we almost started community engagement, pre- covet these sites were a part of an nwbe RFP for round two, and they also have a senior's first commitment. So we invite you to log on to the website to learn a little bit more about that the sites and the RFP process itself. I will drop the link in the chat. We do not want to take up too much of your time since we're not in on the agenda. So I invite everyone to to visit that link, and then we also invite you to a kickoff meeting, we'll be hosting next week. Where we'll talk about all of that information, I just mentioned, plus our strategies for community engagement and we'll end with a question and answering period. So, even though we can't take your questions now, please do rsvp and let us know what you would want to hear more about I'll drop, a couple more links and a phone number where you can. If you're, not the speaker, can you please keep your computer on mute? Thank you. Okay, thank you for that. So I'm dropping in an email address where you can feel free to email, us any questions or feedback. You have and a phone number where you can leave us a message or text us any questions or feedback you have and then I'm just lasting two more links. We would love for you all to rcvp to the Kickoff meeting next week and if you want to sign up for updates and stay really up to date on everything feel free to use. The second link to do just that and that is it on the HPD end. Thank you so much Ms Granville for giving us a few minutes. Can you just tell us exactly what date that meeting will be? Yes, October 1st at 6:30, P.M, October, 21st? Okay! So that's next Wednesday all right! Thank you! Thank you so much, but we will drop off your meeting and let you resume okay. Thank you! So much for taking the time to give us that information. Yes, thank you and we hope to see you there. Next week, bye now committee members you'll have to forgive me that I did not do an agenda ahead of time, but one of the things I would like to discuss for us. We have pretty much found through the executive committee that we do not have to meet every single month, so we will probably meet again in November and if there is not a need to meet in December, we probably won't, but you guys can. Let me know if you think a meeting every single month is necessary. I do not think that it will be we're going to talk about what we would like to do during this coming year we had before the pandemic talked about doing a workshop because we had one a year before, but it did not quite gel because of everything that was going on with the pandemic. So if you think that it would be useful for us to organize a workshop, we can work on that. If you have any proposals for legislation that you think would be helpful to renters. In view of everything that has gone on, you can. Let me know that if that's something you think it would be useful for us to work on. The other thing I'm concerned about is the effect of Covid-19 on the new laws that were passed the year before, because we keep hearing that there's a moratorium on evictions, but then we hear that there is one, but there is not one Sarah. You want to speak. Oh no, I was just making that gesture to say the eviction moratorium is not really in effect anymore, yeah. Okay, oh sorry, just one other, so I had written the draft letter for the Community board regarding the regarding the tax lien sales that miss Tayas had asked me to write, and so I have a draft. It's just in a Google doc form. I do not know. If that's something that our committee would have time to discuss this evening, I mean I could even just read what I have, or you know, share the link so that people can edit it add, notes or comments to it. Is that something that could fit into this meeting, or I think you can read it and then you could send it out and everybody could look at it and make their comments if they have any comments to make right away. They could do that. Thank you so much for preparing that draft yeah. So you can read it. Okay, oh did you want me to do that now? Yes, please, okay, yeah, so it's a Google doc form, so anybody who wants to help edit. It is of course welcome to do so you're able to do that inside of the document itself. So I'm just getting the link, so I can share it. Okay link and I'm putting the link in the chat. Okay, let's see, I do not think anybody here is just on the phone okay, but I do not know if everybody here at the meeting is aware of the tax lien sale. Oh hi Miss Tiath, so the the tax lien sale is something that usually happens every year for properties that are either have property tax arrears or they have unpaid water bills or it could be because of unpaid charges or fines related to HPD violations or the was it alternative. Enforcement program and people have talked about asking the city to continue to po, to postpone this tax lien sale because there's a fear that it could lead to people losing their homes through foreclosure because of the crisis. So in any case the document is there and I can read it aloud. This is my first time writing a letter representing a community board. So any comments are welcome. So dear whoever this is going to we, the members of Brooklyn community board 8, are writing to you regarding the city's tax lien sales tls, which have been delayed this year by the governor's executive order, but are scheduled to resume November 3rd. We are concerned about the effect that resuming tls will have on our community, which has been severely affected not only by the Covid-19 health crisis, but also by the resultant economic crisis. Resuming tls under normal conditions will exacerbate the destabilizing effects of these twin crises on the homes of both homeowners and tenants, and for this reason we urge the city Council to take swift action. First, tax lien sales for class 1 residential buildings 1 to 3 units on the current tls list, especially if owner occupied, should be suspended until the end of the Covid-19 related state of emergency. Second, this is more of a question. Some people are saying that they think this city council should not reauthorize this law at all. It expires at the end of the year. I do not know what the community board would want to do. Okay, it's just in there is a question, and then third, we also urge the council to embrace alternative long- term solutions for delinquent or distressed properties, namely community land. Okay, yeah community district 8 has 204 properties on the tls list. Out of the 204. 92 are class 1 residential buildings 1 to 3 units, 52 of which are on the list solely because of water debt, while the percentage of tls that lead to an eventual foreclosure has historically been low, it's actually like around one and a half percent in part because of the city programs in place to aid homeowners in distress and the various exemptions available. We believe that a percentage of the tls sales that lead to foreclosures would likely go up as a result of the current crisis. We must also take into consideration that these same properties are already at increased risk of deed theft and harassment by unscrupulous actors and seniors, who might otherwise be exempt from the tax, liens or DEP. Liens may nonetheless end up fighting off displacement. Proceeding with these sales at this time would be unconscionable. We do understand that the city is going through a budget crisis receiving far less from the state and federal governments than needed, and the revenue brought in by property taxes will be especially important. The city's own report on Tls from 2016 explains that the purpose of tls is not selling liens, but rather incentivizing property owners to pay their taxes on time and ensuring that all taxpayers pay their fair share for municipal services, and we appreciate the fact that voluntary compliance with property tax law has increased since the law's passage. The policy does not, however, address the unintended consequences regarding deed theft, nor the exceptional economic and health- related circumstances in which the city finds itself today, if Tls must resume, and if the council chooses to reauthorize the law before its sun sets, we urge the council to take into consideration the type of property, as well as the type of lien on the property. As a point of comparison, multi- family apartment buildings represent 82 of the 204 buildings in our district on the tls list and of those 82 only 25 are there only for water gut the larger buildings, more likely to be investment properties may be on the list for a combination of water, debt, property, tax arrears and charges related to HPD, emergency repairs or the alternative enforcement program. Those hppd related liens would necessarily predate the Covid-19 crisis and the tls policies. Intervention may be necessary to ensure that the proper property owner fulfills their legal responsibility to maintain safe conditions for their tenants. Beyond the immediate question of the current tls list and imminent expiration of the executive order, we believe the council should work now on implementing the aforementioned alternative long- term solutions for delinquent or distressed properties, steering them towards community land trust could prevent small properties from becoming targets for deed thieves or large ones, from becoming targets for Wall Street speculators. Furthermore, canadian land trust could relieve small homeowners who are no longer able to shoulder the sole burdens of maintaining their homes, while also ensuring that they and their tenants homes remain affordable and then I'm not sure how one usually closes the cba letter. But thank you so much. Thank you and I'm sure that everyone that's listening. If you have a comment, you will contribute to the letter, and I thought I saw Mr Melkistein's hand. Did you have something to say was just giving the thumbs up. I thought it was very well, okay, all right. So I thank you so much for working on that, and does our chair of the board have any comments that you want to make at this point? Ethel, I'm not hearing her sorry, okay, when I thank you, Sarah Lazar for doing this. It's very rare that people step up to participate in the tasks that we assume the volunteers with the Community board. Excuse me in my mind's eye. These are once this letter goes out. We want to copy the independent budget office and ask them to go over the numbers for the past few years and tell us if the city only adds to which shelter costs burden by forcing evictions through this tax lien sale process. That's one thing that I want to add to that and another letter that I've been mulling over with asking DCP and the mayor to change the affordability marker from 30 percent went to 25. We need to know about unintended consequences. We need to look at the consequences here and driving people out of their homes and into shelters is one. So if we can narrow down the target for this esque to one in two family homes, that would be great urinal the analysis of what's on the current list, the one to three family homes is a little bit over really concerned with the smaller cup owner, but I'm working we'll, let's all work together. My ideas should not be the only ideas on the table, so those are the two things I would. I would ask, would prepare the audience for as we go forward. This letter would go out under my name on board letterhead, so you would get a final copy and free form not on letterhead, but Ms George will assure us all that this is a one that's going out and again we need to make sure that it's going to the Mayor City Council Department of Finance, commissioner and the Ibo independent budget office. We want to ask them to put this idea up as a study to see if we're saving money by putting because that would really sell it. Thank you. Could I just say so the one to three. The reason I put one to three was just because it the two: it was the distinction that the list used for the two different tax classes and understand: that's what was there? It's an easy grab. That's the way they classify it and it would take some work to peel off that the three families. I understand that thank you. Yes, Mr Callahan yeah. This is sort of a tangential just because we're talking about the tax, lien trusts, Mr Todd- and I have both been directly acquainted with this problem, because our community garden, imani community garden, had the center of the garden stolen by the tax, lien trust process and subsequently, the developer, who who took the who bought it from the developer, has let his own property taxes go into collections and he's actually in the tax Lien trust from the prior year. I this is something that I do not know that this is going to be a separate issue, but we as a garden are trying to think about what to do about retrieving our land from someone who has been delinquent and I'm not sure that there is a remediation process that exists and if anyone has any sort of insight into that or something that we can think about going forward. That would be really helpful. Just to just a spot. Mr Todd see Mr Todd, you're great you're, muted Greg. I unmuted him. Oh okay, is he still not muted, I'm not here right, Mr side, I'm not sure that your headphones are working properly. The Microphonia headphones are working properly. I'm not here right now we see your mouth moving, but we do not hear you Mr Todd, you put it in the chat, greg yeah, his headphones are not working. We got bent. Okay, we just heard you is that better much better? We did not hear what you said before now. We do not hear him again. Can you hear me now? We can't all right good. I think I think I kicked my headphone out of frustration like could not get in the meeting. Anyways been doing this 30 years. The problem with the tax lien sale is it's totally weighted towards the private sector prior to the tax lien sale being implemented under Giuliani. We have what we call in rem proceedings whereby the city took directly into their own portfolio, delinquent properties which gave them control over said properties and to dispose of them at their leisure, as opposed to the leisure of a bunch of rich guys in Greenwich Connecticut, which is where the tax Lien Fund is based. My knowledge case in point: we acquired a property on sterling place, bec new communities and local non- profit, housing developer and the family complained to then a state assembly member clarence Norman. He was able to push through both state Senate and State Assembly, a bill that took the property back from bec and gave it to the previous owner. So an analogy directly here: if the state or the city were the owner of that middle lot, they could, at their discretion, give it back to the community, but with tax liens. Now it goes to the separate entity that could care less about anything or a bunch of bunch of rich tax, hedge fund dudes, and they have actually no interest in the city or our problems or anything else. We just basically offshored all of these properties and lose control of them. So this is a really deep problem. Goes back to the Giuliani privatization, the old idea that the Capitalist free economy is the smartest way to go that cities are dumb and stupid and should not have owned any properties because they just ruined them. This is the thinking that's behind all this and we're kind of like tilling at windmills until we get at the real problem. It's this idea of the city losing control of its own properties and being held by rich people who live outside the city, and this is this is a real problem that we need to address, and you know until we can figure that out we're just going to be kind of spinning our wheels. I think thank you thanks for giving us the history and the so- called logic behind what they're doing now. Yes, princess. Okay, I'm hearing about three family. Okay, I know I I'm hearing the difference between Landlord and Homeowner, I'm a homeowner. I I'm also Homeowner, and I'm also on three families apartment Bill Department, but when they did the moratorium on not paying rent, what people are not saying that people with two or three families formed were caught up in that too, the tenant did not pay the rent like. I am one of those landlords that my tenants are not paying. So when people are calling for moratorium, it affects us too, with these small these same two and three family homes we're speaking about now, it did affect us and it still is affecting us because in what my building, I have not received any rent from my tenants for months now, but I still have to pay my mortgage. I still have it's getting clear. I still have to give them life. I still have to give them water, so I can be one of those people where all taxes and a multitude of things- and not because I do not want to pay because my tenants are not paying and those are things I think need to be addressed because we are lumped into with all these multi multi- apartments landlords and we are not, and we I lived in this community as everybody knows. So. That's all I need to say so you know. So something needs to be done and thank you Sarah for that letter and guess what? If there's one thing I would join and get on board to help. You do is that, because I know it's affecting me as a homeowner. Okay, I was wondering: is it all right if I go ahead or yes ma'am? So I was contemplating whether or not in the letter to bring up the to bring up the state bills that have to do with what Ms Ben James was just talking about. The Zelner Myrie's eviction, moratorium bill and Julius Alazar's cancel rent bill because those are things that would actually change the dynamics, because the two of them together would actually like the eviction moratorium bill is also a foreclosure moratorium bill. It's just not getting called that and then the canceled rent bill not only cancels rent, but you do not, but it also, it would also bail out all of the small homeowners for the entirety of the lost rental income. So yeah it's the kind of thing that would completely change the it would change the economic situation of any homeowner of any like small homeowner like one to three unit or even one to six unit, probably, but it seemed like it did not make sense in this particular letter to get into the possibilities of state legislature or state legislation. So, but I do not know if it made sense to bring it up at that point after would it make sense to have two separate letters, one for that purpose and then the other one that she had originally worked on. If I may, I would recommend one letter addressed to both decision makers, both the state and the city, because there's a shared expense there, okay, yeah the state, the state has some authority over the levy, property taxes in the city again, one of the things. I hope this is a close look at the trade- offs with the bosses and the gains as princes are, is going to be hurt in the process if it's not well thought out and carefully executed. So that's one thing that we need to look at as far as Amani garden and other similar community gardens. There's the Brooklyn queen's land, trust, which I think you gardeners are probably familiar with nod your head. If you are okay, so they could be a champion in some instances, then there's the local initiative, support corporations with the aid of the New York lawyers in the public interest that I'm sure we could help us set up some sort of arbitration forum to deal with the Lien certificate holders, try to swoop in and get the deed to the property for a little bit of back taxes. That's, oh, that's been one of the problems with this process, so these are tactics that we can look at as a group and reach out to these champions. If I may call on that to Lisk and lawyers in the public interest to help us set up some sort of arbitration with lean holders from past sales and also work with the current legislature to reformat iteration is open. Thank you is that you, I think it's you. Do you have two screens open yeah. It looks like you're in twice it seems like oh yeah, okay, that should do it. I think, hopefully that was something else. In any case, I just thank you. Everyone, for you know, hearing out the letter and again it's a google doc. So if you have ideas, edits, etc it's there, and I welcome everyone to put their input as they see fit, and there are also some notes after a page break. Thank you, okay. I do not have anything else to add on the letter for the time being: oh Ms Granville. We do not hear you johnny, you're, muted. Unfortunately, in order to spare everyone's ears, I am going to have to mute any areas where the interference is coming in Miss Granville. You are listed as having two screens open. If you can figure out what the second screen is, which does not have your image and close that might resolve all of the other interference issues back on. Can you hear me miss Bravo? If I can just make a suggestion of a minor inconvenience for you, if you could just leave the room and then come back in, maybe that will resolve it entirely? Is it possible for Miss Granville to log off and then log back in you think that would fix it? Yeah I mean the problem is Mr involves that you have two screens open. So until that's fixed it's just going to keep happening. Oh wait, one only one closed. Okay, you should be all right, unmute yourself. I think you should be okay, this better! Yes, okay, I'm glad sorry about that. Allow your immunity to get! Oh sorry! Go ahead. I think we've discussed the letter thoroughly. So I wanted to find out from you all if there were any other particular projects you wanted to work on this year. I started out by talking about the fact that, before the pandemic, we were considering trying to organize another workshop, which is something we had done the year before. So I want to hear what it is that you would like for the committee to work on during this coming year. Yes, there, oh gosh, I there are so many things. I would like the committee to work on that. I do feel like there could be. You know, even though, eventually the Covid-19, I do not know the pandemic crisis is going to eventually come to an end. It's hard to know when exactly and I feel like there's a lot of confusion everywhere about you know the state of the eviction moratorium. You know the various different protections that are available to people and it just seems like every I think I sent out an email to the. I tried to send it to the land, use and housing committees just filling in some details about the state of the eviction moratorium and the very next day there was. I guess that was today. There was a notice from the Department of Investigation, giving instructions to the marshals, and so it's like every day. There's a new development, and I do not know if it feels like part of what the community board is best able to do- is to communicate things and to answer people's questions. You know popular education, so I imagine that getting the word out about these things would be important and probably continue to be important, because there are many people who are just confused yeah and additionally, so I have been involved with the Brooklyn eviction defense network and, while you know eviction, new eviction filings have been on hold for many, there are going to be new. There are going to be a lot more filings now that the moratorium has ended, it'll be slow, but the quantity is going to be great and there are also changes in terms of right to counsel being expanded. So there are just likely to be a lot of people with need for information about these particular issues. You know how exactly does an eviction case work in housing court? What to expect what resources are available to people? Those are just some thoughts that I have thank you. I thought I saw Greg's hand yeah. I agree with Sarah. I mean, I think, we're there's massive confusion now, because there's the contradictory proclamations about who can get evicted, I mean I think evictions were extended, but only for people who do not meet certain needs criteria etc, and so on. So I think we really need to get ahead of this and then they're landlords like Miss James, who are going to get foreclosed. You know I mean everyone needs some remedies and we need clarity, so I think we kind of have an emergency meeting as soon as possible to get people sorted out on this thing. You know like January or you know not sooner. I would second that having a meeting before the eviction moratorium ends at the end of the year would probably be valuable to community princess. I saw you with your hand up. Why is it not on you? Muted is Ben James, you're, still muted yeah. It looks that way. I do not know why she was not muted before okay, yes and one of the things that need to be addressed because they're saying oh moratorium are not paying around and people who can afford to pay their rent are not paying their rent, because I know people who work for transit people who walks to the city and they are not paying their rent, and I think those are the things need to be addressed. Who are the people who I can see? Somebody do not have a job certain things, but people who can afford to pay the rent are not paying their rent and they're using this too. So, if we are going to address, it needs to be addressed in depth. Okay, yes, okay, because I know that because my tenants work for transit and one worked for the city, so I'm speaking from reality, I'm living it right now. Okay, suggestions, Miss Granville! I think Miss ties is trying to speak or raise her hand, johnny, you're, muted, okay. So thank you. Follow up on Sarah and Greg and roberts suggestions to have a meeting before the end of the year on the evictions. I want to also suggest that between now Mid- October and then we make sure people see the wonderful newsletter that Ms Neil prepares every month and maybe consider using those email blasts to remind people of what's going on if Sarah seems to have a direct line into the most critical information about this problem, and if she would make sure that Ms Neil has that on maybe on a weekly basis, we could consider doing an email blast to update people on what the new status is for the various programs that the city and the state are offering and where they can go to get help. I know the President's office has workshops and there are other neighborhood organizations and community organizations that are offering help and if Sarah could give that to Ms Neil, it could go out weekly rather than monthly. That's one thing we could do in between now and a meeting in December. Okay, thank you for that. Does anyone else have anything else, any other suggestions. Nobody else has anything else to say: oh greg has his hand raised. Yes, greg. You see yeah craig. We can't hear you. It occurred to me that it might be helpful to do some kind of a very unscientific survey of our members to see how many are experiencing problems with either paying their rent or receiving rent. Just to give us a gauge going into the conference, it's like we have 40 of our members are only not able to pay their rent and 20 percent of landlords are not able to collect rent. I do not know it might be an interesting survey. There's awesome, it might be. Do you mean a survey of the board members yeah or just anyone on our mailing list, which I'm sure goes well beyond the board? Members does yeah, I mean it's more unscientific, so it's not going to be represented necessarily, but it would give us at least a sense of how deeply this is. You know affecting us. Can you hear me? Yes? Can you hear me? Yes, okay, I'm listening to you and I'm thinking to myself. I do not know which entity should probably do it, but I'm wondering if this is not a problem that central Brooklyn is having period, not just community board 8 but other communities as well. Now, who would be the agency to actually organize some sort of a wider survey? I'm not sure, but it might be very useful to have that information when we're talking to our elected officials so that they do not think. Oh, it's just something that one particular community is talking about. It could not be not with all of these problems, we're having with the economy who, among our elected officials, would be a good I'm trying to think our state. Senator is not he a formal housing, Mary Marie he might, he may have been a former housing. I'm not sure what his background was to tell you the truth, but Sarah's shaking her head. Yes, yeah, I mean he'd, be an obvious guy to do a survey like that and he would cover a big hunk of our constituency. Yes, if he's interested, but so that may be something to to speak to him about. I do not know what I do not know if it would make sense to actually send him, I guess an email or written inquiry about it. I do not know if we need a formal letter at this point, but just find out from him if he's interested in doing something like that, if he would be interested- and I do not think Miss Ty has heard it- I'm not sure if she's still there I'm here, I heard a suggestion to do a survey. I'm not sure if we have a slate of survey questions well, you may not have heard it, but I was suggesting that possibly a wider survey might make more sense to include other parts of central Brooklyn, not just community board eight, but I was saying I do not know. Who would actually do that and somebody suggested that our state senator might be interested in doing such a survey. Myriad. I understand I understand and the questions would be to find out find out what the degree of hardship who's having a problem as far as being able to pay their rent and who are the homeowners who are experiencing problems because of this economic crisis, because people either saying they can't pay and do not pay or people really can't pay. Thank you. So the housing justice for all coalition did do a survey that it was put out to you know, broadly, it was put out broadly for the entirety of the state, but I think most of the respondents were inside of New York City, but they did this earlier in the crisis it was maybe April or so like, and I could I could find where the results of that survey were. But you know imagine that things have sort of evolved since then, of course, they have but yeah. Okay. We might want to look at the survey questions in there and see if there's something that we could update. You know maybe myrie or even this group you mentioned could update. It sounds like a good idea. I have a question. Yes, sorry. So our local electeds are, for the most part, in support of a few different state bills that have to do that are sort of in reaction to the housing component of of all of this, and I was wondering if it makes sense for us to maybe ask them to come to our meeting and maybe explain those bills. I do not know. If I mean it's not like asking them to come in here and do electioneering exactly it's just asking them to explain their bills, but is that is that something that would be appropriate for a community board meeting? I do not see why not. I think I remember with the with the 2019 slate of bills. They did come in and explained what was in the nine bills yeah, and so now. This is a set of three bills that definitely myri Mosley Richardson Kevin Parker, most of the most of the people around here are signed on to them. So maybe they could explain them yeah and similarly, to have somebody from the city or state talk about what exactly the laws are regarding evictions and when they take effect and who's affected and any mortgage moratoriums, etc. Uh- huh just there's a lot of misinformation and confusion. I think I agree yes ethel. I want to suggest that if we can get the state reps to come in, we can send ahead an invitation to come to the meeting. Make sure you get on the calendar. Add them to the Google Group, the Google group that we have for these committees, but one of the things we want to ask and follow up on what has been James is going through, is to ask for carb out of from the eviction moratorium with those tenants who still have their jobs yeah. Those candidates who are still collecting paychecks should not should not be taking advantage of a moratorium that was designed to support people who have lost their jobs. So those tenants who are claiming hardship should be able to must be required to show their landlord that they've lost their job and if they can't show that landlord should be able to proceed with an eviction I mean technically, those are able to go forward. Now I mean the yeah, so technically those are able to go forward now, because those people would not, because now you can only block an eviction by you have to be able to prove under the tenant safe, Harbor act. You have to be able to prove that you expect that you experience financial hardship and you know the judge has to approve it. It's but like eviction warrants can be those cases all of the cases can be started, but eviction warrants can indeed be acquired. Now, if the tenant can't show that they were financially impacted, so okay, I mean: are there any other comments or questions or concerns that anyone wants to speak on at this time? This is such a quiet group. Well, if I may, if I may, have want to bring up another thing- that's been haunting me for a while now the Borah President's land Use director, Richard Barack, has brought it to my attention again that a lot of the folks who live in this community district are being ejected from the housing lotteries, because they're asking for affordable apartments and as we all know, affordability is described as you're, paying 30 of your income in rent. I'm asking you all to support a letter to go to DCP and to the mayor to reduce the affordability marker to 25 of income, to get priority for a set aside for a community district when a zoning of zoning is done and the developer comes in and they get into zoning they're supposed to choose an mih option and within that mih option, the affordability is described usually at 30 percent of income. I want to ask the mayor and city planning to bring that down to 25 and that marker include not only rent but gas and lights as well, so it's a shelter cost not just rent and that the trade- off there is that when people go in for the lottery and they say that they're asking for an affordable apartment, 30 percent of their income, the developer says: oh, this person is likely not going to be able to pay their rent during the term of the lease and I'm going to have to end up going through changes to get them out and victims somehow because they can't pay their rent. So if we drop that affordability criteria to 25 percent, we'll have less of that type of behavior and we will have less, of course, fewer families going to shelters a lower shelter cost for the city budget, and I think that would be a good thing for us to do again to send a copy of the letter to the independent budget office and asm to look at it and validate our assumptions with the numbers. Adam did not. Somebody just send a note in about h about hood increasing that amount to 35 percent did not. I see that in the chat a minute ago. I think it is yes. Yes, so last year Ben Carson of Hud said- and I quote, poor people are not working hard enough with the rent burden at 30, so it was increased unilaterally to 35. Hud is a federal program. That's why Congresswoman Clark is trying to should she win. This reelection implement changes to Hud's rent burden thing to reduce it from the current 30 or the proposed the increase to 35 so that it can be more affordable, because, right now, as it stands, is based on gross pay. Not net pay net pay, as we all know, is much lower than you know, gross pay. So that is that that's something that is definitely a federal thing that would have to be with our federal electeds. I do not know. Sometimes people are just so totally out of touch. It's just amazing and we're still looking at Amis to have nothing to do with the community districts that people live in. So I take the remarks. I've just heard to be in support of a letter, because if we do not say anything, they will continue to think that what they're proposing is okay, yes, a letter is definitely in order. Unfortunately, we have a lot of elected officials whose incomes insulate them from these changes that affect everybody else. So, like you said, if it's not brought to their attention, they will act like they do not even know about okay. Thank you very much. I will draft that letter. I'm hoping that one of our attendees is volunteering to take minutes for these. This meeting, Mr Sax is going to be helping me so we'll both be listening to the recording to take what we can from it. We may not do as thoroughly job as you miss Tyus, but we'll definitely try. I have a question. Yes, Sarah is so with it has to do with the oh sorry. It has to do with the red burden percentages. So is the city? Is the city prevented from applying you know a lower rent burden than what Hud because Hud, as I understand it, they set the percentage of one's income that you pay towards rent in public housing or the amount. Oh, the misneal said no, we can not set our own percentages, so that's the case even with I do not know like affordable New York, the housing that gets created through rezonings things like that. Okay, if I may once again, I'm sorry, I do not want to monopolize the conversation, but I'm working from a playbook that was provided to me by the board president's land use director. Okay and the target for our complaint would be the mayor and city planning, since they issued the zoning, which gives the tax credits to the developers or who are requesting these zonings, if you're coming in to say, like improv, and that area is all manufacturing. But you want to go in and build an apartment building with a commercial ground floor and in order to get that change, you're you're willing to rent some of your apartments at a lower rate. That's the time for us to demand something that's going to help the city budget, which is to drop the rental requirement under the rezoning, which is a which is something the developer is asking for to something that can be used by this community district Hud is using a broedcast, broad net kind of census, data, Usage statistical metropolitan area and wind up with a high income that includes northern New, Jersey southern Westchester and county and excuse our income numbers to the high side. So, for a long time, we've also been asking to make the AMI calculation the area median income calculation, local Hyperlocal, okay, down to the community district level. There is a puma table available that shows some of the data, but we have to push our electives to make the changes that help us stay independent and not depend on tax revenues which are drying up to provide city services and so on. So that's the kind of statements that we need to be validating to put in the letter to go to the Mayor City planning Independent budget office. So they can use this in their data to our state officials as well, so we have their support. Okay, the trade- off in lowering the income on one side is lowering the expense on the other side for the city, because people who can't pay their rent, where are they going to live they're going to sleep under a Bush in Prospect, Park, somewhere they're, going to go with shelter, okay and the city's going to wind up having to pay the whole thing. So, let's come to the middle of the road and figure out how to solve this problem everybody's going to have to tighten their belt to get this done. Thank you. Well. What she said makes a lot of sense when you think about it, because we hear astronomical numbers that are being paid for people to live in shelters and in on the upper West side. People are having a fit because they moved in homeless people and nobody in the neighborhood wanted them there. So now they're taking families throwing them out and putting the formerly homeless men that one neighborhood did not want into another neighborhood. So ethel is absolutely right. It's causing all types of problems, not to mention the money that's being spent. So at this point, is there anything else that we need to talk about. I see some people, but I guess they chose to be quiet. I see circles with names, but I have not heard any of the other people say anything. So I guess maybe we have talked about everything they wanted to talk about. As soon as we hang up, a lot of ideas will be floating around. Oh that's what will happen so we had talked about with the land use, having some land use, training for for board members and your training that would be available to the rest of the public. I'm wondering if there are some things, some kinds of training that, like more specifically related to housing. That would be useful for for us. I think at one point I had looked up the description of the committee's the Housing committee's purview and it said something about 421a applications but which we found. That was a joke. I'll tell you this! We were supposed to have one. I think one applicant come in to explain that 421a application and we found out that none of these people have to come in and tell the community board anything because HPD blesses their documents, whether they answer questions or whether they answer to the community or not. So it's not an obligation in the process that they even have to come to the board because HPD just basically signs off on it and nobody, even checks later on, to see if they actually did give anything affordable to the neighborhood. 420 is a real problem of a program that and as in case Miss Tyus. If you did not know, I actually work for the independent budget office, so yeah, if you ever want our housing person to come in and speak to the board. It's not me, but but we have some people who are quite good on housing and can come in and talk to the board. Okay, I'm not sure who's speaking Mr Callahan Robert Callahan. Thank you. Thank you. That's wonderful! So, just cc me! Yes, okay! Yes, we have to demonstrate to our elected officials that we're not just arm waving and that there are some real financial choices that we should be making on a more informed basis as we go forward because, right now we are we're. Definitely in a pickle according to Dr Fauci. We've got another year to go before we have a viable, a viable answer to this prohibition or a cure for this virus going on here. So we need to so we'll we sympathetic Community board members. We do not want to see people in the street but by the same token, we do not want to come out of this with landlords losing their properties because they could not pay their mortgages. So the recommendations we come up with need to be balanced and the tax credits may need to take different shapes going forward, but we can put the proposals out there give us some thought: look back at the library of studies that the Ibo has done over the years and they are very helpful and then there's a. There are a couple of of law schools, the universities that have real estate programs I'll. Try to send out links to those programs where people can look at that. If you want to take some get some information on land use, there's association of neighborhood for neighborhood housing development, a hd- they have informative classes. Some of them are free. Is the American Planning Association? They have courses, I think they charge for most of those, and I am working with George to use the land use committee meetings for December and January for DCP to come in and do a piece on zoning without 20 minutes, they're still trying to gather information for the in- ground rezoning. We need recommendations and suggestions from the Community Board and the community at large for what they want to see over there and then the following month. I hope to have the land use director from the borough. President Mr, Bear Wrap come in and talk about euler, because DCP is saying that they do not have the money to move ahead with improm when you learn, so they can't say no to private applications and those things will be coming along. In fact, that'll be one of the applications up for the November land use committee meeting, but there's a housing committee meeting, so I want to stick with housing. Thank you. Thank you. After for updating us on the possibilities for the training that people are interested in, because we were quite fortunate last winter, I think it was or the winter before, where the bro president of Manhattan actually had classes on everything that community board members deal with, and she did not say you could not come because you did not work in Manhattan or did not live in. Manhattan was open to the entire city and every time they had a class, it was like standing room. Only everybody was there. Zoning land use traffic, sanitation whatever, and unfortunately we did not have that type of training available to us in Brooklyn. So those of us who wanted to take advantage, we just got on the train and went on over to the municipal building. It was kind of cold some of those nights, but it was worth it because you got some invaluable training and you got to meet a lot of people who are very interested in their community. So it was a nice synergy. I actually enjoyed it and I'm glad we did it because who knew that in less than two years. We would have this situation where people can't even get together and look at each other at the same table anymore. So, oh and ethel, I do not know whether you guys ever come to crown Heights North meetings, but they had a young attorney who came and she was handling some lawsuits that were they involved homeowners, who were about to lose their property through the third party transfer program and come to find out. In most cases they were taking, they were threatening to take people's property under false pretenses. They did not own. They did not owe the taxes that they claimed that they owe- and we found out from this attorney that information is public information that is supposed to be given to the community board. But you have to ask for it and we have asked how many times ethel and have not gotten anything two times. Okay, so I guess we will talk to miss George because we're trying not to alienate any relationships with the people that we already know, but I'm very annoyed with our city council person, because we're supposed to be able to get the information from him and he has not been forthcoming, even though we've asked in writing twice, but it's something that we are entitled to just like we're entitled to all of the information for all of our transit properties in our district, the buses and the trains and the ridership other communities get to react much quicker than we do when they say they're going to cut something because they already have their numbers we entitled to it. But again, if we do not ask for it, we do not get it so ethel. I guess we going to be doing a whole lot of writing this year. There's no other way got to put it on paper. That's true! So before we adjourn for the evening, I just want to remind everybody that early voting starts October 24th, which is a Saturday I'm reluctant to do the mailing myself, because I understand that if you do not sign in all the appropriate places, your ballot can be thrown out and you would not know that your ballot was thrown out because nobody tells you that, and I know the last time I voted. I did not sign it on the outside, like they said I should have so it's something to think about. So I intend to keep myself well enough so that I can be early in line that day. I think they start at 10, be there to sign. You know to stand in line and do my voting and in that way, when I go to bed at night conscience will be cleared. I got it done. People should also remember if you mail in ballots that you have to pay for postage a lot of people. I do not think realize that oh really yeah, it's not postage paper. Oh, that's something else to know and it and it needs more than a single forever stamp. I think it needs two. I think the Brooklyn ballot is like 70 cents, so I would I'm just telling people to use two forever stamps, that's good to know, because I never thought about the fact that it would require more than one stamp and some people do not buy stamps, because folks are all into email and stuff, so they do not buy stamps yeah and the primary was postage paid. So a lot of people may just put their ballot in thinking that they do not need to put postage it's. I think it could be a real problem. Yes, I think so well, thank you for letting us know that and between you and me, I will be on the lookout for some sort of a virtual meeting from Crown Heights North Association, because since we can't meet traditionally anymore- and I just want to let you know that Saturday was a very nice event- they made Nostrand avenue a destination. He had like 10 or 12 bars a long nose string where you could get a 10 discount if you went in and you patronized them, and that discount is still good until the 17th of October, I'm hoping that in December, when they have the small business Saturday when they promote small businesses, I'm hoping that they can have an event similar to that again, but it was so nice because it was like one long block party. So if you are in town, if you're not traveling any place when they do the next one, please come out and support your local merchants. Do I get a motion to Adjourn I'd like to mention that there is a free shredded event coming up sponsored by Crown Heights North Association will be in front of St Gregory's church on the 24th from nine o'clock until noon. Okay, the 24th is going to be a very busy day for some of us. Yes, okay, all right, but I move. We adjourn. Second, thank you. Everybody good night, all right.",
            "summary": "Oh hi, Miss Tiath, so the the tax lien sale is something that usually happens every year for properties that are either have property tax arrears or they have unpaid water bills or it could be because of unpaid charges or fines related to HPD violations or the Enforcement program, and people have talked about asking the city to continue to po, to postpone this tax lien sale, because there's a fear that it could lead to people losing their homes through foreclosure because of the crisis.\nFirst, tax, lien sales for class 1 residential buildings 1 to 3 units on the current tls list, especially if owner occupied, should be suspended until the end of the Covid-19 related state of emergency.\nWe do understand that the city is going through a budget crisis receiving far less from the state and federal governments than needed, and the revenue brought in by property.\nWe want to copy the independent budget office and ask them to go over the numbers for the past few years and tell us if the city only adds to which shelter costs burden by forcing evictions through this tax, lien sale, process.\nI. This is something that I do not know that this is going to be a separate issue, but we as a garden are trying to think about what to do about retrieving our land from someone who has been delinquent, Mr side, I'm, not sure that your headphones are working.\nMy knowledge case in point: we acquired a property on sterling place, bec, new communities and local non- profit, housing developer and the family complained to then a state assembly member clarence, Norman.\nSo an analogy directly here: If the state or the city were the owner of that middle lot, they could, at their discretion, give it back to the community, but with tax liens.\nThis idea of the city losing control of its own properties and being held by rich people who live outside the city, and this is this is a real problem that we need to address, and you know until we can figure that out we're just going to be kind of spinning.\nSo when people are calling for moratorium, it affects us too, with these small, these same two and three family homes, we're speaking about now, it did affect us and it still is affecting us because in what my building, I have not received any rent from my tenants for months now, but I still have to pay.\nSo I can be one of those people where all taxes and a multitude of Things- and not because I do not want to pay, because my tenants are not paying and those are things I think need to be addressed because we are lumped into with all these multi multi- apartments landlords and we are not, and we I lived in this community as everybody knows.\nSo I want to hear what it is that you would like for the committee to work on during this coming.\nAnd I feel like there's a lot of confusion everywhere about you know the state of the eviction moratorium.\nYou know the various different protections that are available to people and it just seems like every I tried to send it to the land, use and housing committees just filling in some details about the state of the eviction moratorium and the very next day there was.\nThere's, a new development, and I do not know if it feels like part of what the community board is best able to do- Is, to communicate things and to answer people's questions.\nNow that the moratorium has ended, it'll be slow, but the quantity is going to be great There are just likely to be a lot of people with need for information about these particular issues.\nYou know, I mean everyone needs some remedies and we need clarity, so I think we kind of have an emergency meeting as soon as possible to get people sorted out on this thing.\nAnd, one of the things that need to be addressed because they're saying oh moratorium are not paying around and people who can afford to pay their rent are not paying their rent, because I know people who work for transit people who walks to the city And they are not paying their rent, and Who are the people who I can see?\nIf he's interested in doing something like that, if he would be interested, you may not have heard it, but I was suggesting that possibly a wider survey might make more sense to include other parts of central Brooklyn, not just community board eight, but I was saying I do not know.\nIf I may, if I may, have want to bring up another thing- Now, the Borah President's land, Use director, Richard Barack, has brought it to my attention again that a lot of the folks who live in this community district are being ejected from the housing lotteries.\nIf we drop that affordability criteria to 25 percent, we'll have less of that type of behavior and we will have less, of course, fewer families going to shelters a lower shelter cost for the city, budget, and I think that would be a good thing for us to do again to send a copy of the letter to the independent budget office and asm to look at it and validate our assumptions with the numbers.\nYou did not know, I actually work for the independent budget, office, If you ever want our housing person to come in and speak to the board.\nBut we have some people who are quite good on housing and can come in and talk to the board.\n, there's association of neighborhood for neighborhood housing, development, They have courses, I, think they charge for most of those, and I am working with George to use the land use committee meetings for December and January for DCP to come in and do a piece on zoning without 20 minutes, they're still trying to gather information for the in- ground.\nLast winter, I think it was, or the winter before, where the bro president of Manhattan actually had classes on everything that community board members deal with, And she did not say you could not come because you did not work in Manhattan or did not live."
        }
    }
}