{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCypidtxHlcJztN-i4y-y76A",
            "title": "Executive Committee Meeting",
            "publishDate": "2020-09-16",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 618,
            "um": 331
        },
        "wordCountFullTranscript": {
            "committee": 78,
            "community": 64,
            "people": 64,
            "time": 60,
            "lot": 54,
            "meeting": 49,
            "question": 45,
            "resolution": 43,
            "issue": 43,
            "board": 42
        },
        "wordCountSummary": {
            "people": 20,
            "community": 18,
            "issue": 18,
            "board": 17,
            "committee": 14,
            "lot": 11,
            "resolution": 8,
            "report": 7,
            "time": 7,
            "office": 6
        },
        "fullTranscript": "Okay, lord one hi mary how's, it going curtis very well: hi, curtis, hi, everybody, hello, everyone, oh boy, hmm, foreign, okay, hello, everyone, bruce gill, sherry miller, cynthia, fred, joel julie, battista, my friend nancy preston, sean. I don't know who that is, and then that smiling face and ariel miranda, curtis, katherine isidro, tim anderson, our good friend james. I don't want to say hi to you. I haven't spoken to you in too many days and natalie spino and mary where'd you go. Do we have quorum ebenezer? Maybe she went to get some food. We need to have nine. So we have one two. Three remember I don't count. Yes, I didn't count you so missing, one more person. No, we are nine and nine, not including jim or ebenezer. Okay. We have seven members of the executive present at this time. One two three four five, six seven we have seven. We need two more okay, oh okay. I see that I alright [Applause]. Okay, we don't have a quorum, but I would like to just point your attention to an email. I just sent out it's and it's a resolution that I would like to present to the ec this evening. So while we're waiting, if you have time to review, please do so. It's in your inbox curtis. I had a quick question. I saw that the two resolves just say: cb12 Manhattan yeah. I didn't have the result because I wanted input from you all on what the resolve should be. Okay, so I left that open. We have top, we have until september 30th to give our feedback, but I just wanted to leave space for space for comments from everyone. Okay, just making sure thanks all right. So I think that the agenda mentions that the minimum was supposed to be started at six o'clock is already say: 6 45, so I just want to be mindful and respectful of each and every one of those times. So we're going to try and be a strict as strict and adhere to our time more than any more than anybody else or more times more times or not. Hey hmm. Can you upgrade fe from the attendees list to the panelists list and domingo too? We have four on lsi, okay, great. We have quorum so benezer. You can get the ball rolling on the record, so you just gotta start now, so I think it says live his life is recording you're ready to go. Is there it says, live right, so we're ready. Yes, you can go okay, good, so we're gonna call the meeting to order is look at my time is 6 48 a few minutes behind. I think thank you of each and every one of you. Who's made yourself available to have this exact meeting in now wednesday september 16th we're going to try and make this meeting as simple as seamless and without a lot of I'll say the word, which is a lot of obstacles along the way on my report. I was going to have richard allman, take a few minutes and speak about an initiative that he's trying to be part of or make us be part of, but I guess I'll wait until he comes alive and he talks a lot to us about those that initiative, which is a name change. I think I believe it was a change on the medal or the highest annual that a fire department gives from an individual who was a known to be a racist individual now to a new name. So he was going to talk to us about and enlighten us more about that than and that I could on my report. I'm gonna keep it short. I'm gonna make you guys and make an official invitation to the panel or the presentation that beta NYC is going to have on friday between 10 and 12, and the panel is going to be in reference to the noise complaints in our district. But in the city of new york it is critical that we are educated on ponds and how it can be criminalized and weaponized how different community boards have higher complaint numbers than others, and the reasons why so it is critical that we understand the nature of what noise really means before we head on or move on into something that is more organizational and it's or institutional for that matter. So I invite- and I had the office sent each and every one of you or the email so that you guys can have the link and be part of this initiative that we are trying to have you guys be part of once that panel or that presentation is takes place on friday, then what we will do is to customize it and have the individual data be presented to us from specifically the complaints in district community board 12.. So I think I was just I stand corrected by natalie, a wonderful liarson that is going to be between 12 to 1, not 10, to 12. and our repeat is 12 to 1.. Thank you so much natalie unless richard is on. That will be the end of my report. Catherine, would you like to add anything else? If not we're going to move on to ebenezer's report even easier good evening? Mr chairman, thank you. My report also going to be very brief. I just want to inform the executive committee that our new web page went live last week. Some of you had a chance to already review it. If you have not, I encourage you to review our new web page as I mentioned, and keep report reporting for the last year or maybe more. We were working very hard on the updating our web page and there was a summer project, and I want to thank paola and janelle our staff that they worked very hard in the transfer, the containers, the from the old website to the new website and upgrading. I also want to say thank you to our chairperson and also jonathan nunez, our I.t person for reviewing and make some suggestions. So it was a hard work during the summer and this work started very seriously in March when we started when we closed and when the pandemia started working from home. And finally, the website is live. Please review it. Have it some time to see what it is? All the information that we had in the old web site is there and we have more contents, and we have a feature that the page can be translated into spanish and several languages just in japanese, french, etc, and also our website has. The mailing subscription to our mailing list is in the front and the home page, and also it is in the back. So if you haven't see it, I strongly recommend that you please take a look to our new website and also we are welcome to any comments and suggestion to improve and make it better. Also. I would like to report that our office has a new telephone system. It was installed a few weeks ago and now we have an internet system. You know our telephone is connected to the internet and the system that we have today win-stream company and system. Also we installed during the summer a new projection screen in the meeting. It was a request from our chairperson and I was able to acquire uninstall with help of a company. The new screen is a very wide and also gonna cover the red box. That was there and the most important is automatic. You can have a model that bring it up and down without the we have to have to manually bring it down up. Also during the summer we acquire some tablets to be distributed among the board members who doesn't have access to a computer or a computer. We have a viewer in the office. We have a few board members that we would like to distribute. So if you need a tablet to connect to our meetings, please call me call the office and let us know more than happy to assign one to you and finally, I would like to call the attention to all the board committee chairs is our statement of district needs is due October 30th and last night we had a training. I sent the link. I hope that many of you take advantage of that training and also we're going to have a second training later this month. I will resend the link for the next one and we need to work all together in the preparation of the statement of district needs. This is the end of my report. Is there any question? Okay here he knows question. No, there is a question. I raised my hand, I don't know who's taking the stack. Catherine, are you doing that? Okay, I'll, take the stacks? Who else is on the thing on the on the q? A no it's just aussie, it's a question from the public, cynthia of auburn. So also what is your question? Okay, so I sent an email a few months ago requesting the preliminary paperwork for the licensing committee meetings and I never received that. So I'm asking now in public to receive that information. It's a public information and everyone should have access to it. Okay, thank you for your request. Is that any other question yeah sorry raising hand anyone else going, yeah, okay, hi eunice, so I just wanted to follow up. Would it be possible we could get the fiscal year 2021 priority items that we ranked last year and then also can I also have the statement of needs sent back to me. I sent a previous email. Yes, the statement of this you need. If you want it, you can go to our website. We have it of the 2021 there you can, you can take it 2020., it's already there the statement of this unit and I will send you the budget priority. Of course, I will send you that is there any other question. I'm sorry beneath. I didn't hear your answer to my question. Yes, the answer to your question is you requested, and I got your request, so we need to listen. Well, I don't. This is not the time and place to oh, it is the time because you never wait a minute. I am not I'm sorry. I have my time I would like. I share the meeting. Therefore, can you repeat the question again so that he understand if you can answer it now I, for a few months a number of emails asked to receive the licensing committee, preliminary paperwork and never received that, and I had I got all sorts of excuses, and so this is the problem came from please. I would like to finish my sentence. This is a public information and I entitled to receive it just like any other person, because it's public and I would like to ask ebenezer to stop ignoring that request- is that it or you have anything else to add. I just I just want to make sure that I'm getting it okay, so he'll have he'll. Have those paper that communication or whatever it is that you're trying to receive by the end of the week. Does that answer your question? What do you have that has to be on a monthly basis? Well, that will be just like we're not going to do any special requests. What's going to happen is that whatever information needs to be published not just to you, it has to be published to everyone else, accuracy, sure, okay. So that answers the question. I hope I hope so, let's see if it's going to work. Thank you. So, let's move on is there any other question he didn't. Thank you very much, mr chairman. Take it away! Thank you so much liz is this back yet or we're gonna just have her do her presentation or have report later on, so gerard is gerard. There gerard is not there. Sorry elisa. Can you up upgrade sorry jonathan who's in the attendees? That would be a beneath there. I don't have holds responsibility I would like. I would also love for those of you who's who have race. Please raise their hands. Please do not continue to interject in the on in the flow of the meeting, so that we cannot hear two people talking at once. So I really appreciate that the review of the future meetings ebenezer we're gonna, go over October and november's calendars. So if you will thank you, mr chairman, I sent we send ellie today the calendar, the traffic calendar for november november, and we have to make one sorry. Let me go back to October is first I'm sorry. I send it rough of the calendar for October and november and in October we have to make a change of one of the committees because of the holiday of columbus day. The youth committee that is on the second monday of the month, have to be held on the first monday of the month because the first month that is the executive committee, so I move it back to to the first monday of the month. October 5th. Please take a note of that. Do you have any problem or you have preferred another day, but I think this is the most appropriate date for the October calendar. I also review the holidays. The jewish holidays is not interfering with our meetings this year. It's gonna happen on a saturday and sunday in October this month. Any question any suggestion for the October calendar before you guys approve it. Yes, richard you need to mute yourself richard and then faye richard you need to unmute yourself. Can you go mute him? Because I think you have the capability of doing that? Yes, I'm trying to do that. Looking for his name appreciate that I can do that. Okay go ahead. I was asking is whether we have to do a budget priorities hearing in October. We should we should have a budget priority as well in October so which they will prefer. We have available in October the 8th, the 15th, and I don't know you want to do it after the executive committee on the 20th 21st, which days of the week are those I'm sorry to say again, I don't have a calendar and we don't have calendars in front of us. What days of the week are those the tuesday 20th is a tuesday? The 21st is a wednesday, probably wednesday. The 21st is better because the 20th is after the executive committee. Personally, that's fine. I, the 20th, is the one day I can't do. Should we go for the 21st wednesday 21st, it will be after the executive committee and before the general meeting. I'm sorry. I don't want to do this, but this is just around protocol ebenezer. We have both gerard and liz on the attendee list. Liz is as beth am so you can just upgrade them. Both okay lisa have been promoted and jerome has been promoted to panelists. So going back to the review of the October calendar, we moved the youth committee to the first monday of the month because we have a holiday on the second monday columbus day, and now we are discussing where we're gonna place the budget consultation hearing in October. If we're going to do it on the 20th or the 21st of the month, the 20th is a tuesday and is the tuesday after the executive committee and the 21st is a wednesday. You know a day two days after the executive committee in October eliza has a question from, I would say the 21st to give us more time and we don't want to meet back to back two days in a row. For me at least, liz has a question: that's what I was gonna say all right: okay, so we're gonna have the budget consultation publicated on the 21st. Any other question regarding the October calendar. Faye has a question fake. Can you hear me yes good evening? Everyone! Thank you. Yes, I think I sent an email in our calendar. We already know that we're going to have our meeting on the 13th, which is a tuesday, not a problem. You prefer you and your committee prefer to have it on the 13. I will put it on the 13. Is that is not a problem. We already wrote a calendar for the entire year and I sent it to you this afternoon. We already said for the entertain and I announced it in the meeting this monday. Yes, I appreciate it. If you can, you know, move it to the routine. Yes, more than happy to do that. Thank you. Okay, any other suggestions regarding the October calendar I just want to. Can someone clarify for me? The board has the ability to host. I assume two meetings simultaneously on the zoom platform. Yes, not on this zoom, not on this zoom. We have one of the webex and the other one on this zoom. When we have two meetings, we have two different platforms, but in the end, in the end, after all meetings are finished, we will be restoring that on our youtube channel. Okay, so if you could just let me know, who's going to be doing their committee on which platform and if there's anything that I need to know, if I'm going over to the other platform, yeah sure we'll let you know in advance, I will discuss that with chanel and paola and we will let you know which community going to be in which platform. Yes, thank you so much any other suggestion for the October calendar. Okay. Thank you very much. Now, the november calendar, again we have a holiday on the second wednesday of the month is veteran days, and that was is the day assigned for the licensing committee. I placed the licensing committee on thursday, the 12th. If it is okay with isidro and his committee, I think they're viewing the entire calendar. That probably would be the best day to relocate the licensing committee on that month, which holiday again it says this seventies, it's veteran days the office. It will be closed so sure, let's do that it will be thursday will be fine, yes, okay, then, on november we have the thank giving date on the 26th. The office will be closed and traditional the office is closed the day after. Thank you on the 27th friday, the 27th. I submitted this request to the executive committee to see if there is no objection and you approve it as we do every year to close the office the day after thanksgiving that's great thumbs up any other suggestion or comments on the november calendar yeah. Yes, I know that election day is not a legal holiday, but it might be one. We would choose to observe and not to schedule meetings that people need to attend before nine o'clock that night, when the polls close it. Actually it is a holiday and I'm sorry I didn't mention, but the office is going to be closed that day in november we have three holidays and the office is closed four days in that month, okay, but did we cover the first tuesday meetings and how they're being scheduled? The first tuesday meeting has been relocated to the 10th. That was another relocation. Okay, I don't know if the business development is domingo has any. I don't think domingo is in the meeting at this time section. He should be moved over. Okay, I see him now. Let me promote him: okay, domingo flamingo. Can you hear us? Yes, I don't know if you hear the comments. Your meeting in november falls on election date and the office is closed and I'd move it to the 10th, the following tuesday, thinking that this is probably the best day to relocate it networks that works that works okay. Well, this is there is any other suggestion for any for the november calendar hiring on. Thank you very much, mr chairman. Take it away, okay, thank you, we're going to circle back to liz's report and then we're going to do gerrard, since he just finished joining us great. My report's really brief I really enjoy. I think it's really important to have accurate minutes of our meetings and I apologize for being behind I'm working on the back minutes and I will have those to the office in time to distribute to the membership for our meeting next week. I also think a vital portion of being secretary is monitoring the attendance because I think it's I think when members know that their attendance is being monitored. It's an effective tool in ensuring that people show up, I think, that's an activity that needs to be taken seriously by the board by the executive committee by the board leadership. I find that my efforts in this regard have been an expenditure of my time that has not been especially fruitful. So I think that my work as the chair of the parks and cultural affairs committee is very important and for this reason I am remaining on the board, but I am resigning as secretary that is. My report wanted to list mention the inauguration of the soccer field here in highbridge yeah. I will mention that. Okay, I report in michael I'm sorry for being ahead. I was just so happy to be there that I kind of hated myself wonderful, and I will talk about that in my second, my report parks and cultural affairs committee, but my report in my capacity in my former capacity as secretary of community board 12 is, I am, I have resigned. I hereby resign as secretary of community board 12 Manhattan. That is my report as secretary pursuant to the bylaws. That means that oc caminer, who is the assistant secretary of the community board ascends to secretary if she is willing to do that, and if she is not, she too would then resign as the assistant secretary. I obviously leave that to her. That is her decision to make, but I am no longer the secretary and I therefore have nothing additional to report. Mr chairman, is I mean I would like to request that lis. Can you please send us a letter to an email? You know to have it our records that you've resigned as a secretary for our files? I will she shouldn't do that, I'm sure she will. Thank you for your service liz. Thank you. Curtis. I think oc has a question. Yeah I do is a significant thing and if I have to fill in the secretary chair, I absolutely need help with everything, including fill me in with like what you know the whole every you know I'm gonna need. I can't do minutes for the general meeting and also for the executive committee meeting, and I really think that we need to assist. Do we? Can we hold a special election? I think we, I think the bylaws allows the executive committee to select and I couldn't believe we are. I believe we elect the new secretary. We can do that at the next general meeting and hopefully someone will be willing to run no assistant secretary. Yes, oc would ascend to secretary, and then we would fill the position right. What it's worth continue to take minutes and I am not willing to take minutes of the executive committee. I am willing to, I mean obviously I'll share whatever files. I have to the extent that the office does not have them, I'm happy to help oc if she needs help with roll calls votes. What have you I do need help, but yeah, and once we have an assistant secretary, then the assistant secretary will be able to assist oc the secretary and we will all go out of her way to make her life as easy as possible, also right. But what I don't hear here is that there will be special, some sort of a special election or that's exactly what we just said. There's going to be a special election at the next general meeting, catherine yeah also has been our tradition in the case. Let's say that there isn't an assistant secretary or somebody put forth also. We can definitely work a plan in terms of making sure that you can get support in terms of like roll call. You know, as folks have like volunteered the days of to support each other, so I think you know over the course, and particularly since we're staying virtual, we can kind of work on that. So I'd be happy to offer support there all right and let's make sure we have this election on the next agenda. So as soon as possible, we get some help for oc in addition to that yeah, if you want to make it my hand, is grace. Catherine just my hand is raped, but I don't see it raised here, but it's raised. May I speak? Oh there it is yes, mr chair, may I speak yeah. I thought you've already made a point of having no. So I guess this is all new information. Thank you, liz for your service this year and over the years. So if there is a special election, what is the process has would have we looked into the process for conducting an election virtually in this world? There are a lot of online virtual platforms and a roll call vote wouldn't work for this type of situation. I'm assuming that's a question to ourselves. Unfortunately, normally we don't have roll call votes and we do it on paper, but that that's probably impractical. So I think you know the simplest thing would just be to have a roll call vote and the reason we do this paper ballot thing in general is to you know, save someone's. You know not embarrass them if they don't get elected because they watch everyone not vote for them, but here you know, I think they'll, probably, ideally, we will actually have a candidate who's willing to be assistant secretary, and then I think you know we don't really need to hide this particular vote or you know it basically delays the actual details of the vote for a day. So we can just have a roll call and we should again go out of our way, and I think you know liz's plight is very significant to you know honor our secretaries, because they do really yeoman's work. Thank you. Thank you. I would also say that this will be a good time for us to think about electronic ways of having of conducting our december elections. There is a software called election runner that you can look up ebenezer, that does this sort of like online digital election. That is supposed to be unhackable by the russians, not to say the russians are going to hack our community board election, but you never know so, but you're scared, okay, all right, so we're gonna. Now un undertake jim we're gonna have to work on that so that we have that position, for I think we should. We can get assistance from the borough president's office about how to run. You know our next. You know big election and maybe from the mayor's office. They have probably already looked into this. Ideally, I'm sure so that was going to be my question that probably the mayor's office or the governor's office has provided some guidance on how elections and voting can be done legally during this interim period correct. So we should check with them. If I just may, as I mentioned to you when we ran into each other on the census day- and I told jonathan also that we could follow up on this. But one of our cbs, a few of our cities, have already had elections in this remote platform and our cb one district manager, lucian reynolds did present at the last borough services cabinet, step by step, how the system that they had used, and so while that is not an open meeting that we recorded, that is certainly a resource that ebenezer can connect you to as a model for a successful board election in this platform, with the consultation of our in-house council and all of these other regulating entities like to join the moments of thanking our comrade at borough president's office in honolulu and is, and for curtis young of public safety for his pointing out the problem with the potential taking of elections. Okay, thank you. Gerard I'd like to hear your report. Since you just joined us well yeah good evening, chair good evening, everybody, but I hope everybody had a great restful summer. It's great to see these faces. My report is really just to speak to ebenezer and say that I'd be grateful. If maybe we could coordinate. I know we didn't get July august september numbers, but maybe we could talk so that we could present the first quarter. Update in October first quarter would obviously be July august and september, so not a report, but more a request that we can put those numbers to paper and present that at the at the next, the first quarter would that be possible sure this week tomorrow I had the district service cavity meeting. We can talk it in the afternoon or maybe friday, okay, sure, okay, gerard! Is there anything else that you'd like to share with us before we move on to the community? No, I give my remaining one minute back to the to the group. It took longer this week than you've ever taken, so we're gonna, move on to our community chat reports. I'm trying to get us to say as much as we can without taking a lot of time, so we're going to have the sydney medina our license commit our licensing. Chair, move on with the next report. You have the floor, hi everyone. Thank you for being part of this quick notes on. You all know that most restaurants or restaurants are going to be opening up with a 25 percent capacity with some restrictions. There has been some push by some local elected officials to have the open, dining room permanent being pushed by our local elected officials, including our distinguished girl, brewer, the congressman and many others to have this on a permanent basis, based on a report by business insider, it's expected to have anywhere beyond seventy percent of four restaurants, not to be open beyond december 2020.. So that is a critical number that if it comes through it's going to devastate our restaurant industry in other Manhattan, as we know, they employ a lot of the local employees and for us that'll be devastating. Just quick. Those two quick points quickly. We had not many issues we had 18 licenses out of those. There were seven renewals, all of them passed. There were no critical issues at the renewing aspect of the license committee. There were two chains of operations and six new licenses out of those six are new licenses. We approved two of them, one of which was a very small license that did not require extended hours and the meth operations were not very insane. So. On that note, we approved a new business coming to 207. Miss delicious colombian is going to come to 588 to 107th street and there was one license that was withdrawn at the meeting and the rest did not pass because they didn't present proper documentations. We have to work with the office to make sure that we get all the questionnaires in place all the floor plans and also all the menus for the new applicants. I know that we're going through a special circumstance here with this insidious pandemic, but between ebenezer, myself and the staff, let's try and do perhaps a little bit of a better job in getting all the paperwork as we had agreed, which is the friday before the meeting. All documents should be in place, but I understand that these are special circumstances. With that, I'm going to open up the floor for questions, I see that he got soaked. I think he said he's occurred there. I see natalie domingo, proud. Maybe they had the hands up before or up for some of the issues I lowered mine. I apologize all right. Thank you. Natalie curtis, you have a question. Go ahead. I had a question called my name all right. So perhaps catherine can you guide me to who had the hand first yeah so curtis's hand was old, so yeah, it's domingo, domingo, hey how's! It going. You hear me. Yes, all right, so my question is around so you're, basically saying that the plaza that they created in dyckman that there's opposition to it. No, I didn't say that I didn't mention that no, the didn't you say that they were trying to make it permanent and what was I don't know? I don't think I didn't make any mention on that, but that is something that has been worked on by some elected officials and I just leave it at that. I didn't. I didn't mention the plaza on my report. Catherine, the next one ariel hi, everyone, so I'm actually just interested in the business that you just mentioned. That's going to be coming to 207th street. Yes, could you tell us a little bit more about the business, I'm more so interested being the person? That's constantly eating out now, seeing what's going to happen well, thank you. Adele for spending your money locally for us as a community means a lot about your pennies and dollars. Stays here really important and really grateful for your patronage. So it's going to be a very small place. It's the capacities are less than 70 and what they're looking for is ambient music, no dj, no promoters and the closing hours that they had requested. I believe I will not be on two o'clock in the morning. I think that the weekend will be two and the rest of the days will be, I believe, at 12 p.m, but you will see those details in the minutes, but it's going to be something different. Ariel. We need to diversify our restaurants here and by having a colombian restaurant will be, I think, a plus for the community absolutely sounds amazing, I'm looking forward to it. Thank you want some arepas anything to get me off thai chinese. You know getting my chair on the polio every now and then maybe it's just a little bit of diversity, just a little bit more and right. Yes, you know- and my question was similar, so I think this is what domingo was asking about when you opened up your report, you mentioned that there was pushback on keeping open, dining permanent. Was that what you were trying to say at the beginning? What my comments were that? What we have here in open dining has been supported by our local elected officials include, including a girl brewer to put this permanent, meaning that every summer or every, what I'll call it the springtime. Those will be available for those restaurants that qualify and follow the guidelines, however, because they do take some parking spaces in the community. That has been an issue and I'm sure that the city will address that when the time comes, but thus far it has helped a lot local restaurants, and I hope it does continue with more regulations in place and implemented. Okay. Thank you. Thank you, catherine. Thank you. Okay, to add to what domingo was saying yeah there has been. I think you're not on a specific instagram page. I think it was like my diary in which one of the business owner was stating that there has been some pushback doesn't relate to what caesar was referring to, but there has been some situations and some business owners that have approached me and said that there's even a web page or some facebook page called keep them honest. Whatever then means, but there has been some movement towards some opposition to as usual to some of the operation of some of the businesses but sort of like to chime in and what domingo and and catherine just mentioned, I'd like to move on to debbie you've been busy with the rebel and everything else. That's going on, I've been so busy and it was a busy summer like I know, for almost every committee, and so I hope everybody will give me a little forbearance. I am not one to take a lot of time in this committee, but tonight I might need a few extra minutes at first again, because there were so many big things that happened this summer. I just want to spend a little time on a much abbreviated version of the update I gave my committee and then I'll go on to the actual committee meeting and a resolution that was passed out of my committee. First off there were two meetings over the summer of the 181st street busway project. That's part of the mayor and dot's, better buses plan or program. The community advisory board has DOT put together this community advisory board. It's all the electeds, it's cds sits there on behalf of the bid we're there. We have a few members of traffic and transportation have been participating, or you know at least at the first one at the most- and I should say all presentations on that have been made so far, the two presentations everything is online, so people can refer to it. I think it's nyc.gov better buses, but just google it if that doesn't work, and so I will say the first draft plan was presented on september very much a first draft. It was a, I think, a fairly productive start. People can take a look and get an idea what they, the only thing they haven't talked about yet in any fashion, is what hours of the day this would work. I will say, and I that of the many you know, obviously every neighborhood thinks they have sort of particular things that need that aren't well understood, and we certainly feel in this neighborhood that we have so many conditions that are not common anywhere else. So a lot of the first meeting was spent trying to communicate that we felt overall, that some of the main issues that were raised were recognized either already in the plan or recognized verbally by DOT. Those main areas would be that you can't look at 181st street in isolation and so they're trying to look at it sort of 175 to 182.. It's been our. You know, everybody has felt strongly and I'm not going to spell out the reasons why I hope you know talk to me afterwards. If that isn't perfectly clear, why you need to take it all into account from the bridge from bridge to bridge etc. So they are looking at it in that manner. There are a lot: there are issues with the street vendors that are there and then what happens when then, you have this bus way and impacts on small businesses, and while that is a terribly difficult, not you know not to untie, they have been. They continue to try to come at that issue, and last sort of my personal pet peeve is the degree to which this neighborhood gets locked up every friday with commutes weekend commutes home and they came out and observed and realized the pain that we're in so again, I encourage people to take a look and those things continue. The idea will be that as far as community board 12 is concerned, my guess is the DOT will be to us in no in the november tnt and therefore the november general, and that and then it would be implemented soon after so it's a little bit slower than what was originally anticipated. Moving on to city bike, as people may know, who have spent time between the southernmost portion of cb12 and 184th street, most of the stations have been installed. It is too early and believe me. I have asked for utilization data or any hard data as of yet anecdotally. What everybody is seeing is the bikes are being used but being at there's always special considerations when you're, the top of where they've extended to and there's nothing above you. So obviously it places a limitation on like oh, I can't go any further, but it's true we're definitely one of those neighborhoods being at the top of the hill. The bikes are leaving and they're, not necessarily coming back, so I think whatever happens, we're going to have a lot of balancing to do to get bikes back up here and they have ways to do that. We have a few spots in particular that we had specific concerns about that went ahead. Some things we had specific concerns about did get altered, but I am asking constantly for data as soon as we can have it to look at what's happening in those specific spots. These are not hardwired into the street. So if there are issues the buildings identify that the community identifies with any spot, then please make me aware. Obviously many people on this call were at that sort of quality of life noise meeting earlier in the summer. I just want to say that group that kind of came out of that had been sort of trying to address. Solutions did talk to me about speed, bump requests, but I just want to make people aware that speed bumps no longer come through the committee and people do those direct with DOT, but I'm trying to keep in hand keep close to sort of what they're isolating most of what they seem to be identifying is like broadway between 190 and dycheman, and then dyke midwest of seamen. I think so it's mostly around like in one way or another sort of touching dikeman in terms of what the requests that were put in so now. Coming to my meeting so with two big items on the agenda. First was if people remember, we passed a resolution last spring with regard to pedestrian safety changes around the area of like 157 158, west of broadway and going out to riverside, and but there was a component of that proposal which would convert what is currently a two two-way street into a one-way street of the what's considered called the lower roadway riverside drive that goes from 158th then goes north to about like 161st and sort of merges in with riverside drive with maine riverside drive. There was a lot of feeling on both sides about this proposal, and so what the committee did was we split out that portion for further consideration, because we just needed a heck of a lot more detail. We asked we raised some issues related to emergency vehicles, etc. They came back as requested in september with this meeting. They made some changes. I don't want to go into it tonight unless people ask for it, but where we came out after a lot of discussion was that we were not going to. We were not going to vote on it that it was not going to be an up or down vote, and so it was a no action item. This has been a closely watched issue by that's a very organized part of the neighborhood they because of the viaduct project. Amongst other things, they have got great like resident association. Well, people really stay in touch and on top of what's happening, so we had great engagement on the issue and again, I'm happy to provide further detail, but people should know that no resolution came out of that. It does, though, leave us with a safety issue at the intersection of 158th, but I think we'll continue conversations about how we deal with the safety issue. The one-way street thing was related, ultimately to some other things, although in part to the safety, okay and then last we had, and I'm nearing I'm nearing. The finish revel obviously was we wanted rebel to come back with the restart of their operations and they came to traffic and transportation. The ceo came as well as that carol, antonez who's, the community affairs person who's been quite involved. I would say: generally: he people were obviously given where we were at really put much more at ease about all the changes that have been made. I will give people a few salient points. They had about a hundred thousand customers, I think going into the pandemic, and then they got like 200 000 more in the matter of months. Obviously, we saw the effects of that to return to the service. Now, unless you've been already lifetime banned, you need they develop this like 42. I don't know, question safety thing that you have to do so. I asked of those 300 000. How many have come back have done that whole process have taken the time he said. Sixty five thousand, so a huge drop off in terms of who's come back and he feels like that's a good thing, because he has the more of the right people who are going to use the service in the right way. Further. He spent time presenting the the various sort of like. If you do this wrong, it's a lifetime ban. If you do this thing, it's a suspension of seven days. If you do it a second time, it's a lifetime ban, you know just going through the different infractions and then the last category was a number of sort of fraud, things that they put in that also weeds out. Some of the cases that you end up with misuse like people might have lost a license and or finding a way in and this and this and that so taken together, oh and then, of course, the main thing is that you can't get on the bike without sending them a selfie with you wearing a helmet. So I think the committee overall felt relieved by many of the things that they mentioned. Obviously we all need to be watchful. I'm not saying I haven't seen anybody blow through a red light as usual, with a rebel scooter, but but, and then the other. The other interesting thing that he said that has nothing to do with this committee, but does about just general. That again was- and that was an interesting thing to hear- is that business does not employ gig workers. He said if you work at revel in any capacity, you have the same health care that I do again. That was a positive, so there was that was that and then finally, and I'm sorry, this is going so long. We had john greenfield from yeshiva university who had led with actually wheel school a letter about the unsafe conditions on the northernmost stretch of amsterdam. You know related to excessive speed and drag racing and the massive wrecks that have occurred up there, the most recent one which plowed into one of their buildings and the and then the car caught on fire and by the grace of god. Nobody was injured. They had written a letter again with that was signed by it. Had you, it had the local public schools and all the other schools heads of school, as well as a series of small business owners from nail salons and restaurants and delis, and groceries and sewing machine repair, as well as all the electeds and the borough president, and so they had sent that letter. Obviously, cb12 got it as well, so we- and they are- the letter- goes to DOT and requesting sort of urgent action on that stretch to try to do some traffic calming measures. So we I'm sorry, I didn't have it ready in time because we got done whatever it was just I drafted it pretty late last night, so I don't have it for you guys and in fact I sent it to the office at like you know 45 minutes ago, but I will have that and that's basically for the most part taking that letter and turning it into a resolution and again that applies to this stretch of amsterdam, the northernmost stretch so from northern tip to 181st, and the very super last thing I'd like to say is that I know and if we still have yeah, I think we went past time. Okay, all right, but actually no. I want to do this because this has been an issue. The ds. I know the district service cabinet meeting is happening. Ebenezer. If you I see 181st street dep project is in there. That has been impossible to get any real updates from them. It has gone, maybe eight months longer than it was supposed to, but we cannot get a straight answer. It has been so disruptive and then also the street lights that were pulled out like pre-pandemic and we do not have them back, and that was a long time to go in the dark on cabrini. So I guess I really would like you know if you can press them for some more or substantive answers, but also I'm just sort of wondering in general how I can how we can sort of get updates from the dsc, because I'm not I'm not there, but then there are things about traffic and transportation. I don't know if other committees have that, but if there's anything I know everybody's got a million things to do but like, if things get discussed, how do I find out? How do I get updated? And now I'm done? Thank you. Demi yeah, I'd like to move on to miranda. If you guys have any questions to ask debbie, please be more than welcome to email, her or call her so that we can move on the agenda and be mindful of the rest of you guys. Are we going to get you asked questions at all like in the other committees we're going to try your hardest? Yes, so could I just wanted to ask we'll actually make a point quickly on this yeah if you're going to make a point? Thank you yeah. It's just a point, and this could have been and I'll be brief. I could have brought this up for licensing committee, traffic, transportation, business or health. I really want to notice note and inconsistency in something that's arbitrary, regarding, what's being done to small businesses versus other things in our community note the inconsistency regarding covert spread mitigation efforts regarding restaurants, there's no inside seating until september 30th, there's reduced occupancy, 25 outside and it'll be inside. They have to clean disinfect before, during and after seating, they have to maintain social distancing and they have people from the building department walking around giving them tickets. If they don't do any of it. I just want to note this all these measures right that is brought up that are likely to close businesses down and when it comes to like revel here's. My question revel has no covert mitigation restrictions, there's helmets that are used by many people. So that's a health issue regarding head lice and anything else. We were told in the meeting yesterday that the bikes are cleaned when they change the battery, which is about every 10th or 11th time. It's used. All I'm bringing up to this committee and to our community is that there is absolute inconsistencies and arbitrary unfairness. Not all businesses are being treated. The same revel gets a pass once every 10 times they get to do it. Would they allow a restaurant to clean the table once every 10 times or a helmet, spreading lice and other things I mean I just want to know to bring that up in fairness to our communities and the small businesses, many of which will go out of business because they're treated being treated differently than other businesses. Thank you. Thank you gerald. Thank you so much for your observations, extremely instructional and educational ariel. If you will hi all so, essentially going a bit more brief, we really etched into two things this past month, one being our committee goals for the year. I want to take some time to specifically highlight some of the issues that were of interest in the previous year, some that some of the committee members had mentioned. They wanted to go a bit more in depth on. I had brought up specifically focusing on connecting with organizations that work with individuals that are homeless, particularly coalition for homeless and particularly picture the homeless. Some of our members had a whole list of different concerns. I'll just mention ada was mentioning the right to council bill, specifically the expansion of it, so that it's actually more accessible in the coming next few months, rather than waiting until the end of I think it was 2022 that the official enactment goes through for the entire city as well as a number of others. Beyond that, I went on to begin talking to some of our newest members about the process that will be going on in the coming months, essentially picking our own committees, individual capital and expense items, and that was pretty much it for us. Was there any other questions. Thoughts concerns I'll, be happy to go back to my smiling face picture instead. Okay, great me too, are you in? Thank you liz. I don't know we like the beard audio. So it's very cute. It's good look for you! So there's a lot going on in parks and culture we've got most of our parks are back open. There's a lot of sports. That's now happening. People are encouraged to wear masks, but you can still. You can play tennis now, even like basketball. I personally don't think the basketball is such a good idea because nobody's wearing masks and it's a lot of up in your face, but I'm not playing basketball. So you do not need a permit to use the tennis courts, but people are asked to on their honors on use an honor system of not using more than an hour, particularly when there are people waiting. League sports for children are being permitted in the ball fields, but other ev and other events can be permitted at parks concessions which, in this community the only parks concession that we have is the hudson. It's now permitted for events of up to 50 people where with no amplified music and anybody has to submit a safety plan for distancing and contact racing and all of that the screens are slowly beginning to return to something that begins to approximate something in the neighborhood of normal, but on a much smaller scale. There's no movement on the RFP for the new leaf cafe that, hopefully, will be happening in the next in 2021, but that kind of took a backseat. A lot of issues related to Covid-19, but parks continue to be open and, despite incredible budget cutbacks, they're doing a you know a reasonably good job cleaning up after people who do not clean up after themselves. There have been a lot of public education campaigns with parks enforcement trying to stop some of the larger parties before they start. So you know if you want to have a party in the park, that's great if you want to roll up with tents and rental furnitures and a professional dj, sound system and 12 cases of beer, not so much parks has seven day a week clean up details that do roll into the parks at seven o'clock, 7 30 in the morning. So if there has been a lot of activity, if you're the sort of person who like is out there, walking your dog at 5, 30 or 6 you're going to see that garbage, but if you're out in the parks, even as early as 8 or 8 30. Most of that detritus has been cleaned up. So that's good and with the help of a little bit of user to lose it money at the end of the fiscal year we did get a couple of trash grabbers and some bags and I've gone out on some late night cleanups with various members of the community and other members of the board. Shout out to curtis shout out to noble, shout out to danielle shout out to sally and we've done. We've picked up many bags of garbage. So if anybody's interested in that, let me know I've got gloves. I've got bags, I've got pickers, I've got hand sanitizer. Yesterday I was delighted to join elias saracidro ebenezer, the council member, the state senator the commissioner steve at the ribbon, cutting for a beautiful new soccer field in the northern part of hybrid well, the set the north, the central part of highbridge park, just north of 175th street, where, where you would enter for the for the tower, it's a gorgeous soccer field with artificial turf. It was, I mean with so much just shitty news. It was really nice to be able to see something so beautiful and I think that it's going to be extremely well used, and I'm just I continue to be really amazed by the parks department's ability to do as much as they do in the face of continuing cutbacks. That said there are, you know there continue to be some really persistent issues with noise and partying inwood hill park, particularly the peninsula area, and the indian road lawn area is a huge issue. I think some of that is going to be taken care of as the weather gets colder, but we have a number of neighbors who have had a really hard time with that I've been working with curtis and the public safety committee with jennifer hoppa parks enforcement with the 34th precinct to you know, try and get some more resources again to stop. Some of the really large out of hand parties before they start and that's been somewhat successful last weekend was actually really good, so that was that was nice, and I did speak with the commissioner for parks enforcement and they will be attending our next meeting and I think they're going to try and attend. We send a representative on an ongoing basis so that they can share information about deployment and also hear people's feedback, not so that we turn every committee meeting into an undifferentiated fetching session, but just so that that's another way for for parks enforcement to hear what people's issues are in terms of culture. The cloisters is open for time. Many museums throughout the city are now opening for timed ticketed visits with their capacity at 25. You know virtually all of our arts organizations are operating virtually not in real life. If you think it's difficult operating a restaurant at 25 and the hit that is taking on your business, I would like for the food and beverage industry to hold the arts and culture industry's beer. There are no plays, there's. No, nothing and that's that's, really been a struggle, because so many of our neighbors are staring unemployment in the face. So that's my report. If people have questions, they are free to ask me and oh, the hispanic society is going to be opening up. This is amazing. An outdoor exhibition of 10 really high quality reproductions of some of their most beloved pieces, and there will be q codes where you just shoot your phone, and you can get some information about each piece and recordings of neighborhood people talking a little bit about pieces of art based on materials provided by the by the curators so they're. There are so many organizations that are just trying to be inventive on how they bring their operations out into the public, either in ways that are small and safe or that are virtual and online. Okay. Thank you. Thank you. So much I'd like to chime in to your report and give special thanks to first steve simon for the invitation to the continent ribbon yesterday and also to another part, another part of our city, that part of our parks that may or may not go unnoticed, and that is the parts in 190th in amsterdam. I believe the work that is being done there by the league uplift in domingo, that for each and every tournament that they make there's one less inmate, there's one less person that goes through the system. So I like to take an opportunity, because I've been extremely active this summer- well not this summer, but during the past month or so as to see how kids are being very responsive and how the park is full of people practicing sports, especially basketball. So I wanted to add on to your report and mention that and having said that, I lay it out for steve simon to come in and actually liz. Could you clarify how the hispanics or where the hispanic society is doing their outside exhibit? Is it in the courtyard on 155th street or elsewhere, they're doing it in the courtyard they're doing it in that courtyard at the broadway entrance, but not up the stairs? Okay, you know what I think they're doing it. You would think I would know this. I will know more tomorrow and I will get back to you on the specifics. I think it's not up the stairs so that it's accessible, but I would not swear to that except it's down the stairs, so it still wouldn't be accessible, but maybe they can do a ramp temporarily. Yes, I will. I will check and let you know thank you steve. Can you hear me hello? We can hear you perfect. Yes, we can hear you, okay, good liz. I appreciate it if you'd also, let me know about the hispanic society event all right, thank you and and that new soccer field is beautiful, gorgeous it's the answer to a dream. I've had for over 15 years to convert a completely unused space and a seadraw remembers at one point: it was just a dumping ground for abandoned cars, and today it is an unbelievable resource for kids in our community. It's going to be used by the uptown soccer academy and I'm sure other soccer groups as well, and it's it just looks beautiful. It's a wonderful job. It's amazing what we can do with 4.8 million dollars with the health and environment committee. As of last thursday, the community has suffered 927 deaths as a result of covert 19. zip code. 40 is moved up of several notches on the list of in terms of the 177 zip codes in the city. It's now ranking at number 69 in terms of cases for 100 000 people, but the zip code, with the highest number of deaths in our community is a code 32 with 286 zip code. 40 has 268 deaths and zip code, 33 206, zip code, 34 167., so what's interesting, is at least I mean it's just awful that we've suffered so many deaths. If we can take any comfort from the situation. The last time I checked the statistics about two months ago, we were at 900. We were at 910., so over the period of two months we've there have been 17 more deaths. You know, which is certainly a much slower rate than what we experienced in March, April and may and June in particular ems. The ems captain in charge of the station at a 172nd and amsterdam avenue gave a report and of course, ems has been very busy, but perhaps not as busy as as I as I thought. They would be during this coca-19 crisis, because what they found is that a lot of people who would normally call for an ambulance for all sorts of other conditions were avoiding going to the hospital and even they found even the number of drug overdoses in our district declined during this period. Somehow I guess people weren't going out and getting access to drugs so, but meanwhile, 34 of their 96 employees got sick for fortunately, none of them there were no fatalities, but they had to. You know they lost a lot of regular tours, and so a lot of their employees ended up working 16-hour shifts sometimes as many as five days in a row. So I think you know at some point. We can really need to pay tribute to the ems employees. They really were on the front line of the front line. Is that the way I've been phrasing? It they're the people that covert 19 patients to a great extent saw you know, had their first contact with, and I just can't imagine people working five days in a row 16-hour shifts and according to the captain, nobody was complaining. They understood what their job, what their job was, what they needed to do and they were dedicated to doing it. We now have 50 more ambulances serving the district. We have no. What is it not nine ambulances, as opposed to the six that we normally have things are returning to normal and but there's you know, there's still, you know, they're still above the average that they've had in the past, with the ddc d, slash dep water, main installation projects in our district. Happily, the water main installation in inwood in the park terrace east park, terrace west area finally was completed. I'm not aware of the debbie of the dep project on 181st street, so ebenezer. I would have also appreciate getting what information you have on that project and I can if this is being handled by ddc. I can certainly ask them for monthly updates, as they've been giving me on their other projects, the ryan health center, a new facility on marsworth avenue, just south of 181st street, should be opening by the end of september. This is a major in gain for the community. It's a great health organ health organization, which will provide a full range of services to people in our district at isabella reported no new Covid-19 cases and currently, which is good news. The new york state nurses association came before us to once again ask us to support them in their efforts to reinstate the psych unit at the allen hospital there's been some recent correspondence between the elected officials and the president of the hospital president is now saying he's going to do a comprehensive review of their mental health services in the fall when and the nurses association asked, and I agreed and I'll be hopefully working with ellie to do a follow-up letter to our resolution, reiterating our support for the reinstatement of the of the psych unit and indicating our desire to work with him on whatever review they're conducting about their mental health services. In line with that, you know, I've repeatedly asked the hospital to provide us with the basic information about the number of patients admitted and discharged from the from the main hospital at 168th street, from the children's hospital from the allen hospital and for whatever reason, which to me is just unfathomable. The hospital refuses to provide this information. They'll only tell us how many patients are being served by their entire system, which you know, which includes facilities in westchester, Brooklyn Queens all over the place, and I keep telling them our focus is on washington heights in inwood. We want to know about the services you've been providing and the impact that covert 19 has had on the facilities in our community, and I reiterated that request in a meeting of the community leadership council of the hospital this morning. Cedric was also on that call and, and once again did not get a positive response. I'm now supposed to have a offline call with a couple of the hospital administrators in the near future to discuss this matter. I don't know that. There's much to discuss seems to me it's just simple. You know this is basic information that any institution would want to provide. I would think that it's to their benefit to, let us know how much work they've been doing on the cover 19 issue. Finally, as you know, and as debbie referred to, we had a noise pollution public hearing in early august as a follow-up to that hearing. The woman who founded the the the facebook site, wahi and inwood for respectful and decimal level, gave a pretty thorough presentation, powerpoint presentation on different strategies and different ideas that could be pursued to try to counteract the noise pollution in our community. And yes, one of those suggestions was to have speed humps. So, but there are, there are other suggestions there that may be more feasible that we can pick up on and during the course of that public hearing, tanya bonner had suggested to to ezra that the community board form a task force to continue to act on the issue and at that public hearing ellie said he would do so, but subsequent to the public hearing tanya and some of the other people from that group decided that they would prefer to have what they considered to be. A community run task force, so they had a press conference. They announced that they would be forming it and tanya reported to my committee that they have. They have issued a mission statement and they have plans to work to create that task force, presumably in the near future. Our role with respect to that task force- I guess, has yet to be determined, and that is my report. Thank you, steve for being a community member and a board member both. I think that I really commend your work and I saw your leadership at yesterday at ribbon. Cutting so again, you know thank you for the invitation for the invite faye you're. Next, I actually had my hand up yeah. Sorry, we didn't see it sorry, debbie that'd be before you go. Can I just asked both steve and ariel to lower their hands since it's from earlier and confusing, and so it's stephanie and wayne now so you said debbie and wayne just those two yeah all right. So I just want to address steve what you said about ddc and the project that dep has going catch basin replacement at the corner of cabrini in 181st, which, by the way, was a brutal thing to have during pandemic, as restaurants started to be able to put some tables outdoors and obviously, we've lost the whole. We had lost at a certain point. The whole stretch between cabrini and pioneers, but anyway it is not ddc is not involved, and I guess the thing that makes me crazy in this situation is that if it was a capital project, there would be that community liaison as reports to steve's committee, and I get copied on a lot of stuff as well about what's happening in a project. So if it falls way behind, you know about it, I'm sure ebenezer deals with the ccls all the time and what I come to came to learn because it has been impossible to get an update. Is that because this was categorized as an emergency project, even though it is a long-term project, it does not get a community liaison, meaning there's nobody whose job it is to follow the fact that things are going wrong now. What happened here is that con ed is really it's. You know they had to go in and move their stuff underground for dep to do their thing and that's turned into quite an odyssey. So I guess what I'm saying is from a practical manner. There is no way that I have figured out to get this board updated and when residents are going, berserk and small businesses are going berserk and there's nowhere to get an answer. That's a problem like if this isn't a fundamental like community board issue. I don't know what is and I've tried it yeah. That's it so that but steve that's. Why ddc is not around this thing and that's why we don't have we don't we can't get really. You know much visibility. Okay, the great points great points are debbie. Unless anyone else has yes, my hand has been up so steve. I thought that gerard was who was first, no, it was debbie and wayne, okay and gerard just racism, okay, so steve concerning the psych unit at allen hospital when this was when we discussed this maybe a year ago, or so we learned that if you present at allen hospital for psych, the evaluation and intake is actually done on 168th street, and then you have to be transferred back up to our hospital. If you are admitted and back then I would say even now, the question is: does that make sense, should we simply be advocating for the psych unit to be reopened at allen, or should we say either? The psych unit should be open at 168th street, where the intake and evaluation is or there should be intake and evaluation at allen, so that, if you present there, you don't have to be transferred downtown only be transferred back up down. Can I respond? I'm asking you okay? Well, I'm asking the leaders: okay, yeah. I guess yeah go ahead, steve, okay wayne. That is an absolutely excellent point and- and I think it's a point that I've also been making. When I heard about this, I thought it was insane. Well, that's a strange word to use in this in this context, but you know to have them transferred back and forth. That was my initial reaction. I said why don't we just move the entire psych unit down to 168th street? I mean what is the point of this and but apparently you know considering the current configuration and bed assignments there is, there is no room. I told the hospital early on. I would be happy if you don't want to open it back up at allen, just provide the beds down at 168th street. I told them that, but you know they didn't accept that idea either, but I think we I have to check the resolution. I think we may have also made that point in our resolution. You're absolutely right. You know there is an issue with having them going back and forth, especially considering that condition. But but the problem I have is the hospital's refusal to engage with us and to have a discussion with us and to give us a really coherent explanation of worldwide of why they're trying to push for the closing of that unit and why they won't even make a commitment, even though they closed the unit in the in the middle, even though they in the middle of the Covid-19 19 crisis, where they were. You know directed by the governor to make available as many beds as possible they for covert 19 patients. They closed the psych unit, which you know maybe at that point they had justification to do so. But I also think it would have been proper and again as a courtesy to let us know that it was happening. I think it was wrong for me to find out. I think second or third hand that it happened. I mean they knew of our keen interest in this issue and don't bother to tell us that it's been closed down and patients are now being sent to the upper east side and gondo's warehouse. That was also wrong. So you know the hospitals, community relations on this issue, I think, leaves much to be desired. Thank you both wayne and steve, for bringing such an important issue, and I think that we should all rally behind it and I think that we can cohision the board and try and get us what stevie's been asking for. It will get as much traction and even more than other issues that are just as important, but it's pretty much a critical health issue that our community should get answers on. So thank you and I thought that was someone else. It was a gerard. Was it gerard right, yeah, quick! Thank you, chairman, steve, a question. I'm back. I know I'm harping a little, but do you think it's possible that health and environment might look at? You know like the disparity between the restrictions placed on businesses and facilities versus businesses. Like revel, you know, and there doesn't seem to be any real Covid-19 mitigation measures. There. People use those 10 15 times with no cleaning, no disinfection, there's health issues related to the helmet. I think it did a great point reporting on all the things that other agencies do in our neighborhood. But these are. These are things that place riders at risk? You know their health. Is that something you might take up in the committee? Well, I don't know hello, yes, yeah, let's have a. I don't think I have to wait for a committee meeting, because this is a this is a sort of a hot topic right now with rebel coming back online, and you know I think we can legitimately. I can legitimately approach the health department on this question. So I'd like to be able to talk to you a little more directly and make sure I'm covering your points and- and I have no- I have no reservation about reaching out to the health department and asking them whether they think this is a. This is what whether or not further oversight is required for revel or any bikes like that. Thanks I'll give you a shout tomorrow, appreciate it all right all right guys. Thank you. Thank you for looking out. Unless we have someone else, I'd like to move on and have faye take the floor say. Thank you good evening. Everyone, yes, well my report, as you probably already everyone, so we, our community, discussed on a very important issue that everyone knows. What is the problem that we are facing? You know with the reopening of the school system the uncertainty that you know- parents and the community at large is having. So this time we discuss not only the reopening and the growing uncertainty you know about the reopening public school, but also the problem that we are facing with the older school of many schools about 21 schools are facing with the ventilation problems all over the city, but this time we decide to bring a few parents and listen to their frustration. They could I mean their concerns and I think it was in part very emotional, some of them the way that they express their frustration, the uncertainty they don't know exactly. You know what is going on and, frankly, some of them they are just lost. You know, so one other thing that we that I think that it was that I commend my community for is for allowing this specifically or came up with the idea that having then just expressed next monday on the 21st, we know the mayor along with other high-ranking leaders. They decided that they're going to open the reopening is going to take place on monday, but still there's a lot of things that they are not discussing and in fact, from the time that was supposed to this school be open, which it was last week to to next week. What they are doing is basically is preparing the the ground, meaning bringing the teachers to the school to prepare, I guess the environment, but the thing is that still, although the the department had took the time to always taking the time to prepare that in advance, many people feel that perhaps maybe that may not even happen, but we have to wait and see exactly how this is going to unfold on monday. I wanted to say also that, depending on what happened on monday, we probably may have to take like a strong initiative, and I mean the board as a whole, and perhaps we may have to even protest if things doesn't get. Oh, I should say if the mayor or the DOE doesn't deliver the promise, all the promises that they are, that they have committed to you know to their parents. I also wanted to to say that that's the positive, no, I will say, having the parents express themselves, but on the negative side in the meeting. One thing that I wanted to bring the attention that I cope with. This is something that we have to really pay closer to it. We have a tremendous noise of technical problems in the background and I don't think that was really it didn't went too well. So I just hope that the next time we don't have that problem, we have people, you know, injecting into the conversation and so forth. This is my report and I just wanted to say some one announcement that I wanted to to share with ariel and also I will be sending you on behalf of my committee, an invitation because we're supposed to discuss the second part of homelessness among students in the double up. So we had that back in 2017 and that we're supposed to have a conversation last year but didn't happen. So I hope that we can do that in collaboration because somehow already start speaking to people and the with DOE and dycd as well, so just wanted to give you that kind of you know upfront notice. So when you receive email, so hopefully you will. You know in the meantime, just think about it to see if you, if you want to have that, following in collaboration with the youth and education committee, perhaps maybe on October 13- and this is my report and thank you. Thank you. Faye. I have a question. Okay, could I also say something please all right yeah, so my biggest thing is- and I would encourage you to ask the DOE in how many teachers, like actual teachers, not substitutes, are operating within the in school instruction because from my understanding, there's a big issue going on around there not being enough teachers, because a lot of them have opted out to only work virtually because of a prior condition, etc. So I think one important stat to be able to look into so that we could look into the disservice. That's currently happening to our to the kids within our district is how many actual teachers are operating. The in-person learning yes and many learn many. There is a great number. I don't really call the number if it was on the 20th. I don't know a teacher that hadn't left the system as well, just because they cannot cope with the virtual, the virtual, remote or remote learning. But yes, I can definitely have that yeah. I think it's more than 70 of actual teachers who will be working from home and the system is overran by substitutes, just something talking: okay, natalie. I think you wanted to chime in and say something in regards to that. Yes, I just wanted to thank you all say that once again, colbert or nokrovic, the borough president will be having an action day for the first day of in-person learning and we will be handing out packets to parents that include 10, masks, two bottles of sanitizer and postcards with information on. Can anybody guess census francis center? Thank you. We have only a few days left and those two weeks will be key on closing that gap and getting the count up in washington heights and in Manhattan in general. As I've said, no one wants to lose to staten island. So we do, you know, invite you know people from the board who want to volunteer at the schools on our list. I will send something out to ebenezer and eliasar so that he can share it with you. Folks in case you want to join us on the 21st. Thank you. I must say that I already signed up and I will be- volunteering will go to president and school that I'm going to be delivering supply as well, so I'm already registered. Thank you, faye. Thank you. Someone else had a question. Steve was that yeah thank you well wearing my park set, and I should have told this to liz the we've arranged for castle bridge school to use the newly renovated audubon playground. We've been able to open up three-fourths of the playground, and one-fourth still has to be done, but so we've worked it out so that access can be provided to most of that playground. The new open field, basketball court, some of the play equipment will be available to the school. The school is gonna use it for recess arrivals dismissals, and hopefully we can also work it out so that the general community can also have access at this point, but the entire playground, hopefully, will be finished in about a month or so, but we felt that there was some urgency and frankly, the school was pushing us to do it so that they could make use of the space before the as school opens next monday and unfortunately, we were able to work it. Thank out. Thank you. Steve we'll be honor represent our next guest. Mr wayne, benjamin, oh thank you laser, so land use committee. We discussed two topics, but we discussed them somewhat at length. I think all board members probably received an email from the department of city planning sometime in late June, whereby you know dcp stated their support for black lives matter, and you know for inclusion and equity in you know the planning profession and the planning process, and I wanted to explore further what that really meant. I mean everyone, you know well, not everyone, but a number of organizations are issuing their public statements, but I wanted to understand what city planning saw as some of the historical ways that planning and zoning was used to exclude and not to be inclusive, and so I invited initially our two dcp reps and they later invited some others from city planning to join us. In that conversation, I also reached out to our planning rep at the borough president's office. That's tim anderson and then looped in sean rickenbacker. Who, you may recall, is the new director of the bond center at city college, and you know the bond center is very focused on. You know the just society as it pertains to planning and zoning. So we had an interesting conversation, but I would say that is the beginning, not the end of that dialogue, because there are still questions that need to be answered, I mean one of which is, you know what is the actual diversity of city planning as it pertains to their actual staff? That was not a question. You know they could answer and also you know beyond redlining, which we all have heard about. What are other ways that you know the planning and zoning process in the city has been used. In fact, to you know, support segregation, and we need to look at how we can be more proactive with our planning process and expressing our planning needs to ensure that you know our needs are presented and acted on in such a way. You know that equity and inclusion are in fact part of that, and we of course need our elected officials, the borough president office, to help us push that forward, and one of the things we probably want to pay attention to is the neighborhood planning and land use study that we worked on once again with city college back in 2007. That study is now more than a decade old. It stated at the time of broad. You know: community needs, vis-a-vis planning and land use. I think it's time for us to refresh that, but also refresh that you know from the perspective of you know, are those still our goals and how do those goals embrace and enhance this whole issue of equity and inclusion? We then moved on to a discussion of a proposed development at 857, riverside driving. Interestingly debbie. This is on the lower drive that you were just discussing long story short. It is a basically a one family structure that dates back to when it was the audubon estate and the proposal is to demolish that building and to replace it with a 13-story 46 unit development. And you know there is a lot of community opposition to that, and the question is whether the zoning calculations are correct, which, for the most part, you know, we've checked, we've been in touch with city planning and, with you know, the borough president's office. It's not the zoning calculations are, you know fairly accurate, but there are some questions about how the street width is being measured, because the street width then determines which far governs there are questions relative to whether the sliver law should apply, because if the site is less than 50 feet wide, so there are some additional technical questions. You know that you know come into play and we have posed those to both the department of city planning and to the borough president's office to help with you know some more detailed analysis, but it turns out that a lot of the decision making falls in the jurisdiction of the building department, because it is the building department that you know will determine what the actual zoning envelope is and what is applicable. Gail brewer has you know personally advised that she is. You know looking into this and is you know, in communication with the building department, and we've also suggested to eleazar that either he or the district manager follow up with the building department to get answers to these questions. It's not a matter of resolution. We just have technical questions which we've online. We need responses to that, but I would say that it is. It is a little bit more than this particular project, because in many cases we get community opposition to you know new developments in this particular location. There are two prior community board requests that have gone unaddressed for the last decade. When scott stringer was born president, we did what's called a soft site analysis and that's basically looking at areas where you could build much larger buildings than it's permitted as of right, and you know in washington heights west of broadway, there are areas that are zoned r8, whereas most of the rest of the aries r72 r8 allows for a much higher density than r72, and this area is in r8. We requested back then that city planning do a contextual rezoning to address that, and city planning in the decade that has passed has done nothing also circa 2008. When the what is now the audubon park, historic district, which is you know where I live, when the boundaries for that were being considered, the community board was asked to give an opinion on what the study area in the boundary should be, and we included the upper and lower drive, for you know reasons that if you look at the housing stock there it is, as you know, older as interesting as some of the buildings that are in the historic district landmarks did not act on that. Nor did they act on any subsequent community board requests to either look at an expansion of audible park or adjacent. You know related districts, so this one-story building either would have been in the area that was re-zoned, contextually had city planning ass or it would have been in an adjacent or expanded historic juristic if landmarks would have acted in neither case, did either city agency give any attention to the resolutions passed by the community board more than a decade ago, and this is something where, once again, we need our elected officials, our president and our council, members to help get action, because we are not asking for unreasonable land use, requests. We've provided city planning and lpc with reasoned resolutions in targeted areas and there's been no response. And that concludes my report. Thank you any questions. Yes, I have a question and I might hand up as well. Okay, so steve debbie, and then we can move on to marielle from the controller's office. All right yeah at the committee meeting wait. I think we agreed that we would have the community board send its own letter to the buildings department, pinpointing our questions so that would it wouldn't get lost in translation. Well that that's exactly what I said that we've asked either eliezer or ebenezer to follow up, and I sent an email outlining the specific questions I don't know if ellie's or ebenezer can advise if they've done so, but I sent an email summarizing the discussion summarizing their six questions and you know asking for the follow-up directly with the building department all right. So the idea, I hope, would be that that ebenezer or eliezer would forward your email to the billings department, so they would know exactly which questions we have in mind precisely that's correct, they're, very good. Okay, thank you, david that yeah wayne. That does explain a lot because it came up for amongst people on monday night and I didn't have the context. I guess just brief question is: do you anticipate any issue with like in terms of the width of the street, that they'll just count the lower roadway like they're, not going to treat all of that and then the little the little upper tiny roadway they're not going to count? All of that are they? That is exactly the question debbie for zoning purposes, for a street to be wide, it needs to be at least 75 feet wide. What we refer to, as the lower drive is only 50 feet wide, so the only way it can be considered wide is, if they're, considering from curb to curb from the lower drive all the way up to the upper drive the problem with that. Anyone who knows the area there's a tremendous change of elevation between the upper and lower drives to consider it. The same street doesn't make sense, but that's the question how you know: how is it for dot's purposes, a narrow street and for city planning's purposes, you'll be a wide street yeah? I don't even think it's 50, I don't. It doesn't add with what I saw, but thank you wayne. You could listen at your meeting. I think d.o.t said it was only 30 feet. So darren lies. Therein lies the question. Let me see what liz has to say. I think she's resting in her hand yeah. I wanna I wanna. Thank you wayne for an incredibly thorough and interesting report, and I want to thank you, elie, sar and ebenezer in advance for moving forward with directing with forwarding what wayne has sent to the relevant agencies, and I think that you know we have not only dot's own, very clear, characterization of that very road as a narrow road. The idea that another agency could regard them as one road and go you know, width of the western curb of the lower drive to the eastern curb of the upper drive is ridiculous. The only change that I would make to whatever argument is being made to DOB with regard to the width of the roadway is to engage the congressman and the united states post office, and I say this because the united states post office mail carriers will tell you that the upper road and the lower road are different roads. So we got d.o.t saying that the lower road is only 30 feet wide and it's a narrow road, and I think that, having you know, adriano likes a good fight, and this isn't this is. This is an easy one, and at this point you know people are kind of having a lot of love for the post office. So I think throwing the feds into the mix here would be helpful. That's it fully noted all right, so we're going to include agnes put on both of you yourself, yeah. The congressman involved in debbie. There's been an enormous amount of that this week. Yes, did. We have ariel from the controller's office wanted to say something: oh marielle from the controller yeah she's been she's been waiting patiently. Next, yes, hi! Sorry guys, I'm not sure if this is appropriate or not because you move pretty quickly on these meetings, but I just had a question for debbie that I put in the chat in the beginning and didn't have a chance to ask when you spoke just if folks were concerned about the margaret corbin not being an open street anymore, because I know some other areas have complaints about that. But I'm not sure- and I was in your meeting for a while- but I don't know if you all went over it at the end or something we did. We did go through today; no, we can right, so I will defer to eleazar, but I think either liz or I can address that and just whenever you can do it offline, I just want it yeah, okay, yeah and I'm happy to download with you my husband for a while. So it wasn't for you, I'm sorry, okay, maria thanks for your patience and mary may remain quite contemporary. Never love you! Hey! I've got a resolution for you, we've actually been talking about. You know the long lines and that seniors and disabled have to stand in to be able to take care of their business and, after speaking, with domingo and with isidro, came back to committee and came up with a resolution to hopefully address this issue, but of course it has to get out to the businesses and I'm hoping that you know isidro and others will help us. Do that. Basically, resolve that seniors and disabled be given priority to enter the necessary businesses to be able to complete banking mailing and buy items necessary for survival such as food, medicines and other necessities, so that seniors can be moved ahead in the line, seniors and disabled people. That cannot stand, or you know, even sit on a walker waiting for a long period of time. In these long lines that happen at various and sundry businesses, don't know how to address that. Don't quite know how to address that with post offices and banks, but you know we can do the best. We can and hope that everybody will honor our efforts and vote in favor of this resolution when it comes to voting. Sorry hold on a second find, my notes. We also completed our capital and expense budget priorities. Those will be, and those will be in the minutes, but also further clarified next month and one of the most important expense priorities that we added as number one is to expand mental health services for seniors. In light of the Covid-19 crisis, you know, seniors are really suffering from depression from health issues. More than ever, because you know friends have died, family members have died and, with the with the social isolation, has come a lot a lot. A big increase in the depression and senior senators staff are reporting this constantly with their interactions with their people. That's about it. Actually. Any questions concerns yeah, I'd like to say something: okay, great! Thank you, mary public safety, chair kurzion. Could I speak john mary's report, a comment, opinion or a question, a a comment and a suggestion for you great enough: let's do it before curtis is that's ready? Okay, very good. I think what mary's resolution I think, hits on a very significant issue which you know affects a lot of people. There are some stores that do provide some advanced hours for seniors, but maybe not enough- and I think this is a very good issue which the community board can utilize to attract some attention to itself as well, and my suggestion is once we pass this resolution. Ellie you reach out to the elected officials. Let's have a press conference. Let's get some publicity on this. Let's try to. I think the press would pick up on this and I think we should ask you know we should we should make a we should make something out of this issue and and try to let people know that we're advocating on their behalf. My second, my second thing mary, is that I'd like to talk to you about the this budget request of yours, because I think it may be duplicative of of the of what is has been the number one priority from the health and environment committee, and I wouldn't want to divide the votes that or the ranking that's done by the community board members. We should try to join together and come up with with one item that covers what you have in mind and what covers what the health environment committee has been advocating for as well in past years. I think we did specify mental health services for seniors and I think we can do that again. I agree with that. We actually did kind of have a you know brief discussion about that possibility in our committee, but we wanted to make sure that you know it's. You know specifically addressed this time around because of you know the increase in the mental health of seniors that the Covid-19 crisis has caused. Well, I mean, I think it's affected the mental health of people across the board, but let's work together on this all right: let's do it steve cedro. You had a comment to make so for sure mary. I would definitely be able to support this resolution because I think it's needed I'm sure it's going to pass so for new license that will come on board. I will remind them that you know this is a community board request and also will be a best practice for businesses, and I'm sure that will be welcoming will be welcoming or welcomed by our restaurants in the area, because it's customary to do this in many other nations. I'm surprised that this is this nation has not caught up in that aspect, so definitely would be a welcoming aspect on licensing. Thank you, mary. Thank you. Thank you, mary, oh really, always being super active in, and I just want to. I just want to point one thing out since I have been on the aging committee, both as a public member and a member and now chair of the asian committee. This is the first resolution that we are having that we are presenting so well. It's a very good resolution, yeah very good, historically and needed okay curtis. Thank you very much. As you all know, it's been a very busy summer with all of the situations happening around the community, we did participate in the noise complaint hearing as well as we convene our committee during the month of July to kind of address some of these issues as well. We'll try to address some of the issues we maintain communication with the people who established the noise group on facebook, claudia she's, been super helpful with updating me and informing me of what's going on with them, even though it's outside of the community board, I'm currently, I I've enjoyed her updates. I have also been working with the precincts trying to help localize situations with noise, be resolved like sort of a block by block type of approach by referring people to the business and helping them to get in contact directly with the nco. So they know exactly who to contact. I'm not always that person, but I can help facilitate the dialogue in the conversation to help them come to a resolution, and what I have heard has been pretty successful with some individual cases that I've heard feedback from our agenda this past week. Excuse me last this past month we did take a deeper dive into some of the 3-1-1 complaints. It seemed to be a pattern of three-on-one complaints being closed out very quickly by the precincts and not being very responsive to the concerns of people individually. So we are going to send particular questions to them next month, in hopes of diving deeper into why we are seeing these this as a pattern, I'm also going to be participating in the beta NYC zoom on friday. I believe, with the borah president's office to get more info as well. So, as you know, quality of life continues to be an issue in the community. I also personally in my own efforts, attended ncl meetings to in order to me to get to know these guys more and to help resolve some of the issues. I've been trying to try my best to attend many of the sector meetings over the past few weeks, particularly in august when they were having them. I'm not sure if the precinct councils are going to start back, but I've heard from the precincts they are planning to start them back this september, I have not received any notice, but hopefully that'll happen. There was a few other emails that came through over the summer, pertaining to the garden on 158th street. That's been somewhat of a of a disagreement between two neighbors and a community partnership between the parks and the neighborhood, and liz has been involved with that. Also, and maybe ebenezer that's unresolved, and I did receive an email a few days ago about this particular complaint and this seems to have escalated once again. So I would love to get your feedback on what some of the next steps should be. It seems like it needs to be resolved outside of the committee, not something that I can manage personally, as they expect me to do, and also I don't think it's something that liz can manage as the parks chair. So I would love to get more insight on what you think we should be doing to help these two constituents also yeah jess. Please go for it. It's it's kind of a hairy issue where there are sort of matters of fact, and he said she said, and it sounds it's a very law enforcement thing and although it's a public area, that's done through the parks department, it's essentially a beef that involves the police and the police. Keep on saying: oh well, bring it to the community board. No, this is, I just want to used to kind of like chime in yeah. Most of the people here in the executive committee are private to the debates and the inside and the inside information. So I think that's something that if you ask at least myself, I think that's something that we can handle offline since the majority of the executive committee, members yeah, that's my situation. The point I was raising is that there seems to be a pattern of you know. When there are these issues, they'll say: go to the community board. The community board is it's just like it just has to be. We can't solve all these individualized problems, so I think we have to find a way to address them without taking on the burden of handling all these issues, even some that pertains to noise. So obviously noise continues to be an issue. I did speak with steve simon a few weeks ago after his committee meeting, to come up with the resolution to put a little pressure on the agencies that will be responsible for these matters. Once again, we noticed that there was a lot of these. You know fireworks unaddressed, you know, there's not a mitigation plan. I did speak with the commanding officers prior to the July 4th weekend and they assured me they had a plan in action. I don't think that plan worked and it continues to see. We continue to hear fireworks so we're in september now. So there needs to be some sort of actual mitigation plan next summer. It will written well in advance of next summer in order to at least address some of those issues. I know. There's I mean a lot of it is it? Is economic people are selling fireworks, they're importing them from pennsylvania and new jersey where they can legally buy them in places and bring it into the city and sell them for whatever profit they're making, but we have to figure out a way to address this particular issue, because it was a large portion of the noise complaint conversation that I think we have not resolved just yet and thank you wayne for all your emails. You said to me about this issue, so the last thing: yes, what role do you think the NYPD played with their strike? Because technically I was part of a situation that went down in one of the parks, and I myself heard an officer say: well I thought you guys didn't want us. So why do you call us? I witnessed that personally. So my question to that is: there's like this strike that wants to be considered a slowdown going on and you have this crime spike currently happening, and is it like it's like the pba is enjoying this because they go and endorse trump, but at the same time it's like they're, just chilling yeah, you know so yeah. No, I think you're right and we did that did come up in our meeting this past month of the perceived public strike. It actually came up in June meeting and July meeting and they continued to well, they kind of denied it, and you know obvious. Obviously no one was going to admit to slowing down or striking deliberately, but there seems to be a somewhat of a strike and there are some people who have called for an investigation. I believe the public advocate called for brigade and eric adams also called for an investigation of this is ongoing, so I don't have much to add, but yes, there seems to be. It seems to be that people who complain about fireworks- I have not seen them being responsive to going to some location, to actually see what was happening on this particular block. I've witnessed it myself and there was literally nothing I mean if I call like someone in particular, that's come to help for the situation. They'll come, but I think citizens are not getting that same sort of like individualized support when they need to for the particular issue. So yes, all right, okay, along with so that's. The last thing I have to mention for my agenda was september the end of august, the NYPD released a discipline matrix and they gave the public 30 days to respond. The discipline matrix did not come to my email address until after the committee had met, we were not able to discuss the discipline matrix, but I did share a copy of what I would imagine to be a resolution that would be hopefully approved by the exec committee. It's nothing too crazy. It's basically just I'm giving a few ideas on how to they can improve their matrix. It's not anti the matrix, the matrix that exists because of a public outcry a few years ago, in order to have greater accountability and greater transparency. So what they've done is they created this long method matrix it's a 53-page document. I read a few times this weekend and I've noticed a few of the problem areas and I've included that into in the resolution, mainly being the resolve, where the matrix would revive the presumptive penalty list. So there's a list and there's several lists where they have like. If you do. This is the this is the action if you do this is the action very few of them lead to termination. That's one problem. The second problem is that the overall investigation process, including people, including things like failure to com, failure to respond to a civilian complaint such as if someone were to call about fireworks. If someone were to call about you know whatever issue that is actually a penalty that they can be had that could be held against them in this current matrix. It is not the case they get like 10 days if it's, if it's, if they're, if they're found if it's substantiated, but so that's one of the problems so that one of the issues surrounding this is the is the presumptive penalty list. The investigative process is still very internalized and a lot of advocates are a lot of folks have advocated for this being an external agency or investigation like most city agencies, there's a new york city office of administrative trials and hearings that would conduct the hearing in the event of an employee who works for the city. Being you know, found to do, have misconduct, issue and then the last issue, I believe. Oh, this is a real big issue for me. I think the presumptive penalty lists are non-binding, which gives the commissioner someone does something egregious, and the commissioner can still say. Well, I'm not going to fire you or I'm not going to penalize you at all. So I think the pimp the penalty list. They should consider having it as being so that you are held accountable, and it's not up to the commissioner to hold your accountable. It's up to the independent investigation that we all have also have included in this resolution, and that concludes my report. Cesaro has a comment or questions to make. I thought is my pops to you and your committee and the NYPD for sending some forces to 174 far between ottoman and amsterdam, a very disturbing fact that there has been a lot of drug activities in the area where a lot of our neighbors are complaining about how they feel unsafe and, as I understand that there have been some operations there, lately yeah. So my props to you and your committee for taking care of this for our residents. As far as like the resolution, curtis lots of information here, lots of substance and lots of numbers, I noticed that the representative penalty has a lot of numbers that you sent us very grateful for that, and I really appreciate the fact that you took that into consideration in keeping us informed. I'm sure you do you do your research, and I applaud you for that. I do, however, would like to read more about into the content of this report, and perhaps we can add more meat to it, and for that reason I don't feel too comfortable in dealing with this issue. At this point, so perhaps will be something that you consider on tabling or bringing back with more meat. So we can have more time to digest that report that you have, which is over 50 pages, strong, just to make sure that we have all the facts together. That's the idea to perhaps to table it, but your comments are goddess: okay, yeah, so that is. That was one of my concerns as well. It took me literally because it is such a dense report. Like I said, the NYPD is giving the public only 30 days to respond, so we have to respond by september 30th in an ideal world. It would have come through my committee prior to today that wasn't possible. I spent my the weekend processing it doing my own research to make sure it was factual. So that's why I brought it to the committee today. I did contact the parliamentarian and a few just to get some advice on what how we can provide feedback or comment in the event that the exec committee did not pass a resolution. I mean the other option is, for you know for the chair to use the chair's power to write a letter and to respond to this and hopefully work in collaboration with me to do that. If the exec committee did not want to move forward with passing a resolution and making our statement, so I am you know, I literally have tried to do my research and present all information as possible, and I understand there are some times straight, so thank you. It revised friends, first, okay, yeah! Thank you chris thank you know for reading that important issue. You know about the resolution and many defense, so I think it's a good idea. I guess that we can, from the time that you actually share the resolution, so we can have more time to go over this, but one of the things that I wanted to for you to consider is some way somehow they got a solution to consider that I don't know if the main power that and our presence have are sufficient to correct the problems that you are enumerating in the resolutions because, for example, in my community, the eastern part of our community is really a problem. I see them coming and people, for example, when they have a loud music. Okay, when they see the police or even the police, get out of the car and ask them politely to you, know to shut the radio or low the raid or whatever you know they know, but once they leave the problem continues. Now I want- and I that doesn't mean I don't think they're gonna be. You know 24 7 on top of this, because they don't have all the police officer and we have to be fair in that respect as well. Now I know another part of the community. Perhaps that problem is not as consistent as it is an hour, and I can understand why, because we don't have individual inside nicholas, doing, for example, creating those noise and we don't have any, but when he also to be considered that they may not have so many police officers available to be 24. 7 trying to you know correct the other problem, so we have to also be kind of. You know fair in the way that we're going to curtail. You know this resolution, so I don't want to make. It seems like we we're trying to target them. You know because this is not the case yeah. It is to correct the problem, but we have to also feel respectful about. You know mindful I should say- and I thank you for that- yes curtis I'm gonna well, I think we should take up on your offer of writing that collaboratively. That's better as a point of information. The other option is the general meeting is before the 30th there's nothing that prevents this reso from being modified and presented to the full board at the general meeting yeah. I think I was getting around to that so wayne. Thank you for summarizing my thought, liz and debbie. This was after me, debbie was before me: oh yeah, so catherine liz debbie, since you haven't spoken all night. Okay, I've had my hand raised the for the past. 20 minutes are real I'll, go ahead, I'll go after you, catherine go ahead. It's okay! I'm just saying just to add me on to the stacks yeah. Okay, what I was gonna say. I think the similar concern that I have around the suggestion with the russell of next week for the general meeting is that it is a substantive amount of information to present that same night, where more members will probably want to support and make amendments and additions, so I think, perhaps still presenting it and I'm not sure again. This is a james thing right where, if we can collect how we have done in the past some more of those recommendations that and kurt is concerned into a letter, because you know it's a substantive and I think again, a lot of the work that we've been doing in the last couple of months. Obviously, with the climate that we're in, we want to be able to still meet that deadline, and so I don't think that we should be taken well. Anything this board does has to eat has to be done by some kind of resolution. It can't because, for example, a committee sending out something that doesn't actually represent the whole board now the point is we have these backup mechanisms so that, if something, if the resolution doesn't get done by the time of our meeting, eliezer can just you know, sign it anyway, and then we will ratify it. You can ratify it a month later. Okay, all right, good, pointless debiary. At the end, oh mute yourself, liz! No, I think debbie goes before me. Oh okay, my bad! I'm sorry and I think mine is just I'm gonna say it, but I don't necessarily need curtis to respond, but curtis. Thank you. It sounds like you have been at 4 000 meetings on behalf of this community with ncos and sector leaders, and that's I it's a lot sounds like you've had a long summer, but thank you the part here. That seems just from the quick scan of that it's a substantiated claim and then all this stuff rolls forward. I just like do you have any concerns that this leaves open all of a sudden, far fewer claims that this is already the case problem right of everything? That's over the whole system. It's not like. We don't have a system of accountability, but it doesn't work because nothing is substantiated so that it was just on that topic. Okay, so yeah. So these most of the claims I did include. I have two facts about the 35th precinct having 55 potentiated in the 33rd, the number whatever it is being substantiated and there's been a lot of data that shows a lot of the substantiated cases. The officers remain on the force after they're, substantiated right. I'm sorry that was my question was the before that of like. Do we start to see things not being the whole disciplinary policy? As I see it doesn't even go into effect, whatever it may be until a claim has been substantiated, so I'm just trying to understand. Is there an opportunity? Let's say this new policy and it was great and it went into effect that all of a sudden there'd be no more uns. There would be no more substantiated claims, so don't respond here. That's just what I was getting at. We could talk outlaw online all right, thank you ariel and then we're going to end it there before we move on to the last. So the mechanism that we have is that we could pass a resolution out of this committee which, having passed it out of this committee, can be sent right away to board members along with the 50-page document or 200 page. However long it is so that board members have the opportunity to review it prior to tuesday's meeting wayne also did send an email in response to curtis's email which attached all of this, which said rather than have all of the whereases, just have a very simple. Whereas that says, whereas the police were, you know, advised to do this top to bottom study and they submitted this report and they've asked for community input by from the public input by september. 30Th now, therefore, be it resolved here's our input and that our input not say we support this plan or we oppose this plan. But we have questions. We have questions about the substantiated whatever and we have questions about. Can you include and invest in some of the things in the resolved in curtis's second email, because I think that reasonable people can and do disagree on if this is a good plan or if this is not a good plan and I think, as a board, we may have differences of opinion on different parts that we like or that we don't like. But even if I disagree with, you know some point in the plan that I think is fine and ariel thinks is terrible. We can at least agree that there are people, okay, that it might be a problem, and so I think that we'll be able to serve the community's interests and respond in a way that is thoughtful without having to get too into the weeds about agreeing. This is good thing. This is a bad thing. Okay, I think yeah before we get to ariel, I think. What's critical and one of the most important aspects is the process. I think this is a second or third time in which we incurred into the habit of creating resolutions on the fly without really looking at what it is that we are agreed upon, and some of us may even agree just because everyone else is agreeing. So I think we should take the opportunity to really look and not again fall into the old habit that I've seen happening reoccurring of doing resolutions without the ability to think through and make a rational decision, whether it's agreeable or not. At the end, hi y'all try trying to add some light here on the tough situation. So, first off you know, I don't want to burden you with the difficult package of reading that I'm going to mention, but please look at the 2019 charter vision commission's work. We had discussed the disciplinary matrix to echo, actually debbie's concerns of how really having a 53-page matrix comes out. I think it can yes very well leave out some of these individual instances that might fall out of that particular written word that comes out in 53 pages. To actually respond to. You know some sort of complaint that might arise whether it's outside of you know excessive force, a piece of authority. I forget all the fatal words, but yes, it's quite frankly. Policy should not be that specific to an individual instance. Policy is supposed to be more uniform in the sense that it can apply to a multitude of different instances that might arise with these interactions with the public. So you know yeah. I would just say please look at that document and also perhaps looking over what was one particular public interest group that was concerned about the matrix of communities united for police reform. There are, quite frankly, a few that came throughout our process and we're talking about this a lot I'll just leave it there, because I don't want to jump into something else that I shouldn't. Okay, I did a list curtis you're, gonna, answer that question or that observation I'd like to move on to dominguez's report, because I'm like 19., steve yeah. Let me let me allow the curtis to give rabiro to oh, yes, thank you I'll, wait till I wait for steve now. I know give me my final, so you're gonna answer both so I could move on it's 9, 15., yeah, okay. I ellie. I strongly agree with what you said earlier that we we need to make a rational decision on this issue based on having sufficient information and a chance to to consider it and absorb this these recommendations. I have not seen curtis's resolution so I'm not sure what it says, but I feel the position that we should take is that this is too weighty an issue to let's just throw upon us and ask us to consider within a few weeks and and that it requires more time, and we should pass a resolution calling upon the police department to extend the comment period. Give us another give everybody another month, because this is too important to the future of the city and to the way in which we have police community relations for years to come, and this is not something that should be wrapped up in just 30 days. I would like us to take a position that more time is required and that the community should be allowed to consider a 53-page document in more than just 30 days. Yep, I'm steve, I think you nailed it, and I think that is. That is exactly how I felt because I think, like I said it literally just came to me last week and I so it's it is a problem. The time period is a problem, so I'm not sure we passed back from the executive committee so that we can just vote on that and have a very short because that's not terribly controversial, we can say the executive. No, that's not it, because israel asked for the resolution to be tabled. If we're going to get back to that, then we should either second it or move on I'm sec. Your second, then, is hidra's request to table it. No, that's not what we're talking about. If we don't weigh in by the 30th, we have no don't get to weigh in at all. Also my suggestion that we have a resolution that says, whereas this is really important. The resolution is steve, has steve, hasn't seen it. So I want each and every one of this person in this community executive committee. No, so look at. Let me finish my point because I'll lie: do you finish yours, as I'm gonna agree, 100 with steve on face agreement and my own point that the resolution needs to be thought out and it needs to be in our hands and looked over before it gets passed right. So I am agreeing with steve, and what I am saying is that we should have a resolution that says, whereas this is really important and we need more than the short amount of time that the police that the NYPD gave us. We respectfully request that the comment period be extended more than september 30th, and that way curtis can have a conversation about this in his October committee meeting and can pass a resolution from the October public safety committee meeting, which we then as a board, can consider in the normal way. Okay yeah. I understand what you're saying so before we go. How about we let curtis speak though man. This was exactly my concern. I think that yes, it I do. I can't I can't even apologize. It's not my fault that it came out so late. We didn't get it until last week, but I do feel like it does deserve a lot of time and I, although I tried my best to dissect everything and yes arielle, I have read the charter revision from 2019, so I'm very well versed on some of the issues. Also, some of the issues that people have been advocating for and against the people have been advocating. The pba has advocated against it as well. So it's quite controversial of a document and it does require. I try my best to just pick out some of the main substance of the document, but I do think that having more people review it and more public input will be helpful not only to the committee but the community overall. So I am in support of requesting in passing resolution to request more time for us to review it. So we can come back to my computer in October and pass as a resolution in our second. So I'm moving forward. Thank you. So we're gonna end. It are you gonna vote all right, eli you're! First on the list, I'm doing the wrong call yeah, I'm usually last, but okay, all right, kathryn, yes, esietro! Yes, gerard I'll go back to gerard. I can't hear him liz yes oc. Yes, mary anderson, yes wayne, yes, domingo, yes and call me and curtis to help out with it. Thank you yes, debbie, yes steve. I think I'll vote. Yes, chris! I'm sorry curtis. Yes, it's confusing richard, yes jonathan, he was there. I think his internet might be happening for myself all right, so I'm going back to gerard okay, eli you're, the last yes, okay, 14 votes, yes, and I have two that either left the call or can't hear us right now. I don't see gerard logged in anymore, a gerard left, so it's unanimous with 14 votes right, yeah, okay, thank you. Okay, one question for parliamentarians for the chair in the event that they say: no, we don't give you more time, then I guess that would mean that the chair and I have to work together on submitting, amen right precisely right, and I would bet that they're not going to well. No, I didn't know that. That's the point is we're just asking for more time and therefore that's why we're not answering now all right come on big event. Curtis we'll have a plan correct, yes! Well! Our answer is to ask for more time exactly, but we should make another substance to it right all right. We need more time and we should send our resolution to the elected officials and to all 59 community boards demanding more time absolutely get it in the minutes. Note that gerard left the meeting at 9., okay and jeff- we don't know when jonathan left jonathan's, not a voting member. He is committee. Yes, can you please ebenezer would promote him to a penalty? No he's not he's, not a committee chair and he's not an officer. I thought he was id the committee yeah, but that's a task force and the task force. I don't think the task force is vote. You think, or you know, which one is it you think then he'll vote. If you don't know, then he'll vote, so we can go based on whether people think how have we consistently dealt with task force in the past already then they vote. I mean go please! Oh yes, please thank you. They vote, but they don't count for quorum. Let me go ahead. We can always get back to that yeah domingo. Yes, I think yeah. So basically it was, as you could see, there's a lot of conversation around small businesses. The impact and, what's next so our committee meeting basically hones in focuses a lot on leading listening to the folks who are directly impacted. So what we try to do is prioritize business owners to try to figure out their situations, what they're experiencing and some sort of advice and input so that we could be able to just to provide a serve a better service or advocate more effectively on their behalf, and so this month we only had, I believe, two to three businesses, and there was some concerns around fund allocations, businesses being harassed by individuals and via social media. What I'm trying to educate myself more on is the new initiative that the city offers as a way of being able to do some conflict resolution. When two parties have certain issues. In this case I would, I would assume the individual who is constantly harassing the business owner is from the community. But from my understanding, the business owner said this individual was from Queens and then so. Let me break down the situation. There was a situation happening in mama sushi where we had the owner of susana osorio present on. Basically, she reached out and wanted to present on the impact hope it has had on small businesses, but also what's going on within the small business community, particularly indictment. So she started presenting about how there were certain harassment, how certain individuals were using social media as a way of targeting her and putting out false claims. So, for instance, there was a situation around the fire skate and the fire escape being blocked by some sort of ornament that she had well this. According to her, the city inspectors actually approved the ornament and it was in compliance with city regulations, but yet people certain individuals still kept targeting her around the ornament and then on social media. They kept just bringing up all sorts of allegations and just basically always tagging her business and associating her business with any incident that would occur within the vicinity, even though they were closed for an hour plus. So that was one of the situations we had another business owner who was talking to us about the grant that was given from the hospital and managed by they were managed by. I think it's hispanic federation, if I'm not mistaken in this thing yeah, so they were. They raised some concerns and I also thank you cedro for making the connection they raised. Some concerns around the what was the framework and what led like what was it that helped these individuals who were auditing these forms identify what individuals needed the resources and they were concerned because there are certain rumors going around certain distributions that went down. That might necessarily raise certain concerns and listen. What's up? Oh sorry, so they raised some concerns around that. Basically, they just want to know how was somebody, how were the individuals selected and what was the process to be selected being that there were in a lot of various businesses? I haven't had the time yet because of school opening, to reach out to the hospital, to figure out to figure out the process and identify the individuals who received the funding. But that was one concern and then, after that meeting somebody who was watching it reached out to me they own a salon. They said they got approved and they never received the money. So there seems to be some like a lot of red like a lot of stuff to look into when it came to that grant so yeah that that's about it and then just making sure that we were gonna have a town hall around. We were working with several business owners to have a town hall around indoor, dining, but being that the sba sbs, I believe it is or sba whatever it is put out some the they put out. I forgot the language for it, but they put out the regulations for indoor dining one of the pluses that I've gotten from business owners is that the percent employees don't make up the percentage of people allowed within the venue. So that's a plus, but I'm still reviewing a lot of the documents and a lot of the regulations associated with indoor dining. So that's that and yeah that's about it for a packed report. Anyone has any thing to add to or ask about dominguez report before we go into new basis and richard allman's report on what it's like to present to us for. Okay, I'll try to be brief. I learned some information in the last couple days that caught me by surprise. Maybe it's something I shouldn't have been surprised by and it's an issue that the community board, I think, should consider I'm bringing it directly to the executive committee just because I think, there's a particular time sensitivity on it. The background has to do with our bennett park on fort washington avenue. I never knew anything about james, gordon bennett before who the park is named after, but I saw in the last couple days that the fire department of new york, not historically a great progressive organization, also had a program an awards program named after james gordon bennett. They just renamed the program because of mr bennett's history and connections with the confederacy. I think we should be the people to call for the renaming of bennett park. I think with the issue live I'd like to see the community board be in a leadership position on this and that's why I'm bringing it directly to the executive committee shouldn't it go to the parks committee and thanks for this, that's the reason I presented as I did. That's absolutely the normal procedure and I think it's a judgment of this group whether we want to- and I would certainly be glad to work with that- I think it's simply a judgment of this group- whether we want to move that extra fast to be ahead of the issue, I'm glad to respect wherever the executive committee goes on. That excuse me, but it is the chair who decides what committees things go to not just executive committee. I think we're saying the same thing in different ways. I think, unless it's a very time sensitive issue as the one that is presented liz, please calendar I'll, be glad to work with you, yeah, and I would like I'd love to have second tuesday of every month at 6, 30 and I'll be more than happy to add this to the agenda. Thank you so much for bringing in my attention richard. I really appreciate it so, as I was just saying richard, I think it's a perfect to go to the protocol of just having it that's fine. It came up in a recent new york times article that caught my attention all right. Thank you. So much- and I read it very interesting- article very revealing as to how sometimes history needs to be revisited because he's not always right. So thank you richard great article and thank you for pointing that out. Unless anyone else has anything that is critical to say, I am gonna call this meeting motion to adjourn bye. Everybody bye, take care.",
        "summary": "I would like to call the attention to all the board committee chairs is our statement of district needs is due October 30th and last night we had a training.\nI submitted this request to the executive committee to see if there is no objection And, you approve it as we do every year to close the office the day after thanksgiving that's great thumbs up any other suggestion or comments on the november calendar Yes, I know that election day is not a legal holiday, but it might be one.\nIt's an effective tool in ensuring that people show up , I think, that's an activity that needs to be taken seriously by the board by the executive committee by the board.\nSo I think that my work as the chair of the parks and cultural affairs committee is very important and for this reason I am remaining on the board.\nMy report wanted to list mention the inauguration of the soccer field here in highbridge, Okay, I report in michael I was just so happy to be there that I kind of hated myself, wonderful, and I will talk about that in my second, my report parks and cultural affairs committee, but my report, in my capacity in my former capacity as secretary of community board 12 is, As secretary of community board 12 Manhattan.\nThat is supposed to be unhackable by the russians, not to say the russians are going to hack our community board election, but you never know so, but you're scared, okay, all right, so we're gonna.\nThat is certainly a resource that ebenezer can connect you to as a model for a successful board election in this platform, with the consultation of our in-house council and all of these other regulating entities like to join the moments of thanking our comrade at borough president's office in honolulu and is, and for curtis young of public safety for his pointing out the problem with the potential taking of elections.\nThat is a critical number that if it comes through it's going to devastate our restaurant industry in other Manhattan, As, we know, they employ a lot of the local employees and for us that'll, be devastating.\nThat has been an issue and I'm sure that the city will address that when the time comes, but thus far it has helped a lot local, restaurants, and I hope it does continue with more regulations in place and implemented.\nIt was a busy summer, Like I know, for almost every committee.\nI am not one to take a lot of time in this committee, but tonight I might need a few extra minutes at first again, because there were so many big things that happened.\nA lot of the first meeting was spent, trying to communicate that we felt overall, that some of the main issues that were raised were recognized either already in the plan or recognized verbally by DOT.\nThere are a lot: There are issues with the street vendors that are there You have this bus way and impacts on small businesses, and while that is a terribly difficult, not you know not to untie, they have been.\nThe idea will be that as far as community board 12 is concerned, my guess is the DOT will be to us in no in the november tnt and therefore the november general, and that Moving on to city bike, as people may know, who have spent time between the southernmost portion of cb12 and 184th street, most of the stations have been installed.\nSolutions did talk to me about speed, bump requests, but I just want to make people aware that speed bumps no longer come through the committee and people do those direct with DOT, but I'm, trying to keep in hand keep close to sort of what they're isolating most of what they seem to be identifying Coming to my meeting so with two big items on the agenda.\nFirst was if people remember, we passed a resolution last spring with regard to pedestrian safety changes around the area of like 157 158, west of broadway and going out to riverside, and but there was a component of that proposal which would convert what is currently a two two-way street into a one-way street.\nWell, people really stay in touch and on top of what's happening, so we had great engagement on the issue and again, I'm happy to provide further detail, but people should know that no resolution came out of that.\nI. Don't know, question safety thing that you have to do: He feels like that's a good thing, because he has the more of the right people who are going to use the service in the right.\nBeyond that, I went on to begin talking to some of our newest members about the process that will be going on in the coming months, essentially picking our own committees, individual capital and expense items, and that was pretty much it for us.\nI think some of that is going to be taken care of as the weather gets colder, but we have a number of neighbors who have had a really hard time with that I've been working with curtis and the public safety committee with jennifer hoppa parks enforcement with the 34th precinct to you.\nWe send a representative on an ongoing basis so that they can share information about deployment and also hear people's feedback, not so that we turn every committee meeting into an undifferentiated, fetching session, but just so that that's another way for for parks enforcement to hear what people's issues are in terms of culture.\nThat may be more feasible that we can pick up on and during the course of that public hearing, tanya bonner had suggested to to ezra that the community board form a task force to continue to act on the issue and at that public hearing ellie said he would do so, but subsequent to the public hearing tanya and some of the other people from that group decided that they would prefer to have what they considered to be.\nThe thing that makes me crazy in this situation is that if it was a capital project, there would be that community liaison as reports to steve's, committee, and I, get copied on a lot of stuff as well about what's happening in a project.\nYou know the hospitals, community relations on this issue, I think, leaves much to be desired.\nWell, my report, as you probably already everyone, so we, our community, discussed on a very important issue that everyone knows.\nI think that it was that I commend my community for is for allowing this specifically or came up with the idea that having then just expressed next monday on the 21st, we know the mayor, along with other high-ranking leaders.\nYou know You know in the meantime, just think about it to see if you, if you want to have that, following in collaboration with the youth and education committee, perhaps maybe on October 13-- and this is my report and thank you.\nAnd I would encourage you to ask the DOE in how many teachers, like actual teachers, not substitutes, are operating within the in school instruction because from my understanding, there's a big issue going on around there not being enough teachers, because a lot of them have opted out to only work virtually because of a prior condition, etc.\nI, think all board members probably received an email from the department of city planning sometime in late June, whereby you know dcp stated their support for black lives.\nMatter, and you know, for inclusion and equity in Well, not everyone, but a number of organizations are issuing their public statements, but I wanted to understand what city planning saw as some of the historical ways that planning and zoning was used to exclude and not to be inclusive, and so I invited initially, our two dcp reps In that conversation, I also reached out to our planning rep at the borough president's office.\nThe borough president office, to help us push that forward, and one of the things we probably want to pay attention to is the neighborhood planning and land use study that we worked on once again with city college back in 2007.\nYou know there is a lot of community opposition to that, and the question is whether the zoning calculations are correct, which, for the most part, you know, we've checked, we've been in touch with city planning and, with you know, the borough president's office.\nThe community board was asked to give an opinion on what the study area in the boundary should be, and we included the upper and lower drive, for you know reasons that if you look at the housing stock there, it is, as you know, older, as interesting as some of the buildings that are in the historic district landmarks, did not act on that.\nNeither case, did either city agency give any attention to the resolutions passed by the community board more than a decade ago, and this is something where, once again.\nThat does explain a lot because it came up for amongst people on monday night, I guess just brief question is: Do you anticipate any issue with like in terms of the width of the street, that they'll just count the lower roadway like they're, not going to treat?\nWe have ariel from the controller's office, wanted to say: something, Sorry, guys, I'm, not sure if this is appropriate or not, because you move pretty quickly on these meetings, but I just had a question for debbie that I put in the chat in the beginning and didn't have a chance to ask when you spoke just if folks were concerned about the margaret corbin, not being an open street anymore, because I know some other areas have complaints about that.\nYou, know the long lines and that seniors and disabled have to stand in to be able to take care of their business and, after speaking, with domingo and with isidro, came back to committee and came up with a resolution to hopefully address this issue.\nCould I, speak john mary's report, a comment, opinion or a question, a a comment and a suggestion for you great enough, I think what mary's resolution I think, hits on a very significant issue, which you know affects a lot of people.\nThere are some stores that do provide some advanced hours for seniors, but maybe not enough, And I think this is a very good issue which the community board can utilize to attract some attention to itself.\nWe should we should make a we should make something out of this issue and and try to let people know that we're advocating on their behalf.\nMy second thing mary, is that I'd like to talk to you about the this budget request of yours, because I think it may be duplicative of of the of what is has been the number one priority from the health and environment committee, and I, wouldn't want to divide the votes that or the ranking that's done by the community board members.\nWell, I, mean, I think it's affected the mental health of people across the board, but let's work together on this all right I would definitely be able to support this resolution because I think it's needed.\nI will remind them that you know this is a community board request and also will be a best practice for businesses, and I'm.\nIt's, a very good resolution, As, you all know, it's been a very busy summer with all of the situations happening around the community.\nWe'll try to address some of the issues we maintain communication with the people who established the noise group on facebook, claudia she's, been super helpful with updating me and informing me of what's going on with them, even though it's outside of the community board, I'm currently, I have also been working with the precincts trying to help localize situations with noise, be resolved like sort of a block by block type of approach, by referring people to the business and helping them to get in contact directly with the nco.\nSo, as you know, quality of life continues to be an issue in the community.\nI did speak with steve simon a few weeks ago after his committee meeting, to come up with the resolution to put a little pressure on the agencies that will be responsible for these matters.\nBut we have to figure out a way to address this particular issue, because it was a large portion of the noise complaint conversation that I think we have not resolved just yet You said to me about this issue, so Because technically I was part of a situation that went down in one of the parks, and I myself heard an officer say: You have this crime spike, currently happening, and is it like it's like the pba is enjoying this because they go and endorse trump, but at the same time it's like they're, just chilling yeah, We did that did come up in our meeting this past month of the perceived public strike.\nThey'll come, but I think citizens are not getting that same sort of like individualized support when they need to for the particular issue.\nYou know about the resolution and many defense, so I think it's a good idea.\nI. Think the similar concern that I have around the suggestion with the russell of next week for the general meeting is that it is a substantive amount of information to present that same night, where more members will probably want to support and make amendments and additions, If we can collect how we have done in the past some more of those recommendations that and kurt is concerned into a letter, because you know it's a substantive A lot of the work that we've been doing in the last couple of months.\nWhereas that says, whereas the police were, you know, advised to do this top to bottom study and they submitted this report and they've asked for community input by from the public input by september.\nYou include and invest in some of the things in the resolved in curtis's second email, because I think that reasonable people can and do disagree on if this is a good plan.\nWe can at least agree that there are people, okay, that it might be a problem, and so I think that we'll be able to serve the community's interests and respond in a way that is thoughtful without having to get too into the weeds about agreeing.\nI try my best to just pick out some of the main substance of the document, but I do think that having more people review it and more public input will be helpful not only to the committee, but The community overall.\nIt's an issue that the community board, I think, should consider I'm, bringing it directly to the executive committee just because I think, there's a particular time.\nI think with the issue live I'd like to see the community board be in a leadership position on this That's why I'm bringing it directly to the executive committee Shouldn't it go to the parks committee and thanks for this And I would certainly be glad to work with that- I.\nI think, unless it's a very time sensitive issue as the one that is presented liz, please calendar I'll, be glad to work with you, And I would like I'd love to have second tuesday of every month at 6, And I'll be more than happy to add this to the agenda."
    }
}