{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "Transportation Committee Meeting",
            "publishDate": "2020-12-09",
            "shortDescription": "Agenda\\n\\n1.    Approval of previous month's minutes\\n\\nJoint Parks / Transportation Committees\\n2.    Proposed conversion of Robert F Wagner Sr Place to one-way between South St and South St Turning Slip in connection with BMCR project \\n\\nTransportation Committee\\n3.    Proposed change in signage on Attorney St between E Houston and Stanton St to Alternate Side Parking\\n4.    DOT: Citibike infill updates\\n5.    Update regarding ongoing traffic issues\\n6.    Planning for January town hall for residents and businesses regarding Open Restaurants and Open Streets: Restaurants programs\\n7.    Vote to adjourn",
            "lengthSeconds": "4:09:09"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "vWTWMjN9D18",
            "fillerWordCount": {
                "uh": 378,
                "um": 687
            },
            "readTimeFullTranscript": "148 min read",
            "readTimeSummary": "23 min read",
            "wordCountFullTranscript": {
                "street": 119,
                "parking": 112,
                "traffic": 70,
                "bike": 64,
                "sidewalk": 59,
                "cars": 43,
                "block": 41,
                "pedestrians": 38,
                "loading": 36,
                "project": 34
            },
            "wordCountSummary": {
                "street": 27,
                "parking": 27,
                "traffic": 21,
                "bike": 18,
                "lights": 14,
                "strips": 9,
                "project": 8,
                "sidewalk": 8,
                "enforcement": 8,
                "pedestrians": 8
            },
            "fullTranscript": "Good evening, everyone I'm 6:46, welcome to the Manhattan community board. 3 transportation, public safety, Environment committee meeting for December of 2020 also want to welcome our colleagues from the Parks Committee, who will be on for a joint agenda item Michelle if you can go through the guidelines before I move forward with the agenda. Yes welcome and thank you everyone for coming tonight, sorry for the hiccups there. It was bound to happen during this weird time. As Paul said, this meeting is being recorded if you have not signed in since the recording began, please sign in the chat and enter your name and affiliation that can be CB3 resident, Delancey Street resident if or something more specific, and if you want to speak on one of the specific items. You should also note that, so you could say, Michelle Cooper, Smith, I live in Delancey Street I want to speak on item number five. We will also ask you to raise your hand once that raise your hand via the zoom function. Once that item comes up once the presentation has been made, so we can actually call the people that want to speak at that time. Please keep yourself muted. Unless the chair has asked you to speak, there are instructions for how to do that up here and also I would just make it very clear that the chat is purely for signing in and if you have any technical issues, when we were in person, we wouldn't yell out in the middle of the meeting, and so that's how I think of the chat. Please don't put anything in there. That is part of the discourse it's purely for being recognized and for technical issues. If you are appearing as a group, please indicate at most two speakers who will be speaking on your behalf. Everyone's opinions is very important, but we want to make sure that we all can be in bed at a reasonable hour tonight. We have a really packed agenda, and just so, you know that there will be a verbatim transfer transcript of this meeting based on executive order. Some of these items will have resolutions that will be formulated at the end of the presentations we haven't. I don't know, Paul does necessarily decide on which ones that will be, but that's the typical committee process is. We will hear a presentation we'll give the committee a chance to ask questions and speak. The members of the public will speak and then we will form a formulated resolution if relevant and thank you all so much for being here tonight and for our parks. Colleagues, thank you, Michelle just to add on to what she said tonight. We do have quite a large agenda outside of the joint committee item. So I will, if I, if need be, have to limit questions from the community in certain topics in certain areas. Just so we can move and have a go through this relatively in a good speed. So please don't be offended if I cut off questions at some point, I will try to get to as many of your questions as I possibly can, but I do want to think about time and everyone's time on zoom as well. That being said, let's talk about the minutes. Agenda item number one from November. There is one change that does have to be made spoke with the office about a week or so ago. On our resolution from the November meeting in reference to excuse me the bike lane on Avenue C. We had to remove a couple things from one. Whereas there was we put East River Greenway ride, Count data. We are removing that portion because we never put the data in that's the problem there and then a couple, whereas is down from there. It said description of proposed protected lanes describe how they are moving. There's a lot of descriptions and we didn't put the descriptions in because we were awaiting the DOT presentation. It does not have any real effect on the overall resolution and what we asked for. Are there any objections to those changes? I did send them out. Yesterday we passed a form of the resolution at the full board right, yes, and after the full board, this was brought to our attention. Susan. Can you elaborate on this for a quick second? So we didn't change any subject. We had two placeholders, we had placeholders in parentheses, so it's basically said parentheses number of parking places, parentheses at the meeting. It was never filled in at the meeting, so we took out the placeholder, we changed no substance whatsoever and that happened in a few places, so we have taken them out in what we sent I mean what I'm asking is. If we pass this yes, we did not send them out, because Jim was reading the emails to send them out and follow. Why are we dealing with it in the minutes? I? Don't think we need to touch our minutes. We need to make sure that we pass the right thing at full board, because the resolutions in the minutes, the wrong reasons I- have no trouble changing it. But the fact is, nobody looks at these minutes and this isn't the place that they need to be changed. I'm just making sure we have changed them, the correct thing and the version that we've set all and we voted on it. That way, you voted on it with placeholders. So then, what we need to do is that the full board have a motion to modify something previously adopted and it'll go through just what we're doing now at the full board as a motion to modify something previously adopted. Copy I'll put that in. Thank you all right outside of that. Any other objections minutes no we're good. All right wendy! You can start lead us off with attendance. Please! Okay! Thank you very much! Paul Rangel here present Michelle Cooper Smith. Yes, Lee Berman, yes, David Crane David. Can you guys sorry I had to go store? My collard greens? Yes, okay! Thank you! Felicia Crookshank, Felicia, I, don't think she's on okay, Wendy Lee, yes, Ellen Lowe, yes, Tariq, Ramos, Tariq I, haven't seen him come on. Okay. Thank you very much. Thank you. Trevor! Do you take attendance now for your committee at this point? Yes, I'm just gonna note who's here the attendance I'm gonna have to handle at our Thursday meeting, primarily because I know there are a number of people who signed on who were not able to continue and they did not try again. So I'm just going to take attendance for to see who's here from parks, K, Webster, Michael Moreno, here David Adams, Jerome, Altman, Carlin Chan, here Ryan Gilliam, Val, Jones yeah, here Carolyn Ratcliff, Robin, Chatel, Josephine Melissa, yes, oh, she made it okay and Troy Villas okay. So I'm done! Thank you Trevor all right. So we're going to agenda item number two, which is our joint committee agenda item for parks and transportation. I believe there's a presentation will Fisher is: are is wolfish or not yeah good evening everybody, if I, could ask community board 3 to please also add James Greco who's, also on the list, as presenter he'll be sharing his screen great good evening, everybody hope everybody is staying, healthy and safe. My name is: will Fisher I'm with the New York City Economic Development Corporation, I'm joined here by additional colleagues from EDC and also by our teammates at New, York City Department of transportation, as well as Aecom, which is our design firm for the Brooklyn bridge to Montgomery coastal resilience project. So we're here this evening to present a to give a transportation related update on a modification that we're proposing to make as part of the Brooklyn bridge to Montgomery coastal resilience project. Like folks have noted, we typically do give up on that project at the parks and waterfronts and Resiliency Committee, but we're here tonight because of the issue that pertains to transportation. So thank you for hosting us as guests. We're glad to be here so James. Are you ready to do you have the presentation available to share yes, I. Do great, okay, I'll, pull up my it says: host disables participant screen, sharing, okay, Paul or Paul's working on it. I think, okay got it great, have worked on it. You should be able to do it. Okay, thank you. Paul you're welcome. All right sharing my screen here great. So once that's up I'll just give a quick intro and then we'll turn it over to James a team. So James, would you mind going forward one slide, maybe two slides great. Thank you yeah, so really quickly. The team will give a project overview, but yeah. This is the perfect slide. Thank you so just for folks who may not be familiar since, like I mentioned that we typically present at the Parks Waterfront Resiliency Committee. The this project is a is part of the lower Manhattan coastal resiliency portfolio. Oh I neglected to mention that we also have Jordan Salinger from the mayor's office of resilience here, so we're looking tonight at the Brooklyn bridge to Montgomery coastal resilience project, which is in the two bridges neighborhood, and this is a project that we are about. 75 percent through design on we've, been doing outreach over the last three or four years and we are looking to get to final design 100 complete design in early 2021 early next year. We have a pretty brief overview of the project. If anybody wants more information, my email is in the chat. We also have all of our previous presentations posted online. So again we are going to give mostly updates related to the transportation component of this. But if you're interested in more information by all means, we will provide it so with that, I'm going to turn it over to James and then we'll go through the presentation, which is pretty brief, I believe it's 25, slides and then we'll be able to take questions. This will be posted on our website in the next day or two as well. So with that I'll turn it over to James. If you will I think everybody for joining us and giving us the time tonight so I'll just back up to go over the general introduction. We are looking tonight at the proposed changes to so traffic modifications at Robert, Wagner senior place at the intersection of South Street and Robert Wagner we'll go through a brief overall project overview for the Bmcr project and look at the existing conditions at the intersection in question and the proposed changes so as well mentioned. The bmcr project here captured in Orange is a part of the overall lower Manhattan coast. Resiliency Effort Eastside Coastal, is to the north, which is going into construction, has begun and then going south from up around the southern tip. Are the remainder of the projects, so we are included at the Brooklyn bridge abutment up to Montgomery Street, we'll see that a few times throughout, as we zoom in a little closer here's, our project I outlined in the black-lines overlapping, with some of the adjacent projects that have either been completed or are going into construction, namely pier 35, complete ere package, 3, complete package 4 under construction and bbe to the south of our project. Here we are one more time. Looking at the intersection of Brooklyn bridge up to Montgomery Street, passing, pier 35 and pier 36, we create a dry line, bathtub tying into high ground at the Brooklyn bridge abutment and then back into high ground at Montgomery Street to keep water back from the East river. We will eventually be zooming in right at this intersection here of Robert Wagner and in South Street, so the project can be described in three main areas: enlargement, one two and three: it crosses a fixed, concrete flood wall to keep water back along. The Brooklyn bridge abutment crosses over South Street with a operable flip up flood wall. All these orange lines running up underneath the FDR, are flip up barriers which we'll show in more detail a couple localized operable gates that are that stay exposed, but open for vehicle and pedestrian traffic, some areas of fixed flood walls and then eventually crossing back across south street and tying into high ground on Montgomery Street wrap around the existing school playground, we'll zoom in here on enlargement, one where we'll see the flood wall tying across South Street and then the flip of barriers running up under the FDR along Esplanade. The main things to point out here are that underneath South Street, there is a large intercepting sewer that collects sanitary and storm runoff. It's six feet by eight feet below the street, that's an integral part to the storm collection and flood prevention properties of this project. In order to make the best use of that sewer. We're going to install a concrete box, a vault below South Street here that allow us to shut down that sewer when we need to and to operate the gate and the equipment located in that below grade structure, we'll be constructing a control, building a control house right next to the existing DOT yard, along Robert of Wagner senior place, we'll explain those a little further in a couple slides. Here's a close-up of the architectural flood walls that will keep that are fixed that remain concrete. This is a flip up gate in advance of a design storm in conjunction with the emergency response plan. This will eventually be flipped up from its stowed position, which currently allows traffic will allow traffic to drive across it. It'll flip vertically seal against this wall here and keep water on the river side to create a continuous flood alignment moving up to the midpoint of our project. The majority of this section is characterized by the orange lines here, which are the flip-up barriers which operate similar to the roadway one that crosses South street, going under the Manhattan bridge. There are some areas where we have additional types of floodgates that are operable. They typically remain open, maintaining visual access to the views out across the river, but in the event of a flood in advance, these gates would be would slide closed and the orange gates would flip up to create that water type barrier moving to the far north end of our project. The flip up barriers end at pier 35, and then we have a mix of swinging and sliding gates that allow for pedestrian and vehicle access. We have pier 36 area that is DSNY FDNY and NYPD have facilities on the what we call the wet side of the alignment in the event of a storm. These would, they would operate evacuate through here, get whatever equipment out. They need, and this would close off and become that same watertight seal here, coming back up across with the football barrier across South Street at the north end and tying into high ground again at Montgomery Street. Here's a view looking south at a typical area of the esplanade under the FDR we're looking south we've got the East River on your left. We've got activity area and a raised sill here in the middle below the FDR and South street, on your right, you'll notice that we've raised the sill here. The intention there is that occasionally there are high tides from the East River that we call low level flood instances that could, over top the bulkhead and could bring water into the two bridges area by raising this up two and a half feet that provides a solid, continuous barrier for resisting the low-level events. However, in the event of something more long lines of superstorm Sandy, the water would be higher than this raised sill and in the event there we have along this pathway is a walking surface. These panels here are the operable flip up gates that would be deployed seal against this. These concrete columns, which house the equipment that operate those gates and allow for evacuation and maintaining all the water on the Riverside. The here will show you a condition during the storm, so we'll see those gates have been deployed, locked in place, keeping the water back, we'll flip to the next one, which is a view from the dry side of the alignment so South Street again, and the bike lane on your right, FDR above and this raised. Sill housing, the operable gates, you'll, see that we have stairs and access ramps for people getting across to the water side and the amenities along the length of this change. This is just a typical condition, but there are other areas of playgrounds and fitness equipment throughout the length and that's been typically covered under other presentations. So this is a typical condition on a dry day in the event of a design storm. This is what it would look like. Those gates would flip vertically, be locked out from the wet side and keep water back from getting into the two bridges area. In addition to the gates and walls, there is a the large intercepting sewer currently below South street that collects water from upstream and within the two bridges area. Both sanitary and storm water flows into the sewer and is eventually gravity fed to the Manhattan pump station to be treated at Newtown, Creek Wastewater treatment plant. We want to take advantage of this system to be able to collect and store water in this considerable volume within you know below grade, so any water that is getting into this area can drain and have a place to stay below grade without causing street surface street level flooding. So our plan there is we're going to zoom in right into this area right near Robert, Wagner on below right above South street. This is that same view. We have interceptor sewer running from upstream continuing on to Manhattan pump station. The important part of this slide here is this concrete box which houses a heavy submarine, watertight style gate that can swing closed and will resist any water. That's stored up in this end to prevent that from entering the dry area of the two bridges area that also keeps the downstream portion of the sewer empty and allows it to collect water from within that drainage area. We'll flip next to a top down view to look at this box in a side view as well, so on the left, we're looking from street level down, we have a large concrete box. We have the interceptor sewer, which would typically continue left to right through here, and we have this large stainless steel gate that will close, typically or main open, allow water to flow through to the pump station during the storm. This will be closed by DEP, sealed tight panel and hold water for storage in the upstream side. Similarly, looking in a cross-section view, we have the upstream filled, so the water is not adding into this drainage area, and then we have this opportunity here on the down downstream side of the gate to store water, let it flow into the sewer and let it fill up and that way we can keep that volume of water down below grade. So that's the overall project now to make that possible. We need to install a the intercepting chamber gate here and the interceptor gate building which we call the igb adjacent to it. The existing conditions I hear a couple aerial views and a map we're looking at right along this area along Robert R Wagner. What we want to point out and we're getting at mainly for tonight, is that the south end of Robert Wagner is currently a two-way traffic and we'll be proposing a change to that. So a little more detailed view of where we're looking north is kind of up into the left. We have south street running eastbound, one lane westbound two lanes. We have a slip street off of South Street that allows traffic coming off of South street westbound to turn right onto Robert Wagner or to turn left. However, you can see the left-hand turn here is typically congested by. There are some temporary barriers here that are intended to prevent parking. However, there's still a decent amount of illegal parking that happens along this area here so kind of cutting off the two-way traffic possibility. Here we have a pedestrian route. If you want to get from this block here down to the sidewalk here, there's not really a great path. You can cross this crosswalk here, but there's no real indication of where to go from there and no defined crosswalk here it's currently the city DOT has a dugout yard right below the FDR off-ramp and their access for their fleet vehicles are through in and out gate currently accessing at Roberta Wagner, where they would typically make a left to go north or make a right to go here and access South, Street again, creating some conflicts between turning and blind turns for traffic coming either northbound on Robert Wagner or trying to turn southbound to get to South street. So, in addition to building this new building, we're going to try to resolve some of those current negatives to this intersection with that the proposed conditions zoom back out one last time to tie in, we talked about the Esker project to the north. Here's a Manhattan pump station. The Esker project has a similar interceptor gate where they're installing a below-grade chamber here to control flow to the pump station. They have a second intercepting gate here to control flow to the pump station, and then hours we'll be going here and we'll eventually pass through the Esker version, and here you can see the intersection of the two projects at Montgomery Street, so zooming in to the left here we'll be looking at this intercepting gate. Building the two on the bottom right are from the Esker project and the one the top right is from our bmcr project, we're using the same architectural design and language so that they are a unified look between as a whole, a resiliency project and James. If I could jump in really quick there, while you still have the map up, just to summarize the reason and need for the interceptor, steward and gates, this I think helps summarize it. The best of all the pages is that essentially, while the ESCR project to the north and our project into bridges, are keeping storm water out, if the river rises like it did during Hurricane Sandy, we also need to protect against having water come up from the sewers into the neighborhood and also need to be able to handle rainfall. During that storm event, so these gates essentially block off the sewers from adjacent neighborhoods from passing under the wall and bringing in flooding from the sewers. So that's essentially what we're controlling for here thanks Jane. Thank you. Well, thanks for pointing that out. So looking at our proposed conditions, I think we have two slides left we can see here in this is our concrete box here that houses, the interceptor Gate Chamber and the gate that will close off intercepting sewer, which runs under south street, we're not making a change to the traffic on South Street. However, we will be connecting the hydraulics and electrical utilities that serve that allow the Gate Chamber to close and monitor and operate in the water service that will be in there that will all be routed through a below ground duck. Bank utility run that ties into this interceptor gate building which houses all the equipment that allows that gate to close and operate and can and connect with the DEP man pump station control system to fit this building in here, allowing for adequate pedestrian access along the sidewalk, protecting it with vehicle bollards. We have a space for a portable generator in case there's a loss of power that we still need to close this gate. This generator will not be here all the time, but DEP can deliver it hook it up to the building, and then that will allow it to be powered. So it can operate the gate in the event of loss of power during a storm event to fit all this. In this area, we've had to bump out the curb line which eliminates a possibility for two-way traffic in this area. However, some of the benefits that come from that are I forgot to mention in the existing conditions slide that performed a traffic studies area in June of 2019 and found that traffic two-way traffic on the south end of Robert Wagner they're only about there's only one car about every 10 or 15 minutes that was using the two-way traffic. Typically, most cars were traveling northbound on Robert, Wagner and majority of the cars that were using the two-way condition heading south on the South Street were actually coming out of the D.O.T yard and making a right so to accommodate that traffic. We've proposed to install a direct access to South Street for the DOT yard, moving the gate from this side here over to the east side, so I can access eastbound westbound on south street. We've also shortened the crosswalk here across Robert Wagner, by pulling the curb line out and providing signage that allows for direct access and visual clarity for coming across the sidewalk across through the curb cut across this crosswalk and then down continuing along the sidewalk. Here, we do want to point out that this also eliminates a lot of turning conflicts from people trying to make a left or a right over sexting or intersecting in this area, while also removing some of the possibility for the illegal parking. It was also creating a danger for cars or pedestrians crossing in that area. We do want to point out that city DOT is with us on the call. Here, we've been working closely with them. They have approved this and we're currently working with NYPD and FDNY to make sure that this doesn't have any major negative unforeseen impacts on their operations, we'll close with one last slide, which is an aerial view. Looking from Robert Wagner down to South Street, you can see a better view of the parking, the building, the DOT yard, access to South, Street and then beyond. We have the bike lane and the flood wall alignment just off frame. So with that, that's the end of our presentation. I will stop my sharing and give it back all right. Thank you for the presentation, Transportation Committee, any questions. So far, no Trevor I'll pivot to you for your committee questions. Obviously we're a little more involved in this process. So I know I've got quite a few I want to see folks from transportation if they have I mean from transportation from parks. If there's any questions from the committee members before I, ask my questions: if you want Trevor, you could have your committee members raise their hands and I could call on them. If that works, sure there's a few on. If there's any questions from any command members, can you raise your hand and I can't see the hand? Apologies I can't seem to find the raise the hand thing: hey Val go ahead! Oh okay, my question was about the sewer section. Is that sewer section that the sewer slides that you showed is that's? What's down there? Now? Yes, ma'am the large sewer. Those are all the existing. We are just adding in the concrete box that intersects it. So what exactly was the title of the concrete box? It's the interceptor gate, Chamber, bringing up that slide again. The yes I can bring it back up. Thank you, okay and then I guess. The other question. Is it what is somewhat the timeline here, because that looks very much like wasn't that one right? Yes, ma'am, I'm just reversing here this one! Yes, so it's the interceptor gate, Chamber I, don't see that yeah! Sorry, the name has changed a little bit since this slide is put together. It's this interceptor isolation, gate the gate is what's in there and the chamber is the box that houses it all right. So the interceptor isolation gate is what's being added. The rest of the things are already there: yes, ma'am, okay and then in terms of a timeline because I, don't you know, I didn't look at everybody's name here, but Aisha Torres is the resident leader down there in Smith, and this looks like Smith houses to me. So I would want. You know her to have an opportunity to look at this, and you know have some comments, as well as the people in Smith I have relatives to live on, South Street, so I, I'm concerned. So what is kind of like a timeline? Will there be an opportunity for people like Aisha the resident leader from the Smith, to comment yeah so ballet good evening? Val? It's nice, just nice to see you nice to hear from you so I. Actually, so we did discuss the on street condition with the new building the new crosswalk, the sidewalk changes. We did discuss that with Ms Torres and Smith houses when we were there in February of this year separately, I called her a few times this week and then sent her. This presentation so definitely happy to have that conversation you're correct that this is in front of Smith houses, so we do want to make sure that we get their input. Okay, good. I'm glad regarding the timing valley, neglected to answer that this work is all going to be part of the Bmcr project, so we are completing design in spring of next year and then that project should begin construction by the end of next year. So you completing design by spring of 2021, and you begin work the end of 2021, that's correct! Okay, and do you have to go to the design commission or have you been to them already? No, the design. Commission components have been worked in to the presentations that we've worked through with the Parks Committee. The interceptor gate building did appear in our latest presentation, and this sub-grade work did not, but is I, don't think is subject to pvc necessarily, but we are like James mentioned reviewing this. We worked on this pretty closely with D.O.T and then the fire Department and police department as well and yeah. That's the levels of review that we've gone through. Okay. Well, I'm glad that you're going to talk with Aisha that that's good, thank you, hope you're doing well. Thank you all right. Any more questions from Parks Committee members. I'm wait! I, don't see anything! I'm sorry, just one more comment, because I got something today that there's now a bmcr website. I didn't hear that mention, but there's now a brmc website and I think people should be able to go there as well as I. Don't even understand the link I got senior citizen here, but there's a link that has english Spanish and Chinese in relation to this Bmc. Our project and I would just hope that you know just let everybody know that there's a web page as well as a link for you know in english, Spanish and Chinese. That's great! That's a really good point. Thank you. I think we were so focused on the transportation aspect. I neglected to mention that so yeah. We actually just kicked off an engagement campaign on this project, which is going to be for this week and next week we are working with Aecom and carp strategies, which is a engagement consultant that we have on our team and they are distributing posters to posters and flyers essentially to any building in the project area or other organization school. That would like to have some of those so I believe our team has been in contact with the resident association leaders from nearly all the developments along South street. We have something like three or four hundred posters going out this weekend next and we are also going to be doing a webinar with live. Simultaneous interpretation in spanish, Cantonese, Mandarin and Fujinis next week on December 16th, so Val. Thank you for reminding me to say that I'm gonna put the link to the website where you can find the info about the event and any you know, I'll put that in my email in the chat so that everybody can see that. Thank you, Val. Okay, thank you. That was going to be my next thing. Put it in the chat. Thank you. I'm going to go through some quick points and questions more or less focused on the transportation component of this. First of all, thank you for the presentation. Will I just want to make a note that this is the first time we're seeing the interceptor gate information for this portion. So if we could make a note to present that to the parks committee in January that'd be helpful, so we can focus questions on that for that particular topic. The just want to point out a couple of things and I'm I don't really see any issues with the proposed reversing of traffic I. Imagine the only people who make that right turn are from that DOT yard if I walked out every day, I never really paid attention to it. To be honest on that particular slide, there's a couple of concerns where there's illegal parking, because that area is horrible and it's full of cars that park illegally every day all day, there's no enforcement in an area. I'm a little concerned, I appreciate the sidewalk, the sense of the sidewalk, but what's to prevent those cars from parking on that sidewalk. Once it's extended, it's not heavily trafficked for pedestrians, but there is some traffic in this particular era, mainly the two bridges here: we've taken on the approach of pedestrians, first, primarily because of a lot of issues we've had with pedestrians and pedestrian safety, I mean there's a great emphasis on bike safety and bike transportation. That's why there's a bike super highway along South Street, but there's absolutely no emphasis on pedestrian safety, so I'm going to focus on that portion of it. The concern is that you've moved the entrance and exit from the DOT yard from Robert F Wagner, Robert Wagner place and you're, not placing on South Street a lot of those cars, because there's only one turn making Tessa Street actually make a left turn to get on the Brooklyn bridge, because it's very quick from that are they now going to have to make that double left or wide u-turn to go to get on the Brooklyn bridge and that that's the second concern. The first concern is the sidewalk and what's to prevent cars from parking on that sidewalk yeah. So I can answer the first one and Trevor if James. If you wouldn't mind showing the proposed condition, so there are going to be balls, protecting the interceptor gate building, but not the sidewalk itself, I'm sorry! Oh, the sidewalk is soft. The bollards are actually going to be protecting. They will be on the outside of the sidewalk James. Perhaps the rendering shows it a little bit more clearly, so, at least for that section near the brigade building itself that will be protected because but I hope that answers your question regarding that. No, if you look at the little pedestrian in orange, that's what I'm worried about cars parking at, because you know that area, there's just so much illegal parking down. The area is horrible, and this is DOT they're going to want to park on that sidewalk they're legally parking there now outside the bears, I'm just trying to see if we can find a solution to prevent cars from parking on that sidewalk, okay and the ballers be extended upward so that they can't pull the car in that area for vehicles. Yes, so I'm not sure of the design intent, but behind I assume it was just to protect the building. But if the committee is interested in that, then by all means would encourage you to put it put in the resolution. We can speak with our partner agencies regarding that as well. In case anybody wants to mention it. Oh James sorry go ahead. One thing on there is: we do need to keep the sidewalk open for some length because when DEP needs to deliver their generator, it's the gates are located here. So I have to hop up the curb and pull back in here. So we couldn't I, don't know we could do a full permanent blockade, but there might be something to look at. You know I understand it's just there's no enforcement at all in that area of parking, which brings me to the next point about South Street and the increased traffic, and I'm happy that you're looking at this portion of the street to improve pedestrian and traffic flow. But we need to also look at the other intersections, including pipe ruckers and Catherine slip. What we'd like to see and what's important to follow this whole path of pedestrian safety is to get lights at those intersections which are similar to the ones that Clinton, which show a bicycle red or yellow light I, don't know the proper name. For those there is one at pike. But if you go to slide 14 or 15 I know you promise ways to slow down bikes, those arrows that you see and you notice, there's a senior citizen, pushing someone in the wheelchair. That's a common scene, and you see the bike going by there's nothing to tell bikes to slow down. We need lights. We can't have there's no rumble strips or suggestions for people to slow down. Anyone who has bike down South Street knows that there's lots of conflicts and we want to make sure this is a safe area. So we're asking for lights and I, don't know if someone on the from D.O.T is on I'd like to get the proper term for that, because there is one at Clinton street which has lights for bikes. Is someone from D.O.T on give me the proper names like Mr hi Trevor good evening? This is Jennifer Santina's DOT, so those are just going to be traffic signals for the bike phase and, as will had mentioned, if this is included in the CB3 resolution, that's something that we can continue to discuss James. Well, I'm not sure if that was already looked at, but it certainly will be something that we can review right and I. The issue is that part of this is EDC. Part of this is DOT and there's obviously some ordinary agency coordination. We found that out when we were trying to get some of the light fixed under the FDR which took years based on jurisdiction, but I think it's critical that we have, because we are a walking community. You remember the survey from the Brooklyn bridge Esplanade pedestrians experience was number one or number two, because we walk the people who typically bike through the neighborhood, and we want to avoid these conflicts that we have I know. There's some community members on who want to speak. So I'm just going to add one more thing that I'll let the community members because I know some wanted to speak so I'll. Let them go first, I'll, take a few questions from the community, raise your hands in order and we'll call on you that way and we'll move from there. So we can move on this agenda item and move on to the next item. Oh, we may have to write a resolution on this. Thank you, Trevor, we'll come right back to that grace, Mack hi! Thank you for the presentation and it's very similar to what Trevor just said with concerns of we don't have anything about changing the or reversing the traffic, but I think it is very important for I. Guess everybody not just you know pedestrians, but also bicyclists as well as you know, a vehicle that there should be traffic light or bike light lights. I'm sorry at the access points of all entry into the Bmc or like across, because people do cross there and there's very a very little strip of media walkway before you know you get, you know, intercepted with a bike, so I think it helps as a visual aid for everybody in terms of like just walking so there's. No any description like any issues with like anybody getting into any potential accidents. So I think it is very important if we're addressing like safety and we're looking at everything with you know related to the Bmcr project is very crucial about that. So that's my comment. Thank you. Grace I, appreciate that and good to see you so yeah a couple things so we have been able to. As we have been constructing sections of the Esplanade separate from the Bmcr project. We have been able to respond to a few CB3 requests for four additional rumble. Strips I would also say that, like I mentioned, we are at 75 percent design, but which means that we can't move a lot of the larger elements around anymore, but we can continue to fine-tune smaller elements such as you know, adding rumble strips or looking at what crossings look like exactly as we get towards 100 design. So this is helpful feedback and we'll definitely be taking this into account. I think the sorry I thought I had one more thing to mention, but I it slipped my mind so yeah. Thank you for the feedback. Oh just one more question as we're looking through this for the feedback, if you recall from the last I guess CB1 with the parks meeting I have mentioned about like what I guess. I didn't use the correct term, but it's really like for joggers, where they shared the same pathway as well as the bike lane. Is there any way to maybe diversify it or have it as a separate? Also because of safety issues? You know where you know: there's a bike lane, but then, where there's joggers and there's a lot of avid joggers as well. As you know, the half marathon goes through here all the time every summer. So if there's a way that to address that issue as well as you're doing the rubber strips and everything like that design, you know to put that in because that also causes a safety issue where they're sharing the same lane as bikes list so as the bikes. So is there any way to I, don't know something to think about. Maybe you know as you're looking at all these safety issues and addressing it absolutely okay, we'll keep that in mind. Thanks grace all right, what do I have next, just a quick reminder to the community. Keep your comments or questions two minutes. We do time for the to keep the meeting flowing. So it is two minutes next person I see is Christina from Knickerbocker Village. Yes hi. Can you hear me? Thank you, Christina hi. Everyone thanks will and James for the presentation, just wanna back up what grace and Trevor mentioned about having the bike traffic signals, whatever they're called at the intersections I know when DOT was installing bike lanes like around the neighborhood, the kvta had actually asked for these signals at all the major intersections along South Street, and they, for some reason, did not grant them. So if we're going through this whole process of you know, rebuilding the whole waterfront. If we could just add that, because I walk along this path pretty frequently and it's pedestrians, there's joggers, there's cyclists and we're all kind of like sharing the same space, and it's it just makes walking difficult, so yeah I would definitely like to advocate for that as well. Thank you great thanks, Christina nice, to hear from you and thanks for all your help with the outreach campaign getting the word out all right. Of course, thank you. I see Daisy's Iphone Daisy, yes good evening. My name is David Chavarria and I want to thank you for your presentation and I want to thank the community board for giving me this platform to air. My grievances, I'm I, want to talk on the same vane as grace and Christina, which is putting a traffic signal in the cyclist lane. Now I'm representing the residents of lands, N1 and Tuf Les and we live on the waterfront and we want safe access to the esplanade. Now personally, I've been a victim of cyclists hitting me as I'm trying to attempt to get to the esplanade. So what I'm asking is protections this signal for our residents, because when you cross there we're like sandwiched in between oncoming traffic, a very narrow pedestrian path, and then we have the cyclist before we get to the esplanade. So it's very dangerous and I don't want to feel like I'm risking my life or the resident's life just to get to the esplanade. So I think that it will make a lot of sense if we will have a signal traffic for cyclists and, unfortunately like I, don't want to infringe on the cyclists rights, but I have to say that they are infringing on our rights because they have a certain arrogance because they speed and then they get angry when we are in their way. So to keep everyone safe, I would humbly request that as a solution that there be a traffic signal for the cyclist to protect all of us in our community. Thank you. Maybe I, don't know if I see any other hands up Michelle. Do you see anybody else up? Okay, all right, I see it now all right, two minutes 30 seconds Max, it's just to echo Trevor's words the. If the sidewalk will not be protected by bollards, then every vehicle can park there, especially it's all city vehicles, placard holders. They are kind of unenforced vehicles. If DSNY needs access for generators, there are retractable, bollards or removable wallets that can be used, otherwise that sidewalk is gone. Thank you that was that really was 30 seconds. So that being said, Trevor I want to ask what is the ask of our transportation committee tonight to assist the parks committee? I know we're really focused on that change of street and that change direction. I know you wanted to talk about potential resolution for tonight. I know we don't have anything drafted, I'm looking for any kind of guidance on what to do tonight. For this specific item, I know that it's a change in street direction, right we're looking at making this a one-way westbound. If I'm correct all right, so Trevor I mean you're a more senior chair than I am so I'm in your hands on this. Well, we've done this before, because, typically we don't get the presentation until sometimes five minutes before reading. Well, so we got this one pretty late, so it's not always that we don't always have time to formulate a resolution. So we typically can do some bullet points based on the things that we think need to the DOT and the EDC team needs to see with regards to the actual change. There is I mean they're, actually bumping out portion of and removing a lane of the street, which I'm not too particularly concerned about, because I know that particular term serves the dltr, but it's a change in the street configuration and it is permanent and we're talking about conditions for the bmcr which have to do with traffic and pedestrian safety. So I'd like to include him and there's only a few things and I think his name is Truress. Torres I mentioned that I'd like to see ballers extended on Wagner place, to the extent that they can and any other way that can discourage sidewalk parking, even if they are plastic, if their generator needs to come in that way, I don't think it's going to come in that often, but we need to make sure that we don't have that doesn't turn into a parking lot and then make it a very dangerous situation. Pedestrians. The only other issue we had is that these crossings, where people have to cross- and there is one in this area and they're all connected- that we need to ask or demand that lights bike lights be installed whenever there is an intersection and make it coincide with the changing of the street lights or the vehicle lights. Because right now you get across as a pedestrian and then you wind up in a bike lane and the bike lanes, don't have any reason to stop rumble strips are nice, but some people think it is a signal to speed up. So lights are the only thing that gives the pedestrians some safety that they know they have the light to cross because they're not in a safe area until they cross through the bike lane I know there was a mention in the chat that seems to encourage people to walk anywhere in the bike lane, and that is not true. That slide. If you want to go back, is a crossing where people are actually in the crosswalk yeah that one those are people in the crosswalk and I. Think that's Near Catherine slip if I believe, if I think that is where people crossing the crosswalk and that's the problem that we have is that you walk into the street and that's it I know. There's some talk about bumping and I still want that to happen where they bump out the space where people can travel from, but I think lights are the only solution. If we're gonna do this once in a lifetime very expensive, you know half billion dollar project connecting to the ESCR. So those are the only two things. I said it's a lot longer than what needs to be written, but those are the only two things all right. This is anybody else from the committee want to chime in, because I want to start putting these bullet points together. I know Trevor just put two in Wendy. Are you do you have all that for the minutes? I don't know if you want to give I, don't know if Trevor, if you want to give Wendy something a little bit more succinct that we want to put bullet point wise who's, taking notes for you, I'm sorry, okay, no! Okay! Now it just popped up, I'm just so used to Michelle, taking notes that just threw me off sorry, Michelle I got demoted for this party meeting. The direction would be actually due. Northwest is the one-way direction that would correct, yeah be going inland anyway, it would be heading directly, Northwest, yeah, Robert Wagner goes it's technically labeled as North South and South Street goes East West, so it would be we're calling that Robert, Flagler northbound, all righty and yeah I think putting in the lights would be good because it will signal to bikes. I mean largely when there's no pedestrians people are gonna go through, but it'd be like yeah. Okay. This is the time for the pedestrians to go through and about rumble strips trust me. No one thinks that they're a signal to speed up but lights are not a bad idea here, they're good. We should ask for them. Thank you, David I, like asking for the lights. What else are we doing here? Trevor we're asking for lights. What else are we putting into the lights at the at all intersections that? Are that have lights and I? That's probably, there's probably a better way to work. That I mean actually rumble strips. Also, you know they're, not bad I rarely encounter them when I'm biking, but when you do, you really do have to there's room for there's already strips at each intersection. There are well, then they don't have to defect because I go a lot in that area and I've never noticed them, but I have noticed them further south around the battery park. The ones that are there are very noticeable, but maybe those are to tell me that I've actually left the path. Yeah I, don't know all the design elements. Katherine, I, think what you're talking about is the rumble strips that owner that are on the side of the path. There's actually no rumble strips in the bike path: yep you're right. There are ones to the side to indicate that you've left the bike path and there are rumble strips perpendicular to the path, but I know they still had a couple left to do so. I'll follow up with Thunder Roberts, but yeah. They were installing rumble strips the painted rumble strips it's, not your granite inset like you've got at like Brooklyn bridge park or maybe down at the battery, but it is the thick hyper. The thicker painted thermoplastic striping, rumble strips well, the ones down to battery park are the ones that I think would be good here, because once I've gone over them, I know they're there and I. You know I'm pretty cognizant. The next time I come through to control the speed, I'm not a speed demon but and I. I've walked that path. Almost every single day, I just haven't seen any and I've been yelled at many times crossing this crossing the crosswalk to get out of the bike lane. So if we can and David probably has the proper wording- or maybe the proper wording for those type of rumble strips that are actually in the bike path, as opposed to the side to encourage people to slow down, in addition to lights at every intersection, where there is a light, can I ask you a question Trevor sure you had just mentioned a bicycle traffic light at every location where there's currently a traffic light? Are there any access points that are not current that do not currently have a traffic light? I seem to think that there are some pedestrians trying to think I. Don't think so. Okay, if it's possible to confirm that, because in case there is one that should also get a bicycle traffic light: okay, because I'm walking through Montgomery Clinton, Rucker, Slip, Pike, Catherine and then well. So can you pull up that slide or there's a slide with all the intersections I think they all have signals for cars coming on Saturday, except for Robert Wagner, but there is no pedestrian crossing correct, okay, I thought there may have been between Robert Wagner, and so, if it's easier, we can name the streets. Catherine market Pike, Records Clinton, although Clinton has one a very nice one, actually in Montgomery I think we should name him as you just suggested. If there is a name for what I have asked, Catherine I believe if you could give us the words that we should ask for the rumble strips which are perpendicular and more effective, but the reason I notice them is because I'm always driving with my dog in a basket and when I hit them. It's not good for the dog, and so it's a it is a pretty strong signal to slow down. Yeah no I agree I either avoid them when I'm on my bike or I slow down. So yeah I. Think, though, that I think that probably I don't know another name other than what we've just used is the rumble strips they're, the ones we have put in and places along that bike path are perpendicular to the path and they are the thermoplastic striping. The way the striping is done with the other signals on there so should I. Just we should say rumble strips that are perpendicular on the path I'll try to find like a design detail that shows them, but I think just rumble strips is correct. Right, but I want to make sure we're getting the ones that David is talking about, because I haven't seen any of those types of strips along between Brooklyn bridge and Montgomery Street Paul. Is that enough? I see Ellen has her hand up Ellen go ahead, hey so I just want to clarify for these rumble strips or whether they're painted on or their actual speedy bumps I just want to get clarification on what exactly we are talking about, because if bikers are going to avoid what are in essence, speed bumps right, then it decreases and increases danger for joggers I used to jog a lot down there and because of the construction I've stopped jogging just because of the danger level, but I think because bikers just really don't care right, there's no penalty for them. Speeding. So if this creates another issue, I just want that clarification in terms of ramifications whether or not these are painted on their actual speed bumps. If their traffic lights you know is I, mean there's really no penalty right for not recognizing speed lights, traffic lights for bikers, especially along that strip, and that's been a serious issue on a daily basis. So Ellen. We want to put something along the lines of enforcement inside this resolution, yes or no. That would be preferred, but also you know just so that I get an idea of the ramifications right. If we put, we want a what might happen or if we want b what else might happen because I really, if this be bombs, creates just an avoidance issue right for bikers or anyone who just wants to go around then when that decrease the safety, the space to which pedestrians and joggers can move about safely. Let me ask David: what do you do when you encounter them on the other side of Manhattan when I counter the what the speed bars the speed bumps, the Ellen's point, I'm just trying to figure out: do you go around them or do you slow down? Well, I, slow down, I mean I really despise bikers who generate conflicts with you know, with pedestrians. Now, on the West side, they've got I mean there's a state law right. That's a state park. There's actually a sign that says that you must yield to pedestrians. So maybe D.O.T has signage like that, because that that's that all you really need to do is say look to the ones who are the jerks, I'm trying to scrub my language. So what you need to tell the jerks is that like? Actually you don't have an absolute right to use this spike lane? There's an intersection here with pedestrians, and so all you really need to do is make that clear and the jerks are going to it just lessens it. I mean everybody can be a jerk at times. You know. If suddenly, someone appears, especially if there's a collision everyone's first instinct is it's not my fault. Why were you there, but anyway, I think that a light will give if it's especially if it's synced with the when the pedestrians would cross, because it's synced with the street light, the light will be good. The rumble strips will be good, and perhaps, if there's signage that says, pedestrian crossing I know that they don't put the high visibility. Stripes is what I saw on the design. You know I, don't know you can also just put a lot of signage and just make it ugly, but anyway I, don't think I'm a rare biker who respects pedestrians. I. Do think, though, that the jerks, which are a pretty small percentage you know make it look like everyone is a jerk, so Paul. What I'm hearing just to wrap this up is that signage that says, yield to pedestrians bike lights, whatever the property for that is that are synced to the traffic lights at the intersections of Catherine Market Pike, Rutgers, Clinton, Montgomery, rumble strips that are and I don't have the words for this David. You said perpendicular, that's the one that make you slow down: yeah they're perpendicular to the path crossing right, they're, actually in the bike path, as opposed to inside of them and to Ellen's point. There are rumble strips on the side, so it's going to be very difficult for them for a biker to go around them if they're in the path and on the side. But I do hear that point of you know. After a while people are going to figure out a way to go around them, but I didn't think we need to do something for safety in that particular era, because a number of people have already been hit by bikes, and this includes the safety for the bikers and pedestrians and people who want to walk. But those are the main issues, I think, okay, so those are the bullets that we really want to go after Wendy. Do you have all that just want to make sure if there's anything you feel like you're missing, so we got the signage, the rumble strips that are perpendicular the intersections and the with the lighting. Okay, so I guess we're turning this into bullet point form and sending it back to the office to get a more cleaned up resolution. Technically we have to vote on the bullet points. The only thing I wanted to make sure that was in there wendy was the additional bollards on Robert for the illegal parking right on Wagner right I. Understand that there's it's going to be limited, but we really need to do what we can to make sure we can get rid of some of these vehicles in that area. I use the language that harass use, which was you know that they should look at removable or retractable bollards, for when they do need to. You know, need access when they do nexus that you know they. There were pictures and they've described a generator so when they do need access to the area for equipment, flexible bollards or removable ballers, not flexible, retractable or removable. Bollards, okay got it. That's what we should ask you for we're just going to ask Catherine one good question. Now that you have all the information you know, Paul has other stuff. The someone had mentioned the race crosswalk in terms of being you know getting this done. Do we have raised crosswalks in other parts of the city, I mean the answer. I would let D.O.T really speak to that I mean yes, there are raised crosswalks in other parts of the city, but I would need them to tell you like what the necessary studies are. That would put in a raised crosswalk I would point out too that a raised crosswalk well pedestal protects the pedestrians from the street you're. You still have the same issues when you get to the bike path, that the bike path will be at the same level as that crosswalk I. Think what I think the mention was to only raise it at the in the bike path, but the bike path is already at the level of the esplanade. So what are you a crosswalk is done so that the pedestrians have kind of like they're the they're at the level of the sidewalk as they cross the street, and then the drivers in the street come to a raised location. But in this case the bike path is already at the level of the esplanade and the person crossing the street is in the street and then stepping up into the esplanade, so it so the bike path. I'm saying if the bike path was like the drivers, there's no change for them to indicate that this is more than a crosswalk more than the crossing and the rumble strips and the other things so I. I'm not seeing what a race crosswalk actually serves in this at the intersection right I was only on the bikes. I was only talking about the race crosswalk in the portion of the bike path. So if you look at this slide, where the wheelchair is that portion be raised like a speed hump, basically to where the person is crossing, only that particular section I should also add here that you know we do follow. Typically, when we're designing DOT standards for DOT things park, standards for parks things, so you know we do work with our partner agencies. Who you know are the experts on this kind of thing, yeah, that's what I'm asking if someone brought it up and I didn't think about it and D.O.T is on the line, and I'm just asking have they done that? What we're describing, which is only a race crosswalk in that bike lane? Has it been done in other parts of the city to your knowledge? There are raised crosswalks in other parts of the city, but as far as I can understand the request here, if we are looking at this slide, you know and Catherine kind of already explains that the bike lane and the and this portion is already in line on the same grade as the sidewalk. We wouldn't be able to just install a raised hump. Only in that crosswalk section, a race crosswalk is typically going to match the grade of the kind of like opposite tail-end. If that makes sense. So my question all right, so I'm going to move this along because I know there's some other items Paul. We need to vote on this, and so, if Wendy could read back the bullet points- and we take a vote on this we're going to have to work on the warehouses. But we've done the bullet points before I. Think I do think we do have to move on. Thank you, Trevor Wendy. Can you just read back the bullet points and then we'll go with a vote on the bullet points and see how that cleans out? Okay, I could just hear my screen really quickly. If that helps makes it a little easier sure. Okay, give me one second and then I have concerns raised regarding illegal parking near concrete structure. Additional bollards placed on Wagner plays looking into removable and retractable bollards so that when access is needed for the generator, it's there. The addition of intersection, like bike lanes, bike lights, to protect pedestrians, to coincide with traffic lights, I put down that anything to like slow down bikers like bike lights, rumble strips and then the possible addition of like another lane for like joggers or pedestrians, and then I also got some form of enforcement and or ramifications for the like any possible, like I, guess, side effects of speed bumps getting added, because someone mentioned that, if you add speed bumps or the rumble stress, the bikers can just like avoid the strips all together and go right into the pedestrian lanes for the bullet points. I would even narrow this down a little bit more because we're getting into what we think we can ask in order to give the community board's opinion on this change at the intersection. So it would be the additional followers on Wagner place, doing the utmost to Doterra Park. You don't have to change your wording. This is just for when we go to write the actual resolution, and so that we can get a vote on this. The addition of intercession bike lights at and I forget the names of those streets which we'll add, put a placeholder for the streets, placeholder for the streets by lights and rumble strips at the intersection, but that's the that ties into that first thing, so we're only just adding rumble strips and the DOT gave some reasons why the addition of a speed hump, although you're not talking about there, but those are the things we but the oh, I'm sorry add the signage of yield to pedestrians at each intersection to let people know and Lee has pointed out that bike lights should be changed to bike traffic lights. Yeah bike lights should be traffic signals with bike indicators. David. Do you have your hand up? Was that yeah? Because I was wanting to point that out too so I had I have a hand up yeah. We need to specify rumble strips that are perpendicular to the path that are in the path and perpendicular to the path like yeah and by the past. Are we going to ask for an additional lane for joggers pedestrians? What language are we going to use for? That? I would suggest that we look into to look into adding an additional lane for joggers I know but flew as mentioned with 75 percent design, and that might change things, but I do think it needs to be studied. It would be really nice if we could have a pedestrian on that particular stretch. As will and DOT know, that's one of the most used bypass in all of the city is there anything else we need to change clean up. Okay, we verbally you've been saying traffic lights and yield signage. I, don't see it written down here, but I actually, don't think we should do that because I know DOT is not going to do two things where one thing will suffice. Okay, so we really need to decide which we want to ask for I, prefer the traffic lights, yeah I, think so too, I'm an agreement with the lights. Okay, I'll just take out the signal. Oh it was there. Okay yeah. This is good okay. So, let's move to a vote. Whatever do you want to do your committee? First? Do you want me to do my community? First, we do mine because I don't know who's on yeah I. Don't have fun, wait a second. We also say it says the last one is tacked on about asking for enforcement. That's that should, if we do something like that, it should go to different agency, or maybe we should ask for coordination, but the design of the either the transportation or the park components here. It's not related to the design. We actually are asking for things that are like going to be self enforcing, largely and that's our objective in these things. But if we're going to ask for enforcement that has to go to a different agency, it really ought to be a different resolution, all right. So let's pull that out. You know what, if you just pull that out of the bullets, you don't need to share your screen, just pull it out of the bullets unless agency. You know somehow thinks that we could ask for something like coordination, but I think it's premature to ask for that. What we really let's go ahead and pull it out, Paul and I. Don't I'm looking at my screen, I see Josie and I. Think that's it! No Tariq is there? Oh! Is he not on your committee? He's transportation he's ours, so Josie what the bullet points that we've gone over the owl was on before she's, not on anyone, Josie I, think Josie's on in spirit I. Guess it's an extra meeting just being honest about it. So my vote is yes on the bullet points to craft into a resolution to allow or to allow to give an opinion on changing Robert F Wagner place with the bullet points. So yes, Trevor. Thank you. I'll. Take notes from my community too, thank you, Trevor Great Representative. So that's amazing transportation committee we'll take a vote on this one right now as well and spirit with the Parks Committee when David just called us out: okay, Paul Rangel, yes, Michelle, Cooper Smith, yes, Lee, Berman, David Crane, yes, Felicia, Crookshank she's, not on okay, Wendy Lee, yes, Ellen Lowe, yes, Tariq Ramos! Yes great! Thank you very much. Thank you to EDC for coming on. Thank you, Trevor and the members of the Parks Committee for coming out for this joint item. Thank you like stay for the rest of it you're more than welcome to, but we're quite back, I'm actually going to stay and listen. Thank you good night. Thank you all right. So that's one agenda item down. It's only 8:10. all right now we're back to all of our items. We're gonna go right to the proposed change of signage, on attorney between Houston and Staten on alternate side, Parking Susan, who is here presenting I, believe the seventh precinct yeah so well. If I could just explain. This has been an ongoing complaint to the community board for I'd, say years, and the seventh precinct community, Affairs, Detective, Soto and Rodriguez has been extremely helpful in trying to resolve this issue. So I believe Jennifer is going to present the complaints, because they've also been getting the complaints and her suggested solution and I. Think after they speak, there might be some residents here. There are residents here that I'm sure would also like to speak for two minutes on the problem. So I guess Jennifer I'll start with Jennifer to explain the complaints going on good evening. Everyone good evening, the so we've been recently. The biggest complaint is cars being illegally parked on Attorney street, from East Houston to Stanton. Cars are parked on the sidewalk preventing pedestrians from walking using utilizing the sidewalk. So currently, the signage on attorney says no parking Monday through Friday 7, A.M to 6 p.m, truck loading only Monday through Friday 7 A.M to 6 p.m. Our proposal is to have the signs changed to alternate sides, and this would create additional parking on both sides of the street, because at the current moment, parking is only allowed for commercial vehicles. So how this helped completely like I know, there's all this stuff going on. But if you just elaborate a little bit more I just want to know how it best assists the seventh person and everybody in that area of attorney. It will create more parking, more legal parking spots for residents and also too for the garage to utilize. That's basically it at the moment. Technically there shouldn't be any cars parked on that block unless it's a commercial vehicle. Okay, that's pretty much! You know our recommendation. Okay, no great just I know this is part of a bigger presentation for later tonight, but this slide has I guess some of the photos of the things going on Attorney street between Houston and Staten, and this looks pretty problematic. What are those cones on the cars like is? Can somebody explain to me those cones I? Forgive me for being naive, but can somebody explain those accounts, so I think what's happening so I've been there and observed stuff, and so the first I want to say the nature of the street has changed very much from commercial to residential and the garage actually uses the sidewalk and I believe Jennifer can tell me if I'm wrong, that those are our cars from. Are they associated with the garage? This is detective Rodriguez. Yes, they are the cones. There was construction also going on that block, as new buildings have been going up these last couple of years, so the cones could be construction. There was a construction area. There was also scaffolding at one point, so I'm not sure I haven't seen those cones now like well, that might have been I can't see the date. It's kind of small. Is that November 25th, that's correct, yeah November 25th, but it's illegal. We can't do that. No, yes, there's no saving spots or anything like that. Like Susan was saying that this there were a couple of businesses, but now we're going back almost 10 years or maybe more on that block and those businesses have now turned residential, so they need I know the residents need additional parking and if I could also say right nearby there's the cul-de-sac, which is no parking and people are illegally using that also and yeah. We've addressed it with summonses as the other CB3 meetings we've, but we've addressed it with summonses. There's also been noise, complaints and cars at night, and all that we've been dealing with all that all right. So you have been giving out some since Michelle go ahead thanks, Paul yeah, so these are pictures that I took my dog trainers actually on this block, so I walked by there at least once a week, and so when I knew that well I knew it was a problem, obviously, and then, when I knew it was coming up. I took these photos and I also have photos of the cul-de-sac. I mean there was a literal boat parked there all summer, I'm not sure. If anyone saw that I think it's gone now, the last time I watched by but there was like I mean we live in New York city I, don't know what the heck someone was doing parking a boat there, but it's just lined with cars the whole way some of them will kind of broken down or I'm not sure if it was part of the garages storage. But my question about alternate side parking is I mean if you can see this picture. There are like three to maybe even four lanes of parking being used on this street now and so. I understand that alternate side will create more legal parking, but it will create less parking generally right. It's like I'm, not a driver. So I don't know the rules about this, but it's isn't it just. You can only park on one side of the street every day. Right. Is that correct or no that's correct? Yes, but with? Is it no sorry now traffic? Well, traffic agents have been calming down. So if you try to park legally, they have been submissing vehicles. So people sometimes just leave the car anyway, and you know fight the bullet on that, but I mean like. If so, let's just say, we implement this new regulation. What parking will be allowed on this street? For those of us who are dumb and don't know exactly what the regulations are Michelle, what alternate park side means is that once or twice a week, each side of the street will be no parking for purposes of cleaning the street, so it'll be like three hours on a Tuesday and three hours on a thursday, but it's not that it's like only one side has parking at any given time. So there'll be two lanes of parking one on either side and then, once a week, all the drivers will idle on the other side, while the street sweeper comes like they do on Suffolk Street. Is that accurate yeah? That's what happens, destroying the environment and taking up public space for us, so I mean what and what's to say that the garage is going to abide by these rules because clearly, like they don't have enough storage for their cars. Hence why they, as you can see here, put a car, multiple cars on the sidewalk and are also parking perpendicular to the sidewalk, which I imagine is illegal, even with alternate side of the street parking, so I know, there's been I. Believe there's been outreach to the garage owners like. Is there any recognition that they'll obey by these new rules? You could ask if the garage owner is here is the garage owner here I? Think there's only one person who signed up to speak on this, but I don't know if they were the owner. Richard who signed up to speak is one of the residents who brought the problems to us. Okay, there's also Jerome all right. Let me so in the interest of time. Let's go to other committee questions I see, Ellen has her hand up and then I'll go right to the public right after go ahead, just to follow up on Michelle's question in terms of the effectiveness of the strategy, especially when summonses haven't worked. So I'm I, I'm not understanding how this will solve the issue when clearly this garage or whoever is parking, their cars and boats in this manner on Attorney Street already talking and doing these things right. So I'm just trying to understand the full picture of this approach here. So the picture doesn't show the rest of the block. Let's see on that picture, where it has the car on the sidewalk up a little bit further from that is where the commercial parking begins and then goes towards up to East Houston. So on this picture it doesn't show the available parking that's available if the China. If this signs change I was going to say, I'm actually confused about why putting alternate side of the street parking is going to change the situation unless they are monopolizing the commercial. You know loading unloading zone, which is there and they are using it to shuffle cars in and out and double parking them on the sidewalk effectively. If the garage is taking over the commercial zone and using it any way they want, then a switch will change it. Otherwise, I'm not I'd like to hear how it's going to work too. Maybe Susan won't talk about that. So my understanding, well a couple of things and first of all, I want to say the boat, which I also saw all summer. I believe has nothing to do with the garage is cars and trucks. So it's going to create more legal parking which will reflect the change in the neighborhood. Also, the seventh precinct I'd say in the last several months has been really upping the enforcement. So that's going to be combined with giving them place. You know when you say you can't do this. You definitely want to say, but you can park here and right now, which I think you'll hear from the residents right now it doesn't work. So this is trying a change which no way has to be permanent, but it's trying to change that. We think will work and you know it's like what is the downside if it doesn't work, you still created more legal parking and you haven't made this situation any worse. So it's trying to see if it will work by giving people a legal place. More legal places to park and I'll ask the detectives if that's correct, if I'm reading this correctly, that is correct because, like I said, even the garage is saying that it can't it could store more cars up legally if there was more legal spots as well and there would be less cars, as shown in these pictures and, like I said as well as residents will have more parking spots because essentially, the commercial space is underutilized because there's no commercial vehicles on that block, it's mostly residential. So if we create more space for legitimate parking, then he then they'll be able to the cars, wouldn't be consolidated in front of the garage. The way that it's shown in the picture, they would be sprout and using the block to its entirety. Okay, I'm sorry can Lego Lee has his hands up and then I'll go right to you, Susan, I'm sorry, yeah, there's an important point to be made here. You know the name. Ludlow Garage is actually a misnomer. This is not a garage, it's a repair shop. They are not storing cars. There they're not storing excess cars that are trying to park overnight or anything like that anywhere on attorney street or even I believe near the cul-de-sac. They are strictly a repair shop. The roll down gate that you see on the east side of Attorney Street is their body shop where they have a paint booth and on the west side is their I think they have five or six bays. So, if they're taking up spots, which I'm sure they are it's for cars that are either awaiting repair or have been repaired and are waiting to be picked up by their owners, so they're not parking long term and I- think that's an important distinction and the suggestion to modify commercial parking to allow additional permitted parking will help both the neighborhood as well as Ludlow Garage, which the other misnomer is it's Ludlow, but it's actually on attorney street by allowing them to legally park a car that has been repaired or as a waiting repair until they can take it and fix you know and send it out to the until the owner comes and picks it up. Thank you Lee. Thank you for that clarification that helped me out a lot just now, I'm going to go to Richard, oh Susan, go ahead, Susan and then I'll go I just want to very briefly- and yes. I also want to thank Lee for those clarifications, but I just want to emphasize that there was. This was a commercial street. It had commercial parking because there was a lot of commercial need, and so, as our you know, our precinct officers told us. You know it's under utilized now it's just not needed to have that commercial to have that commercial parking. So we have parking that we don't need. While we have other parking that we do need, that's it Richard will explain it much better than me hello. Can you hear me? Go ahead, Richard come on okay, so we live right on this block and then right on this corner. So we can speak to it in a lot of detail. There's many cars that are by the garage. Can we share a presentation? Actually, we just have a few photos. Also, if you don't mind, you can share your photos. Yes, thank you. So there's attorney street and there's Stanton Street and we live on this block, and this is where the cul-de-sac is the dead end street, and so the garage owners are using the entire street to park cars permanently, some of which pick up trucks filled with what looks to me like trash in an area that is a alternate side parking area in the cul-de-sac. They never move for street cleaning. So there's never a street cleaning that happens here, and this is the whole block. Sometimes the trash spills out beyond these pickup trucks, there's a gas tank and other things like that and the boat that was already mentioned was definitely by the garage owners. We saw them cleaning, painting the boat right there over the course of the whole summer and every day, the garage parks, this truck tow truck in the parking lot, which again is no parking zone and it's their permanent private parking area and it is not being enforced. So this car is here every day and that leads to a lot of trash and people treating this as a litter dump, etc. So I'm 100 with everything that Michelle said, which is it's an enforcement issue, so even in the Kurdistan there is ultimate side parking, but it is not observed. It is also not enforced same thing with the no parking area is not absorbed, observed or enforced, and then I know that this is not illegal, but there are pickup trucks filled with trash that are permanently parked by the garage owners which creates an unsightly appearance, and that leads to constant littering and illegal dumping. If it was enforced, it would offer the opportunity, for you, know, cleaning trucks to come through and to clean. The area. I know that there have been budget cuts in sanitation, and so this would just really help keep a clean block that is more livable and hospitable to its residents. Additionally, Richard has a slide on possible solutions, so I mean at the end of the day the alternate side parking is probably a good idea if it means that it is being enforced and if it means that it is being cleaned but yeah. The existing parking rules also here in the cul-de-sac, should be enforced. We were thinking of it might be helpful to turn the no parking into no standing and then to increase the frequency and increase the routine checks. But at the end of the day, what Michelle and Susan were talking about is what we 100 stand behind, which is any of the rules. If they are only enforced, then we probably wouldn't even have those problems, but I can also assure you that almost every car that is in a tiny street, also leading up to Houston Street, is by the garage they have little stickers in the car, and it says it's Ludlow, Garage and I mean I'm not checking every car over weeks, but it is not just standing there for a day or two. That's for sure. Thank you, Richard wow, okay. That was a lot and definitely helpful I. Just before I go to the I know. The committee has some other questions. My question is for the seventh precinct when you're giving out your summonses. Are you just summoning the car owners? Are you going after the garage as well? The garage owners, the body shop, we summons the vehicles that are illegally parked, for example, let's talk about the boat that was parked there. When we observed the boat was parked legally, it wasn't in violation of any codes it aesthetically. No one puts a parks, a boat in a New York, City Street, but unfortunately, everything was up to code, the registration, the insurance, the vehicle paperwork was everything was correct and there was no reason to issue the boat a summons. At the time it was observed, it was attached to a vehicle and that's okay in New, York, City traffic law states that that's okay, so we do have traffic agents frequently summonsing at the location. The garage owner is supposed to be on the call he would even tell you he's received thousands of dollars in summonses last month. I, don't know if he's still on the call, but he can attest to that because we had that conversation as well. So it's not like enforcement is not being conducted. We do have enforcement on that block. Okay, thank you. David Crane go ahead. Hi I'll, be quick, I mean I'll, be honest. I am a customer of Ludlow Garage, but I can tell you. Yes, they do use the street for parking cars for until the customers pick them up. The one picture you did show which had the three cars diagonally parked they were actually in the driveway of their shop across the street. So it's like their driveway I, don't know how it is with the parking lots, but they weren't taking up other spaces. My only concern about the alternate side of the street parking and I could see it make sense. But my experience with alternate side of Street Park in New York on one way streets is that people just then go illegally park on the other side for an hour and a half, and so you don't gain any traffic lanes. I mean I lived in third street in Avenue a for 20 years, and we always did that. I know what happens on one-way streets where I am now on around grant street, not on grand street but like Henry, Street and stuff. So I'm not sure if that's gonna, what that would solve it, might give the residents at least a chance to get parking at night, which I could see that. Thank you, bill David. You had your hand up. Go ahead. Yeah I finally found it so back in 2008 June of 2008. We requested that they turn this into truckloading. It was on behalf of something called plantains cash and carry so are they long out of business that was at 155 attorney, just making sure that I think they are because I think he went out of business about a year after we made the change for his business? Yes, they're out of business, okay, and so there's no business there who makes who really does need the commercial space? Is that everyone's understanding you still have del Mar plumbing, which is right next to Ludlow Garage? Does del Mar plumbing need commercial parking this time from time to time, they're gonna have to have large deliveries, so I'm pretty sure a truck loading zone is warranted, but anyway yeah. I'm curious. I have no doubt that there's more, that is necessary, but do we really want to get rid of all of it? I'm actually I'm in support of getting rid of this, but now that I hear that there's a plumbing supply place, I, suppose: plumbers, not supply plumbing plumbers, with multiple vans directly right next up right, they don't have as much need for it, probably is not legal for them to use truck loading and unloading for waiting between runs or whatever. Thank you. David I see I'm going to take the final two comments from the public tonight. I see on this agenda. Item chorus: oh yes, I walked a tourney street today and I counted 15 vehicles that had ladle street notes on their dashboard. Five of them were on the sidewalk. It's about sidewalk parking is always illegal, so it's just enforcement and no change of synergy will change that. The thing is, if you get rid of loading zones of commercial loading zones on the street, all these new residential buildings with all these new residents would need services. They need delivery trucks, they need utility trucks, they need all these Amazon and ups and USPS. They need a place to download those goods. The garage right now uses them illegally because they park there all day and not just cars that are waiting to be picked up by their owners. All the employees of the garage are parked illegally on the street and on the sidewalk. So that's a bad idea to change it to alternate side parking alternate side just to clarify. It means that you need to you can park this car legally all hours of the week except one and a half hours a week, that you need to move it for street cleaning. That's it! So that's, basically an incentive to store your vehicle for free on the street every day all day. That's it all right! Thank you! Richard! I'm gonna get one more quote from you and go ahead. Yeah I just wanted to chime in to the detectives on the call to say that I do think that enforcement is a big issue. The tow truck is parked there every day in the cul-de-sac, but additionally, something that we're calling out is the street leading up to the cul-de-sac on Attorney street. There's no parking there from I think it's nine to 10:30 every day, and this is never ever enforced. I think if enforcement has gone up, it's because I'm literally three on one full-time, like it's really quite a labor that I would love to be relieved of, and I just would like. Enforcement of the current parking lots. I am definitely not an expert on what will alleviate the issue more generally and I'm totally open to problem solving. But enforcement is a big issue based on my experience, living directly on this block. Thank you. Susan. You have your hand up. Is that you having your hand up yeah, I, couldn't figure I? Think because I'm co-host I couldn't do a regular race. That's fine! So I wanted two things. I wanted to say. We have been working on this a long time with the seventh precinct. I want to assure everyone. We are going to continue working with them on enforcement and they have been very responsive. We have also discussed this with sanitation. They said, as you mentioned, you know, there's a lot of cuts right now. It's not planned to be put on a regular truck cleaning, but they are have stepped up the cleaning there and if you will continue, the residence continue. Letting us know on the cleaning problems and photos are great. We will continue working with sanitation on that, but also with the enforcement is, you know when you send pictures of those cars on the sidewalk like I took myself about a month ago. It's very effective. Thank you, Susan all right. So, let's move on this. There is a potential resolution that we can draft here tonight. We do I did send it out to the committee yesterday to start taking a look at it, I, David, I, guess, I, don't know if I can make this motion, but I make a motion to enter this resolution. This draft resolution into our meeting for tonight. Second, thank you all right. Let's pull that up! Wendy! Do you have it? Let me chime in here I'm uncomfortable without going forward discussing this without having input from those two commercial tenants or establishments on the street. Del Mar, as well as Ludlow I, understand that somebody from Bloodload was here earlier, but dropped off, so I think I, don't know what outreach was done to either of those entities and I think they really do need to be part of this, hopefully to come up with a solution, but I really do want to hear from them as well. If I can just answer to outreach, the seventh precinct asked them to come to this meeting. They were at the meeting and they left as far as the garage, not the plumbing. So you know that was his decision. Can we add that in it's a draft resolution, so we can make whatever changes we need to make in terms of outreach and anything like that? We've done that on previous resolutions in terms of outreach into the community on different things, so leave that something you want to put in. We can so, let's start chopping this up Wendy. Can you pull up the resolution if possible, sure? Thank you all right, so Lee I'm going to let you take the lead in terms of outreach portion, if you want to put it in thanks, so I think it should go in. Probably it's item number four in the first, whereas number: four yes yeah in that first, whereas if we add a number four, I'm not sure the phrasing, but it where. Let me get back to you. Let me see if I can type something up real fast sure, I'm also I'm just going to put it out there that I don't think that there's a need to hold up this for that kind of outreach, I think it was done, and if that is the intent here, then I will want us to vote on it as an amendment not to hold it up, but to point out that outreach. Wasn't we don't know that del Mar, the other commercial establishment had any knowledge of this and I don't know if they are fine losing commercial parking, they may need it as part of their as part of their business. I, don't want to hurt them right, I, don't think they can legally use it for the purposes that they would use. It I'd be interested to hear. Maybe if the precinct is on I, don't think that a business that you know has vans that go out to their customers is allowed to store their vehicles in front of their business or near their business in a commercial zone. That's not what they're for it's, for you know like Haresh, was saying to be able to be near a building, so you can provide plumbing services to the customers in the building. It's for those kind of usage, but it's not to store the vehicle you're supposed to have a garage or some other paid spot. For that then I would work or also the side of the Start street parking. If you can find it if the precinct could just clarify that, if they're still on the line, oh we're still on the we're still on the line, we did outreach with the garage and they're in the agreements with changing the size for that Del Mar. No, but we never had any problems with. You know parking of vans or any of that sort, but I did not reach out to them. Do you think that they would be negatively affected by this change because of their vans? No I've never seen any of their vans parked on attorney streets. I, don't know if they have. You know if they storm somewhere else. I don't know about that, but that I know that they haven't been used to that. Could you answer? Would they be allowed to use it? That was my question. Is that I'm sorry? No, there would be. That would be commercial parking. This is unloading and loading, which means that they would have to leave the Van open and they would have to be unloading and loading. The van and activity, some kind of activity parking the vans no overnight or anything like that. No so you're correct in what you're saying the commercial vehicles are not allowed to park overnight, you're, correct, yes, okay, I know Paul had to run to the bathroom, but I'm just gonna time in about my thoughts as we're looking at this, which is I, do not want to get rid of commercial loading zones because we have put that in our district needs the past two years that we need commercial loading zones for deliveries. I, don't see why we'd get rid of that in this spot when we already have them, because I don't remember actually having any proposals over the past two years to add them anywhere. So I would not want to get rid of them here, because I mean frankly, I think everyone knows that I do not like adding parking anywhere, and if we have this, if we have increased enforcement, as the detectives have told us- and we have some legal parking plus existing commercial loading zones, maybe that's a mix that we can deal with. I, don't know if other people have thoughts on that from the committee. I think it would be important to preserve some on the block. I really do commercial, a commercial zone or truck loading unloading either one or the other it I wouldn't want to get rid of all of this. So I don't know if we have quantified how much space there is here. That's my question like I, don't think we have a diagram of what is where, on the west side of the block, it takes up about a little more than half a block on the north side of the street, like between Houston and Mid block on the west side of Attorney Street from Houston to Stanton, and so but sorry, I'm just asking is the half a block of commercial loading on the north, half of that block or the style path of that block on the north side of that block? Okay, so like where the scaffolding is there on that north side, yes, correct! That's why? When I refer to the picture, you really can't see yeah the commercial zone from that picture yeah, although I'd say I walk by there and there are often cars parked that do not appear to be commercial loading, but I would want to preserve that. I'm not sure if other people agree that that's interesting, so the pictures that we saw were not even where we're talking about so those were in a zone. That's the south is allowed, so those are in a zone where parking is allowed and it was happening on the sidewalks as well as in the parking lane. Is that true, like the unicorn vehicles with the cones on you know, I think I mean if you look at the resolution, it says number two in the first, whereas that the whole street on the west side is truck loading only and no parking, so I think if someone wants to cr. If someone wants to go into deeper detail that the north half of the west side of the block is truck loading only in the south, half of the west side of the block is no parking. Is that accurate? Yes, that is accurate. Okay, thanks and then the east side is no parking at all, except for on Sundays. So my question actually that'd be good to capture that so I'll pause, okay, so maybe so Wendy. Do you want to add that to the second number, two in the first, whereas that the north half of the west side is truck loading only in the south side, the south half is no we'd parking able to compromise instead of taking both. We keep one so, let's say, for example, the truck loading only and no parking Monday through Friday on the north half of what's and then taking out the no parking excess Sunday on the east side. Perhaps but I can I follow up before we talk about that Ellen, which is you're talking about the what the resolve is going to be the pictures that we were looking at where this is certainly Wendy. It's the south half of the west side of the street. Oh the style pie, gotcha yeah. Yes, thank you, sorry about that. So was any of the photographs that we were looking at where we were observing the various forms of illegal parking. Definitely it was illegal on the sidewalk, but were we observing illegal parking on the curb in those photographs or was it down the block? So that was the pictures that I was showing you that from that I shared in the initially were from was my back was to Stan and looking north, so that was the south half of the block, so you can't see so I'm not sure exactly where the cutoff is part of that might have been I know the detective said you couldn't see the loading zone or the excuse me that the truck loading only part so I was in the no parking part of the block and there were still two okay, but it wasn't no parking okay, so it was a no parking zone and there was vehicles parking and across the street where it was so on. The east side of the street parking is allowed and that's where they were doing it parallel all the way up. No, the east side of the street no parking, except for Sunday. So when I was there was during the was sorry it was during the week at 9:30. So all of these regulations were in effect at the time no parking except Sunday is on the east side of the street, because you just had Ellen change it to say I mean when you change it to say the West side. Oh no, that's not what I meant to do. I meant that we wanted the first clause to be truckloading only in the north, half of the West side, no parking south half of the West Side. Sorry. This is confusing. We really need a map, so that is what it says there. But what about the east side? I thought you just were when you were speaking a moment ago. You were saying it was on the east side. There is no parking except Sunday. That's right! That's in the original resolution! Yeah! Originally this one said: east side yeah. So sorry what I was trying to capture I thought David. What you wanted to put in the second one was that to try to make it clear where the truck loading was and where the no parking was on the west side, because it's not clear from the original resolution like what section is what okay, but is there a different regulation on the east side? Yes, and there's that right so portion of it is no parking except Sunday on the east side somewhere, which is no longer in the resolution yeah. When do you want to just go back to the original version? I, maybe I can make this too confusing I just I. Can't it's really hard for me to visualize this without having like an actual picture. So that's why I was trying to put it into words here, yeah, on the east side, it's no parking, 7 a.m, to 6 p.m, except Sunday, the holy side on the West side, it's broken down in two parts. The North side says truck loading only Monday through Friday 7 A.M to 6 p.m, and on the south part of that block. On the West side, it says no parking Monday to Friday 7 A.M to 6 p.m: yeah, okay, so the entire block is some form of the entire block. Both sides of the street is some form of no parking, so everything we saw parked in that photograph was illegal, yes got it. So if I could just ask I, don't understand the point of keeping I understand what you're saying about needing some loading, but I don't see the point of any of the no parking, so I was proposing keeping at least the north half of the west side of the street as truckloading. Only because our district needs have said two years in a row, we need more commercial loading zones, so I don't want to sacrifice that and then the other no parking areas would be altered. Side of the street, like so the half of the west side of the block and the whole east side of the block, could be alternate side of the street parking. Would that be amenable agreed? Okay, I think that would be good because we do need to preserve stuff for the for deliveries. That is the bane of where I live right. So that's why I so that, so we should then amend the scroll down to the air force. Yeah, therefore be it resolved so I'll. Do it I'll move to demand so then the first therefore be it resolved where it says from truck loading and no parking. Let's just actually say change of parking blah for those portions that are currently truck loading and no parking, so, instead of from it would say, for those portions that are yeah so I. That would be part of the amendment and then the second part would be I think that after arrangement period we should add the north half of the west side of that block should remain whatever it is currently, which is allows truck loading and unloading retain its current signage. Maybe yeah I think retain the current signage. What this, what it's called from the above, so that it's clear, yeah now I, don't know how strict things get I know that there's a distinction between commercial and truck loading and unloading I, don't know, what's the best to have in the mix, I'm not sure exactly. You know like your ups trucks, they don't leave it open and walk down the block, so the truck loading unloading might not be suitable for them. Basically, I don't know exactly which to ask for and I should know, because I was chair of this committee for quite a while, but we have D.O.T on the line. Also, I mean: can you help us D.O.T generally? What is needed in large residential buildings, or even small ones like mine, is deliveries these days. Also, occasionally, you know the plumber needs to have a place to go. What is the mix of signage to allow that type of like Calvin, Galleries and also having well for deliveries itself? It would be like the typical, no standing anytime, so that allows you to pick up and drop off. I'm talking about, like ups, the ups truck that parks for 30 minutes, while it walks up and down by the that is what that's terrible in all of Manhattan. Now they have nowhere to legally operate. I think something like that would really use some a loading zone like your typical truck loading zone. But let me think if there's any other situations, where we have a mix and the other one is you know your plumber, your electrician, who may need to be there for three hours for those I think we end up putting in meter parking for that. Well, I think we probably should ask for truck loading, unloading and David if I may. I did also want to add that you know once we receive the resolution and I know you're familiar with this Susan smile you're with us as well. You know our borough engineers then are able to take a closer look and we can evaluate exactly which particular regulation may make the most sense if a change is deemed feasible. So you know up to the board and the committee, if you'd like to sell out, sell it out exactly, but also, if you just lay out the means and the requests here, that's something that we can take a closer look at so then we could ask for DOT to investigate and come back to us yeah. So is there? No that we can actually say should be converted to signage that would allow delivery services to load such as I think we should spell it out, such as Amazon and ups to load. There's only 200 different companies who are now doing this. It is truly out of control. Yeah, wait, I'm just a little. So is this I? Maybe we're just talking to the wrong group at DOT, but is there no like understanding about what like regulation? There is in New York City, for what like an ant, where an Amazon truck should be parking, because this is something that we've been dealing with for a long time like? Is there no like standard regulation for that as a parking standard sure so right now, we don't specifically have a regulation for kind of this like short-term drop-off, it's something that we've been discussing. You know. Curbside management is certainly, as you know, especially in community board. Three parking is a premium as well as access to the curb, but for I think neighborhood. Loading zones are also something that has been requested in the past, but for specific kind of short-term loading. I know that some zones in no parking areas, no standing areas, have also been used for the expeditious, pickup and drop-off of goods, nuts, and so who who's the one to resolve. This is this something that the administration has to resolve as a city council bill like that's actually right now kind of blowing my mind that there's no like standard regulation for that, given that Amazon has been taking over the city for like 10 years now so I, don't know if Susan didn't want to say something about it, yeah, so we actually have been, and we even brought it up and I think was last month with the Dod when they came through the bike corral and we I believe Ed said and Jennifer. You could correct me that D.O.T was working on a truck. Our a delivery plan and I thought in a couple of months that you might be coming to us is that wrong am I, misunderstanding I believe that's still our timeline, and you know what our plan is for that, but yeah like as I mentioned in response to Michelle's question. It is something that the agency has been grappling with, but what folks have been able to do in the past is current is to use the current existing like no parking any time, no standing anytime regs for the very quick. You know 15 minute max, like kind of unloading, but that's not you know, I'm not saying that Amazon's allowed to do that, but you know I like and I, don't want to speak specific to Amazon, but we are so just like. Have a look the other way, so the truth is that for longer periods they just use bus stops well, you'll see more later about this in our neighborhood. So the is the timeline defined. Is it over the last three months six months we'll hear something back from D.O.T on this Susan? Do you know well what we just said about they're expecting about three months: I mean they're still working on it, so it's not defined I mean clearly. You know we need a plan yeah, okay, so Paul. Do you want to just finalize the language here? Yeah, let's finalize the language, those are all pertinent topics, let's finalize the language, so we can get to the next topic: dots on here for a lot of different agenda items. So, let's wrap the wrap this up. Where is there is David back on, because I know David wanted to change that portion. No he's gone he's here. I think it was just we were trying to decide. I was going to let my husband eat, so I was telling him that the soup is cooked, retain its current signage I think we should just we should say truck loading. Unloading should be converted to signage that allows truck loading and unloading, because that is what delivery services would use. My understanding I mean unless we come up with another phrase which says you know other kinds of vehicles as well converted to signage that allows for truck loading and unloading yeah. Rather than specifying exactly what it says. That's that'll work all right. Do we have any other changes we'd like to make on this agenda on this resolution or we cleaned up. It looks great to take out. We just need to take out after for these portions that are currently truck loading take out that just take out truck loading and because that's the part we wanted our addressing in the second sentence right. We just wanted to say for those portions that are currently no parking. Does that sound right? Okay, that's correct! Okay, thank you, I need the outreach in we want to add the outreach portion and or I, don't know if we addressed it or not. Let's see if addressed the issue actually I think Lee said he was formulating language there. You are yeah I haven't, but what the last line of the last therefore I think mentions. I think it should be a separate, whereas, oh somebody can come up the language, because I can't like something, whereas the seventh precinct has done the extensive outreach to Blah repair shop and invited them to this meeting tonight. Please type out the specifics for this meeting and the person appeared or not appeared. The person appeared for a few minutes and dropped out. I'm not quite sure what happened if I could say, I really, don't think we should be calling out individuals I, don't know how it helps. What we're asking DOT to look at I was gonna say that yeah, I'm fine with I would draw my recommendation about the outreach, but I would like to add. Maybe in the therefore be resolved that we ask DOT to come back to us with the results of their study. Duty should come back to community board CB three with the results of their study. Could you repeat that last bit with the results of their study, well, which study and all that is the study of the signage change? But this is a larger study of basically it's a city-wide plan for how to handle the deliveries right. That's no! That's a different thing that we were talking about we're right now, we're just talking about them. Coming back with a specific study on this, if you want, we've already talked to them about coming back to us with the plan for the city in three months, which they said they would do okay. So what are we asking them to study? What signage, because the word study means a really long process as I understand it. Okay well last time to take a quick look and see if something is warranted, but Jennifer's just said to us that their process is when we send them to when we send this to DOT Jennifer. Can you help me with what you want to said sure, of course, and so just to clarify once the board submits, or you know sends us the formal resolution that then triggers the evaluation for us to you know, take a look at the possible change in the parking regulation, and what I'm seeing here is that there is the specific location and kind of like the requested needs that are spelled out and Jen. You know, please feel free to add more but I believe that's. You know sufficient for us to take a look, but we are waiting to. We will need to receive the formal resolution from the committee on the board, so what you should be describing, but they is, they send a letter. This is something that they do. Naturally, this is their process is to go in and analyze it to see if it's warranted, and then they send a letter back to the board saying we did install such thing or we decided not to because such a reason are we saying that we want it back on our agenda if there's well, we can't well, we may want to it's up to the depends. What the results are: okay, I, just I. We could add this thing, but we've never done it before and they have always done this thing, because this is what they do. I don't know. Are you still doing that because I haven't received any letters in a long time so, but maybe because we haven't made any requests so Susan I just want to say that go ahead. I was going to say that, typically, yes, we do send a letter, whether it's feasible or not, and we will be able to install if it is feasible. But at the same time, if you do want us to come back, I think I would be the one to come back and be able to. You know bring back that information if needed. Why don't we just put to notify us of the evaluation? That's fine is that okay David sure, especially if, because of with budgets- and you know our current mayor, perhaps there have been less communication. So, let's put it all right. Is there anything else? We want to add no further amendments. Thank you, Tariq. Anybody else, all right, we'll vote on this at the end of the meeting tonight, I'll go into our final vote. Thank you, Wendy. All right. That is, agenda. Item number three checked off the list. All right. Let's go to agenda item number four DOT! Thank you for staying on. We have the CitiBike infill updates. Please go right! Thank you! Paul! Absolutely hi! Everybody! Thank you again just to reintroduce myself, I'm Jennifer something as I'm Dot's Manhattan deputy borough, commissioner, thanks again to Susan and Paul Michelle Cv3 for adding us on the packed agenda. Tonight, I have a few DOT colleagues on so I'm joined by Caitlin Toner, Wiley, Mariello, David, Andrew and Lilly Gordon Covid-19 from Dot's bike share program as well as Jennifer Liang from the Manhattan borough commissioner's office, who many of you already have the pleasure of working with so going back to or going to. You know our next agenda item for CitiBike infill last year, DOT embarked on our five-year phase, three CitiBike expansion alongside our partner Lyft, and this is going to double the size of the bike, share system, service area and triple the number of available bikes. Since the program launched in 2013, New, Yorkers and visitors have turned time and again to CitiBike as a healthy, safe, fast and affordable transportation alternative and, as the city continues to reopen in a Covid-19 world. We believe that bike share will play a critical role in getting people around the city and back to work. Our phase 3 expansion in Manhattan started earlier. This spring, when we expanded into new neighborhoods uptown, we moved north of 130th street further into Harlem and Hamilton Heights, and then we started installing new stations in Washington Heights over the summer, and so, in addition to expanding into new neighborhoods D.O.T is also working to add new stations and increase the dock capacity in the existing service area, including here in CB3, and this will help support the demands of a larger system. We're going to present these CitiBike Intro plans to you tonight and so with that I want to thank the board again for giving us this opportunity and at this point, I'd like to hand it off to Caitlyn from our bikeshare team to walk us through tonight's slide. Hi Jennifer. Thank you. Can everyone hear me yes, great and then I think am I able to share my screen. I'll. Do that now simple screen? So if I'm assuming everyone can see my screen, if not, let me know but hello everyone, my name is Caitlin toner I am a bike share planner at the New York City Department of transportation, and tonight I'm going to be presenting CitiBike expansion and infill. So the first portion of the presentation we'll talk more about CitiBike as a whole and our extension and info plans and then near the end, we'll talk more about CitiBike in relation to community board three and then after the presentation will open it up for Q&A. So thank you. So to start off, I'm going to just do a CitiBike overview. So what is city pike? The CitiBike is New York City's bike share system. It is a point-to-point transportation option for New Yorkers. It is available 24, 7 and it is. It provides New Yorkers the convenience of having a bike in New York without the hassle of bike, storage or bike maintenance. So CitiBike is a public-private partnership, so with DOT and Lyft, and DOT is responsible for the planning, outreach and oversight, while Lyft is responsible for the day-to-day operations, equipment and maintenance, and so with this in mind, to talk a little more about the history of CitiBike you can see on. The right is a map of the phases we have gone through in CitiBike, so back in 2013 CitiBike was launched with 330 stations and 6,000 bikes in Manhattan and Brooklyn, and then in phase two we expanded further into Manhattan and Brooklyn and was also the first time we added the CitiBike service in Queens, so that increased to 750 stations and 12,000 bikes, and so now we're in phase three which started in 2019. It's planned to go for five years, and so this is going to complete Manhattan go further into Brooklyn and Queens, and this is also our first time providing the CitiBike service in the Bronx. So this is going to expand our geographic area. It's going to add 35 square miles, it's also going to add 16,000 new bikes to CitiBike, and so we're really excited for this expansion, because we've also seen a lot of high ridership numbers as well. So just to highlight a few steps. We have had over 107 million trips to date with the Citibank program. A bike on average gets 5.5 trips per day, and then we also have over 170,000 annual numbers, and so we're very excited that, as expansion continues, that we also are having these high ridership numbers as well, and so, since this year is unlike any other, we do want to address how we're ensuring rider employee safety during Covid-19. So we have put into effect cleaning high contact areas on bikes when they're returned to the depot, we're also disinfecting bikes when docked at high use stations near hospitals and when our employees are handling the bikes on a day-to-day basis. We make sure that they're using social system practices to ensure safety and, in addition to making sure that the service is safe for our writers and employees. We also started the critical workforce membership program, so that provides free membership for essential workers. And so, with this in mind, the CitiBike program as a whole I want to go more into about the phase three expansion and infill. So phase three is broken up into two components and you can see on the map on the right. The two different types, so expansion is where we're bringing CitiBike into new parts of the city that have not previously had CitiBike. So you can see that dark blue in the map, and so that's going to increase our stock size. It's going to add 32,000 stocks, 16,000 bicycles and it's going to double our geographic size. That's gonna have an additional 35 square miles and then phase three info is where there was our. We already have x thanks to phase one and phase two, so that'll be the gray area and we're gonna add capacity to this existing service area. So this is already in a 33 square mile area with currently exists: 29,000 dogs and 13,250 bicycles, and we plan to add 16,000 dogs and 8,000 bicycles. And so why is info part of phase three? So, as CitiBike continues to grow, there will be more bicycles in this course, so kind of thinking about the idea of gravitational pull and also looking at how other the patterns of other modes of transportation. We are saying that writers will tend to move towards central business districts, and so, as we continue to expand into new areas, we do anticipate that those writers will also travel into the central business district. So we do want to be make sure that we have the capacity for that when that happens. We also look at this as an opportunity to look at the existing unmet demand with riders currently having issues of finding a bike or a dock. So we think this is also a great way to make sure that we can handle the capacity in that way as well, so having Intel as part of phase 3 improves the rebalancing and overall system operations, and so to talk more about the Intel timeline. It does work a little differently than the expansion, because it does really look into ridership demand, so the areas of higher demand will receive the most stock stocks. So since this is going to be a four year, ongoing rollout of new and expanded stations demand may adjust and fluctuate over time. So we are constantly looking at the demand and planning accordingly, so because of this rolling installation. This may mean that we cover multiple communities at a time and also this iterative planning process is designed to help address the changes in demand, a system expand, and so, when looking to add more docs into info there's a few things we may consider. We may add new stations, we will expand existing stations and we will also think of creative design solutions. So if you look at the picture on the right, this is a design we call 3D bridging because it allows us to have one station beyond both the sidewalk and the road bed and so in more detail about our planning process. We do we first start with community feedback, so we have an online feedback portal which, as you can see on the right, is a screenshot of the online feedback portal and all the circles in blue. Our community input can use feedback. So we look into that in their comments to help look at potential stations and additional docks, and then, with that in mind, we do the station siting, which will use ridership data and use more technical criteria to help identify feasible locations, and once we have a strong list of viable locations, that's when we begin the community notification process, so that includes notifying property owners, community boards and key stakeholders prior to installation and even after the installation of the station, we do have ongoing monitoring to assess the performance of stations and to adjust accordingly, and so with this information about info I do want to go into more detail about the news stations we're proposing at Community board three. So we are proposing nine news stations overall. So in this picture on the right shows the first four in the more northern part and to clarify the circles in dark. Blue are the locations of the new proposed stations so just to read off the locations on the left. It will be East, Fifth, Street in Cooper's square on the North Road bed, East, 13th and 2nd avenue on the side, south sidewalk, East, 3rd Street and 1St Avenue on the South Road Bed and Eastern Street and 1St Avenue on the South road bed. And then the additional five is in the more southern part of CB3, again in blue circles on the map and so to read that the locations on the left is Grand, Street and Samuel Dickstein Plaza on South Road bed, it's Orchard, Street and Broome Street on the West Road Bed, Fourside, Street and Grand street on the West Road bed, Clinton street and Cherry street on the East road bed and Market Street and Henry Street on the East road bed. And so the last few slides are just kind of zooming in closer on the map. So this is the location of the East 13th street and second avenue along the south sidewalk and that will be along the building. And then here we have East 5th Street and Cooper Square on the North road bed. I do want to note this. One was the only one that was relatively close to an open restaurant permit. So we did take that into account. We saw that big the scratcher on 209 East 5th street had a permit. So we made sure that the proposed station is more than 10 to 15 away feet away from that permit area, so it wouldn't conflict but moving along. We also have a pro play station for East 3rd Street and 1St Avenue on the South Road Bed East, 1St, Street and 1St Avenue on the South road bed, and then we have Orchard Street and Broome Street on the West Road Bed Fort, Side, Street and Grand street on the West Road bed here and then on the last slide. Oh two: more grand Street and San Joaquin Plaza on the South road bed and Clinton street and Cherry street on the eastern bed and then the last one here is Market Street and Henry Street on the East River, and so thank you for the opportunity to share more about CitiBike and also our plans here in CB3 and I'll open it up for questions. Thank you, I was I, didn't realize we had that many stations in our district and we want to add more all right. Let's start with questions, I'm going to start with Michelle go right! Thank you, Paul, and thank you guys for making this presentation. Do you mind going back to the slide with the one that had the orchard broom yeah this one yeah? Is that wait that says it's oh I see it's where the existing one is so that'll, be on the north side of the of Broome Street Northwest Corner yeah it'll be north of Broome Street, okay, and will it be in that neck down that exists there? It will not be Ombre street, which I think on that southern part has the neck down it'll be on Orchard Street is where the neck down is now I. Think yeah. Doesn't it go all the way down to Broome there? Not oh, I'm aware of when I visited the site. I can continue, because I know that there have been a that. There had been a proposal process earlier this year about extent maybe was extending the neck down on behalf of the museum. Maybe that's going to be more and more moot and as Covid-19 dissipates, but I don't want to speed that beam for another year, so I just wanted to flag. That might be something we'd want to revisit or consider I, don't know him hi, everybody, sorry yeah, I, guess I would just try to understand a little bit about this. If I'm looking at it, it's Orchard street I would assume it would be north of Broome Street in that tenement zone. I. Think it's a potential I think we're having a continued conversation with the public space team about a variety of different options, but I would assume that a potential station location here might be able to integrate with those plans. But yes, I would fly. This is probably out of all of them, one of the most interesting and kind of there's a lot going on in and around that their area yeah all right thanks, so clarity, Tim for flagging, we'll work with our public space team. If we haven't already or we'll follow up with them again great. Thank you. David Crane I was just going to plug for the agencies to please give us information in advance, so we can put them on the agenda. There are nine locations here. Those could have been listed on the agenda and we would have, and then we might have people here saying. Oh, but there's a special needs school right there that or something of that nature that we may not know about. Because there's you know I can only know so much of the district I've tried to get people. You know on this committee who will be familiar with other portions of it. The point is: don't hoard this information until the presentation, please thank you David Susan. Thank you. Did you have your hand up go ahead? Yeah I wanted to ask for I'm always concerned when the bikes are on the sidewalk and I just want to ask on the one on 2nd, Avenue and 13th street. That's on the sidewalk is that on the sidewalk, at the curb and not on the inside of the sidewalk that'll, be along the building line, I suppose so not on the curb line. So is it close to the intersection? Caitlyn I? Think is the question so I, don't know what I'm saying is it on the inside of the sidewalk as opposed near the building, as opposed to on the sidewalk as the curb and you're saying it's at the building right? Yes, so I'm going to tell you that's a serious problem. We've been working with Jennifer Liang for a while now to get the one on first avenue between 5th and 6th street moved because it is a disaster in rush hour, particularly that's when everyone's bringing their bikes back. That's when everyone's on the sidewalk- and you have you know all these people, because it's a long, a big installation they're with their bikes on the sidewalk, while people are trying to go back and forth on the sidewalk and it's a real conflict and that's also an area where the sidewalk, particularly on weekend, nights gets extremely crowded. I would say, having bikes on the sidewalk at the building. Instead of the curb really presents problems in our very overcrowded district and I would ask you to look at putting it in the curb or putting it in on the sidewalk at the curb or putting it in the street. Yeah can I. Just add on to that before you guys answer Susan. Is that where that's New, York I only infirm right across the street correct and that's going to be Mount Sinai expanding into that area? Correct yeah! So that's already problematic, as it is so I, don't yeah where that's going to be positioned, I, don't know! That's the Verizon building, though yeah I mean I, know where the resin building is at yeah, but across the street is New. York I am near and just the amount of people there it's not good when they have to cross the sidewalk elected. Thank you for letting us know. Okay, Trevor I saw that your hand was up. Oh no go ahead. You wanted to respond on my apologies. That's okay, Trevor I saw you handle yeah, I'm just gonna echo David's comments about letting people know about these proposed locations. I know, and I'm specifically talking about the one Clinton and cherry I know when D.O.T presented years ago about a traffic plan. That street was changed dramatically, eliminating parking and adding a two-way bike lane on that street, and that corner is two NYCHA locations, 286 South, Street and Laguardia, and also your metrics. You say that you got input on a website, I'm just curious to as to where the data comes from, meaning who exactly asked for a bike corral at this particular location, not that people didn't want it, but I really think that there needs to be outreach before these two natural locations. So we don't get a repeat of what we had a few years ago. When people say we had no idea. This was proposed because it was buried in the last four pages of a presentation at 9:28 on a transportation meeting. We had no clue of where the locations are. It's almost like. Okay, here's a surprise. After all, the pre for the presentation we got the locations at the end, so I'm just going to repeat what David say and to take a look at that location because I'm not sure it's appropriate, but if you deem that it is that you really need to do some outreach to the two NYCHA buildings on that corner and Trevor and David, you can speak a little bit. Oh go ahead. John I was just going to say. Thank you for those comments, and those are you know, points that are taken and Lilly, please feel free to add on. But when we do, you know our first kind of chance at outreach is to share these. You know selected sites and proposed locations during the community board presentation. So you know if there are additional folks that you'd like us to reach out to please let us know we do complete notifications and outreach to all of our city partners, as well as the adjacent properties prior to installation and at least for, like the NYCHA sites and the park sites. We do additional coordination with them as well, but point taken on the Clinton site tremor. That Clinton is on the sidewalk, though not in a nitro location, which would require a different level of interaction. If this is on the roadbed I, don't imagine or the sidewalk, your inaction is not the same as the ones that are located in the nitro properties. So we don't have locations most of the time the we conduct notifications for all stations, regardless of where they are, and if the station is on another agency or private property, we do very extensive coordination, but we will be doing notification outreach for all these stations, regardless of, if they're on the sidewalk or the road bed and just to speak a little bit more to the feedback portal in our outreach process. You know we, like everyone else, have been, I'm really hampered in a lot of our work due to coved. Typically, we do pretty extensive on-street outreach and that has really shifted to more of a focus to the online feedback portal that feedback portal information, I, think I, believe was sent to all the community boards, as well as to CitiBike rider Lyft, serves and posted on our social media and variety of things like that. We've also emailed it to different types of community stakeholders so trying to get as wide a set of feedback as possible. Of course, understanding that there are limitations with online outreach. Well, I understand and thank you, but I think it would have been helpful if we could have put this on the community board website with the locations. I think it would have given a lot more feedback, but thank you Paul for letting me ask that question: hey Paul, it's Tim! Laflin can I just ask a quick, clarifier sure then go ahead. So can when we're talking about these new locations and we're talking about road bed versus sidewalk? Is there a standard amount of docks right or does it vary by location like in terms of like number of bikes and length of installation varies a lot yeah great question? It does vary, I, think I, don't know. If really can explain more on this on the news stations I think tend to be between 25 to 40 stocks in total I. Don't know if you have more information on that yeah, so the station sizes do vary. Part of it is based on the amount of available space, so we have very rigorous technical setting requirements so sometimes we're not able to extend a station as long as we might want, because there's a utility cover or a hydrant or a tree pit. Various obstacles like that, but I think what Katelyn said of between 20 and 45 is probably the average, if not maybe the on the lower average, where possible near larger hubs, transit hubs or parks or large shopping destinations. We try to place larger stations where we know there'll be greater demand got it thanks. So in the interest of time, does committee have any other questions. First, before I go on. No okay, I am thinking. You know. We just got this information now and if we wanted a resolution that this got wanted us to put a resolution tonight supporting all of these. No, not at all right that. That's not what my impression was go ahead. Susan I should say: I was told that we don't need a resolution. Correct I do think we need I, do think, there's a need to come back with more outreach to the community on some of these new potential new spots. This is a can I jump in this is an update. They gave us a previous one, and this is an update to that one in the previous one. Actually I talked about the online portal, so I think there's a whole series of these things that are coming and maybe a towel. Those are structured that we want to that. You want to address. Could you repeat that last line dude? Well, maybe you want to address how those updates are structured, but they are rolling out these expansions, and this is the at least the second. In the series of updates about this expansion, the last one was roughly a year ago. I think I was cheering at the time. I don't know when we switched so maybe you want to figure, ask them what their plans are going forward and what the you know. Okay, so yeah! You know well yeah, let's go with that! What's the you know, this is a five of F phase. Three is a five year timeline. Is that correct, well 2019 to 2024? That is correct. It is a five-year timeline and Caitlyn if you're able to scroll back to the slide. That kind of outlines, I know, there's a few maps that kind of dictate this, but let's see oh there was a slide that kind of highlighted exactly where infill is being prioritized now so essentially for Manhattan. It's boards, one through eight, it's the system's busiest areas as well as portions of like downtown Brooklyn and north Brooklyn, which is essentially the you know, the initial areas where we launched the bike share program, but right now we're focusing in Phil on that, as David had mentioned, and as Katelyn mentioned during the presentation, it is an iterative process where we will be rolling out additional new infill stations over the next few years, but right now, this our plan is to kind of focus on the first kind of busiest sites and I know this. Isn't the map I was talking about, but I here we go, I! Think it's the no I. Don't recall, though, but here we go, that's it. So here is the map that shows the initial Intel focus areas and, of course, Cp3 is right in the heart of it, and so our plans right now. You know we're working through these info presentations with boards, one through six and then they're looking to you know, do presentations to upgrade separate west side shortly as well, but the installations will be happening over the next few weeks. I'm not sure what the specific timeline is. Caitlyn that we're aiming for here, but when we are looking to you know return with additional new info sites, we'll be able to notify the board. You know when we come to that phase, but right now we're just focusing on this initial infill rollout in the light blue areas on the map, so you're talking about installation in the next few weeks. You see a site if I'm correct, did I just hear that correctly, so I think we're working. Sorry we're doing a lot of these until presentations, so I think we're going through new infill sites in Midtown already where we did the presentations last month, I don't know lily and Caitlyn. Can you help elaborate on that yeah? That's a great question, so I think the next few weeks is probably a little bit aggressive or a little bit quick, but and then, of course, I think we expect things to slow down a little bit around the holidays, but the goal is to get new stations on the ground within the next. Let's say two months: that's not enough time for community input. Go Ellen, go ahead, yep, I'm sorry I'll get to you! David I just saw it I just wanted to ask whether or not there or we can get something a bit more comprehensive like up to this point proposed sites within the district that we can just see in a comprehensive manner, and then we can actually get feedback or walk those streets. So then we have a better macro picture of the proposed sites. So right now the sites that we're proposing are the nine that Caitlyn laid out. I think you know that we want to emphasize that we think this is going to be an iterative process, so we'll likely end up coming back in over the next couple of years, but we don't know what that will look like. So it's really. We have the this all the sites that are on the ground and the best place to understand that picture is really the CitiBike website, because there are often moves and things like that. So that provides like the most comprehensive look at what's actually on the ground right now and then these nine stations are what we're proposing to add to the that at this time. Okay, so then there are the already existing sites, that's on the website and then there's only nine proposed. Thus far, that's correct Tariq was your hand up yeah I just are these: are the nine proposed sites proposed from the feedback portal? Yeah? That's a great question, so some of them the feedback portal, really helps drive the let's say like the intersection or the couple of blocks that we look at because we have to combine. We want to be able to combine the community feedback with our technical criteria, so it's not always possible to put a station exactly where somebody would like one due to our sighting criteria, but we try to get as close to that. Those areas as possible and I will just say I want I, do want to echo what David and Trevor have stated already. You know getting these presentations a little bit earlier helps us also ensure that this meeting gets filled with community people from the district, who can also respond to what you're proposing it helps us speed up the process a little bit so that we can actually do our work and our job to represent the community. So I will appreciate if you know the department can just send this over to community board. So we can collaborate with you and get community input if you're not getting response on the portal from our community district. Thank you, Tariq appreciate that David Crane and then Susan Stetson yeah. So we need to understand that the CitiBike program doesn't come to the community board for approval for something it also. It doesn't make changes. Only because we requested them, you know, like the street side, parking, the way that those operate is. We have to make a request and that triggers an evaluation other things they may come to us for real input on something where, like they're, changing street geometry or something like this. You know long-term projects like the you know, used housing reconstruction that just wrapped up but CitiBikes. They have always said from the very beginning, basically they're going to come periodically and announce they're, doing expansions or changes. They don't even have to announce them. They will just you know as demand changes. They will make adjustments to what they have. So that's kind of why- and let me also say I- am a complete supporter of this program. I think it is fabulous, even though I don't use it. I have my own bike, but we need to understand that if we want input, we need to ask for the opportunity to do it very clearly and I think we ought to do that resolution maybe next month, because it's not pressing, but we need to say we want them to give us the list of proposed changes. Those nine changes, so we can put them on the website in advance. I understand that you know that when you make presentations, you're thinking that you're coming to the community, you're not you're, coming to like what are we seven nine of us here and some activists who regularly come to our meetings for these in particular, I would like to see us have a formal request to the agency to just give us that list, as if it was the MTA giving us a list of the bus changes that the route changes they're going to be making. We look at it and we decide if we want to stick it on our agenda or not, and okay, I think I can stop talking now. But the thing is, we should not be surprised in the future when they come and tell us that they're going to be doing this in the next few weeks or months. That is how this program works and we can ask for more information. So we can do better outreach to get people to the meeting. Who would have concerns the people who use that portal they're activists there are people who want the bikes in a certain place, they're the people who are the demand for it, they're people like me: it's not people who are going and saying that's, not such a great location, because blah that you would hear tonight if people had heard that location was going to be discussed tonight. So we can do that next month. Thank you, David Susan go ahead, yeah, so one change from the beginning when we were first notified of these at that time it was relatively easy to get a change in the station and it was- and we were told that and we didn't, we did get DOT. You know we had some problem sites and they were changed. Then that changed where we were told we could never make changes and of course never is not never. But I would like to ask. Is that true? Is it still dot's stand that we can't have changes made? No, that's not our stand at all and we make changes all the time for a variety of construction or roadway, repaving or parades. You know all kind I mean maybe not parades right now, but all kinds of things, and if there are particular stations where there's concerns or challenges, we're always happy to take a look it may you know it may not always be that we are able to make that certain accommodations, but we have been I, think you know trying as much as possible to meet concerns and things like that and I will say that as we, you know when we first when the program first launched, you know everything was kind of a blank slate and as we continue like we're, really we're trying to carve out the space as best we can. So it becomes a little bit more challenging as the system grows to make adjustments, but we're always happy to discuss any particular sites. So that's very good to know because there was a period when the community board and elected offices were told in writing. You can not make changes and I do know that there was always exceptions, but that was the general rules, I'm very glad to hear that it's a little bit more accommodating and I know that you know because we're we are asking for a change on first Avenue I will say that change was requested by the development there of thousands and thousands literally of apartments and their board, and their lawyer asked for the change. Those it was serious and I want to say one more thing. You know I think the resolution next month is a really great idea. I want to ask the site I am objecting to on second avenue at the building I, it's a really serious objection. We have that right now on first Avenue it is a disaster and I would like D.O.T to come back and say they're not going to do that. Not saying that area shouldn't have one, but it should be either. You know somewhere in the road bed or somewhere on the sidewalk at the curb and I would like a commitment from D.O.T, because we've had experience with that. It does not work. It's a really bad idea. Hi Susan, so the bikeshare team will definitely take a look at alternates and either Jen or I. Will you know, respond back to the board? I do if I may just want to give a little bit of a response myself to you, know, DOT being accommodating and open to requests for station adjustments. You know we see bike share. We see CitiBike, as you know, a real mode of transportation. It is a transportation system, this network of stations- and so you know we're not going to you know, generally speaking, we're not going to be open to just relocating the station. If somebody doesn't like the look of it or if somebody is unhappy with the placement just because it's right outside their doorstep, if there are serious operational kind of technical concerns that we can address, that is something that we're open to and I do think that you know we have been trying to accommodate a lot of these requests that have come to the board, but, as Lily said we'll, you know we're continuing to do that with our infill stations as well as- and you know, they're these stations move around a lot construction and you know they're either permanently or temporary relocated. So, please, you know we're open to continuing to work with the board on finding the right site and I will tell you that many times people contacted me and said I, don't want a bike installation outside my front door. I have never gone to you with those objections. Thank you Susan, but always feel free. You know it is our program, and so, if the board doesn't want to have to deal with those constituents, you know the Manhattan borough commissioner's office is open for business. I think you know. Take you up on that. Thank you. I do kind of want to wrap this agenda item up, so I will take this. These final comments from Tr, Trevor I, think I saw your hand up Trevor yeah, just a quick clarification following up on your question Paul, because I'm not clear for the nine locations in CB3 that those installations are going to take place over the next few months or the next few years, and I'm only talking about CB3, the new locations, those new locations and the nine new locations we presented tonight. We hope to install in the next few months right and following up so when is there gonna the outreach to those folks who live in those areas? When is that going to start so the site-specific notification? So we send a letter and do emails and calls to property owners and businesses adjacent to all of the station, so all around all those nine stations that will start a couple of weeks, probably about a month a little bit more before we plan to install I know some of the conversations like our partners at NYCHA. We may have already started some of those conversations, as we know that we're potentially looking to play stations there so, but we give at least a couple of weeks to make sure that a letter reaches someone and that we do multiple attempts to call and follow up so that we are able to speak to the appropriate contacts at all businesses and residences adjacent to new stations. Okay, thank you. Trevor David Crane last committee member to ask a question. Yeah I was just going to back up Susan's point about the installations on sidewalks, especially the busy one at that location. There are problematic and if there was to be any brief resolution tonight, asking them formally to reconsider that one. That would be the one to do. The motion on I'm not proposing one though, but it's late, yeah I, don't know if we want to go ahead with a resolution tonight, just because of the amount of time we've already put into a lot of stuff. I think that if I'm, if I heard it correctly, you guys said you're going to take a look at the 13th Street one already correct right. We heard that loud and clear, so no for no problem, I'll take I, believe there's a community member who has his hand up Mr Wall, yes, yeah the station on 13th street. It's just if you move it to 2nd Avenue and 13th street. The sidewalk is very wide in front of the Verizon building. It's true that it's a terrible location to put it on the sidewalk of 13th street and I absolutely object to any stations on the sidewalk that location specific has a very wide sidewalk in front of the Verizon Building. That said, I do hope that this committee will pass a resolution next month to move the station on First Avenue between sixth and fifth street, on the east side to the road bed right now there are three vehicles parked there where 40 bike docks can be thanks. Thank you. I don't need to do a resolution. It's already been moved yeah well and we'll take a look at future agenda items offline. That being said, I think we are done with this topic. So thank you for presenting on the potential news stations in the district. All right agenda. Item number five Michelle, I'm gonna pivot to you, since you have the wonderful presentation. Thank you, Paul and I apologize. Thank you and I apologize that this is happening at almost 10 p.m, but I feel very strongly about what we're about to discuss. So, please bear with me. I want to thank D.O.T for being here tonight to discuss these issues, which are just generally the issues that are happening around traffic in our district. I live in the lower east side. So that's where I'm going to focus and I want to thank Susan in the office and also council member Chin's office for their continued issue. Attention to this matter, so I started attending CB3 meetings as a member of the public in 2017 because of the dangerous traffic conditions that I saw on Clinton and grand street on the approach to Williamsburg bridge and I lived right above it so night after night, I could see from above the anarchy that ensued as these cars attempted to squeeze just every last. Second, out of every light, leaving pedestrians to dodge traffic like Frogger characters and I applied to be on CB3, so that I could join this committee and work on these issues. So I'm happy that we're bringing it up tonight. I know this is neither the first time nor the last time that we were discussing this topic. In fact, our last in-person meeting back in March was about the traffic conditions in this area, and unfortunately, this already terrible situation has deteriorated in the wake of Covid-19 and what many in the city believe is an NYPD enforcement slowdown, so I live on Essex and Dilliancy now and where I have to walk through the Delancey, Essex and broom at six intersections on a daily basis, and it is terrifying. Every time there has been a proliferation of illegal left turns onto Delancey, by drivers going southbound on Essex and just one block down drivers routinely turn aggressively from the right lane all the way across Essex onto Broome every day. There is the chaos that I will show you in a minute at Norfolk and Broome, which is just the next stop. After that, broom turn. I am shocked that there have not been serious injuries that I know about. Maybe there have been and they made it the city of this Essex Crossing development, where I live and the common denominator here is the Williamsburg bridge approach and the lack of attention that has been given to how cars interact with pedestrians. There drivers will do anything to get there, even if it puts pedestrians, other drivers, cyclists and themselves in danger. The last proposal we heard in March was to make Norfolk a two-lane road and I am telling you I walk it every day, multiple times a day. It will not work. There is a loading zone on that block for Essex market that is in constant use. In fact, there are often trucks parked on the sidewalk, because there's not enough space in the bed, and this is the same as the one in the middle of the bike lane on Clinton street for trader Joe's and target. We see a comment and have another common denominator here: one lane roads with loading zones with loading, docks, excuse me, and we must begin thinking of Delancey Street and Essex Street. As the main routes to the bridge, they are the only streets that have a chance of safely holding the volume of cars that approach the bridge. But in order to do that, we must think about patterns traffic pattern. Shifting there isn't one answer here: I'm not a city planner, I'm not a traffic engineer and we're definitely not going to fix this problem tonight or in a day, but I think we need to think about things like a left turn only light cycle onto Lan Fountain Delancey from Essex. We could also think about doing a full stop of traffic, so no traffic at all, so pedestrians can safely cross at all. The intersections and traffic does not need to compete with them. We could use corner barriers like in Midtown to funnel pedestrians to one side of the intersection, and, like I'm saying there are many options, I'm sure there are many more, but what I'm asking of DOT tonight and I've asked before I asked this in March I had probably the last time that you guys were here is that we need to think bigger than just really small things like Norfolk. We need a big, bold change, because this is an interconnected system and we have not addressed it holistically and you don't need to take my word for it, because I'm going to show you some photos that I have taken over the past six months or so. Let me just open up this powerpoint. This is working sure Paul, my share screen's, not working. It's a song. Let me see a sign. You don't want to hear from me. Let me fix it. She should be fine. Maybe you should it's like coming. Oh there we go there, you go okay, so here we go all right, so I'm just gonna play you one or two of these videos. This is just a regular day, November 25th right after or right before thanksgiving when I was out taking my dog for a walk. Okay, here's the first one car, two cars, three cars, four cars making an illegal left, turn on Southbound Essex onto Delancey in one traffic cycle and here's just the next traffic cycle, almost heading to pedestrians, okay, plus that's Delancey and Essex. I won't make you watch anymore, but I will try and figure out if we could send this to you guys. Here's a truck that yelled at me when I tried to tell him that he was making an illegal left turn and there were multiple. He see his role, he rolled his window down. Okay, here is the intersection of broom in Norfolk. You can see it's kind of a disaster. This is the other night I apologize, it's a little choppy. This white van is about to go through a red light to try and knows his way in you see it's a red light, yet someone's coming through it. This is the street that D.O.T proposed making into a two-lane road, okay- and here we're gonna move now to Clinton street, where the other main thoroughfare to the bridges on a one Lane street, where there are constantly cars parked in the bike lanes, there's a truck parked on the sidewalk okay, and now we're going to move on to Broome Street between Norfolk and Clinton, which is a one-way going westbound, which I imagine is because of the seven priests precinct needs that. But here are cars that are constantly, if you can see here, even one car going eastbound and one going westbound and here's another car going in the wrong direction, more cars going in the wrong direction, and here I'll have to give a shout out to my committee member Lee, who sent this these photographs of a car going the wrong way on Grand street and the approach to the Williamsburg bridge. If everyone knows that this is one lane for most of it, grand street back to the FDR, which gets horribly backed up until it splits into two lanes farther up- and here is what we were talking about. Also thank you Lee about the lack of loading zones in the district. Someone parked someone dumping all their packages here. Two trucks parked blocking two separate ways: here's some more! This is Suffolk and Grand. This one is in front of target on Clinton and grand, and then here's my ending with the Asp problems so suffice to say you don't need to take my word from it to see that there are terrible issues with this area and I. You know I've made my suggestions. So Paul turned over to you how you want to proceed on this sure I know we have D.O.T on the call you got to see all of this I know. I only became chair a few months ago, but this has been a topic. That's been on for quite some time. You said: March, correct I, think that was the meeting I missed. Yeah March was the last time that they came I. Believe Ed was here that was in person, yeah, so I know. The consistent answer is just to take this back, but I think we may need something stronger if we want to put resolutions together down the line that have some teeth to it. If DOT wants to just talk about what you've seen so far, yes, so I wasn't at that last March meeting, so I wasn't I mean a lot of these issues. I'm aware of I've heard about it. What I can say is that if there are specifics that we can look at signal timing concern intersections, you know additional signage. Those are those little things that I could definitely share with my different groups of you know within DOT to take a look at them because, based on a lot of the stuff that you mentioned, there are different groups that work on them. I think that's why I'm not able to have all of them join me tonight to speak on behalf of you know this area, but I am glad to you know, take back all the different issues or specific requests for us to take a look at them. I know that there was what was it was a mentioning of like when I was looking at the video that you showed with the vehicles making those turns I think there was a mention of our four-way crossing and causing traffic. That's also known as a barn stance or for us, it's called the old pedestrian phase. I think that's something we could take a look at. My thing is that we do take a look at a require, a certain study for us to see how it would work and in addition to that, we have to make sure that it also doesn't back up traffic, because a lot of this traffic on the Lansing is heading towards the bridge. But you know that doesn't mean we can't take a look at that potential suggestion. What else can you say in terms of Norfolk making it two lanes right now? It's currently still one lane right, I think it's because it's the construction project itself. So I, don't know if that's gonna, you know depending I, don't know if it makes sense to put it back to two lanes. But if you don't feel like that's something that we should do, then maybe we won't be able to do that, but that's something I would have to find out, because it is part of that overall, grand Clinton study that we were doing for that. So that's something! We could definitely take a look at trying to think what else was that I can also mention loading zones. So we do have a pilot neighborhood loading zone. Currently it's not in this area. We have them in CB4 and CB7. I would say that you know this is something that our agency is going to continue to look at and see. If there's a way for us to, you know continue to look at. You know in different areas to pilot it or to actually make it permanent for CB3. I would strongly suggest if there's an area that you want to take a look at for you know putting in designated loading zone. You know, certainly let us know put in that as a request, and we could take a look at it. What else do I have machines? They also have mentioned corralling pedestrians to one side and I know that's something that a community member had mentioned that are I, don't know if it was our March meeting but another one so that you can make the left turn like Essex, Southbound Essex can make left turns on Delancey and pedestrians couldn't cross there because, as you saw from the videos, it's just really untenable that there are pedestrians and people trying to blow their way through to the bridge at the same time, and that's part of what leads to the backup. Okay before I go to the right. Oh Jennifer, were you saying something? I'm sorry, let me just cut you off I think that's all I have for now and what someone else has something more specific that I can address. Okay, so I am going to just before I go to the committee. I'm just going to ask a question. The one thing that scares me in the videos and the pictures is I. Don't see enforcement agents there and we'll see traffic agents there I, don't you know I, I'm scared for the community people were this close to getting hit. I know I crossed Delancey a lot during the middle of the week and I. You know I run across so and I live up all the way up by 14th street, but I still use that area. So I'm afraid that people are going to get hurt that they have gotten hurt that they'll eventually get killed because somebody's making, like that big truck doing that left turn. My question is about enforcement or lack thereof like where's. You know I'm I want to if it's something we got to write a resolution on at some point in regards to enforcement. I think that's something we got to go with. Is there a reason why there's no traffic agents down there was that is that handled by PD, or is that NYPD it's NYPD I mean we can certainly try to work with them for the those several intersections I mean in addition to that I think I could also find out from the seven precinct if there are any accidental reports for those locations, because I would think that if there's a certain amount of excellent reports, for you know, accidents in that area, that's also something that triggers us to even take a closer look at it. Okay, I just think we would want to be more proactive and not reactive to a lot of that stuff. Lee Berman go ahead thanks. You know, I really do wish that the precinct were still here. You know somebody was killed on that very intersection a few years ago. That's why the left turns were prohibited. Since then, we've been having town halls and meetings going on four or five years now with the DOT, and it's always the response. We have to do a study we'll do a study we'll come back. This is four years and to hear that one of Michelle's suggestions is the response is well. We need to do another study, I'm not sure why that wasn't studied three years ago, two years ago, a year ago, even in March or that wasn't put forward the fact that there's no enforcement whatsoever. Yet when we ask the precinct apparently because the elderly are just spry enough to miss getting hit by a car by a whisker, the reports at the seventh precinct say there isn't an issue, but yet that video right there shows two people were almost struck, and that goes not just on the Lansing Essex, but granting FDR granted Madison all the way up, Grant street, to Essex and in the surrounding area. So to the D.O.T I say: you've had time to do studies, you've done studies, you say you'll reach out to the precinct you'll reach out to Pb. We know that every day every afternoon- and there are traffic safety concerns at that very corner. But where was enforcement? Where were the traffic agents? Your agencies aren't doing enough and really does it take somebody else to get killed before we really figure out what to do it's again: four plus years of town halls and meetings. Okay, thank you. Lee David, I think I see your hand up am I, correct yeah. So the big intractable problem is that a lot of traffic wants to go from the FDR to the bridge of Delancey, and there is no connection for them to do it. This may require some really big thing. I mean Dominic suggested that they build some connector between the two I. Don't know how many billions that might cost congestion pricing that was effective is probably the only thing we can do. I would love to see that program put in yesterday. I know that it's you know it just it's taking a long time and there's also a lot of small-minded opposition to it. That is probably the only thing that's going to do it, but now that I'm as I was sitting here, waiting to speak I was thinking about intractable problems on the West village. They no longer have traffic coming into their neighborhood because they have these very nice. The last street going toward the west is cut off from the highway and then you have to make a u-turn to come back up. Could we do things like that in our neighborhood? Is that possible, for people like us of modest means to I assume that someone paid for a gigantic study that Sam Schwartz, perhaps you know, was paid to come up with a big solution which then DOT has spent decades installing? And it's incredible, it's wonderful over there actually I don't know. We need congestion pricing and we need it yesterday and it needs to be a very large fee and it needs to cover everybody who wants to use the bridge, no matter where they live. Thank you, David Susan, go ahead, I'll see you, so the truth is, and I want to be careful not to shoot the messenger with. You know it's very good that Jennifer stayed so late and I think she wasn't at a lot of these meetings before where we did have dots investigating everything, and this is what they came up with and I think. The truth is that they know that they can't solve the problem. They can make little changes here and there, but without doing something big which they don't have the authority to do. They can't solve the problem. I agree that congestion price is probably the only thing, that's going to make a difference, and if that happens, it's not going to be for a long time. I would suggest if you have small things that should be looked at, including examples from another village that we do maybe next month, a very specific resolution to look at all those things, because they're specific I mean they're not going to come back and say: okay, we did a study, and this is what you can do to solve. The problem. We've been there a million times, but if you have some very specific suggestions again like the example that David gave that they've done in other places, I would suggest that we put that in writing. So Michelle help me out with this yeah I know we want to put some items down tonight. Yeah. We want to focus on before we go to the next agenda item, which is going to address what next month kind of looks like for us, as a committee give us some things that formulated out of that presentation, then David. If you want to chime in what you just said earlier, something we can put together for a potential agenda items that are a little bit more specific yeah wendy. Do you want to share your screen? We can start drafting just bullets right, Paul, yeah, no specific res over tonight, but something that we can use to put as a potential agenda item that we will have. Okay, just rethink, please the item about limiting the availability of pedestrians to cross the street, because one driver turns into the intersection and almost hits the pedestrians. The thing is 10 times more. Pedestrians are using that intersection at that moment than that one driver, so the emphasis has to be about prioritizing the pedestrians in the intersection. Thanks, I mean I, don't know what people think I agree that it's an intractable problem without gigantic infrastructural infrastructure changes which we can joke about infrastructure week, but it's not coming to New York anytime soon, I mean I, think something that I hate to inject more PD into the situation, but, like I, think having a traffic enforcement agent, there might help that's something that was installed at grand and Clinton and it did help when they were there. So that would probably be my number one ask because it sorry, like part of the problem, is that drivers like just don't get in trouble so like. Why? Wouldn't they do it? You know and like my understanding from what we've heard from DOT is that only the state can authorize more traffic cameras so like we can't even really say that to get remote, you know enforcement. We need a body there, I mean. Maybe we need those big signs like they had on Clinton street too. There needs to be just I would say: presence of a traffic control agent at the intersection of Delancey and Essex, between the hours of like 6 a.m and 11 p.m. At the earliest yeah I, don't know what do people think about like things like those like big light up signs like even putting them in there's like some space in the median, the grassy median, maybe no left turn I mean I, know people know it, but shame them a little bit. I don't know. Are we in a hurry to get this out tonight because I'm just trying to get a handle on the purpose of this? So are we writing a list for Jennifer to follow up on regarding our sense of list of concerns and it needs to be done within a specific time frame or take some time and submit and then discuss next month and then give it to her or I mean I'll just say: Ellen I feel like this isn't like a imperative, at least to give like one to two suggestions that she can take back now, because it's the left turn situation has gotten so out of control like there, I've called three on one I called the precinct directly I emailed Councilmember Chin the whole bit and there's like sometimes PD that pull people over, but there's never been a traffic enforcement agent. I think that would probably be I mean. Maybe we just prioritize that as the ask for now, so I'm going to ask you just to think about. Is it more strategic to give her one or two things to take back now or to do a very strong resolution with the list of things? Maybe it's a lot or but we're not going to have a meeting next month. Well, we're going to have to end up with sorry two meetings, because now D.O.T wants to bring the gateway to Chinatown next month. Okay, it's good! Now it changed. They got rid of that horrible thing. Okay and so I think what they have now the community might want to go forward with so we're good. That's my bad news is we're going to have two meetings. Okay, I mean: is there any chance that we could have people from at least some people from D.O.T who do work on these programs to come next month? Jennifer I can see if I can get one of one or two of them to join me. That would be I. Would that would be really wonderful if you could do that, because I do think that we need a bit of a working session so and maybe, if you could send some of the ideas to them ahead of, we could send them ahead of time, so they could be prepared to address them. Michelle and Susan I understand your point of a hard-hitting resolution, but I also think that if we're able to ask Jennifer to go forward with a couple of bullets, a couple of bullet points, for example the enforcement, if she's able to coordinate with PD, you know in a week to get enforcement out there, couldn't that, that's not what she does. That's not what D.O.T does we have to go to NYPD for that, but for her to put the ask to end what because we've always been told in the past by DOT. This is something that they'll contact NYPD about and ask since it's outside of their perspective. So Leah, I'm telling you we need you're putting it in someone else's hands. We need to go to PD with it. You know if you have very specific corners, you know we could I could just ask for that. Now it's a safety issue, and then you could still include it in your resolution next month. I have specific corners and that's fine and okay right, so I could vote for you. I could go forward with that. We could discuss it in district service and we could still put it on our resolution next month. You know it's not one or the other yeah I think we can formulate a lot of this stuff for next month. Now that I've been informed, we'll have a second meeting. Sorry, no thank you. Susan I appreciate it. We can put something a little bit more concrete together instead of just bullet points, we'll have something legit that we can work off of, but yeah. If Susan you go back to just service and say: can we get the these agents at the specific corners? I'm sure Michelle will send over I. Think that's the start. I think! That's the start here we got to start somewhere on this end. Yeah I. Think if Michelle shares all that information with me and with Jennifer, we can get started on it. I agree. Thank you. Those videos are scary and now the next one all right- we're not done yet, but we do have our final agenda item, which is planning for what was the original plan was to not have a formal meeting next month but to work on the open street open restaurant forum. Susan I got a piece of Cb2's meeting last night. They were very regimented in how they did things last night. I can only get bits and pieces I just wasn't able to finish hearing it, but to provide some clarity to the committee. Open restaurants, open streets has become this whole topic and agenda item that's grown outside of this committee. It's grown so much bigger. It affects not just us as a transportation committee. In fact, economic development will affect SLA. It affects all the businesses, the residents, it's a it's across the board, so it was proposed that we potentially look at this in a town hall format inviting the electeds, maybe co-sponsoring with them. Maybe Susan correct me. If I'm wrong another board involved, maybe CB6 I, don't know if you want to provide some more clarity. So do you have the that document? I sent to you, which one I have several: it's called open streets, I sent it to you a while ago. It starts town, Hall, reopen street restaurant and open where I gave all the information that we had talked about and the so maybe I can just forward it to should I forward it to Wendy, wait hold on I. Think I got, it is it's, it was I got it I I'll share my screen. It's fine, don't worry. Wendy I got this one. So I think it was the exec that decided this right yeah. We discussed it exactly correct. Exactly and we've had a network of block associations asking us to do this because of all the issues. So this is open streets, restaurants and open restaurants. It's those two programs and the issues. If we could look at the document, I listed all the big issues and there are a number of safety issues. But the big issue is the city is not in any way doing implementation. They don't have individual a like I can't go to DOT and say: can you fix this because in reality it all comes from the mayor's office of special operations? Who now triages and there's no feedback? It is I, don't know how to describe it. So there is no compliance. There is no community engagement. There is no community input and now they're looking at making the program permanent not just for year but for permanent there's some terrible safety issues. We've dealt with the FDNY I know: there's been summonses issued are ready for storing propane in the community board 2 meeting they talked a lot about the propane problems and the fire department was there just admitted it was scary and terrible. We've had safety issues with structures falling apart during high winds. We have quality of life issues from noise from the businesses and independent performers amplified sound the business. Well, I don't want to go into detail. There's lack of engagement, there's no follow-up for complaints. There's no working with the community board proactively. There's lack of clear guidance for the businesses they're in a terrible position. I went to a meeting for the businesses hosted by nightlife and it was supposed to be on guidance and D.O.T if you're, still there Jennifer's still there, I'm going to tell you. The people from D.O.T did not know the rules. They particularly did not know when they were asked about the structures in the street that had to be 50 open. They just didn't know what was going on. So you know I feel for the businesses too they're also suffering from this. The agencies that are involved are DOT, DOB, the sheriff's office, the office of special enforcement. What I'm going to say- and we talked Paul and I- did speak to Jeremy and Carolina's office, asking them to co-sponsor which they have agreed to do, and the date they've already given that date and I did tell Margaret Chin's office at a meeting today that we were going to ask them to also co-sponsor, because he can't have one city council person and not the other Jeremy suggested, and this is I think some of what was done at CB2 today. The issue we know the issues and what might we do is have a list of questions that involve these issues and have the agencies be ready to explain them and describe how they could work with us to mitigate these problems. You know they certainly need to hear from the community, but I think we don't want to have like just a session of people saying the same complaint over and over. We might want to have press there, because that always works, and it was suggested that CB2 has already done this a number of times they've done resolutions. It was suggested that we might want to do this with CB6, because we share a council member and they very much have the same problem. It's I think more located to one area than we have, but they certainly have. This comes up at borough service cabinet meeting a lot so there's a couple of boards I think four, two, six and three it doesn't affect all boards, but it very much affects several boards in Manhattan, plus boards and other boroughs all right. What was the date they gave us again, Susan was it January? Was the date of our next? It was that January, I'm sorry, I'm just was it the 12th yeah? It was a date of our next meeting. All right, I'll take any thoughts from committee members on this and what we're trying to do here, I think we should do it in presenter mode. What do you mean? What does that mean like we do full board so that, like people can't just unmute themselves and talk? Oh absolutely? Well, we were thinking of having them write down, questions like if they had questions. First of all, you can ask them to send the questions, preferably before the meeting, and then we can have them write down so that we don't have people saying the same thing over and over that's what CB2 did they had? You submit your questions ahead of time on their website or, however, they asked for it and they went from there. I saw that they did a breakdown of like who asked the questions. I believe it was I, it was called their rework. Their reopening group I believe was the name of the group yeah, it's the name of their committee. It was them who asked the questions. First, then I believe it went over to the full board and then I believe. I'm sorry, I'm trying to remember the water off the top of my head members of the public and businesses I, don't know which order it was, but they broke it down into like different stakeholders of who asked the questions, and he said, I only got bits and pieces of it. I wanted to watch it again before the meeting, but I didn't get a chance to I saw Clinton had his hand up Clinton go ahead, so I've actually been to several of Cb2's meetings from starting back in March when they first started having them and that's one thing what I was going to ask was if we were planning on this to be. You know an open round table like what they have done is what you were just describing Paul. They I think. If I remember correctly, it was, they would start with the committee and then they would break it down. I think they went to other board members, business owners, community groups and then general members of the public I. Think that's generally how they broke it down, and then they had it. You know they would have it in more of a represent, so it wasn't six people. Speaking from you, know a block association. They would kind of have it structured that way and it seemed to work generally pretty well for most of the meetings that I attended, they were able to get the ideas out, but it didn't turn into a you know: complaint fest, yeah I saw that they elevated people into the I, guess the presenter part when they needed to and then dropped them back into the regular level after that, which I think makes things easier. In this case I guess we gotta talk about how we're gonna get these questions submitted, go ahead, Ellen I think it might be easier if you had people sign up like some of the community boards too. You sign up to be part of the meeting and part of that sign up. You provide your contact information. What you're, representing who you're representing, as well as the issue or question that you want to ask or submit, and then from that before the meeting you can gather up those and divide it up between the constituencies, various constituencies and similar issue areas right and collect them together and I'm sure a lot of these community groups know each other anyways. So as long as we have broad coverage for everyone and everyone specific point has its moment, then we don't need to have 10,000 people speak about the same point right, so I think it's more about airing the issue shining, a light to specific certain things and I. Think if we do have. Let's say you know certain block associations. There are within close range of each other who have very similar issues. They can nominate someone to be that speaker, for example, and cover all these issues right, because they're so similar. I'm sure that there's not 10,000 issues within a six block radius, let's say right so that helps us organize and facilitate the meanings better to give it structure and I. Think that's really what's missing in a lot of these meetings. Is that there's really a lack of structure? So, therefore, the facilitation process is a lot more challenging. No I agree with you. We need to structure this as much as we can. We see what happens at this committee when this topic comes up, but it does get out of hand even for me to try to pivot and wheel it back in it's still difficult to do so. Many people have different things to say, comment whatever right, Susan go ahead, I saw your hand up and then I'll go to David. Okay, so just one thing, I didn't tell you. So there is a coalition of community block associations and they didn't want to wait till January, so they actually had a meeting last night for me to address all of this enforcement and explaining you know what was going on to them, so they are all together. We went through. We all know the issues they're all in contact with the board. They brought up I think you know, I think they would be perfectly happy with what Ellen suggested. You know as like a rep from each group. You know it, but I think it's also important to make sure there. No we're not going to talk about the structure at this location. It is about the systemic problems that are happening and happening all over it's not about. We should let them know and I. Think CB2 did this. Also, it's not about us. You know this restaurant is doing this yeah. They made it very clear last night when they opened up with their rules and their guidelines and their norms that they weren't addressing anything specifically like a specific restaurant or street, or something like that they wanted to tackle the bigger issues. David Crane go ahead wrong button. Are there going to be agency people there I mean so in the past? Oh, so this is going to be one of those where the agency can answer directly and some people can question the agencies. Okay and I haven't been to any of these online okay, so maybe that maybe it would be good to have a way for people to submit their questions, not that we require that, but if they could and then we could assimilate to something for the agency so like be prepared for this, and in fact someone presumably would ask these questions. I, don't know I've never done one of these things online. You know, I haven't been to any of them. So it's interesting that Clayton Paul have both been I. Guess Susan as well. I have a meeting from last night. I can send it I, send it to you right. Paul, yeah and I was in the committee, some of the stuff. That I was able to pick up I liked from last night. Is it very controlled and how they do it yeah it was I didn't get to watch everything I was shifting from work to this meeting, so I saw bits and pieces, but what I did see I liked? What I become a professional in Microsoft in Google forms over the past month or so I think that could be something we use and put on the website to submit questions from businesses from residents and then we kind of sift through them, I'm more than willing to have like a day to kind of look through stuff to narrow it down and who will represent like a certain agency or if it or if we do it. As the committee we choose, who we're going to represent and ask the questions ourselves based on what's submitted, we have people who are on multiple committees here now we have SLA represented. We have economic development, we have human services represented, so we have arts represented I. Definitely you know I'm trying to get everybody's take on it. I don't think Trevor's on the line anymore, but parks would not like go ahead says. So. Not all these agencies are involved in these programs and you're right. It does involve all those things, but they're not involved that you know there is a certain group of agencies that the mayor's office have put together. It's the one I. Actually, you know read off in that list. I also asked to have the meeting last night recorded, so I'll try and get that recording and send to everyone, and we know we're gonna, try and get the agency CB2 got some of the agencies, so I don't see why we wouldn't the person they got from DOT has I'm going to say it has been useless for the many months that I've been dealing with it's the same person that Paul's met. So it's not just having an agency represented it's trying to get someone that can actually say something with, but having the elected officials. So one thing I want to ask you one ask all of our state people to also co-sponsor or just the city. I would suggest that we might ask everybody to put their name on it, because I think it'll carry more weight and then I would also suggest. Like I say, you know, we can have people asking questions, but we also know that the questions ahead of time and I would actually ask the agencies, if you want them to give some presentation to start with to address as much as they can. That would help in eliminating some of the questions. David. Do you still have your hand up? Yeah is the mayor or the mayor's office or whoever is controlling the thing actually going to be there, because that really I believe is. The problem is that the mayor is calling the shots. The mayor has no idea what he's doing and if he's not there, the agencies aren't going to be able to respond very well, so they had a person from the mayor's office of special enforcement there. He was from the fire department with his party because they all are from agencies. So yes, absolutely we have to have someone from that division absolutely and I'm going to try and get someone from the sheriff's office because they play a big part in this role. It's very different than how we ordinarily deal with agencies, okay, so the pressure ultimately the one that has to give you know where the shift has to happen is in that office, and this is different than what we had in the past where we had like SLA was a multi-agency thing and all agencies could potentially help us. This was avenue B many years ago anyway, I'm just thinking aloud, but that's the target for whatever pressure can be created. So the way you make change these days is the most important way to make. Change is to have a reporter ask a question in the mayor's press conference. You know his daily press conference, so we can't do that, but if we have press there and we have enough pressure that it becomes a problem, it's like the Upper West side. When people you know confronted the mayor about their fake problems, he made a change, even though it was a bad change. It's that kind of very visible type of pressure, but we also another big issue- is city. Council is going to be voting on making this permanent, so we also want our council members to know what the problems are. We want our council members to be getting input from us before they make a vote to have it permanent, and you know I would suggest that we're not coming out as being against the program. What we're coming out on is making it better for everybody so that there isn't conflict between businesses and residents so that it's safe. You know that that's you know kind of what I suggest that our you know our goal be. There will be people there that will just kind of bash the whole problem and say we want to get rid of it. I think CB3 and you know I, don't know if we only supported the open pedestrian, but we certainly never had a position against the program. No I, don't think so. Yeah I like having something on the CB3 website, maybe the social media that we have for people to submit questions. But you know like use all those angles we could do it we have or are we getting com? Is it is our time frame to? Is it too quick of a turnaround to get this done? Susan, I'm just thinking it's December 8th, that's January 12th, and we got to make sure everybody commits to comment. Well. That was a date that we got that Carlina could commit to so I want to get started tomorrow. I want to ask the agencies tomorrow, but I have to kind of tell them what the format is. I have to kind of tell them. You know what we're doing, but I do want to reach out to the agencies right away, we're going to have other work. We have to do like how we're gonna do the zoom I would suggest for the questions that we have a fillable form on our website that people just go in and fill it out and hit submit, and then we screen the questions we go through them. If there's multiple questions of the same variety, okay, you're out, we'll ask this one we'll ask this one and the committee members can ask the questions like. Oh I would like to see that happen. The committee you know Michelle can ask these three. We can ask these three and so forth. I just happen to be picking your names, sorry, but that that's the way all the work. You know that way. We do that I, think that will be something that's easier for us like. We just have the questions ready and then maybe you know the committee has some questions afterwards. I would like to also give a short speech on my frustration in trying to work with the agencies. The problems in trying to you know to work with the agencies to cure it to fix the problems. Okay, Dave go ahead, I think it shouldn't be all filtered through the process that you just described. I, maybe should be I, think that there's I think there's value in having some component of authenticity where people are actually saying this affects me so badly because it doesn't have to be the whole program, but part of it could be useful, yeah you're going to have a few people, so you have Arthur Schwartz, that's suing the city, so you have a few people. I mean there's a lot like the meeting. I went to last night was fine, but you're going to have you know the dwellers coming in and being toxic, you can have Arthur Schwartz and a few people there that don't even live in our board, but they're not suing the city for this. So I'm just you know, I agree with you, I'm just telling you what to expect yeah. It would be better if it was residents with others of residents I think in terms of data collection. It would be interesting if, once we do get, those questions submitted that we can aggregate information right if we discover that 80 of the complaints are of a specific certain issue, I think all the electives would be interested to know, because these are representative right of the people who live here, but also to figure out who lives here. I think that registration process is good in that we identify people. They don't need to submit a question, but they can submit a question and one of those could be do you live in community ward, 3 right gathering data in this way is actually quite informative. It's informative for the work and it's a formative for the discussion, so I would encourage the format to include these types of considerations, and we have in the past on speaker form said you know: do you live in CB3 right? So I'm just suggesting that should be an element in terms of the registration process. In addition to you know, name affiliation, you have a specific concern or question right blah and then it because this is coming in electronically. It makes the data gathering much simpler and less much easier, agreed, Susan, just a question, because you know I. I've only had the honor of cheering on zoom and not face to face. So just remind me about the speaker form that have the actual person's address on the speaker form. We don't ask for the we they're addressing we've. Never asked for the address, but we have like particularly at public hearings, said: do you live in CB3 copy? Okay, just make sure I just want to make sure how far we can go and but we do need a deadline to absolutely get these questions in January. 12Th is a pretty quick turnaround for this. So when do we want those questions submitted, especially with Christmas? That's right with the holiday coming in a lot of people are going to be doing their own thing. So, what's a good deadline day, we can give people to submit questions by so that way we can submit it to the agencies if they want to put a presentation together and have some answers. So I don't want to keep saying this. We all know all the questions. I could submit the questions to the agencies tomorrow. All the elected knows we're all doing this all day every day. This is a presentation of it, but it's not going to be anything new. We do want the community to be saying. You know we can't stand this anymore and saying that directly to you know the mayor's office of special enforcement who has been removed from it, but I can submit the questions tomorrow. You know so it's you will be getting specifics to ask and you'll see when I get the video from the meeting last night. You'll see the same thing. It's the same questions over and over okay, it's reek, were you saying something before I thought you were trying to come off? No okay, I was saying the deadline could be January 4th, but it's kind of depends on how much time you need all right. January 4th is a Monday, I'm correct right after the new year boy, what's up all right, Ellen, I'm going to ask you a favor: could you draw up a form and send one to me with the specific information that you would want to see on it sure Google form I can just share it with you. We're not using a google form, we're not going to use it. No, we said we were going to do what we always do on this on the website. Just have people fill it in on the website right into Google form. So this is a New York City website and we have to you know we do it their way and if you look at the speaker form, you can send me. The information you want Ed will make it up and send it to department of Information technology. Okay, and they will do it. You know we can't just put a google form on a city website. So look at the speaker form. You know that gives you know. Let's you know the format and just tell us the information you want on it. Okay, Ellen I have a copy of it. I'll send it over to you and if you want to make any changes or ask any specifics on there or just let me know, I'll send it over to you. It's also right on the website. So I just want to explain to people. You know our website says secure website. It's under certain kinds of we can't you know we could never do just what we want. If we could do just one I would have a place for members to be able to sign in and store information. So that's the kind of reason we deal with an awful lot of bureaucratic restrictions. I understand copy all right, I, like the presenter format, I think that works I, think it makes it easier. I think that's where we should go, do it as the webinar or I guess that's! Is that what it's called and the way we do our full board? You know if we have to elevate somebody to ask something or answer something we'll do that, but it keeps it control to us being on that side and limiting the extra conversation and people coming on and just talking have any other thoughts committee. Did you make a decision about CB6 I know that we share Carlina as a councilwoman I know they have some of those similar issues up in Kipp's Bay. Anybody object to having CB6 as part of this. That's maybe that's a better question. It will get bigger because they'll have to have all their city council members. Perhaps no we're not asking we're asking them to join us and it's you know. We have our two council members, okay, what's the upside of asking them to join us, it gives us more weight. So maybe yes, then, hey I'm all for throwing heavy hands so yeah. Let's call them up so they won't be involved in the planning, but they would be co-sponsoring it and we would be asking the questions collecting. We would have to ask them to submit questions. Also I don't see how we could not, but you know what I'm hearing it's they're the same questions. What I would do this is what I would do? I'm you know, I haven't thought about it before, but I'm putting this before you so I would call them up, and I'd say this is what we're doing. This is what we have decided to do. We know you have the same problems. Would you like to join us in doing this? Does that sound good to you? That sounds fine. All right, I think we've got something Susan okay, so the biggest thing is getting the agencies there. I will some of them I, don't even have context for I have to get contacts for them. So I'll start doing that tomorrow. I think that's the most important thing. When you talk about time, the most important thing is getting them scheduled. Okay, do I guess I can ask us that exactly we have a meeting date for our second meeting. No, we don't but I'll, try and work with that on you beforehand, sure. Okay, all right I, believe that was our last agenda item. I want to go to 11, it's only 11 o'clock. We do some more. We haven't had a vote yet so we've got to vote on. Okay, any anything else before 2020 runs out no okay. So that being said, let's get a vote on the res. Well, we already voted on the bullets for the joint item, so this would be for the resolution that we proposed tonight and anything else after that. So when do you go ahead? Okay, Paul Rangel, yes, Michelle, Cooper, Smith, yes, Lee Berman, yes, David Crane, yes, Felicia, Quirkshank, Felicia she's, not here, okay, Wendy, yes, Ellen Lowe, yes, Tariq Ramos! Yes, great! Thank you very much. Thank you. Everyone before we adjourn I just want to say, happy holidays, everyone. Whatever you celebrate, it's been a fun year on zoom, I, hope to one day eventually chair this meeting face to face. It's been great. So far. Now I know we're going to have a couple things already lined up for January with town hall and with our original committee meeting. That being said, happy holidays have a great one. Hopefully, 2021 is much better for all of us and thank you for your support and I am going to make the motion to adjourn somebody again. Thank you. Paul thanks, Paul, bye, good night, happy holidays.",
            "summary": "3 transportation, public safety, Environment committee meeting for December of 2020 also want to welcome our colleagues from the Parks Committee, who will be on for a joint agenda item Michelle.\nThe members of the public will speak and then we will form a formulated resolution if relevant- and thank you all so much for being here tonight and for our parks.\nPlease don't be offended if I cut off questions at some point, I will try to get to as many of your questions as I, possibly can, but I do want to think about time.\nThe attendance I'm gonna have to handle at our Thursday meeting, primarily because I know there are a number of people who signed on who were not able to continue.\nEverybody, If I, could ask community board 3 to please also add James Greco who's, also on the list, as presenter he'll be sharing his screen great good evening, everybody hope everybody is staying, healthy and safe.\nLike folks have noted, We typically do give up on that project at the parks and waterfronts and Resiliency Committee, but we're here tonight because of the issue that pertains to transportation.\nSince, like I mentioned that we typically present at the Parks Waterfront Resiliency Committee.\nWe are looking tonight at the proposed changes to so traffic modifications at Robert, Wagner senior place at the intersection of South Street and Robert Wagner.\nAre the remainder of the projects, So we are included at the Brooklyn bridge abutment up to Montgomery Street, we'll see that a few times throughout, as we zoom in a little closer here's, Our project I outlined in the black-lines overlapping, with some of the adjacent projects that have either been completed or are going into construction, namely pier 35, complete ere, package, 3, complete package 4 under construction and bbe to the south of our project.\nWe will eventually be zooming in right at this intersection here of Robert Wagner and in South Street, So the project can be described in three main areas: enlargement, One. Two and three: it crosses a fixed, concrete flood wall to keep water back.\nThese orange lines running up underneath the FDR, are flip up barriers which we'll show in more detail a couple localized operable gates that are that stay exposed, but open for vehicle and pedestrian traffic, some areas of fixed flood walls and then eventually crossing back across south street and tying into high ground on Montgomery Street wrap around the existing school playground, we'll zoom in here on enlargement, one where we'll see the flood wall tying across South Street and then the flip of barriers running up under the FDR along Esplanade.\nWe're going to install a concrete box, a vault below South Street here that allow us to shut down that sewer when we need to and to operate the gate and the equipment located in that below grade structure, we'll be constructing a control, building a control house right next to the existing DOT yard, along Robert of Wagner senior place, we'll explain those a little further in a couple.\nThe majority of this section is characterized by the orange lines here, which are the flip-up barriers which operate similar to the roadway one that crosses South street, going under the Manhattan bridge.\nIn addition to the gates and walls, There is a the large intercepting sewer currently below South street that collects water from upstream and within the two bridges: area.\nWe want to take advantage of this system to be able to collect and store water in this considerable volume within you know below grade, so any water that is getting into this area can drain and have a place to stay below grade without causing street surface street level.\nThere is we're going to zoom in right into this area right near Robert, Wagner on below right above South street.\nWe have the interceptor sewer, which would typically continue left to right through here, and we have this large stainless steel gate that will close, typically or main open, Allow water to flow through to the pump station during the storm.\nWe want to point out, and we're getting at mainly for tonight- is that the south end of Robert Wagner is currently a two-way traffic.\nThe city DOT has a dugout yard right below the FDR off-ramp and their access for their fleet vehicles are through in and out gate currently accessing at Roberta Wagner, where they would typically make a left to go north or make a right to go here and access South, Street again, creating some conflicts between turning and blind turns for traffic coming either northbound on Robert Wagner or trying to turn southbound to get to South street.\nThe best of all the pages is that essentially, while the ESCR project to the north and our project into bridges, are keeping storm water out, If the river rises like it did during Hurricane Sandy, we also need to protect against having water come up from the sewers into the neighborhood and also need to be able to handle rainfall.\nHowever, Some of the benefits that come from that are I forgot to mention in the existing conditions slide that performed a traffic studies area in June of 2019 and found that traffic two-way traffic on the south end of Robert Wagner.\nTypically, most cars were traveling northbound on Robert, Wagner and majority of the cars that were using the two-way condition heading south on the South Street were actually coming out of the D.O.T yard and making a right so to accommodate that traffic.\nHere, We do want to point out that this also eliminates a lot of turning conflicts from people trying to make a left or a right over sexting or intersecting in this area, while also removing some of the possibility for the illegal parking.\nLooking from Robert Wagner down to South Street, You can see a better view of the parking, the building, the DOT yard, access to South, Street and then beyond.\nActually, So we did discuss the on street condition with the new building the new crosswalk, the sidewalk changes.\nI'm glad regarding the timing, valley, neglected to answer that this work is all going to be part of the Bmcr project, So we are completing design in spring of next year and then that project should begin construction by the end of next year.\nThe interceptor gate building did appear in our latest presentation, and this sub-grade work did not, but is I, don't think is subject to pvc necessarily, but we are like.\nSo I believe our team has been in contact with the resident association leaders from nearly all the developments along South street, Simultaneous interpretation in spanish, Cantonese, Mandarin and Fujinis next week on December 16th, So Val. Thank you for reminding me to say that I'm gonna put the link to the website where you can find the info about the event and any you know, I'll put that in my email in the chat so that everybody can see that.\nIf we could make a note to present that to the parks committee in January, that'd be helpful, so we can focus questions on that for that particular topic.\nThe concern is that you've moved the entrance and exit from the DOT yard from Robert F Wagner, Robert, Wagner, place, And you're, not placing on South Street a lot of those cars, because there's only one turn making Tessa Street actually make a left turn to get on the Brooklyn bridge, because it's very quick from that.\nIf, you wouldn't mind showing the proposed condition, so there are going to be balls, protecting the interceptor gate building, but not the sidewalk itself, I'm sorry.\nThe area is horrible, and this is DOT they're going to want to park on that.\nJust, there's no enforcement at all in that area of parking, which brings me to the next point about South Street and the increased traffic, and I'm happy that you're looking at this portion of the street to improve pedestrian and traffic flow.\nAnyone who has bike down South Street knows that there's lots of conflicts and we want to make sure this is a safe, area.\nRemember the survey from the Brooklyn bridge Esplanade pedestrians experience was number one or number two, because we walk the people who typically bike through the neighborhood, and we want to avoid these conflicts that we have.\nSo I'm, just going to add one more thing that I'll let the community members because I know some wanted to speak.\n. I'm, sorry at the access points of all entry into the Bmc or like across, because people do cross there and there's very a very little strip of media walkway before you know you get, you, know, intercepted with a bike, so.\nSo I think it is very important if we're addressing like safety and we're looking at everything.\nI would also say that, like I mentioned, We are at 75 percent design, but which means that we can't move a lot of the larger elements around anymore, but we can continue to fine-tune smaller elements such as you, know, adding rumble strips or looking at what crossings.\nIf there's a way that to address that issue as well as you're doing the rubber strips and everything like that design, you know to put that in because that also causes a safety issue where they're sharing the same lane as bikes list.\nYou know as you're looking at all these safety issues and addressing it absolutely okay, we'll keep that in mind.\nEveryone thanks will and James for the presentation, just wanna back up what grace and Trevor mentioned about having the bike traffic signals, whatever they're called at the intersections I know when DOT was installing bike lanes like around the neighborhood, The kvta had actually asked for these signals at all.\nWhat I'm asking is protections this signal for our residents, because when you cross there we're like sandwiched in between oncoming traffic, a very narrow pedestrian path, and then we have the cyclist before we get to the esplanade.\nSo I think that it will make a lot of sense if we will have a signal traffic for cyclists, and, unfortunately, like I, don't want to infringe on the cyclists rights, but I have to say that they are infringing on our rights because they have a certain arrogance because they speed.\nSo, that being said, Trevor I want to ask what is the ask of our transportation committee tonight to assist the parks.\nI know you wanted to talk about potential resolution for tonight.\nFor this specific item, I know that it's a change in street direction, right we're looking at making this a one-way westbound, If, I'm, correct all right, so.\nWith regards to the actual change, I mean they're, actually bumping out portion of and removing a lane of the street, which I'm not too particularly concerned about, because I know that particular term serves the dltr.\nI mentioned that I'd like to see ballers extended on Wagner place, to the extent that they can and any other way that can discourage sidewalk parking.\nEven if they are plastic, if their generator needs to come in that way, I, don't think it's going to come in that often, but we need to make sure that we don't have that doesn't turn into a parking lot and then make it a very dangerous situation.\nWe need to ask or demand that lights bike lights be installed whenever there is an intersection and make it coincide with the changing of the street lights or the vehicle lights.\nSo lights are the only thing that gives the pedestrians some safety that they know they have the light to cross because they're not in a safe area until they cross through the bike.\nI know there was a mention in the chat that seems to encourage people to walk anywhere in the bike lane, and that is not true.\nThat's Near Catherine slip if I believe, If I think that is where people crossing the crosswalk and that's the problem that we have is that you walk into the street and that's it.\nStill want that to happen where they bump out the space where people can travel from, but I, think lights are the only solution.\nThe thicker painted thermoplastic striping, rumble strips well, The ones down to battery park are the ones that I think would be good here, because once I've gone over them, I know they're, there.\nIn addition to lights at every intersection, where there is a light, can I ask you a question Trevor sure you had just mentioned a bicycle traffic light at every location where there's currently a traffic light.\nI'll try to find like a design detail that shows them, but I think just rumble strips is correct.\nBut I want to make sure we're getting the ones that David is talking about, because I haven't seen any of those types of strips along between Brooklyn bridge and Montgomery Street Paul.\nI just want to get clarification on what exactly we are talking about, because if bikers are going to avoid what are in essence, speed, bumps right, then it decreases and increases danger for joggers I used to jog a lot down there and because of the construction I've stopped jogging, just because of the danger level, but I.\nIf, their traffic lights, you know is I, mean there's really no penalty right for not recognizing speed, lights, traffic lights for bikers, especially along that strip, and that's been a serious issue on a daily basis.\nI, don't know you can also just put a lot of signage and just make it ugly, but anyway I, don't think I'm, a rare biker who respects pedestrians, What I'm hearing just to wrap this up.\nAfter a while people are going to figure out a way to go around them, but I didn't think we need to do something for safety in that particular era, because a number of people have already been hit by bikes, and this includes the safety for the bikers and pedestrians and people who want to walk.\nYou have all that just want to make sure if there's anything you feel like you're missing, So we got the signage, The rumble strips that are perpendicular the intersections and the with the lighting.\nI mean yes, There are raised crosswalks in other parts of the city, but I would need them to tell you like what the necessary studies are.\nI'm, saying if the bike path was like the drivers, there's no change for them to indicate that this is more than a crosswalk more than the crossing and the rumble strips and the other things.\nIf you look at this slide, where the wheelchair is that portion be raised like a speed hump, basically to where the person is crossing, only that particular section I should also add here that you know we do follow.\nThere are raised crosswalks in other parts of the city, but as far as I can understand the request here, If we are looking at this slide, you know and Catherine kind of already explains that the bike lane and the and this portion is already in line on the same grade as the sidewalk.\nMy question all right, so I'm going to move this along because I know there's some other items.\nAnd, then I have concerns raised regarding illegal parking near concrete structure, Additional bollards placed on Wagner plays looking into removable and retractable bollards, so that when access is needed for the generator, it's there.\nAddition of intersection, like bike lanes, bike, lights, to protect pedestrians, to coincide with traffic lights, I, put down that anything to like slow down bikers like bike lights, rumble strips and then the possible addition of like another lane for like joggers or pedestrians, and then I also got some form of enforcement and or ramifications for the like any possible, like I, guess, side effects of speed bumps getting added, because someone mentioned that, if you add speed bumps or the rumble stress, the bikers can just like avoid the strips all together and go right into the pedestrian lanes for the bullet.\nI would even narrow this down a little bit more because we're getting into what we think we can ask in order to give the community board's opinion on this change at the intersection.\nAdd the signage of yield to pedestrians at each intersection to let people know and Lee has pointed out that bike lights should be changed to bike traffic.\nI would suggest that we look into to look into adding an additional lane for joggers I know but flew as mentioned with 75 percent design, and that might change things, but I do think it needs to be studied.\nI, don't see it written down here, but I actually, Don't think we should do that because I know DOT is not going to do two things where one thing will suffice.\nOkay, So we really need to decide which we want to ask for I, prefer the traffic lights.\nThat's that should, If we do something like that, it should go to different agency, or maybe we should ask for coordination, but the design of the either the transportation or the park components.\nWe're gonna go right to the proposed change of signage, on attorney between Houston and Staten on alternate side, Parking Susan, who is here presenting I, believe the seventh precinct.\nOur proposal is to have the signs changed to alternate sides, and this would create additional parking on both sides of the street, because at the current moment, parking is only allowed for commercial vehicles.\nBut, if you just elaborate a little bit more I, just want to know how it best assists the seventh person and everybody in that area of attorney.\nThere shouldn't be any cars parked on that block unless it's a commercial, vehicle, Just I know this is part of a bigger presentation for later tonight, but.\nThis slide has I, guess some of the photos of the things going on Attorney street between Houston and Staten, and this looks pretty problematic.\nThe first I want to say the nature of the street has changed very much from commercial to residential and the garage actually uses the sidewalk.\nLike Susan was saying that this there were a couple of businesses, but now we're going back almost 10 years or maybe more on that block and those businesses have now turned residential, so they need I know the residents need additional parking and if I could also say right nearby there's the cul-de-sac, which is no parking and people are illegally using that also.\nThere are like three to maybe even four lanes of parking being used on this street now and so.\nSo people sometimes just leave the car anyway, and you know fight the bullet on that, but I mean like.\nThose of us who are dumb and don't know exactly what the regulations are Michelle, What alternate park side means is that once or twice a week, each side of the street will be no parking for purposes of cleaning.\nWhy putting alternate side of the street parking is going to change the situation unless they are monopolizing.\nYou know it's like what is the downside if it doesn't work, you still created more legal parking and you haven't made this situation any worse.\nAnd, like I, said as well as residents will have more parking spots because essentially, the commercial space is underutilized because there's no commercial vehicles on that block, it's mostly residential.\nThere they're not storing excess cars that are trying to park overnight or anything like that anywhere on attorney street or even I, believe near the cul-de-sac.\nSo, If they're taking up spots, which I'm sure they are it's for cars that are either awaiting repair or have been repaired and are waiting to be picked up by their owners, so they're not parking long, term, And I, think that's an important distinction and the suggestion to modify commercial parking to allow additional permitted parking will help both the neighborhood as well as Ludlow Garage, which the other misnomer is it's Ludlow, but it's actually on attorney street by allowing them to legally park a car that has been repaired or as a waiting repair until they can take it and fix you know and send it out to the until the owner comes and picks it up.\nIt is also not enforced same thing with the no parking area is not absorbed, observed or enforced, and then I know that this is not illegal, but there are pickup trucks filled with trash that are permanently parked by the garage owners which creates an unsightly appearance, and that leads to constant littering and illegal dumping.\nOne puts a parks, a boat in a New York, City Street, but unfortunately, everything was up to code, the registration, the insurance, the vehicle paperwork was everything was correct and there was no reason to issue the boat, a summons.\nYeah I just wanted to chime in to the detectives on the call to say that I do think that enforcement is a big issue.\nWe will continue working with sanitation on that, but also with the enforcement is, You know when you send pictures of those cars on the sidewalk.\nWe do I, did send it out to the committee yesterday to start taking a look at it, I, David, I, guess, I, don't know if I can make this motion, but I make a motion to enter this resolution.\nAnd I think they really do need to be part of this, hopefully to come up with a solution, but I really do want to hear from them as well.\nAnd I, don't know if they are fine losing commercial parking, they may need it as part of their as part of their business.\nIf the precinct is on I, don't think that a business that you know has vans that go out to their customers is allowed to store their vehicles in front of their business or near their business in a commercial zone.\nBecause I mean frankly, I, think everyone knows that I do not like adding parking anywhere, and if we have this, if we have increased enforcement, as the detectives have told us.\nI mean if you look at the resolution, it says number two in the first, whereas that the whole street on the west side is truck loading only and no parking.\nYou want to add that to the second number, two in the first, whereas that the north half of the west side is truck loading only in the south side, the south half is no we'd parking able to compromise instead of taking both.\nI know the detective said you couldn't see the loading zone or the excuse me that the truck loading only part so I was in the no parking part of the block.\nNo parking except Sunday is on the east side of the street, because you just had Ellen change it to say I mean when you change it to say the West side.\nWhat you wanted to put in the second one was that to try to make it clear where the truck loading was and where the no parking was on the west side, because it's not clear from the original resolution like what section is what okay, but is there a different regulation on the east side.\nYou know like your ups trucks, They don't leave it open and walk down the block, So the truck loading unloading might not be suitable for them, Basically, I, don't know exactly which to ask for.\nThe other one is you know your plumber, your electrician, who may need to be there for three hours for those I think we end up putting in meter parking for that.\nI did also want to add that you know once we receive the resolution.\nSo, you know up to the board and the committee, If you'd like to sell, out, sell it out exactly, but also, If you just lay out the means and the requests here, that's something that we can take a closer look at.\nMy understanding I mean unless we come up with another phrase which says you know other kinds of vehicles as well converted to signage that allows for truck loading and unloading.\nI think it should be a separate, whereas, Oh somebody can come up the language, because I can't like something, whereas the seventh precinct has done the extensive outreach to Blah repair shop and invited them to this meeting.\nComing back with a specific study on this, If you want, we've already talked to them about coming back to us with the plan for the city in three months, which they said they would do okay.\nYou help me with what you want to said sure, of course, and so just to clarify once the board submits, or you know, sends us the formal resolution that then triggers the evaluation for us to you.\nKnow, take a look at the possible change in the parking regulation, and what I'm seeing here is that there is the specific location and kind of like the requested needs that are spelled out and Jen. We will need to receive the formal resolution from the committee on the board.\nYou know our next agenda item for CitiBike infill last year, DOT embarked on our five-year phase, three CitiBike expansion alongside our partner Lyft, and this is going to double the size of the bike, share, system, service area and triple the number of available bikes.\nBut hello, everyone, my name is Caitlin toner I am a bike share planner at the New York City Department of transportation, and tonight I'm going to be presenting CitiBike expansion and infill.\nIf you look at the picture on the right, this is a design we call 3D bridging because it allows us to have one station beyond both the sidewalk and the road bed and so in more detail about our planning.\nYeah I wanted to ask for I'm always concerned when the bikes are on the sidewalk.\nNot that people didn't want it, but I really think that there needs to be outreach before these two natural locations.\nWe got the locations at the end, so I'm just going to repeat what David say and to take a look at that location because I'm not sure it's appropriate, but if you deem that it is that you really need to do some outreach to the two NYCHA buildings on that corner and Trevor and David, you can speak a little bit.\nI think it would have given a lot more feedback, But thank you Paul for letting me ask that question.\nIt's boards, one through eight, It's the system's busiest areas as well as portions of like downtown Brooklyn and north Brooklyn, which is essentially the you know, the initial areas where we launched the bike share program, but right now we're focusing in Phil on that, as David had mentioned, and as Katelyn mentioned during the presentation, It is an iterative process where we will be rolling out additional new infill stations over the next few years, but right now, This our plan is to kind of focus on the first kind of busiest sites, And I know this.\nI, think you know that we want to emphasize that we think this is going to be an iterative process, so we'll likely end up coming back in over the next couple of years, But we don't know what that will look.\nOnly, because we requested them, you know, like the street side, parking, the way that those operate is.\nI understand that you know that when you make presentations, you're thinking that you're coming to the community.\nYou know it may not always be that we are able to make that certain accommodations, but we have been I, think you know trying as much as possible to meet concerns and things like that.\nI do if I may just want to give a little bit of a response myself to you, know, DOT being accommodating and open to requests for station adjustments.\nDo think that you know we have been trying to accommodate a lot of these requests that have come to the board, but, as Lily said we'll, You know we're continuing to do that with our infill stations.\nSo, please, You know we're open to continuing to work with the board on finding the right, site.\nAnd I will tell you that many times people contacted me and said I, don't want a bike installation outside my front.\nI, don't know if we want to go ahead with a resolution tonight, just because of the amount of time we've already put into a lot of stuff.\nThat said, I do hope that this committee will pass a resolution next month to move the station on First Avenue between sixth and fifth street, on the east side to the road bed right now there are three vehicles parked there where 40 bike docks can be thanks.\nSecond, out of every light, leaving pedestrians to dodge traffic like Frogger characters and I applied to be on CB3, so that I could join this committee and work on these issues.\nWe're definitely not going to fix this problem tonight or in a day, but I think we need to think about things like a left turn only light cycle onto Lan Fountain Delancey from Essex.\nWhat I can say is that if there are specifics that we can look at signal, timing concern intersections, you know additional signage.\nThose are those little things that I could definitely share with my different groups of you know within DOT to take a look at them.\nI. Think that's why I'm not able to have all of them join me tonight to speak on behalf of you know this area, but I am glad to you.\nWe could definitely take a look at trying to think what else was that I can also mention loading zones.\nI would say that you know this is something that our agency is going to continue to look at and see.\nI would strongly suggest if there's an area that you want to take a look at, for you know putting in designated loading zone.\nWe want to focus on before we go to the next agenda, item, which is going to address what next month kind of looks like for us, As a committee give us some things that formulated out of that presentation, then David.\nI, don't know what people think I agree that it's an intractable problem without gigantic infrastructural infrastructure changes which we can joke about.\nDon't know what do people think about like things like those like big light up signs like even putting them in there's like some space in the median, the grassy median.\nSo, Michelle and Susan I understand your point of a hard-hitting resolution, but I also think that if we're able to ask Jennifer to go forward with a couple of bullets, a couple of bullet points, for example the enforcement, if she's able to coordinate with PD, you know in a week to get enforcement out, there, couldn't that, That's not what she does.\nThey particularly did not know when they were asked about the structures in the street that had to be 50, open.\nYou know they certainly need to hear from the community, but I think we don't want to have like just a session of people saying the same complaint over and over.\nHere, I think we should do it in presenter, mode, First of all, You can ask them to send the questions, preferably before the meeting, and then we can have them write down so that we don't have people saying the same thing over and over that's what CB2 did they had.\nI, don't know which order it was, but they broke it down into like different stakeholders of who asked the questions, and he said, I only got bits and pieces of it.\nYou know an open round table like what they have done is what you were just describing: Paul, I, think, If I, remember correctly, it was, they would start with the committee.\nI saw that they elevated people into the I, guess the presenter part when they needed to and then dropped them back into the regular level after that, which I think makes things easier.\nSubmitted, go ahead, Ellen, I think it might be easier if you had people sign up like some of the community boards.\nWhat you're, representing who you're representing, as well as the issue or question that you want to ask or submit, and then from that before the meeting you can gather up those and divide it up between the constituencies, various constituencies and similar issue areas right and collect them.\nThere is a coalition of community block associations and they didn't want to wait till January, so they actually had a meeting last night for me to address all of this enforcement and explaining you know what was going on to them.\nYou know it, but I think it's also important to make sure there.\nI, don't think Trevor's on the line anymore, but parks would not like go ahead.\nLike I say, you know, We can have people asking questions, but we also know that the questions ahead of time and I would actually ask the agencies, if you want them to give some presentation to start with to address as much as they can.\nCouncil is going to be voting on making this permanent, So we also want our council members to know what the problems are.\nIt would be interesting if, once we do get, Those questions submitted that we can aggregate information right if we discover that 80 of the complaints are of a specific certain issue, I think all the electives would be interested to know, because these are representative right of the people who live here, but also.\nThat's right with the holiday coming in a lot of people are going to be doing their own thing.\nI'll, send it over to you and if you want to make any changes or ask any specifics on there or just let me know, I'll, send it over to you."
        }
    }
}