{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB14",
            "channelId": "https://www.youtube.com/channel/UC_BAkpXTYFoKdHVRvswVgtg",
            "title": "Top chat replay",
            "publishDate": "2020-09-24",
            "shortDescription": "Brooklyn Community Board 14\\nEducation, Library \\u0026 Cultural Affairs/Transportation Committees\\nWednesday, September 23, 2020\\n6:30 PM",
            "lengthSeconds": "1:52:53"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB14",
            "normalizedName": "Brooklyn Community Board 14",
            "twitterName": "Brooklyn Community Board 14",
            "youtubeChannelName": "Brooklyn Community Board 14",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_BAkpXTYFoKdHVRvswVgtg",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "w0xJOhdeZCo",
            "fillerWordCount": {
                "uh": 330,
                "um": 382
            },
            "readTimeFullTranscript": "60 min read",
            "readTimeSummary": "8 min read",
            "wordCountFullTranscript": {
                "school": 64,
                "project": 44,
                "projects": 41,
                "bike": 37,
                "park": 36,
                "students": 32,
                "lane": 30,
                "schools": 27,
                "street": 22,
                "lanes": 22
            },
            "wordCountSummary": {
                "school": 17,
                "projects": 9,
                "project": 8,
                "learning": 8,
                "students": 6,
                "schools": 5,
                "streets": 5,
                "park": 5,
                "ventilation": 4,
                "student": 4
            },
            "fullTranscript": "I'm Stephen Cohen, I'm the co- chair of the Community Board 14, education, libraries and cultural Affairs committee, along with my co-, chair, Carl, Henry, Cesar and the transportation committee. We welcome you this evening to a packed agenda with a lot of interesting items and have joined the meeting so we're looking forward to getting started and hopefully answering a lot of questions. I think because there's four items on the agenda we'll get started without much further Ado. The first item is an update on school capital projects for the community board 14 districts, and for that we have Miss Yvette Knight from the school construction authority to update us Ms Knight. Can you please take it away absolutely so. Thank you for inviting me it's a pleasure to be here. As I mentioned it's my first time with community Board 14.. So it's a pleasure to be here. What I think I'll do is I'll just go down the list of your schools and let you know where we are with any capital projects. One thing I'd like for you all to keep in mind is the following. There are two things that most of our capital projects for the SCA is currently on hold. As we like to say: paused, our paused projects are constantly under review and Miss Kathleen mentioned Steve Lowett. He works with the SCA leadership team and they're constantly reviewing for projects. However, when we present projects for to be renewed, they have to be renewed through the mayor's office of OMB. So anything that is on hold slash pause is awaiting the approval from OMB. That's item number one anything that has restarted or immobilized we are still is it's very recent and because of all the safety protocols that we have had to put in place, we have very. There are no completion dates for these projects, and I know some of them have been ongoing for some time, but because of where we are with our situation and the pandemic, we have a lot of safety. Protocol is in place, which means that we can not yet give a completion date, and we probably won't be able to do that until we're about 90 through the project. So I'd like for you to keep those two things in mind. As I go through the list, so I do have a list of your schools and I'll just go through the list. As they have been presented to me at Edward Morrow, we had a there's a resume project that is on pause for a Su TV studio at Erasmus. There are no projects at K240. There is a exterior modification project. That's currently on hold paused at K199. There are no projects at K381- 197. There is also a exterior modification project that is currently paused and on hold. The athletic field at Midwood has been on pause, so I'm re- mobilized and restarted again. We will have to look at the schedule because that was recently restarted, so we do not have a completion date to that as yet, there's no project to K06 there is a project at 109. K109 is to replace a water heater and that has been restarted at K-134. There seemed to have been a lot of different projects that were under consideration and all of those projects are on hold or paused K-139 the same story, several projects that had been put on the table and nothing has been restarted at K152 315. There is a fire alarm project and that is currently also paused on hold K 193. There is a library project that has been restarted recently, K197 the exterior modification. There is paused as well k199 no project k217, the exterior modification. The ongoing exterior modification project has been restarted. We at this time do not have a completion date. K29249. There is an ac project that was recently restarted and I think that completes the list of schools. Yes, based on the information, I got that completes the list of schools. So let me know if you have any questions sure I guess Ms Knight for the ones that are on hold. Is there a general date by which there's targeting for starting things up again? Do we have any inclination for any of these? Sadly, no- and I think that I'm sure you appreciate the the budget crisis that we're facing in the city, and so, as I said, we present projects constantly to the mayor's Office of Umb and at this time the ones that I mentioned are the only ones along with some projects in some other communities where they have given us permission to restart. But to answer your question, no, I do not have a sense of when all the projects will restart. Okay, Steve Ann has your hand up go ahead and Hi Miss Knight. Thank you very much for your very concise listing. I just had a quick question about the fire alarm at K152 315.. So there are some facade and other things playground other that are re- mobilized, but the fire. What is the situation with the fire alarm and is that type of occurrence, given preference or priority? Thank you, as I mentioned, that project is paused and still on hold when I know that at this moment, projects that are given priority are projects that relate to air conditioning and anything where the ventilation system is compromised, and I am sure that you appreciate the decision around those elements of a school building. It's very well mentioned in the news about the importance of having proper ventilation for people returning to a school building. So at this time those projects are given the priority and as it relates to anything else, those projects were given priority along and a lot of those ac projects are managed by or what we call our mentor contractors. So I think there was a sense that we wanted to enable you know people who wanted to go back to work, especially our mentor contractors, to complete those projects, and it so happened that a lot of those ac projects were managed by our mentor contractors. So they restarted, but as it relates to other kinds of projects again constantly under review, and you know we meet with OMB, but we do have to wait for their approval. Steve Sean has her hand up go ahead. Sean thanks just to be clear on what it means in terms of the budget to put the projects on hold. Does that mean that there's just not the cash flow to keep them going at this time or are they being defunded? Is that funding being taken away for those projects indefinitely? I think it's number one, the cash flow okay, so the money will so those projects will be will move forward once the funding is identified at this time. That is the information I have and then one year where I'm sorry go ahead. No, you finished. Please yeah! I mean you know. We are in a situation with a city that they're considering all measures to manage through this situation. So at this time is the cash flow situation, and you know I do not know what it will mean a month from now. Okay, but for now, okay and then the other thing is with the ps217 project. Could you provide whether it's off the top of your head right now or as a follow- up what the original completion date was? I know it. I know it's being changed because it's being slowed down because of additional precautions, but when was it supposed to have been completed, would be helpful. I will have to get back to you on that. I do not have the original completion date with me right now. Thank you, Steve Florence, here the instructor lower your hand, go ahead. Florencia also there's some questions in the chat. So whenever board members have done asking questions, it looks like there's some community members. You have questions as well good evening. Miss Knight just wanted to know hi. Thank you for your information, the Psp 109 with the water heating system. Yes, it's necessary for them to have the hot water during the winter. That project is unpaused and it's ongoing. So oh, it's unbelievable! Yes, it's on! It's restarted. I think that's a better way to yes, it has restarted. Yes, okay, great yeah, okay, thank you. You're welcome. Are there any other board members with questions, as I can turn to Q&A? Okay, so emily Krell asks at 2:17? Is there a plan for remediating the playground and garden areas after the construction is finished? You know what I will say if the construction does impact and compromises the playground and the garden area. Yes, there's always a plan to remediate if it's damaged by the work. At this time. I am not clear as to what the exact plan is and when the completion date will be, but it's our general rule at the SCA. If we damage a play area for staging or if we use it for delivers or anything like that. Yes, the the contract calls for it to be remediated at the completion of the project, but I other than that. I am not aware of any other separate project that would take place to do that. Remediation. I will have to check and look into that great. Thank you. Megan Demarcus also submitted some questions about 139. I guess to start you had mentioned. There were some 139 projects and she just wanted to get some clarity as to what which projects those are because she was only aware of a play yard project. I there was yesterday there's a playground product that seemed to have been in the planning. I see something around a gym: the cafeteria, the library and some bathrooms. They were in various stages of implementation, whether it was like scoping them out whether they were moving towards design, but regardless of that stage of where they were everything, including any forward- moving construction is on hold. These projects never really got to the point where they were put out for contract. So construction did not begin on these, but even at the design or scope phase they have been put on hold and that's something to also consider the pause does not just affect projects that had been ongoing with the actual construction. A lot of the cause has also affected scoping and design of the work, so I that is true for these projects at 139.. So in terms of the design phase, is there any because it would seem like from a design perspective that? Could you know that would not involve like? Actually, you know actual. You know, manpower that sort of thing you know construction. Is there a possibility that the design phase can get restarted? For some of these? Even if you know the actual construction aspect has to get postponed or so a lot of our projects, we utilize outside consultants, and so that involves money and being part of the budget, and so because that is also part of on the issue with the budget and cash flow. Those projects we're not engaging outside consultants for the most part to complete any design or scoping so yeah, and I saw- and I just added a new question to the chat: are our new projects still being submitted, or at this point there were. I did see a few that came out. We called it the notice to proceed. Those are really just air conditioning projects and again for obvious reasons around the cities, and I think school communities concerns about ventilation. So any new project that has been approved, it's mainly air conditioning projects. Okay, that makes sense- and I forget, if you mentioned the the schoolyard that recently opened at 115,152 315 in Midwood high school. I know that opened. You know about two weeks ago, at least over labor Day right, so were there any other recent completions, including you know, air, conditioning and ventilation, because I know that's a that's a hot topic around the around schools these days right anything, it's really all that I mentioned around any projects that we started. Nothing at this time has been completed. Okay, thank you any other questions from any of the board members. Okay, I do not say anything. Thank you so much Ms knight. That was much appreciative. Much appreciated. We appreciate you answering all our questions and giving us that update quick heads up Steve, I do see it looked like Megan had a second question: okay, yeah! I was using my discretion to because I got you yeah. If you want me to ask it, Megan also asked: would pressure from politicians who funded the projects help advance a restart? I do not know if you have any, I think more funding from them. Would I do not think I you know. I can't see how it's going to hurt, but I can't answer definitively that it will make a difference. This will restart. So all right, thanks so much okay, you're welcome and before I handed off to Carl, to introduce our second speaker for this evening. I did want to mention something that Carl and I had discussed regarding the education, libraries and cultural Affairs Committee for this year, and- and this is in part because we know that education is such a big deal and in this pandemic atmosphere for the community, not to mention that libraries and cultural affairs are obviously impacted as well. But we did want to mention that the by the Community board, 14 bylaws, encourage participation of non- board members on topical committees and so non- board. Public members can be appointed to topical committees like ours, by the board chair in consultation with the co- chairs. So I did want to mention that for anyone any non- board member on the line who might be interested in joining the committee, we could. We certainly would appreciate it. But I will mention that the bylaws limited limit, the the non- board members to at most three and perhaps less than that. So there would not be that many spots. But you know, especially if there are any public school parents and we were 14 or folks who have interest in libraries or cultural affairs in the district. We certainly welcome you know if you want to. Let us know if you're interested Sean should, if folks are interested, should they email the board office. Should we put that in the chat? How do you want to what's the best way to address that John emailing the board office would be fine and then we'd be happy to pass them along to you and carl great, all right, that's it from me so with that Carl want to go ahead and get to topic two of the agenda. Yes, I do so thank you very much for that Steve and thank you very much for sharing that information. Yvette and thank you. Everyone else for all of your questions as well, and so for the second part of our meeting, the joint meeting with education, Library, cultural repairs and transportation. This part is an update on public school reopenings from Devonta Graham, who is a borough manager for community affairs at the DOE and so devonte. If I mispronounced your name, I apologize, but you know. If so let me know how to correctly pronounce it and then go right ahead. Please you said it correct it's devonte good evening. Thank you Sean for sending me the invite I'll start off by introducing my role. My role for this is my first time meeting with the Brooklyn community board 14.. My role to you guys will be on the bridge to the huge bureaucracy, the DOE. So if you have any questions around like a new school building, then you're a district or something like that, a new school open in your district you reach out to me. I may not have the answers, but I connect you with our office of district planning. They can help you out if you have a school, that's going through neat renovations and things like that, you'll reach out to me and I'll get you in contact with our office of facilities and things like that. So I'm not really mastering on any policy things like that, but I'm just your bridge, I'm the connector between you and the DOE with school reopening which I've been focused heavily on almost been tough starting way back in six months ago. Just getting the simple things: the devices to every student and things like that. That's been a pain for us and things like that, and we want to make sure every student is set up for success, but and taking an account like our students in shelter. Our students in temporary housing make sure you have the adequate internet access and things like that, and so that's been tough and not penalizing those students for not having that and having circumstances they can't control. So we're trying to take that into consideration. When we look at our attendance policy and things like that, coming up for school reopening, we know school started on Monday we've been getting mixed reviews some students that can't connect to internet, and things like that which we expected some students that do not have a device. So it's all different options and things that we've been going over students reaching out to their school on the school running out of their inventory of devices, just trying to figure out those little small issues that turn into big things over time. So with our attendance policy, we let schools use their flexibility, taking an account that some students may only have like a brother and sister in the house. They only can use one device at a time, so we want. We do not want to penalize the student that has to let his little brother use the device at that time, because he has a class so really emphasizing that to our teachers and our principals and our schools as a whole. The one thing that we're also looking at is our busing we're prioritizing our students with special needs that are farther out from school, we're prioritizing them. First, our business is going to be chaotic this first week or these first few weeks, because the bus drivers got to figure out the routes between, like the students that are doing, the blended learning and the students that's going to school every day and adjust their right accordingly, because we see it as the bus, the school, the bus riding is extension of the school day and making sure we're following the Social Justice Social Distance protocols and all that different items and also we're looking at the grading policy. We're not using our. It looks like there's a bit of a lag right now, so I can see you moving, but I do not hear any sound. Is anyone else experiencing the same thing? Yeah, it's Devante's signal. The connection must be slow, all right, so Devonta. If you can hear us heads up, we lost you about maybe 10 seconds ago, or so I think he may be reconnecting, let's see all right. So let me ping him in the chat and see if he's alright. If you stop your video that may help us hear you, let's see, if I can do that, did we lose Devante outright? No, I see his. I see his video now yeah he's still moving. Okay. I do not think he hears us. We can't hear him all right. So then, let me try pigging him in the chat. Let's see, if that's anything now he's gone, oh no, there he is his video's off all right. So what part did you guys had to experience? We lost you, we lost you as a grading policy. You were talking about the championship policy, okay, so with grading policy. Here we're not using our traditional platform where we use a through f as a grading meter, we're going towards things like meeting goals, approaching goals and things like that. We do not feel like. We should penalize the student just because slow internet access and things like that. We just want to give students a chance to succeed in this environment. It's all new to us and new to the teachers as well. So we just want to take that into consideration where we're creating our students and things like that. As far as Covid-19 testing, we have a strict protocol, we're going to have students test, we're going to do a temperature test for every student that walks into their classroom, we're going to do lunch at the student's desk and things like that so we'll. If the student tests positive, we'll shut down the school, we'll shut down part of the school coming to do an extensive cleaning for that school and the parents will be notified and given the option do they Wanna? How do they Wanna move forward with their student? Do they Wanna take their child out of that and go to a blended learning cycle, we're giving the parents the options to choose if we, if they have a positive test at the school, whether that's by a teacher or a student or one of their fellow classmates, so I'll pause right there and I'll just take questions? If you guys have questions on that, and we can move forward like that, I do not see anything so sure so Devonta. Thank you very much for that and then yeah so attendees. If you have any questions, do not hesitate to raise your hand and then, if people do not mind, I have a question that I can kick things off with. I see. Ann has a question in the chat. Okay, awesome. So then Devonta. Thank you very much for sharing all that information, and so the first question I have regarding the the Kova testing, and so, as you may be aware, there were some articles and local papers regarding some teachers who had concerns in Ps139 regarding the Kova testing and the DOE protocol with that, and so my question for you is, have you seen any guidance from you know your superiors regarding whether or not the testing protocol for what happened that Ts 139 has been updated and if so, what that updated protocol will look like? Yes, I've heard about it. I have not like really getting much information on it, but our protocols. I know some of my colleagues was following up on that positive test from a teacher. So I think our protocol is still the same. We'll keep the teacher out, but it's also taking consideration how the teachers feel. I know teachers were not given a much pretty much any options besides come back and have to teach in person. Schools like that, so that's the whole thing around the union and how their looking at the situation and things like that. But it's not too much. I can speak on in terms of our protocol about that, but it will keep the teacher out for two weeks. You know I think they'll have a private meeting with her to see how she wants to proceed, but she want to do a turn into a virtual learning or return to the school as an in- person instructor. Okay, thank you and then, as a follow- up question, for that is there? Is there a link either on the DOE or somewhere else? Where you know parents can get information on. You know the latest up- to- date. Information regarding you know: DOE guidance on code testing for their kids and teachers, because stuff is changing so much. Oh definitely, things are changing from day to day. But yes, I can send you guys. The latest that we have in terms of Covid-19 testing protocol- I can send that right after I get off this meeting, I'll, send it to Sean, and maybe she can afford it to the group. Carl Steve has his hand up. What's up so there were. There have been news reports that there are areas in the city and in Brooklyn, where we're at like a three percent infection rate, and I believe I've heard that if the city- wide rate were to hit three percent, schools would close. Is that right and are there plans for how it works in terms of a certain threshold in certain areas that schools in those specific areas that have higher infection rates would close temporarily? Can you just give an overview of that yeah? I'm not sure if there's a threshold that you can meet to shut the entire school down, I'm not familiar with that policy, but there are different protocols that we're taking into account. If we see a like a spike in testing or students, that's testing positive. That's in person we'll ask, like some students go to a blended learning thing, a blended learner or we'll cycle. The days like some students come on Monday, some come on Wednesday and some come on Friday and things like that. We'll try to like stack the schedules for the students, but I'm not sure if there's a any percentage or threshold that needs to hit to shut the entire school down. I'm not familiar with that, but I can look back into our protocols and I'll afford all the information to you guys, but I'm not familiar with a three percent threshold. This is Joel Siegel. I I'm sorry. I do not see a button for raising my hand, but as a parent of a high school student, you know we get. We got bombarded with emails like literally every day and if you're in middle school or high school, you know you have some way of monitoring your kid and a pupil path is one of the ways and you get millions of emails. That way but including, I believe, it's today or yesterday. There was a letter from the chancellor about protocols for testing, but we were told, and again it's been a series of moving targets and somewhat understandably, because it's a you know, it's an unprecedented situation, but we were told toward the end of the summer that if two people from a school tested positive- and they were not in the same class that the entire school would get closed down and for at least two weeks that was, that was the last protocol that we were told and then someone you might not find difficult to leave. My wife and I were opinion. You know it's never going to work for always close down yeah. I would think all the schools will get closed down, but I'm not I'm not familiar with it. If two students test sponsors they're not in the same class, though two people could be a teacher could be two people, I'm not sure about that protocol. But I can double check and I'll send also send that information, but I'm not sure about the two people, because that seems like a relatively low number, even though not taking this thing for granted or anything like that, but it's just two people I mean I do not I'm not sure if they'll take two people but I'll check back and see, and also teachers with some kind of proclivities or weakness to the virus that they they're excused from having to do in school. So yeah and I think Ann has a question yeah. I actually buzzed it in through the chat, but I was curious. You mentioned that the students are having lunch at their desks, so I'm guessing. That means that the teachers are the ones who are moving. Is that thank you, yeah in terms of what you mean by moving as in Describe moving. You said: the teams are the one. That's moving in terms of changing classrooms. Are students going from room to room in the school? Okay, no yeah teachers are the ones. That's moving, not the students just to keep the traffic low in the hallways, and things like that. The teachers are readjusting their schedules to come and bring their resources into the different classrooms, letting students stay in one place. Things like that and so devonte follow- up question would that be so: that's the same, acrosss all the great bands, so whether it's elementary middle or high school, it is the teacher who is doing the movement and then the students are staying in their respective class. I'm not sure if that's true acrosss, the Middle School and the high school level, but I know it's much more prevalent in elementary schools and things like that. So I do not know if the high school students are doing that or the middle schools are doing. That, I definitely know is the elementary schools are most likely doing it all right. Thank you and I think Mandzura has a question. Mandarin. Did you repeat that question I heard tested how many students is being tested till now and what is the ratio like positive or negative? I do not have that all that data at my disposal right now, but I know it's every student that walks in the door every day they're getting a temperature check and things like that. It's going to be a waiver that parents get to give consent to their students to actually get tested. It's going to be a rare way how that if a parent does not consent, how that's going to work? That's going through legal! We have may have a parent that does not want their child to get tested, and things like that, so that got to go through legal. Does that child have to go through a blended learning cycle just because his parent does not want to consent to that student being tested. That's the thing we're going to figure out in these next couple of weeks once we run that through legal, but that's next in the pipeline to make sure every student gets tested, but for right now we're just doing like a simple temperature check, and let's do this go by so then follow- up question based on that, and you know you may or may not have the answer for that. Is there any reason why legal would be figuring this out now? After you know the first two days of in- person, learning has begun as opposed to you know, maybe two or three or a couple weeks before the hybrid learning and the in- person learning started yeah. That's a question way above my pay grade, but I would I would say this should have been figured out way before even before two or three weeks ago. This should have been something we had planned at summer school. We had students going in for summer school, but yeah, that's just what's coming down from the higher ups to me. They will send a consent form for a home for parents to sign to have their children tested at the school, and some parents do not agree to that. We're going through legal and see how that plays out, but yeah. I definitely agree. This should have been handled way before this gotcha and then do you know, and that waiver form that you're talking about when it is sent out. Do you know if it will just be sent out in English and is it going to be physically mailed or would it be sent you know? According to you know whatever language, I guess the DOE has on file for that family right like the deal he has those nine languages and so yeah. If some record shows the family is you know Bengali or you know urdu or french, it would go out or is it all just going to be in English no it'll go down to their native language. That's what we're hoping that's! What we're working on with our interpretations teams, and things like that, so we definitely do not want to say anything in all English. We do not think that's culturally responsive to do, and not just reckless on our part in lazy on our part as well. There's an attendee tazine who says they're a cec member and can shed light on some of these questions. Should I open up the microphone? Yes, please? Yes, please, no problem you're on hi everyone! Thank you. This is Tizin Azad. I am a C cec district 22 member, and this is a very important topic for all of us and, as you have all these unanswered questions, so do a lot of parents, especially parents who are digitally disconnected or parents who are english language learners so based. Definitely, these are questions that are you're raising as far as the sort of protocols that will be taken by the students or any sort of individual walking into the building, there will be a random temperature check. This is not. This is not on every. Not everyone will be able to get it or there will be a bunch. There will be a select few that will be doing that and it will be administered by sort of the school security agents, and this is where we hear the latest. Prior to this, we were told that this might be done by school personnel, teachers or staff, and before that we heard that it was done by would be done by nurses, but it has been changing and it might very well change, come school opening in person and the testing how many students will be randomly tested for Covid-19. It depends on the size of the school. If it's something if the school is below 500, I believe that it will be a 10 of the student body of the population of the school and above that, will be 15, and that will also be a random testing. It won't be, it could be. Someone might be tested twice, someone might be tested more than once, but we have to understand that nothing is really randomized if a child or if a school personnel walks in with some sort of a sniffle, we would imagine that they would be one of the fews that might get tested. So even that is something that we have to iron out. We do not really know what that randomized testing might look like, and then we have something called the isolation room. If somebody does present covet- like symptoms, I want to stress that this is covet- like symptoms, not that they will. There will be tested positively for it pr prior to be isolated and from the latest guidance we hear from the oe. It might be that the rule, the isolation room, which is problematic as it is sounding we know that might hold more than one individual that might be covered symptom presenting. So it might very well be someone with Covid-19 and someone without, but they will be sort of housed together, and this has just directly because of lack of personnel, lack of teaching staff school staff because of the budget cut, that's there and so they're trying to look for ways to sort of mitigate this, these type of issues arising in school. I do not. I can't recall the other questions you have raised. If there's something I'm missing, please feel free, no thousand. That was that was very helpful right because you gave us some more insight into what Devonta mentioned. Regarding what testing protocol could look like at the schools, and then we also shed some insight into the forthcoming communication. You know, especially for parents who are either you know who themselves or their children are english language learners. So that was very helpful as well too. Florencia had her hand up, but now it's down warranty, you're, good. Okay, let's see, do you see anyone else who has any other questions either for you know Devante or tazin thousand? How do I pronounce your name again? I apologize yeah, I muted her hold on go ahead. Okay, it's tazine yeah! So how do I pronounce your name again? Is it a tasen or tazen? I apologize it's tazine like yes, that's good! Thank you! Hey no problem! Thank you. Yes, I was just asking the group. If there were any questions for you, tazine or devonte Carl looks like it looks like you got it Michelle and a little schooler. That's also special needs student. I've heard about the protocols in the schools, but what exactly are the protocols for the buses? My child is bust, but I have not heard anything about the responsibilities of the bus owners and maintaining a safe environment for the children getting them to school. Some of the special needs children are on the bus for two hours at a time or more. So what the bus driver is supposed to do is make sure the students are properly distanced with that six weeks. Distance and also the windows are supposed to be down for circulation and it's not the bus. So that's the protocols we have for bus drivers to ensure that, because we feel like riding the school bus is extension of the school day, so the same health and safety and social distant protocols should stay that way, but I'm also talking about the cleanliness of the buses. I mean what protocol call are they given for that as well, because they're not only just picking up dropping off? Sometimes they use the buses for other things during the day, so yeah the buses from what I understand are supposed to be clean. Before and after each student is picked up and dropped off to their respective schools, and it's supposed to go through extensive, deep cleaning that, after that, and also so it's supposed to be clean after they drop them off in the morning and before they get picked up in the afternoon and once they drop them off for the afternoon, I'm supposed to be clean after that, as well for the next day, they're not doing temperature checks as well. I'm not sure if the bus drivers are doing temperature checks, but I can check and see. Thank you Carl. I do not see anything else. Okay, no problems, yeah, okay! So then, if there are no other questions for cezine or Devonte, then thank you both very much for oops wait. Did someone have something I was just going to mention. I did see a message that someone from the Collin wanted to speak. It looks like Elizabeth, Dennis and Megan Demarcus Elizabeth is unmuted. Oh, I was just saying that there's no way for us to talk in the chat and we do not see a lot of the stuff in the Chat fyi and that I guess if we want to have a question or to speak, we should just raise our hand or put it in the Q&A. Is that correct in the Q&A I'm watching that okay cool just wanted to check but yeah, just to mention that we can't participate in the chat itself and also that we can't necessarily see everything in the chat. So thank you. I also see Emily Krell has a question emily go ahead. Oh I'm! Okay! I do not. I did not mean to raise my hand if I did raise my hand. Sorry about that. No word and Megan Demarcus posted in the Q&A megan, is that a call- in is that a telephone yeah? Yes, is this megan now I think I think those questions megan submitted were already asked unless she added additional ones in the last few minutes. There's one calling user I've unmuted. I do not know if that's megan, it's not okay! So then, in that case, the only thing I have is shown from the conversation that we've been having so far with Devontan. You know with some further insight from tazine. Does it sound like there are any? You know next steps that either Cb 14 needs to follow, or we definitely need to. You know hear back from the borough community Affairs Office. Yes, I would. I was in the invite out. We have a meeting every Friday, where we do this community roundtable. Where we talk about school, reopenings and a different question that comes up it's a very insightful conversation. I will send that invite out to Sean and I'll put you guys on my email list serve so anytime. I send anything out that information to get to you guys as well. You can follow with me if you have any questions or anything that comes up DOE related. You can reach out to me and we can get those things ready for you guys great and then carl yes, I mean I would take Mike you from the committee. If there's anything, you want me to follow up on other than what's been said in terms of information, that's not at hand right now, but also Devonte. I will add you to our our district service cabinet list that meets every other month, so we could get ongoing updates that way as well, and did I already say this: the link that you'll provide to your Friday Friday updates. We can put that on our website, so the public has access to that as well. Okay, thank you and I guess Davonte since there were some things that you said: you'd get back to Sean or us about you know. Hopefully, you've been keeping track. We do have our general board meeting coming up in a few weeks. So, to the extent you have you can get back to us on anything, and you know we could conceivably provide an update to the board. When you know we, we provide an update from the education library and Cultural Affairs Committee at that time. Okay sounds good. Thank you. So then, with the co- chairs like to move to the next section of the agenda, are we there? I think I think our plan was transportation would handle going forward. Do I think Devante still might be the person who's dealing with the next issue as well, so joel, if you wanted to take over we're skipping item. Three, no item: three is yours: the schools, the outdoor distancing? Yes, that's why this meeting's joint, because it's about street schools using oh okay. So do we have a speaker on this? I think is maybe prepared to help answer that and I can jump in with with schools in our district. What was the question because I reached out to our office of district planning? They have not got back with me yet on this topic so, but I can listen and take notes and I'll. Have our team follow up with you guys, but I'm happy to listen and take notes and things like that and Joel. We might just kick it back to Steve for a minute, because this was really raised by board members who had who were curious about the policy in the process regarding street openings, for schools to use either for instruction or for play just to increase their own social distancing capacity. Did I do that? Okay, yeah? I mean, I think what so what had happened at some point in the summer was there was there was you know some public statements, so there was a community board in Manhattan that actually, I think, adopted a resolution encouraging the schools in their Community board district to open up for open up their streets. So that's how that this kind of came on our agenda. What happened in the interim was, I think, basically, the mayor invited schools to. Basically, I guess you know- go through their own process to apply for this. You know if they wanted to use the streets around them and apparently there have been a lot of applications. I saw there was a news item last week. I do not know about in our district, but I'm city- wide there were. There were a lot there. I do not know. If there were that many that have been approved. I think the number was something like 20, although some of them might still be working through yeah go ahead, sean yeah, so the process is that the schools are applying through through the mayor's office and DOT, and then that's being shared with the street activity permit office and there's no approval process for community boards. Only for the precinct- and I have asked that the Department of education at least give us notification, because you know we have other applications for street usage, and so even if we're not being asked to weigh in on the school street closings, you know we might want to make sure that we are aware of the effects on traffic patterns or other applications we may have. So I have not heard back from DOE or the mayor's office on whether or not they can include us in some part of the process. But I do know in this district there are only two schools that even applied and one of them withdrew its application. Oh and I can't remember one ps1 34 on 18Th avenue and they wanted to close the back street of the school which is Webster between either Ocean Parkway and Seton or yeah between Ocean Parkway and Seton. They withdrew that because of some other conflicts that they would have to deal with, and then the school that I believe did get approved for a street closure is yeshiva of Flatbush on east and I think they're closing east 1:6 between J, and I, if I remember correctly so that's what I know and because we're not in the process in terms of getting it directly from the schools of the mayor's office. I spoke to sergeant rios at the seven. Oh precinct he's the admin officer, so he said he'd give me a heads up. If another one does apply right, I mean. Is there? Is there any real role for the board to play here like if, if there are parents who think like, I can think of certain schools in the area that you know there's like dead end streets nearby? So I do not know if this is all based on school principles or administrators. Deciding whether to apply or not- or you know, if there's more of a if there's any sort of role for the community here to get the process rolling, you know really was because of the of the community board in Manhattan taking action, and you know I'd heard from a lot of parents over the summer who you know wanted to promote outdoor learning and that sort of thing. I guess I know Devante, you said you were you were getting. You were getting more information on this. Do you do you know anything about outdoor learning and what and what schools have done around the city or are doing regarding utilizing streets at this point? I'm not familiar, but I know in our meetings a community advocate had advocated for outdoor learning and things like that, just a new creative way, the social distance and also keep the students engaged, but I do not know if that's actually taking place, but I can check in and see and I'm not familiar with the streets and things like that, but I definitely can check with the Office of District planning and get more answers, and things like that. I do know that in Manhattan I know Daniel goes to Laguardia and they were making summer arrangements to do outdoor stuff at Lincoln Center, and I have not gotten anything that that's a done deal yet and but I know they were doing that not closing streets but doing some outdoor stuff because they have so much performing arts people. You know who have not been able to do that, but I mean frankly, how long are you going to do outdoor learning? I mean the season already changed. You know all of a sudden. It got cool, you know, so I do not. I really do not think this is a viable thing. In the long run I see, Emily Crowl has her hand up unmuted go ahead, emily, okay, thank you. This time I did mean to raise my hand yeah. I can just chime in quickly on the situation at ps217. You know we're a school that is in an area, as you guys all well know, with very little open space and our playground and our track area and our garden have all been pretty much kind of decimated and made mostly unusable by the construction. So we actually did go to our principal and kind of kind of you know try to suss out whether he was interested in going through this process, and I think, from his point of view like they do not. They are scraping together just to have enough teachers to do like at you know, teaching within the school, and I think the idea of having to provide additional staff to manage something like outdoor learning was just right, like understandably so, going to put him over the edge. So I think for us we are going to be looking to like other. You know, non- profit organizations in the area like Fdc or you know just to think creatively about. Is there any way to partner on extending like play streets, or you know, finding some outdoor space because I do think like even when it gets cooler, kids need to go outside and kids need space to do that. So I know at the very least, over the summer the new kirk was closed off to traffic, at least at certain times. So I do not know if they've continued to do that, but you know, presumably, if there's the safe streets going on in that area, that would that would be good along those lines, especially if that's something that Fdc could take advantage of anyone else. I know Greg Alvarez had asked about this topic before, but I do not know if greg had any questions, no, nothing else. At this time. I was just curious to find out if there were any specific initiatives, but it sounds like it really has not been taken advantage of yet. So I think answered my question great all right. So I guess you know devante. If you want to add this to your list of items to report back- and you know, I guess it's something for us to monitor- and you know, certainly if there are schools and in the in the area that want to take advantage of it, I think you know that that's something that would be. That would be good given the circumstances, but it sounds like at the moment. There are not that many that have availed themselves all right. So with that yeah go ahead, may I jump in I'm sorry to just do it that way, but just to put it out there I mean, I think that it would be most appropriate at this point, given the many unknowns like not knowing the extent to which it places additional onus on a principal and school leadership that we would just offer to be helpful on a case- by- case basis, whether that's helping a school, that's trying to achieve outdoor learning or play space expansion and helping them navigate, you know, or working with the precinct or navigating other things that are going on in the area or if it's helping a parent group try to suss out. You know how they can support their either their school principal and leadership or work with a community- based organization. Maybe joins those connections together. You know we'll try to be there to build those bridges for them. You know upon request, excellent and anya. Just let me know that there's some questions in the chat in the Youtube chat, so I'm just looking at that real, quick, okay yeah. I do not think there's. I think someone else raised the concern that Joel had about the weather changing and that it would be difficult to do outdoor learning with with winter around the corner. There's another there's another Attendee Joe Fraim hi good evening: everyone, I'm a parent of 139 and in regard to the project and outdoor learning, the yard space that we wanted to get fixed. There is a large dip in that yard that would impact outdoor learning when it rains or when the weather is bad or it collects over a couple of days. So could that be a position where they could consider pushing forward the construction project to fix the yard, so we can achieve outdoor learning or you know, for our students, hi steven with the SCA. That is, is something that yes, if a principal wants to raise that as a reason for restarting the project that that's fine. I do want to set some expectation. However, that project was just in design. It was not even at a point where it was going out for a contractor, so you know I I'd say yes if they do want to use that as a reason. That would be fine to send an email and you can send that email to me. My email address is Y K N, I g H, t at n, Y, Nycsca.Org and I'll escalate it. So that's definitely helpful because we have been sending emails. We've been meeting with SCA members, we've been trying to push the project forward to get it in that design phase and we've been put on hold yeah and, as I mentioned before, I do not know if you've heard my presentation, you know so many things are paused budgetary reasons, but you know there are things like as it relates to social distancing and, as I mentioned ventilation, and I send that email and I will escalate it and we'll see we'll see how that unfolds so yeah. Thank you, appreciation emily and Joe Frank. Can you please lower your hand? Are there any other questions? Anyone else? I do not see anything else. Okay. So if that's the case, hang on one second emily do you have another question? I really do not I'm so sorry, I'm literally trying to find how to lower my hand right now. I apologize it's okay challenging for me too. Do not worry. I think I think we can turn to item four on the agenda so joel. If you Wanna take over and talk to us about Parkside Bike Lane. I guess thank you before you do that it's event with the sva. I think, if there's nothing else for the SCA, I am going to sign off. So I do have two follow- up items. I look forward to any emails that you may have for me and we will see you the next time. Thank you very much. Okay, thank you! Bye- bye! So Diana are you with us Diana Storiano hi. How are you doing? Nothing need me. What's that I hope you guys hear me and see me no scene, please there. You are okay, I'll, take the hearing. It says my connection is poor, but we will just go with the flow. I guess yeah. We may not be able to see you, but we can hear you it's better. We can hear great. So I'm not sure if everyone knows me, but I like to introduce myself. My name is Diana Soriano, I'm the community liaison for D.O.T. I just joined CB14. I want to say about two weeks ago sean right about that time, so yeah about then so looking forward to working with everyone and hearing everyone, everyone's feedback and just a minor. Thank you to anya, because I was having some trouble and she helped me to be on now. I would like to introduce my two colleagues Preston Johnson and Sean Diaz, who are on the call and will guide you through their presentation all right, so I'm going to hand it over to Preston Johnson. Can you hear me? Yes? Okay, do you want to? Am I able to share my screen? Yes, I just need you the presenter, so you should be able to okay great, so my name is Preston Johnson, I'm the project manager for at New, York, City Department of transportation in the bicycle unit, and this proposal is a project I'll be supervising the installation of, and I just want to take you through some of our ideas and would love to hear any feedback suggestions and anything else you have so the project location is on parkside between Park Circle and Ocean Avenue. So there are entrances to the park at either end of the of the project and then also a pedestrian entrance sort of in the middle. In between that Preston did you share? Oh no, am I are you not seeing this correct? Yes, we are not seeing it okay, my apologies. Let me see what I have to do along the bottom. You should see a share button. Ah, okay, there we there we go okay, excellent, sorry about that, so you've eliminated cars. It's just well, not exactly right. Let me just try to figure out how to do the full screen. Okay, so these are the extents of the project from Park Circle to ocean Avenue. As I said before, and just to give a little explanation of the current conditions. There is typically one moving lane and wide parking lanes in each direction. There there's a difference at Park circle where there are two lanes in each direction and no parking and then at Ocean Avenue, it's different. While there is parking, there's one lane in each direction and left turn lanes, so there's really no dedicated space for biking. In that condition, though, those wide parking lanes are often used for biking but, as I was describing they end before you are able to and traverse the entire length of the corridor and so there's as a result, there's kind of moderate bike volumes on the corridor and looking at the safety of the corridor for kind of what appears to be a mostly quiet street. It has it's in the top third of crashes, a lot of those are coming from Ocean Avenue, which of course, is a pretty complex intersection, but there are also a lot of crashes around parade place. We also see a lot of rear, end crashes and you know which might indicate like there's kind of like sudden stopping or you know just maybe some reckless behavior people kind of speeding faster than the conditions permit, and we hope that some that our project can address some of those issues. So I want to talk about a couple inspirations that the project comes from, one of which is this idea of the utilizing the border of the park as an opportunity to provide enhanced Bison bicycle facilities. The most I think, well- known example of that is Prospect Park West. I think if you people with experience on Prospect Park West, see that having a bicycle lane, there works differently than the bicycle lane within the park. It serves more of a transportation and community neighborhood purposes for utilitarian cycling, rather than the sort of necessary well, not necessarily but recreational purposes that are pretty common within the park and then the fact that the Prospect Park West Bike Lane, is two ways kind of facilitates that type of use it's pretty inconvenient. For me trying to get from. You know the south side of the parade grounds kind of going to park slope because there is no. You can't travel that way within the park. You kind of have to take the long way around beyond Prospect Park West, there's also Flatbush avenue, where a prospect are where a protected bike lane was installed this year and then Ocean Avenue. There is a bike lane that's in development, and so this would kind of complement those and create kind of a new transportation network of safe, comfortable cycling streets. Another inspiration for the project. What was the open streets? We saw the open streets as very successful in some respects where a lot of people were out there biking and walking and able to socially distance themselves, but at the same time you know, I think there was the need to kind of balance the the mobility that that was sacrificed with motor vehicles that were not able to kind of use parkside as a cut through, and I think what this project can do is kind of take some of the best of those two ideas creating safe, comfortable places for people walking and biking. While at the same time maintaining that mobility for people in cars and so as a result from some of those installations, we have these goals. We want to improve the pedestrian safety that comes in a couple, different ways that I'll explain, shortening crossing distances and adding daylighting, which means kind of clearing out cars a little bit to improve the visibility between people, walking and people in cars. We want to extend that safe, comfortable bike route around the park, as I was describing and then at the same time, we want to make sure that people in cars and motor vehicles are able to continue to have that same ability, but at the same time we want to address those crashes and try to lower those crashes that we're seeing and so protected. Bike lanes are one of the best tools that we have and in our toolkit, as far as providing some of these street safety measures and it the those benefits, really accrue to all the street users. It's not just people and bikes. So what you see from the slide is a 15 drop in all crashes, with injuries and a 21 drop in pedestrian injuries, and these are we've been doing these types of bike, Lanes Street redesigns for over a decade, and so this data is New York, City data that we've seen in, I think all five burgers. So the typical condition of what we're seeing. Oh, my that is not Prospect, Park West. I do not know what happened to my photograph, but the photograph is supposed to be showing Prospect, Park West and I think you're familiar with the street well enough. But looking at the sections, what you can see is currently, as I describe the street you've, got the parking lanes in each direction: travel lanes and they're separated by the painted four foot buffer, and so what happens instead of that is that buffer goes away and the parking lanes are narrowed and that extra space is used to create a two- way bike lane alongside the park and the parking lane is moved away from the curb just like on Prospect Park West to to create protection between the moving vehicles and people on bicycles. And so you can see that kind of beige area. That's representing a a pedestrian island that would be located at the intersections at parade place and at St Paul's. So what that does is kind of provides an opportunity for people crossing parkside from the park to shorten that crossing distance, which we, which we observe to improve safety for pedestrians at at Park Circle. It is a different condition. So what you see here is a kind of a this is a progress drawing, but what we have currently are two lanes in each direction that stays but that concrete, Island, the narrow, concrete island. That's there. We would remove that and kind of redesign that the larger concrete island as well and then create kind of a barrier protected two- way bike lane, as it approaches a park circle to see kind of a different perspective. Of that the top drawing is the existing drawing with the two travel lanes in each direction and the island and then below. That kind of gives you an idea of maintaining the two travel lanes, but taking the extra space and using it to have bikes, go at the other end of the corridor. This is also draft drying, not exactly sure how long the we'll have to do computer models to model the traffic to determine exactly how long this turn lane needs to be that matters, because it kind of depends what the the amount of parking that will be converted in the project right now, this it's being shown as very long, so. Consequently, it's it we're proposing that this might take this in this drawing. I think what you're seeing is maybe 15 spaces, but we will do the model computer model modeling to see if that's, if that's necessary or if that can be shortened. But what you can see is all of the traffic capacity of the intersection is retained, but the bike lane is added and it feeds into the park and when the new bike lane on Ocean Avenue is eventually built, it'll also feed into that as well, and also to give you kind of a sectional first, oh boy, I'm sorry, my my after section is incorrect. Had some last minute changes and things went crazy, I guess- and so, but as you can see on the in the photograph, it will be sort of similar to that where you have the the bike lane running alongside the moving lane, with a buffer in between and so for, the parking impact of the project over by Park circle there's very little impact of the project on parking at the intersections at St Paul's and parade those pedestrian islands that I was describing in the daylighting to create more visibility for pedestrians that takes away a little bit of parking and then down by ocean. That's the largest hit which, as I was saying, we're still trying to determine what that final total will be so just to kind of wrap it up. I want to just say that this is a project that we're you know we're hoping to kind of build on the open streets idea and the also the progress that's been made on Prospect park, West and Flatbush, Avenue and yeah. I would love to love to hear what you have to say. I just have one question, and that is you have the budget to do this now I mean because we just heard from a lot of education. People who are saying all sorts of things are on hold. Is you have the budget to go forward? Well, you want to feel that, yes, we do have funding in the budget for this, so this is sean Macias, hello, deputy director of the bike unit. Yes, so we've been funded through the next fifth school year you know after then I think there'll be a reassessment, but there is current funding for this project. Okay. So when do you anticipate this happening so we'd like to work on it over the winter, the design that is and then we'd be looking to implement this sometime in early summer. Okay, does anybody have any questions? Yeah, Nina, Nina's? First, okay, go ahead, hi, so I have a question. I'm one of these people who bike commutes from the south end like actually not so far from where the Cbr14 office actually is. I pick up what is it argyle going to the park and currently I either have to go through and then kind of negotiate my bike down the curb or bicycle a sort of backward around to the circle. You know there's kind of once you once you get in there, there's not a really good way to get through the parade grounds going. What would it be north, South so and the area by the police station that area a nightmare? It's not only very packed and very congested because you have bike riders and joggers and everything, but also because the the surface there it floods and it's just and it there's big potholes and it's not a great situation. So my question is either: can there be a like a cutout made so that when you come through from say, argyle or Rugby that you can go straight through and then get off the curb without having to kind of stop? You know those of us who are not. You know comfortable just jumping the curb you know so that they're, you know so that it's the bike can just go slide right through into the bike lane or do a direction change on now. I do not remember the name of the street because currently you would be going the wrong way on a one- way street trying to get out to get to the you know to Parkside. Do you understand what I'm saying it's really hard without being able to say, draw a map, but Nina? Are you saying when you come down to argyle you hit Kayton and you're at the parade ground right? You hit Kate you're at the round now, but I do not recommend that anyone bicycle on Caton, because it's a death trap, it's narrow and there are gigantic trucks, ridiculously large trucks. On that as a map fact- and it's pretty scary, so I mean I go acrosss because Argyle goes actually right into the parade ground right. The bicycle through and you've got the you know those ballpark things on and soccer fields on either side. But then you either have to turn and go through, make a left hand turn and then a right to get to the circle or you know before you've got one- way streets the other way or if you go all the way through, then there's a sidewalk, but there's really no way out. I mean you have to then get between cars and wiggle your bike over the curb and down onto park slides to cycle. So my question is: can there be a cut out so that people can go straight through with their bicycles and get in to you know access the bike lane? Well the bike just so. The bike lane they're talking about is going to be on the on the on the park side, so you would have to cross. You have to cross parks, but you're still leaving us stranded on the other side. That's what's happening as soon as we're still or we have to go around where the police station is and that place needs some serious work. Yeah. I think one of my colleagues, Hayes Lord, had a lot of conversations with. You know community Board 14 about the routing and with also the parks Department, and I think they also have concerns about biking with the per inside the parade grounds, and so we can look into those types of changes, but we also have to defer to the Parks Department as far as their witches. Well, there's, no once you're on, if you're on argyle heading toward the park, where you're supposed to go, you have to go into the parade. Well, the timing, I mean, I also agree. I biking on Caton Avenue is not advisable, but the timing. If you get that green light at argyle, you should be on. Hopefully you can make it to the biking area by the parking lot before traffic catches up to you. But I understand your concerns. Oh it's not going to happen. You have school buses and other buses blocking argyle, so you can't even get straight on into the park and then you have you know Nina Campbell, I'm going to break in because I'd be happy to facilitate you're right. Hayes Lord did have a lot of conversations with us. It's a it. We went we covered this when the those park, the argyle and Rugby bike lanes, were installed. So Preston I'd be happy to facilitate a conversation with park, so we could revisit those issues for sure that'd be great. Okay sounds good Sean, you had your hand raised yeah. I have. I have a couple of questions. One is you might already be aware, but the street lighting on Parkside is really poor. I forget the number of street lights that there are. We did a count, one time, it's a small number. It's like six. So when it gets dark at night, parkside is an extra dark street and a few years ago, NYPD actually made a request with D.O.T to add lighting, because there was a a sort of gruesome major crime, violent crime on parkside. So I'm imagining it. If cyclists are biking at night and they're even closer to the curb and blocked by the cars the I have a safety concern, so I'm wondering if D.O.T, if you would work with your colleagues to see if this could be. You know if another lighting survey could be taken for additional lighting to make this a safe as possible bike lane. And then my other question is about the pedestrian island, because Poor Diana's only been with us been working with this district for a couple of weeks, but I've I've been hammering away at the fact that the pedestrian islands that DOT installs have plantings in them, but nobody maintains those plantings. So I've got a very dangerous pet island on coney and n right now, because the weeds are higher than cars. So if you could just ensure that any pet island is manageable from a maintenance point of view and you're not depending on another agency to do that, maintenance. That would be most helpful and I just want to ensure that fdny will have input on any pedestrian island to ensure emergency access on a busy street right just to clarify currently we're proposing the islands as flush flesh painted islands, kind of the same way that Prospect Park West, the first iteration of that it was just done painting through paint later on, as the possibility that it could be built up. As a concrete island- but that's not part of this project, really okay, spy relief for me and then the lighting yeah, that's a great idea, we'll definitely we'll definitely look into that yeah and I've also made notes of these requests sean. So I can also take it back great I'll, find I'll, find our street light count and get it to you Dinah. Thank you. Okay, Steve, you had your hand up. Do you have it yeah? I guess I was just curious. What the time line is for the Ocean Avenue protected bike lane that was mentioned once or twice in the presentation. Sean. Do you want to do? You have updated information on that yeah, so I have it so to be clear. It's a it's a parts project, so I'm just passing along information that we've been passed along. So I think you know for the definitive answers you should certainly reach out to parks, but they've told us that the project is on track to begin in early 2022. So that was the latest information that we have. I saw Ann Godette has a handout, yes hi! Thank you. Thank you for this very interesting presentation, so I have a couple of things I want to touch on and perhaps you could clarify. One is Nina raised an interesting point. I'm now not clear. Are the lanes on the park side of parkside or the building side of parkside? So that's one, two merging at the top and bottom for motor vehicles is already challenging so and you're talking about removing parking spaces. So I'd be interested in hearing a little more of that for our community members. We are up closer to this area directly there three on the there's. Also I was curious, is: was it discussed to put a bike crossing at some of those intersections where these pedestrian islands would be so to make it more user- friendly? And I think that's all. I have thank you very much. So, yes, it will be on the prospect park, side of Parkside Avenue and the. As far as the bicycle crossings, we do have like a special kind of like tool, kit of markings and treatments that we do for bicycle crossings, but they're, usually sort of dedicated to when you have when it's intersecting. Maybe like another bike lane I mean I'm not sure there will definitely be the opportunity for bikes to be able to cross at sort at like parade place or St Paul's. If that's those are the types of locations you're talking about, but there would not necessarily be like a new special infrastructure that would sort of take them out of the bike lane. Does that make sense, and I'm not sure if I totally understand your concerns about merging, clarify that and it's already very challenging for a motor vehicle to merge at the top or the bottom when turning say toward from ocean or on to Coney Island right. So it's a snarl most of the time so during higher use at early morning when people are trying to get somewhere or you have exercise and other things that are ongoing being proximate to the park. It's particularly challenging so you're talking about angling, your curve, but people can turn in two directions or go straight. I believe at all of those points, so when you're fanning, when you're funneling down from two travel lanes into one on both sides, I'm just curious how and then reopening how that could be achieved without creating less or without creating more driver resistance or impatience, or a rush to jump a light or some such so. I'm just concerned about the timing on those areas given where, without this funneling, it's already stressed. Okay, I think I understand just to clarify we're not really changing much with the traffic operations the there will be the same moving number of moving lanes in each direction, the l we can look at like what you're suggesting about where sort of near park Circle the two lanes kind of funnels into one lane and kind of make sure that is working optimally. I mean you know, I think it's one of those things where it can just be the kind of situation where it's a give and take, but yeah we'll definitely take a look at it. We have raised here in florencia, yes, thank you very much for the presentation just wanted to know. What's the cost of this project sean, do you have any sort of idea on the budgeting, but just right before you know we are a grant funded project. So a lot of these is coming. It's federal money essentially, but sorry go ahead yeah. So we could work on a number, but generally, you know compared to say other capital projects where you're relocating street infrastructure and sewers- and such you know that's in the millions, if not tens of millions, these types of projects are generally less than say, 300,000 to or 500,000 or less, but we can. We can work on a ballpark number for you, but, like Preston said there is money already set aside for these types of improvements around the city, billy richling hi. Thanks for this presentation, I just wanted to make a quick comment and then ask one question. The comment is that, although I share some of the thoughts and questions echoed by Nina and some other folks, I generally think this is a great idea. I lived for many years immediately, south of parkside Ave and particularly that intersection at Parkside and Ocean. I crossed it every day to get to work and to get to the train, and it were many times where I was scared for my life, to be honest with you, so anything that calms that street down is a big plus for me, especially because I tried and failed to be a cyclist while I was living right at that area because it just felt unsafe. So as a general principal I'm extremely supportive of this, I did have a question. I know, and you may not know the answer, but I was thinking about it because the parts Department has come up a couple times. I know that there have been you know. I know there was a proposal to sort of rethink the south and eastern barriers of the park. I know that there's been a proposal to redesign the southeast entrance of the park. I know that there was also a plan for a Shirley Chisholm Statue. I do not think the statue has been put on hold or the artwork, but I'm not sure what the latest on those other projects are particularly the entrance redesign and the reason I'm bringing up it. Bringing it up is because I'm wondering if those projects, either their construction or whatever the final product is, would impact the bike lane in some way and if we there's a need to think holistically about what's happening on the streetscape right there we have. We have looked at some draft plans of the the way that the bike lanes going to come down from ocean and we plan to it to work with that. I think it might change where bikes kind of enter, rather than going into that the entrance as they do now. It might be a little bit earlier, but it's it's not. I do not think going to meaningfully change park side, but some of that is department. Kind of outside of our scope got it. Thank you, Preston and Sean. Somebody asked if we could post if we could get this to post on the website. Can we do that on the on the Cb 14 website, yeah I'll, follow up with Diana on that? Okay, we will also post to our website tomorrow and send you the link. So maybe we can you can link to it from your website. Perfect. Joe, we also have three attendees Elizabeth. First, I see that Elizabeth there's a little hi yeah. I was just going to say I live kind of I think, just kind of south of where this is, and I think that this would hugely help make it easier to bike. I currently do not bike a lot right now, because there's not a lot of places. You can go with protected bike lanes in our neighborhood and being just a couple I mean this is this is connecting a major problem that it's really hard to get kind of East- West for me on, and I think this has really helped. So I just wanted to say that this I mean. I agree that there's a lot of questions that need to get like hammered really specifically, but I just wanted to say that I'm in favor of having safer streets for cyclists in this area, thanks Erwin Figueroa, hi everyone. So I live on ocean a little bit down on regent place. I actually was biking on parkside a couple of days ago, so I, when I go the last comment and then the comments from Billy and Nina then that I support this is something that is fairly valuable, especially a side bike at night on Parkside and it almost these are times where it's almost a drag strip. One question that I had is representation. Most of the protection for cyclists is parking, and then I saw at the circle on the western end of the of the project is going to be a concrete barrier, but I could not see if there was going to be any protection immediately on the intersection between ocean and parkside. Is there any plans, whether it's a concrete barrier or ballers, to protect cyclists immediately after they turn if they're coming from ocean once they turn to Parkside? I think most likely it'll be ballers like flexible dollars, yeah, okay, but yeah, but I'm supportive as well, and also for the safety component for pedestrians. Thank you. Thank you. Jeffrey Thomas, hello. I want to say I agree with the folks who spoke just now saying, and this is this is badly needed. We need a sort of path to get it's surprisingly hard to find a safe route to bike. You know westwards from parkside. You can go through the park, but I do agree that going through Prospect Park West that bike lane is better for commuting than going through the park itself, and I'm hopeful that Prospect Park Southwest will also. You know. I think I think, once it's complete it'll have a huge amount of value for connecting up some bike paths. I wanted to confirm one thing I thought I heard earlier the regarding the flow, the like funneling effect. My understanding is, this does not change the number of lanes of traffic. This is just narrowing the parking lanes, but where there are two lanes there are still two lanes where there's one lane there's still one lane and making the bike lane. Is that correct, okay, yeah biking? I regularly bike on on park side sort of both directions. Try to follow the park when I can, but if you're trying to get onto the park you know making that left turn onto the park at Parkside. That's very hard. Cars get very angry at you. I think it'll be great to have a protected lane here. So cal d, I hello, can you hear me? Can you hear me? Yes hi? I I'm just thank you guys for the presentation D.O.T. I also want to express my support for the bike lane. I think it's badly needed and as someone who bikes along park side quite often it's, it can definitely be a little crazy at times and a little tight. So I'm definitely. I just wanted to express that. I really support this and I also echo what some of the earlier speakers said or mentioned where we need. You know maybe like just consider the lighting at night. You know and add more street lights, but I'm 100 on board and thank you for doing this, and I hope that the project continues around the entire perimeter of the park. Thank you. Thank you. Steve Cohen, you have your hands still up. Is that if you have anything it's further to ask not for me personally, but I did see there were questions in the chat and youtube, so I guess I'll just mention those Blake Morris on the Youtube chat asked why can't eastbound bike traffic be routed through the park? I can't eastbound traffic Sean. Do you have any particular park insight or yeah? So I think, in order to create a parking protected cross- section, we have to keep a certain footage clear for sanitation. So we have the space to allow bi- directional. I think, even just on the call tonight, we've heard that the westbound will be a tremendous help, but even an eastbound connection in the network will be helpful for folks again who are looking for a different experience. You know inside the park, as Preston mentioned, it's a little more recreational where, on the outside, we feel a different kind of more neighborhoody type use. All right. We got. We got to get wrap this up pretty quickly. I see Nina, you still have your hand up. Is that a mistake or down billy same for you? Have your hands still up? I guess billy, no, I'm good. I apologize! That's! Okay, that's! Okay! All right! As many have said, this was a very nice presentation very thoughtful and, as you can see, a lot of people are happy about it. So we thank you for coming Steve. Did you see any more things in the chat, because I can't really the other one was probably for Sean Campbell. I think Barton was just asking that the presentation put up well, no, the with regard to the the last, the argyle and Rugby bike lanes that there was going to be an update as far as how the bicycle volumes had changed. We was wondering if there was going to be a report and if we had actually gotten any sort of report along those lines, not that I could recall our answer off the top of my head I'll have to search through the files on that. But if that's Spartan's way of suggesting that this bike lane team come back to us post installation to report on you know on the bike lane and usage, I do not think that they would mine and it sounds like a fine idea. Yeah there's an excellent interpretation of what I meant so to our friends of the Department of Transportation. Thank you for coming and telling us about this proposal and we look forward to it being completed, as you said, so I think that's it. I thank Steve if I may jump in just for one moment sure sorry, thank you. It would help us if the board would be willing to write a letter of support. It sounds like it's positive, I think. Also in that letter you might be able, to maybe caveat some of the you know things that you would like, such as the photometric analysis of the roadway. But if the board been climbed, then we would appreciate a lot of support, I'll defer to the board on that, but asking for a lot of support when you would not have accepted a letter of rejection. So thanks to Steve and Carl Henry for the help on the leading us on the education matters, sean anything else, no other I mean to wreck. I do not know if you saw Joel that your co-, chair, Divor, Deborah Valentine, is also on the call just so that the co- chairs are okay, guys and to be more serious about the request from DOT. The this committee can bring it before the full board for endorsement and if the full board endorses it will be forthcoming, there you go so all right. Do I have a motion to end the meeting? Thank you, everybody for the presenters and the co- chairs and our host Mark Moss and for anya for always doing all the heavy lifting to get these going thanks very much thanks anya. Thank you. Thanks. Sanya thanks has left the meeting you.",
            "summary": "I. Think because there's four items on the agenda we'll get started without much further Ado. The first item is an update on school capital projects for the community board, 14 districts, and for that we have Miss Yvette Knight from the school construction authority to update us Ms Knight.\nAnd I think that I'm sure you appreciate the the budget crisis that we're facing in the city, and We present projects constantly to the mayor's Office of Umb and at this time the ones that I mentioned are the only ones along with some projects in some other communities where they have given us permission to restart.\nThat project is paused and still on hold when I know that at this moment, projects that are given priority are projects that relate to air conditioning and anything where the ventilation system is compromised, and I am sure that you appreciate the decision around those elements of a school building.\nYou know people who wanted to go back to work, especially our mentor contractors, to complete those projects, and it so happened that a lot of those ac projects were managed by our mentor.\nSo they restarted, but as it relates to other kinds of projects again constantly under review, and you know we meet with OMB, but we do have to wait for their approval.\nThose are really just air conditioning projects and again, for obvious reasons around the cities, and I think school communities concerns about ventilation.\nSo were there any other recent completions, including you know, air, conditioning and ventilation, Because I know that's a Steve, I do see it looked like Megan had a second question: I, do not know if you have any, I, think more funding from them.\nWe look at our attendance policy and things like that, coming up for school reopening.\nWe know school started on Monday we've been getting mixed reviews some students that can't connect to internet, and It's all different options and things that we've been going over students reaching out to their school on the school running out of their inventory of devices, just trying to figure out those little small issues that turn into big things.\nWe do not want to penalize the student that has to let his little brother use the device at that time, because he has a class so really emphasizing that to our teachers and our principals and our schools as a whole.\nOur business is going to be chaotic this first week or these first few weeks, because the bus drivers got to figure out the routes between, like the students that are doing, the blended learning and the students that's going to school every day and adjust their right accordingly, because we see it as the bus, the school, the bus riding is extension of the school day and making sure we're following the Social Justice Social Distance protocols and all that different items and also we're looking at the grading policy.\nThey Wanna take their child out of that and go to a blended learning cycle , we're giving the parents the options to choose if we, if they have a positive test at the school, whether that's by a teacher or a student or one of their fellow classmates.\nAs you may be, aware, there were some articles and local papers regarding some teachers who had concerns in Ps139 regarding the Kova testing and the DOE protocol with that, and so my question for you, is, Have, you seen any guidance from you know your superiors regarding whether or not the testing protocol for what happened that Ts 139 has been updated and if so, what that updated protocol will look like?\nThere was a letter from the chancellor about protocols for testing, but we were told, and again it's been a series of moving targets and somewhat understandably, because it's a You know, it's an unprecedented situation, but we were told toward the end of the summer that if two people from a school tested positive-- And they were not in the same class that the entire school would get closed down and for at least two weeks that was , that was the last protocol that we were told and then someone you might not find difficult to leave.\nDo not have that all that data at my disposal, right, now, but I, know it's every student that walks in the door Every day they're getting a temperature check and things like that.\nThat's the thing we're going to figure out in these next couple of weeks once we run that through legal, but that's next in the pipeline to make sure every student gets tested.\nWhat testing protocol could look like at the schools, and then we also shed some insight into the forthcoming communication.\nI think the number was something like 20, although some of them might still be working through yeah go ahead, The process is that the schools are applying through through the mayor's office and DOT, and then that's being shared with the street activity permit office and there's no approval process for community boards.\nIf there are parents who think like, I can think of certain schools in the area that you know, there's like dead end streets, nearby?\nOr you know, if there's more of a, if there's any sort of role for the community here to get the process rolling, you know really was because of the of the community board in Manhattan taking action, and you know I'd heard from a lot of parents over the summer who you know wanted to promote outdoor learning and Do. You do you know anything about outdoor learning and what and what schools have done around the city or are doing regarding utilizing streets at this point?\nA community advocate had advocated for outdoor learning and things like that, just a new creative way, the social distance and also keep the students engaged, but I do not know if that's actually taking place, but I can check in and see.\nKnow, teaching within the school, and I think the idea of having to provide additional staff to manage something like outdoor learning was just right, like understandably so, going to put him over the edge.\nSo with that yeah go ahead, may I jump in I Given the many unknowns like not knowing the extent to which it places additional onus on a principal and school leadership that we would just offer to be helpful on a case- by- case basis, whether that's helping a school, that's trying to achieve outdoor learning or play space expansion and helping them navigate, you know, or working with the precinct or navigating other things that are going on in the area or if it's helping a parent group, try to suss out.\nCould that be a position where they could consider pushing forward the construction project to fix the yard , so we can achieve outdoor learning or you know, for our students, hi steven with the SCA.\nWe've been meeting with SCA members, we've been trying to push the project forward to get it in that design phase and we've been put on hold But you know there are things like, as it relates to social distancing and, as I mentioned ventilation, and I send that email So, if that's the case, hang on one second, emily I think I think we can turn to item four on the agenda I guess thank you before you do that it's event with the sva.\nIt serves more of a transportation and community neighborhood purposes for utilitarian cycling, rather than the sort of necessary Well, not necessarily but recreational purposes that are pretty common within the park and then the fact that the Prospect Park West Bike Lane, is two ways kind of facilitates that type of use.\nYou kind of have to take the long way around beyond Prospect Park West, there's also Flatbush avenue, where a prospect are where a protected bike lane was installed this year and then Ocean Avenue.\nWe saw the open streets as very successful in some respects, where a lot of people were out there, biking and walking and able to socially distance themselves.\nThe the mobility that that was sacrificed with motor vehicles that were not able to kind of use parkside as a cut, through, and I think what this project can do is kind of take some of the best of those two ideas: Creating safe, comfortable places for people walking and biking.\nWe want to improve the pedestrian safety that comes in a couple, different ways that I'll explain, shortening crossing distances and adding daylighting, which means kind of clearing out cars a little bit to improve the visibility between people, walking and people in cars.\nBut, looking at the sections, what you can see is currently, as I describe the street you've, got the parking lanes in each direction: travel lanes and they're separated by the painted four foot, buffer, and So. What happens instead of that is that buffer goes away and the parking lanes are narrowed and that extra space is used to create a two- way bike lane alongside the park and the parking lane is moved away from the curb just like on Prospect Park West, to to create protection between the moving vehicles and people on bicycles.\nI want to just say that this is a project that we're You know we're hoping to kind of build on the open streets idea and Also the progress that's been made on Prospect park, West and Flatbush.\nYou know community Board 14 about the routing and with also the parks, Department, and I think they also have concerns about biking with the per inside the parade grounds, and so we can look into those types of changes, but we also have to defer to the Parks Department as far as their witches.\nThe l, we can look at like what you're suggesting about where sort of near park Circle the two lanes kind of funnels into one lane and kind of make sure that is working.\nI mean you, know, I, think it's one of those things where it can just be the kind of situation where it's a give and take, What's the cost of this project.\nDo you have any sort of idea on the budgeting, but just right before you know we are a grant funded, project.\nI agree that there's a lot of questions that need to get like hammered really specifically, but I just wanted to say that I'm in favor, of having safer streets for cyclists in this area, thanks I actually was biking on parkside a couple of days, ago, so I.\nYou, know and add more street lights, but I'm 100 on board, and thank you for doing this, and I hope that the project continues around the entire perimeter of the park."
        }
    }
}