{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCgFwgrApUvg0TVbxexo3Gtg",
            "title": "Top chat replay",
            "publishDate": "2020-10-16",
            "shortDescription": "",
            "lengthSeconds": "3:14:45"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "wejbJuXUqRk",
            "fillerWordCount": {
                "uh": 244,
                "um": 279
            },
            "readTimeFullTranscript": "106 min read",
            "readTimeSummary": "12 min read",
            "wordCountFullTranscript": {
                "budget": 69,
                "capital": 62,
                "item": 50,
                "parks": 48,
                "funding": 38,
                "schools": 36,
                "expense": 34,
                "services": 33,
                "request": 32,
                "school": 29
            },
            "wordCountSummary": {
                "budget": 25,
                "capital": 17,
                "expense": 11,
                "parks": 8,
                "trash": 7,
                "street": 7,
                "requests": 6,
                "request": 6,
                "removal": 6,
                "funding": 6
            },
            "fullTranscript": "Oh nicely, I just figured out, I can see everybody will should we start still have a couple of people joining if you want to give it a minute, but you're, probably right about on time. So, okay, it's up to you, okay! Well, why do not? We start? Listen! Okay, I'm Barbara Sharkey, the chair of the budget committee. I want to welcome everybody and I now can see people because I did not have my computer working prior to now, but now I can see everybody I just want to. If this is what we're doing tonight is voting on the 2022 expense budget, our priorities and the priorities of the capital budget. I just want to start off with a little statement by the way. 2022 is the budget that starts July, 1st 2021 and it goes through June, 30th 2022, and what I want to say is it's really, I think, a very strange time and will- and I discuss this- to do a budget because we do not know what's going to happen. We certainly do not know. What's going to happen, even if this we're now in fiscal year 2021, we know it's a unique time. We know there's going to be city, state and federal cuts most likely. I do not know how it can be avoided and we do not know yet. With the Community Board's own budget, which I know, people have been asking for items and making requests. We do not know what's going to happen and I'm very concerned that there's going to be cuts this year, 2021 cuts because the year that ends June 30th, even if we get even if we get federal funds and even if there's a new administration- and I want to get political, but even if there's a new administration, it's going to take time to undo and to make the changes and to make up for the losses that we already have. So it's. We have to keep that in mind, especially when we do the knees the needs statements, because it's almost, I always say it's almost a joke at times, because the way they do not respond to us- and you know every year they give us. What we're looking they're going to look at tonight is the responses to the 2021 budget, which we're in now, which goes for June 30th, and they you know when they respond, that they always do. If there's money in the budget we'll fund it. Well we're asking you to put money in, but this year we do not know. What's going to happen with that, and I'm going to at one point I do not know if I have any support, I want to discuss. Even we've done this way back. We've done this before other times is to recommend to the state legislature that we have a tax increase, a wealth tax. So I'm going to throw that out. I do not know if I have support from anyone, but I think that's the only realistic way we're not going to have enormous cuts, so I think we should start off with looking at the expense budget for 2021, which is the year we're in now, and can you put that with those that on the screen? Okay, yeah? So everyone should see you know our screen if you were able to participate in the last couple of years, you're at least a little bit familiar with the new portal that the Department of City planning has for our district needs in our budget requests, and I also have set up a spreadsheet here. Most of you are board members, and most of you should have received a copy of this spreadsheet. I've made it a little bit less cumbersome by putting it up here, but then I also meant to do you want this up Barbara or do you want the the like the roster one, I think the roster? So we what we're doing now, we want to look at what we did in 2021, which is now and see what we're going to. If we're going to do leave those items in for that for 2020 2022, which begins in July again, I hope people, I think, understand by now that really does not matter if somebody's something's in one of our priorities, it really does not matter if it's 10 or 11 or 12, if the in our priorities, especially when you look at the comments that we got back from the agencies which those of you who have worked with me before know what drives me crazy when they say if there's money, we'll give it to you, we're asking you to put money in the budget. Okay, I'll put up the official response right now. So this is where we always get back from from the city, and it includes, I think, most of the board. Members should be familiar seeing this, but it includes the priority that we had and then the agency's response to it now number one, I think, is more important than I think it's more important than ever. When we get back to whatever we get back to remote learning or get back to in direct learning, I think pre- k and 3-K is going to be extra important. I mean these kids have been home, not understanding, I think. What's going on and whenever I see kids in the street I get really concerned. How are these kids dealing with this? So I mean I would like to leave. I know pre- K, Inc and K seats have been good because I think the mayor made that as a priority, so those have been funded. Anybody has any more comments about that. Judy Schneider has her hand up I'm finding it hard to read this sheet so that as we go through each one, could you just quickly state what they are? Okay number one was to fund 3-K and pre- k seats in Community, Ward 8.. The agency response was further studied by the agency of this request. As needed. I mean I, you know, I think it's been steady, you know you have yeah. Did you have anything else to say Judy or okay, Michelle and then Gail have their hands up? Okay, Michelle yeah. Thank you. This is the year 2021 that will expire next July. Now it expires expired. It expires, June, 30th, yes, June, 30th. Okay, I want to make sure we have not gone through all of this. I want to make very sure that our priority is schools. One of the issues. As you know, people are leaving the city like crazy. Every year. When I participate in this budget committee meeting, I always want school schools to be number one. No pre- k is number one well, okay, but that that's not the same thing. I do not know what you want about schools will you I do not. I want more schools, one of the things that we lack dramatically in this district and if you have ever participated in the school entry program, you would understand what a complete fiasco this is. Children from our district are can be sent as long as two hour trips to a school that they can be assigned to. We need more schools in the district, and while I have, I think that absolutely exceeds the importance of 3-K and fork and pre- k seats. Now you have stated that it does not matter what the order is of what we are asking for, but I see that number one is pre- k. Number two is after school programs, I'm absolutely in favor of that, but I do not see in the four items that are on this page that we're looking at. I do not see schools anywhere. Why do you have to be specific? Do you want more middle schools? I want more elementary, more middle and more high schools. Okay and I would love- and I would like to see them see that as number one, because it's so unrealistic this year. This is also the expense budget. Everyone we're looking at expense first and then we'll go back to capital. So you need to build the schools before you before you fund them exactly so this is expense, not capital, so, okay, so we should put that should be in the capital budget, more schools. Additional schools have to be on the capitol first yeah, okay, well in the expense where you say 3-K and pre- k, you're, assuming that there's room in each of the existing schools for an increase in these number of seats- and there is not, it was not seats made available this year, the 20 there is not any room, I mean they're in a place like ps6. You know, kids are meeting in the hallways and nobody's meeting in the hallways right now we understand that Barbara, but I'm just saying going forward. I think that this item is a capital item, because I do not think the seats exist after we do this budget, but I'm talking about this budget now, so I'm thinking this should be we I do not know. I do not want to go back and forth between expense and capital. I understand that. That's why I think it should be removed from the expense budget, because the seats do not exist. I will fight that. These kids need pre- k and three Katie's. I'm not disputing that Barbara. I'm only saying that, currently, these seats do not exist and, while your statement to me your explanation was that to create seats, that's in the capital budget. So in response to your explanation to me, I'm suggesting that this go into the capital budget, because these seats do not currently exist. They have to be created. Okay, I vote no on that taking it out of the expense budget, I vote. No, do we want to take a vote sure, but I'm only going by do not your explanation. Listen. I do not think there's going to be any schools this year, so you know that's not relevant. We are asking for something. Okay, I you want to vote on each item. I can stay till I have to get. I have a meeting at 6 A.M, so I have to be finished by 6 A.M. How do you want to work this? I know that you know if we have to vote in each item. I would think you necessarily need to vote on each item. Maybe it's good to just go through the whole list and let everybody have a chance to have a conversation, and then you guys can really discuss on the first one. Then Michelle, I'm going to meet you and lower your hand. Gail has her hand up elaine and we'll go from the list after that, there's more Gail Barbara. First of all, I think that asking having the expense budget items as well as the capital budget is fine. I do not think that one has to be excluded in favor of the other. Interestingly, I do not believe that we actually have any three k seats in the district and we've been able to secure more pre. I mean fun 3-K we do not have. We do have adequate pre- k seats at this point in time because of Ben Kalos, but bottom line is. I think that we should have it in the expense budget, as well as in the capital budget, because you have to have the money to build the new schools, but you also need the expense budget to cover other costs. So I do not see that it's necessary to cut one out in place of the other michelle and then, interestingly, I think that we should the three pressing issues that were in our district needs. I think one was affordable housing. The second was parks and the third was schools. Those were the three that we highlighted. So I would also think that we have to kind of take a general look as far as which initiatives overall are most important to the district and then drill down to the specifics within those areas or are any of those to be replaced with something else. Okay, anyone else. I recommend at this point next. Are you done gail? I do not want to hit you. I am all right. Next we have elaine and then Betty and then Barbara Rudder and Trisha. Okay, I was going to and will you said it, but there's a difference between capital and expense. Capital is for infrastructure or items that have more than a five- year lifespan. As far as the schools look, we all know. This is a process that we do every year and there's no response from the city, but I think it's important we can put in definitely build new schools. We need a high school, a middle school grammar school, whatever the new titles are, but the expense component is that you're looking for seats within existing facilities and they have opened different ones by either renting out or whatever. So I think that's the difference is that you're looking to find existing seats or new seats in existing buildings and then what we need is because that age group gets older, we need local schools and the pandemic has made it even more important that we look at local schools so that the children are not having to go on buses to go an hour or two hours. We all know the story of living on the Upper East side and the kid is going to ps6, but they have to pick up kids in Roosevelt's island so that kid gets on at the crack of dawn, goes to roosevelt island and then goes to ps6. That's unacceptable from a learning perspective and even mental health for child. So I'd like to see we have one request for seats when we look at the capital budget, make sure then we've put in four schools, new schools and opening spaces in existing facilities. Are you done elaine? I do not know? Yes, I'm sorry. Okay, next time I'll say I'm done. Oh yeah, okay, it's okay! Thanks, Betty Star, six time, Mute Betty, Cooper, Wallace! There you go hi. It was already said what I was going to say. Thank you, okay, Barbara Rutter! I was just going to add to the list that I think that we need some emphasis on affordable housing or housing to supportive house more supportive housing in here too, I would like to see that as part of the or I know that's because I do not mean to construct the capital budget, but the expense budget can be programs for it or I think it's in there is it. Okay Gail listed the top priorities and I think that's a different document. It's in the priority budget. Thank you for this fiscal year, we're looking at this fiscal year now. Thank you. Trisha hi, everybody. Apologies for the children's music behind me. That's just Teddy. I think that just to go off of gayle's point again, I think that there's a little bit of a confusion and about just about the documents that we're looking at. So it may be helpful if we just barbara. I know that we're going over expense and then I know that we're going over capital, but I think that it would help everybody to know that in our district needs statement for Fy21 that we said that the three most appreciative, pressing issues facing our community board is one affordable housing to go to Barbara, Rutter's, point parks and schools and specifically to Michelle's point. We say in the very first sentence that we need pre- k, Elementary middle school and high schools seats. So I so if that helps the situation, I know that we're going over these extra these specific budget requests, but that's made very clear at the top of our at this at this top of our district needs statement, and then we kind of dive down deeper. So I agree with Gail's suggestion that we that we, you know, identify and first recognize that, if we're still okay and comfortable with those three big priorities and then to dive deeper into it, but that's just I think, for if it's helpful to others to know that those are the three top priorities that we that we identified last year and everything that you just said from Michelle and Barbara Rutter's comments that was that was reflected in in last year's district needs statement. That's the last of the hands up for this, so the second one I was asked to read them provide, expand or enhance after- school programs for elementary school students rate K-5 in the fund out of school. It's called out of school time now and day care programs for all children who go to school in community. What aid or have parents that work in community board AIDS the agency response was presently there are a variety of agency- funded programs. This is that's by the not- for- profit agencies in the district for this target population. Additional programs are contingent upon available funding and will be distributed throughout through an RFP process. Organizations are encouraged to apply and then it says the agency agrees with this request, but the funding decision follows a different budget process, an rft program. I do not know how much money is going to be available for not- for- profits to run these programs. Any comments gail. I would just change it a little to say, affordable and accessible programs, because when we were looking at child care, we did not find that many affordable options and even as Trisha had said, if you have to pay for a really small child 35 to 50,000 a year, that's just not doable, and it's not even for the elementary school kids. Also, if you have to find programs for them. The agency programs that are currently available are still expensive unless somebody is at the poverty line right. But if somebody is above that, then, and in our district, there are a lot of people who have a middle income but can still not afford the daycare options that are available after school programs. So I'd like to modify our request. Just to talk about affordable, you mean, if we put it in 2022, okay, the next one was other youth workforce, increased funding for youth programs in development and requests. Presently there are a variety of agency- funded programs in the district. This is usually the not- for- profits too, for the target population. Additional programs are contingent upon available funding and we just and will be distributed through an RFP process. Organizations are encouraged to apply and that's the agency said the same thing basically number four. I think that we really need that now. Barbara Trisha has her hand up for that. One hi I just Wanna. I think I would like to propose that we strengthen this a little bit, so this is the year that they cut summer youth employment program, which this community board stood up for and said that we wanted this program funded, I'm going to send will an article. They also just the city, just put out an article saying that they were planning on cutting the learning to work program, which is another funded program that allows for high school students to have a paid internship. These are very essential programs, and particularly the summer, youth employment program has funded students working in our parks to keep them running and to open up the pools and that sort of thing. So these are two very important programs. If we can specify that youth, workforce development requests and specifically say include the summer youth employment program and the learning to work program, I think that this would strengthen and it would strengthen the overall request. Trisha. That's why I'm so concerned, because we do not know what kind of cuts are going to happen yeah. So if we could, if we could change the language on that, one in particular, yeah include those two that would be. That would be great. Thank you. Anyone else. Would you send me the language that you want to include if you just send it to you, and I just sent you an article, will that you could share with the with everybody on the call? Yes I'll, send it to you now that was the only person, and I think this is very needed now, because it's getting very bad out there. Other animal and pest control requests under that is increased funding for rodent extermination on city streets. I think things are worse and very bad out there now any comments. No okay, number five again. We've discussed this before other park. Maintenance and safety requests, preserve funding for year- round workers and associate parks and re recreation workers in New, York, City parks and recreation. I did get people calling about that. The parks really need. I know, John Jay Parks needs more health assistance. Cultures has a conservancy, so it's in little better shape, but there's other parks and Catherine's a lot of parks, and I think we know we have very little open space in this district and we really need it maintained. Otherwise, it's not going to last, and we said that's, I think very important and again with it was one of us needs to share hand up yes, so again, just to speak on this one and the next one I could not agree with you more Barbara. I do not think we need to keep these. We. There is very few weekends that have gone by that. I have not called our parks managers to ask them to address a specific issue if it's either garbage pickup or if it's maintenance. I just called parks workers like two days ago, because we had teams who were throwing things into the empty John Jay Pool that needed to be taken care of so absolutely need more staff and for the next one, because everybody is using our parks so much even at the East 72Nd Street Neighborhood Association meeting that we're at we're getting complaints about the just the high level of trash, and we are hearing that parks could be facing. Obviously 20 budget cuts to their staff. So we absolutely need this, and even if I know that this is all one list, I know that it does not matter too much, but even if we can bump this up, I would I would love that, because it is very important to us and the next one improve trash removal and cleanliness, that's in the parks and outside of the parks, because it's too different budget items, but we really need that. We can't and I'm afraid, that's they're, going to try to cut that. The streets are in this, garbage is overflowing in the parks and outside of the parks and it's two different items and we really need that needs to be done. I do not know that was number six, no questions. Okay, number seven was provide new traffic or pedestrian singles increased Sunday funding. For I can't I can't see this order of my stock, where I'm looking audible accessory crossing singles. I think that we really did. We got some money for that this year. You know the automatic single audible sing singles, but I think that's still important. We have a high senior population. People can't see right, the streets are darker than they ever were, and I think we need extra help and cost in the streets. Let me have some questions on this one or some comments: Elaine, Rebecca, Barbara and Betty my hand did not go up in time for the previous one, but Barbara are you saying that for the improved dress removal, it's not just department of parks that we're reaching out to but also department of sanitation, because we have decreased pickup in the community, the Cans are overflowing. We seem to have people in this community or who come into it, who have no respect for putting their garbage in the correct place. So I think we definitely need increased pickup for the cans on the corners of all the streets. Yes, definitely, and I have nothing to say on the next item- I'm finished. Okay, Rebecca. I have two things: the first going off of what elaine just said. I do not see that the request for outside the parks, as part of do you have to add it- has to be added, because it then different funding sources, so I would suggest adding it and either putting it like directly below or directly above and then the second was about the new traffic or pedestrian signals, because I did notice that they asked for a list of specific locations and I'm sure they're going to say that again next year. I do not know if anyone here has an idea or if maybe we want to pass this on to craig and chuck and send a letter after transportation, and I think we I mean I would suggest, since we needed another number we needed to put the trash in the park and outside the park that maybe we should for now should take out the pedestrian signals, because I've seen a number added this year. So maybe we need the trash, maybe more important than that. One will be my recommendation. Okay, anybody else, Barbara Rutter, I'm going to ask if you could keep the audible in. I have an eyesight problem and I'll tell you it's making me it's making it more difficult for me to cross, because I do not see necessarily the countdown number. You know they wanted the countdown and I really think it's extremely important. Maybe we could combine the inside and outside garbage, is not it both parks doing it, and why do we need two items for it? Because one of them is Parks Department and one of them is sanitation, and why do not we just combine the sanitation and say whatever do we need outside the park and on the street or sanitation? Is you know? Corn? Is the empty trash cans in this on the streets? We can try doing it that way. The requests can only go to one agency at a time. Oh, that's it there's two of them going to sanitation that you could be combined both in the Senate they're, probably going to criticize us, but we'll try to combine it with another sanitation really are important, there's more and more blind people here, people! Actually, I'm not I'm not arguing with you, but I'm just telling you how they respond to us. Okay, the next one wait. We still have more. You have more people who have comments on this one Barbara Sorry Betty, Cooper, Waller, Scene, Star, six, okay, yeah Barbara. I have noticed in the past weeks that they have taken away at the crosswalks. The timing, in other words, you do not get the numbers as to how many you know how long it's going to take before the light changes and that's very sick, so that's very serious at first call and call it into the board office where it's taken away. I have not seen that it's a call. Well, it's okay, all right hold the board office with that should not happen. I thought you're just the thing we're talking about now had to do with crosswalk, and with that you know it has to do with taking anything away. I did not. I we're talking about the gauntlet. No, what we have what we had was a way to see when the light was changing. You knew how much time you had taken it away. So, if they're taking it away well, okay, after that elaine Walsh, then craig then felice then Rebecca Dengor yeah. I just want to support that. We need to put the sanitation issue as far as garbage pickups higher up it's not on there. I'd like it right under the removal of the trash for the parks. It is overflowing. It's a health issue. We also have some people in the neighborhood who are overturning full garbage cans and nobody is picking them up. This is an essential public health issue and we need to get sanitation to come back and do pickups the mayor reallocated funds to certain other communities and did not think our neighborhood was commercial enough or Covid-19 enough to have garbage pickup. So it's an essential public health issue and you can expect volunteers to be emptying out garbage cans. It's wonderful that the volunteers go out and pick up litter from the tree, pits etc, which is another issue I'd like to talk about it another time, but we need to move sanitation up, and I make a motion to include right after the removal and cleanliness for the Department of parks and recreation that we put in the sanitation and requests for increased pickups seven days a week of all garbage cans in the major areas. I'm finished thanks next craig later good evening. Everyone. I just wanted to acknowledge that back in February the transportation committee members did solicit input from the members of our committee regarding locations for audible pedestrian signals. So we should have an active and recent list, but if anyone has any other intersections that they believe would be necessary, we're definitely happy to include that as well. Thank you felice. I would agree with the emphasis on trash pickup. I do not think we'll ever get a daily trash pickup, although that would I would be thrilled with that. But if we could get perhaps more or bigger trash cans in the neighborhood, that would be helpful. Buy that one here they said they did not have them it, although it certainly does make a big difference when it's harder for trash to flow out of those trash cans- and I know I it's a challenge when they're so overflowing that people do not even have enough room to throw their dog waste bags in the trash can. But the other item that's on here- that I think maybe requires a little bit more emphasis. So, item number nine is on increased funding for tree pruners and tree climbers, but I think with a lot of the extreme wind conditions that we've had, and I think one of the things the mayor said he was reducing- was funding for tree pruners that that's something we really need to emphasize. I was out walking just last week and a branch fell off a tree and on a car on the block I was walking on, I think the care of the trees is really critical for just public safety, and I I'd be very concerned about efforts to cut back free pruners, and so, while it is on here, I would just maybe make that a little stronger or you know emphasize it as a priority. Well, it is a priority. It's pretty high up, yeah Rebecca Dengor hi! No, I just I do not want to labor on this, but I would I do not think we should combine the trash pickup for both the parks and outside of the park, so I think cause we're not going to because they would not okay yeah. I just want to make sure with another sanitation, we'll figure it out when we do. We get that back to that, but no, we can't combine it yeah, okay, good Russell, squire, thanks so on the trash pickup point for the parks, one. I think there's a bit of a mismatch between the request and the explanation in terms of improving the trash removal and then the explanation for the parks portion only talks about the need to exterminate or basically I know I noticed that we'll change that when we redo it. Okay, so sorry I wanna, I Wanna give everybody a little bit of a frame of reference. The request itself is from a pick menu a drop down menu of options that we have in our explanation. We can clarify what we're actually really asking, but when you guys see us enter it into the portal later you'll notice that the everything that's under requests is a pre- scripted line. So I think in previous years we had to pick. You know something that related to cleanliness, and you know there were. I think they had it. Last year too, they changed the system recently and they made it much more difficult to come up with these requests got. It did not fit. What we really needed, though, like they changed everything they changed the whole process. There's a good question. Russell, I'm sorry, no that's fine! So, but so that means we're going to need two, essentially that the trash removal is two new items right, because it's trash removal in the parks, because that one currently does not cover it and trash removal in the in the on the streets and then the last point is, I think, the way to to effectuate the point that felice made about the tree pruning is maybe in the explanation we can emphasize the public safety aspect of it and that that's the reason for it all right. Thank you, Russell is that oh yeah, just yeah, okay, great trisha and then elaine yeah just very quickly. I agree. We need to keep the two trash pieces separate and that's fine and then just wanted to thank felice again for talking about the tree pruning. This is something that we brought on the list last year, I'm following a huge storm that had happened and the dangers that we saw after that. If you remember this, like very heavy snow storm that came in and just like kind of broke, a bunch of trees and pieces and did a lot of damage in our community russell. I do not know if will already asked you to suggest language, but if not I'm happy to suggest something to strengthen that, but absolutely agree that this needs to be kept in the budget and strengthened with language. If we can elaine and that's the last person with their hand up for this item, the Parks Department has been negligent in doing tree pruning for years. They seem to go to the other boroughs, because the trees are on a hill and after a rainstorm you know the mudslides we've seen the devastation not tree pruning, whether it's through central park or other parks or on our streets. I know, and I'm going to put my other hat on as president of East 86Th Street, we paid to have a pruner come in just before the storm was it two years ago. We did not have any problems because we had pruned. We also did not have the money to do it, but we knew we were in a dangerous situation, so I think hawks has to be put on notice. That pruning is important to the safety. I agree totally it's a public safety issue. It can be environmental also, but it definitely is a public safety issue and I'm finished. Okay, remember the that will just told us. Some of the language is awkward because we had to pick certain language. So that's why some of it does not is not as strong as it should be. I think am I right will yes, that is exactly right. That's what happens and they I think they changed this two years ago and it's just absurd. The next one is enhanced home care services, increase funding for services to older adults, including personal and home care, transportation services, meals on wheels, Senior, congregate, care, mail programs and case management, so that takes in everything it just says. The answer was difter is aware of the growing aging population and continues to fund programs in this community district as well as advocate for increased federal state and city funding. I think that needs to stay in. I wish it was you know, so we can't make a stronger three. We should be very strong. Is it we see now during this pandemic? What a need is for these services. You have one question or one comment on this: one Barbara rudder: can you add something about greater fruit, deprevision also something about food in there, because there was something I did not hear that food. Can we add something about the food that there's so much more of a food that need a food deficient, more services? I know you have it, but can it be stronger with that if we can make it stronger? I remember we had to pick certain language. I thought the explanation is just handwritten yeah, so how would you make it stronger, and I forget, but well you could. You know just add something about a food delivery. You know an additional food with for greater food need. You know a greater need, particularly amongst the seniors. Is it not just yeah? No, I'm saying that, but it's not particularly for everybody. Okay, the next one is: oh, you have one more hand up for this, one. Sorry, barbara, it's billy, I was just going to suggest adding in language that maybe mentions the pandemic and the heightened need for transportation services. This is remember this is for July 2022, but we're doing it. I hope yeah. I hope the pandemic is over yeah, I'm a view that you know we should be prepared for the worst on this and I'm not sure you know, even with the vaccine, how quickly we rebound. So I think the pandemic has shined a light on the need for this, and I do not know whether that means no. I agree. I just hope it's over by then anyhow, that's my two cents, I'll mute myself. Okay, you're good to go. Okay, other park, maintenance and safety requests, increased funding for additional roving park, maintenance staff tree pruners and tree climbers, so the parks are really in there twice this one. So that may give us another number. Yeah Trisha has her hand up. I know Barbara, I do not. I do not think so. The bar the parks is not in twice. We just talked about it earlier, but this is all separate stuff. This is this is trash removal and then this is and then this is tree pruning. So it's not because we said tree pruning was in there too. I it was not in there before they were just fully suggest. If Lisa just jumped ahead a little bit, it was not in there yeah they're, okay, once it's in there, anybody else, nope go ahead, expand Street, Outreach and create funding for homeless services, outreach person. This is for homeless services. I had to see what the outreach was for outreach personnel, especially during the overnight hours and provide department, homeless services with updated information technology equipment. The equipment is capitalized. Well depends how expensive it is again. It says the agency continually works with provider organizations to enhance services that are working successfully, identifying best practices and expanding the those services are ideal, no hands up for this one hands up. Okay and then it says other programs to address public health issue, requests increase funding for the Department of health enforcement for all food vendor rules and regulations. We know we need, I do not even know if there's any enforcement right now. You have, you have one hand up already: elaine, okay, I I'm slow to the reach on the expanded street outreach which one are you at I'm going back, because I went in okay. The issue here is that years ago they combined and we lost having a local agency do Outreach, and so it's done by goddard. We are inundated with the homeless and I'm talking about really the high and not the ones who just lost housing but who have mental health and drug problems we're seeing all over the community. I've talked to a number of community groups and what we need is not just technology. We need to have outreach workers assigned to us that are out on the streets right now. Remember. The police are no longer working with the non- profits to do the outreach unless it's a crime violation. Okay. So I really would like to see some change in language if it's appropriate to ask for funding for our community to have an organization that is responsible for the Outreach. Elaine is not that part of the RFP process when they did the RFP process. Maybe we have to say, increase the agencies under the RFP process right under Bloomberg. They combined they reduced how many agencies were funded. So, yes, increasing number of agencies, so Community Ward 8 an agency within community. What ACES fund is really what you want to happen. Well that that's what I'm saying guided Riverside now has jurisdiction over us. It used to be lennox sale, we've lost the outreach and the different programs we had for the homeless right now. It is a violent situation that's going on, but the police can only come out if they've seen somebody commit a crime, but the harassment what's going on and the destitution. It's disgrace. What what's happening with the homeless and we need to increase the number of agencies funded? I think to identify a local agency to do this through their not if it has to be an RFP process. Okay, but I disagree with that. I do not think it should be an RFP. It can be an RFP, but it should be localized not in each district. Yeah, yes, yeah. Okay, we can change that because it's really problematic. I agree. You have several other hands up Barbara about this, so Ed Hartzog, Russell, Squire, police, Michelle, starting with Ed. Do I need to unmute no you're good, oh good, thanks yeah. I just want to echo what elaine said and really I just wanted to chime in real quick to say. I'm sorry, I'm going to. I already spoke to Barbara. I'm sorry, I'm going to have to hop off. I have to take my son to hockey practice, but I will try. I will. I will try to call I'm headed out to Flushing meadows, but I'll try to call from the parking lot in the car for about an hour if the meeting's still going on. But if we get the housing I'm going to defer, I just wanted to say I wanted to defer to Barbara. So if you did not see me or if no one said anything, that's why there's silence from the housing committee anyway hope to talk to you all in about 40 minutes, russell squire thanks! So I think on the the homeless services point. I just want to make sure I think basically there's a you know. Part of this is also just the underlying services and the need for services right. It's not just about making sure that there's outreach and that there are people on the street to find phones, services yeah. What's the number of services? Okay? Well, so the explanation it says: okay, so that's something that we'll add it's not just that it's not just about right people on the street overnight and that kind of thing so that okay, that was the point I wanted to make is make sure that we're getting the additional services too. That was it for me. Okay, thanks. If you had language that you wanted to put in just chat it to me, sorry Russell Felice, so just briefly, because I do agree that the increase in homeless in this neighborhood is is a real problem, maybe take out the reference to technology equipment because I'm not sure how that benefits the yeah- I do not know. I do not know why that's in there- okay, it was not originally, but you know they had to change it because of certain rules of the of OMB, okay, so yeah, I just have not an emphasis on homeless outreach, yeah, okay, Michelle or sorry felice. Were you done yeah? I was just you had mentioned the enforcement health, the Department of health enforcement for all four food vendors. I just wanted to stress it's more important than ever, because the police, who are the other enforcing agency for street vendors, they have been instructed by the city not to ticket or enforce any activity of the street vendors. So the Department of Health will now remain the only enforcing agency, the department of consumer affairs that offers or gives the licenses, but they are not an enforcing agency. So this is more important than ever yeah and we can say that when we put it, if we put it into the 2022 budget, okay and then elaine and that's last hand up, okay, just a quickie on the technology, DHS has now the pads and all of the technology. They need to do this, so I do not think we need the information technology equipment done. Most of them are working from home or, if they're in the shelters, they all have the systems in place so that from people who work there. Okay, thank you and number 11 is other programs to address public health issues. This is where it's strange: increased funding for the Department of health enforcement of all, for we did that already: food vendors- okay, that's in that number, 11., 12, other expense, traffic improvement, requests, increase the number of workers to inspect repair and preserve the Department of Transportation's infrastructure, both bridges- and I want to say something about roads. I do not know if it goes in here or someplace else. It is almost impossible to walk the streets now. My balance is something that's happened to my balance during this period and I have to use a cane and it's so scary, to walk in the streets. The streets are cut up, the streets are broken up when they're repaired, they're not repaired correctly, and a number of people have told me they've fallen. So I do not know if that, if that this fits that or we need it goes in capital, but we really need that. Does this cover that repairs? Well, do you know which one is it well yeah? No, it would it would, I believe, so. Okay, the streets are really impossible to walk on Betty and I were discussing this earlier. You have a couple hands up for this one: okay, Michelle and then elaine and then Russell yeah. I wonder if under number 12, with all the talk we've been, you know, we've been talking about the esplanade and all the little sinkholes that are creeping up. That are really very dangerous, so I do not know if that could come. That would just have to be a different item, because it's parks so without having a third item for parks. Can we tag that on to one of the preceding parks requests yeah? I think we should. I think we should add that on because we were working on one sinkhole and since that time there have been one or two others that are that have been discovered and it's been. We've been having a lot of conversation about it. I agree yeah thank you, okay, Elaine and then russell squire and there's several more after that. Okay, I just want to say there's a difference between the streets and the sidewalks. There's been a lot of construction on the streets, and I would like to see included in here that DOT needs to hold the contractors accountable when or utilities when Con-, ed or phone or whatever does work in the street. They are to come back and make the street whole they're not doing it not doing it at all. Right D.O.T needs to take some leadership on doing this. I do not know how we put it in there, but there's an accountability piece and going the sidewalks are not the ot, except where we come into problems with overgrown trees, but with root systems. But that's a whole other issue to get the owners of property to repair the sidewalks and D.O.T is supposed to inspect it. So in some ways it is D.O.T that should be fining or notifying landlords that they need to fix their sidewalks. I'm finished. I say that because we'll wait. No, I know why you're saying it. No, I appreciate it. I really do I do not know. I see I do not see you on my screen. Next is Russell and then Trisha and billy, then Barbara Rutter and Judy Schneider Russell thanks yeah. I just want to make sure I understand why it seems to me for this one. You know. Inspection on the one hand sounds to me like a service, but repairing and preserving sounds more like capital, and so I just want to- I guess, just sort of so I'm clear why the latter two would be included in this one or if that needs to be a separate capital item, and I think you know we may want to just suggest putting the repair and preservation portion of it into the capital section. If it's not there already. I think it depends on how much repair is needed if it goes in capital or expense right will. I do not know how the DOT funds the program, but we could we could check. Maybe I actually see craig has his hand up. Maybe he knows how the DOT funds that program, if you want really sure if this would be considered capital or not, but generally with in terms of maintenance, if it's a state of good repair project, that's just part of typical regular maintenance. I would imagine that's more likely to be an expense versus something that more significant repair, which would be a large dollar some type of project that would be more capital related, which would be considered state of good repair as well, but not just typical general cyclical maintenance, yeah. Okay, all right! Well yeah. It was probably a question just to understand what the what the process is. So that makes sense that was all I had is that it yep that was all he had then Trisha and then billy after that yeah. So I just I want to respond to Michelle's thing, so the esplanade sinkholes. That is all capital, so we do not need to add that to this one, it is capital, it is in the capital budget. It is at the top of the capital budget. I'd like to keep it there, we're good on that. So no need to add that there we have it in the we have it in the capital, but on the capital side, it's where it's been before. It needs capital money to do those Repo repairs. This is not an easy thing. These are big projects, that's that billy and then Judy. So I was just going to say back in May the board passed a resolution calling for the Queensborough bridge south out of roadway to be pedestrianized. There is either a capital or an expense need not exactly sure what it would be. Dot says they need to add fencing to that south out of Roadway Council member Kalos and Van Bramer have said that they would fund it, but it's not clear whether they would have enough to fund it and whether that's actually going to happen. So I just wonder whether we want to either here or later in the capital budget, depending on, what's appropriate, specify that this would also include the Queensborough bridge and a fencing on the South Data roadway. Of course, one opening capital pardon, I think, that's capital, but yeah. I was not sure, and I do not know if craig is a problem but yeah if we want to turn back to it on Capitol, that's fine. So next is Judy Schneider. Yes, just to answer Billy's question billy we've been in touch with D.O.T in preparation for our esna annual meeting about the bridge and they are they're not going to do anything with that request. Until the bridge repairs are done, which will not be till the end of 2022.. So putting it in now is pretty much, I think maybe premature. Well does not. We can't request it, they can refuse it, but we can do it and, but I'm just saying next year might be a better time for it. But Barbara. I have a question because I got a little lost with all the comments. What was the this initial request? Was it for some did? It include sidewalks, which one are you talking about, then we're talking about now, the last one we're talking about number 12., increase the number of workers to inspect repair and preserve dot's infrastructure, both bridges and roads. Okay, because somebody said that sidewalks should be included. Sidewalks are definitely the responsibility of the people who own the property yeah. We know that yes, DOT will come out and they will summons them. They will give them stiff violations and the only time that, because we've asked we've made this request, the only time DOT will fix it and back charge which they did years ago now they will not do it anymore unless it's absolutely critical and somebody's going to get killed. If it is not fixed- and I was talking about the streets- but I know the sidewalks- maybe what we have to do is have people call the office when there's a problem on the sidewalks, no and then we'll come report, it that's absolutely the best one. Next after Judy is Elaine and then rebecca Dengor. I just wanted to comment by the repair and maintenance is in expense, because none of these repairs last more than five years and they do not fit into capital. Unless it's a major, you know regrading of an avenue or streets. So I think it's in there because these are not. They are expensive, they're expense because they do not last more than five years they're lucky they last the year. I'm finished next is Rebecca. I'm looking at one of the documents that will sent us, I mean it does say in their guide that roadway maintenance, I.E, Pothole, repair, resurfacing trench restoration is a capital, expense, highway, repairs here and pothole resurfacing of streets. Any roadway maintenance is capital, not expense. What document were you looking at Rebecca, and I sent it to you I'll- just put this to you in the chat too here thanks I'll put that in for everybody to see okay, but I just to go back to this item. You know in previous years we discussed that it was about inspections and the number of workers to inspect and repair, which is the reason why I think it was an expense. So I think we want to request the repair more yeah. Are you done and we'll move on? Yeah? Sorry, okay, thanks, sherry hi! I just wanted to understand the process. I have a new item that I want to introduce. It seems like we're done with that whole list. We have more, I know. Oh, I thought I thought 12 all right. So at some point you will ask I'd like to make a presentation on behalf of the voting rights what to take out because we can only have we can't have more than 25 items, okay, so you'll. Let me know what I just wanted to understand. What time I guess I think we can go up to about 30 or okay other boards. Historically, there's only 25. I think other boards have now started just like having the ability we we're all able to have the ability to have more with this new system, but so when we finish the list we'll take any new request. Okay, thank you, police. If the purpose of item 12 is to address pedestrian safety issues, then I would add in sidewalks and perhaps remove bridges since bridges are inspected regularly as part of the biennial inspection process and that's required, I think, under federal under federal rule. So maybe just emphasizing the explanation that this is a pedestrian safety issue, an instant to inspect and repair roadway surface and sidewalks and bridges they're, probably not city funded, it probably is it might be city funded, but I'm not sure it impacts, Pedestrian, Safety, okay and then elaine and that's the last hand up for so far for this item. My issues have been covered. Thank you. Okay, number 13 is address. Illegal conversions and uses of buildings, hire additional department of building inspectors for compliance and code enforcement and hire auditors for application applications. I think that's definitely needed, but what the response was. This request has already been funded. Sorry to laugh, you have one hand up from Michelle yeah, since this is a request from the department of buildings. Can we just add the word signage to that? We have a lot of illegal signage. I think it needs to be a separate item. This is about it uses a bill. No number excuse me. I just wanted to say number 13 is requesting additional DOB inspectors for compliance and code enforcement, and traditionally an inspector from the DOB is also the person who inspects the signage. So if we could just put the word in there, okay with me, I was going to give it its own number, but okay and then marco and then Elaine hi everybody with respect to illegal conversions. I think this is the time to put it to be more specific and concentrate in the illegal hotels, because many affordable housing has been losing with illegal conversions in hotels, transitory transition houses, illegal conversions and I think our effort. It should be more in that part, because the other regulations that Michelle mentioned are commercial, usually the population they call to the for illegal conversions. We have several buildings that have been converted in hotels, illegal hotels, and I think we have to specify these expenses. For that part specifically. Thank you. I wanted to support what Michelle is saying about the signage it does belong in the item we're discussing. We have tremendous abuse of signage and they have told us at DOB. They do not have staff to go out interesting. They can go out to other areas and provide service, but we need to push that our community needs help around the illegal signage. That's going on finished. Thank you. That was the last hand up for this item number and there's another page after this. So number 14 is provide, expand or enhance, prevent preventive services and community based alternatives for youth. It provide additional funding for children services, especially programs, to prevent abuse and neglect. That's number 14., there's another side of that. Page people got it in the mail and they you have one hand up from elaine. This is an extremely important service, particularly during the pandemic, but I have seen no response, no visibility from acs on what our challenges are and what the stresses are in our community. They focus everywhere else, but we indeed do have a need for preventive services for children, abuse situations. People say it's on the ir. Uprise, but we have yet in all my years on the board ever seen, acs come to us to discuss this issue, so I think it's an important piece. I know it's low on the item, but I think we should continue this because they have not provided us with what we need. You have one more hand up from Michelle, oh and then another from Rebecca. I just wanted to note that on number 14, the agency response is ridiculous. Oh they were all ridiculous Michelle I mean this just says: if you want additional information who to call that's part of your response, the responses get worse year by year. I can't even complain anymore about it. Okay, number 15. You have one more question or one more comment from Rebecca Dengor and then you're ready. I just want to echo what elaine said. If anything I think. Last year I even asked for us to move it up a little bit so once we're finalizing, I think if maybe we want to move it up and hope that we'll get a better response by showing it. I do not think it will remain a priority. Okay. Number 15 is sign. Additional traffic enforcement offices provide funding to increase the current number of traffic control agents. Any comments yep couple russell than Tricia, so I see that the response refers to Crossing guards and it seems to me that I mean, in my opinion, that's the most important aspect of this request and I think that I would suggest specifying in the explanation that what we want is in particular is more crossing guards and that that's that's the priority to me. That's the most important aspect of it. So that's a suggestion. That's all I have Barbara's muted, oh thanks, barbara you're, muted, just unmute at the bottom of your screen. There you go, I what I said is we said we said that in the explanation we talked about school safety agents in Crossing guards. Okay, I see it in the response. I do not see it in the in the exponent. I think the explanation just says: traffic control agents, but in the next column it says New, York, Police, Department. Funding to currently current is currently available to maintain both the school coursing guards and school safety agents head counts. There is no funding available to increase oh yeah, okay, so they're drawing a distinction. So I'm just saying I mean I think the point is just to emphasize that the people yeah the school crossing guards are the part we want. Is there anyone else? Yes, Trisha, then Judy, then craig. So I just want to see I'm looking at number 15 and looking at number 16 and seeing a lot of similarities, and I'm wondering if this is one of those areas that we can combine. I guess I would defer to craig and to Barbara Chalky to see if this is something that we can 15 was we want to emphasize the school gods. I think that's a separate funding stream. Okay, then the then the traffic enforcement unit. Yes, it's separate, okay, then. My other question is that for traffic enforcement unit, which I know is the next one. If and I guess my question is to craig- if we can add something about placard- monitor like monitoring placards, to cut down on placard abuse, that's something that we've talked a lot about, and I do not know if that's something that can be added to this one just to be added craig is I'm going to go, just went out of order and skipped Judy for a second all right, Judy, actually, trisha. I was going to make the same comment regarding placards. I guess my opinion is that we should keep these separate. I think they're in terms of gifting understanding and emphasizing the need to have school crossing guards as well. I think, if we're talking about traffic enforcement officers, we also need to ideally have more more officers for traffic control at high volume, high congestion safety compromised locations within the district like near the 59th Street bridge and near the exits. We know the issues on second avenue and even coming off the bridge at the Fdr drive in 96th street, where they're already there sometimes they're, really critical in terms of keeping traffic, hopefully moving, which of course has impacts on air quality and air pollution and safety. So I do not know if that could be added to it, but that's also, I think, very important as well and then regarding 16, absolutely placards, and I think we, I think that a lot of this comes down to just traffic enforcement in general parking enforcement, because we've talked a lot about issues regarding not just platform abuse, but double parking issues and the quality of life issues that causes whether it be fairway on 86th street as an example, or some of the other examples that we keep hearing about right. So I would, I would do all of what craig said: keep him separate, add more traffic control to the first one and then add placard Placard enforcement and general parking enforcement to the second one. Thank you. Okay, next, after Trisha was Judy Sorry did we skip to Judy? That's okay, traffic control agents, desperately needed here in the 60s, especially with these new bike lanes that make 61 and 62 narrower traffic is backing up on first because it can't the traffic is stopping on first acrosss traffic and there's no agent, it's stopping on York, it's stopping on. Second, it's stopping on third, so we need traffic control agents and that request should not be confused with any other request. It's a desperate need. The bridge, as craig mentioned already, has a high volume of accidents and I think death. Even we need traffic control agents. I can't stress that strongly enough for the 60s and I would not want to see anything mixed up with the traffic control agents thanks, Judy Craig, you still have your hand up. Oh I'm sorry, I guess just in response to Judy. I I'd suggest if there is room for another item that perhaps that becomes a separate listing traffic control agents. Well, we'll try to add it. We may we can. I mean Elaine. Walsh is the last one with her hand up on this. I think we need to add something about the traffic control, since the police are not doing it. The monitoring of the bicyclists- oh yes, who are not following any of the regulations and has become a dangerous public safety issue, whether it's bikes or scooters, but there's no enforcement of whatever is on the road. That's not two feet or a four- wheel, car yeah, to add something because it's become a problem crossing the streets going. You know I do not. You all know what the problem is. We need to have some enforcement here and I have to say, with all of the accidents going on with the bikes is that there is- and maybe it does not belong here, because it's a state issue, there must be a process to have people, take lessons on how to ride a bike, etc, as we do with cars licensing. So I just say we need to put in here enforcement on the bicyclists they refuse to ride in the direction they're in and they're all right on the side. Thank you and they're all on the sidewalk. That's a whole other story. Thank you all right. That's the last hand up for that question or item is that it? That was the last for that item so on to 17 and, I believe, actually just 16. I do not know if you read out loud, okay, seven yeah we did do 16:17 is increase. Health inspectors example for restaurants. Well, I do not know what they're doing now with I do not even know if they're respecting health inspectors and inspecting restaurants right now, but we can't it's even more important now during the pandemic, we have to make sure the restaurants are following the rules. You have one hand up for this one so far, Trisha I so I can. I can tell you that they are doing health inspections. I've have friends who own restaurants in the area they are being doing health inspections. I just wanted to mention that I think- and I guess I would defer to the group I'm going to push for this in the in the new stuff too, or we can do it here, but I think that we actually need to be calling for something very different with relates with release to our relation to our restaurants. I think that we need to be calling for additional supports and programmatic abilities to help our restaurants and other small businesses survive. So I would I would really I can tell you that they are doing these food inspections already. I would rather us talk about ways. I would rather us turn this into requests to the small business services and others to create grants and other opportunities for more funding to help our small businesses survive. Okay, that's separate item I think will any is that it one more sherry, Weiner yeah. I would think we need to expand the the explanation to take into account. Covid-19 enforcement, which I think is. It is different than just health inspection, it's adhering to appropriate Covid-19 regulations. That makes sense, so I think I think, just under just under existing under explanation. I believe it's still the health inspectors who are doing it, but I think we should expand that we want funding for people to be going out to the different restaurants to make sure it's not even just restaurants, I believe it's food stores and other all retail establishment. I think I think it needs to expand. We have to identify, I think, is that we need to identify that there's a need for Covid-19 enforcement, even though I know you're saying it's next summer, but you know who knows how long this may be. I do not want us to lose track of when this budget starts. It's July yeah. I understand that. Okay, no, I'm not saying no, but I just wanted people to know that. Okay, thank you. That was the last hand up for this item. Number 18, enhanced programs for elder abuse or victims provide funding for eviction prevention services for at risk senior citizens. It should be for all for at risk, and the housing committee is working on this and evictions are supposed to still be frozen and there's not supposed to be evictions for anybody seniors or non- seniors so that have to stay in there. You have one hand up Rebecca. I I'm just going back to the fact that you know this will start in July. I do think it needs to stay in because we do not know. I do not know, what's going to happen yeah now. I hope we hope I mean it's been extended, but not enough yeah. So I would vote to keep it yeah. Okay, number 19 is extend library, hours or expand in here. This is we're talking about Sunday services, I'm waiting for services during the week now, but we I think we should keep it in and there was a whole of a group of requests. You have that list will of the what the libraries were requesting. Yes, I have it do you want me to put it up or we can put it up at the end of we can put it up at the end. If we do not cover it yeah, I think we should still keep Sunday services in, but I do not think it's going to happen in 2022 no hands up for this, so the next one is other garbage collection and recycling requests increased recycling program, including solid waste. I think they cut back on the solid waste they cut back on some of those programs, so I think they have to stay in there. You have a couple hands up for this one Chris Craig, then Rebecca, then sorry, Barbara Rudder, I'm not sure if it would fit into this category. But I would like to see some mention of composting in here. I did not hear what somebody just said. I can't it was not clear composting. Can you hear me composting yeah? We should put it back in yeah that can go in there. I think. Thank you all right and then I saw Barbara had her hand up, but she's lowered it. So I think she yeah she said. Go on. Okay number 21 is other public housing, maintenance, staffing and management requests. Increased funding to ensure all NYCHA community and senior centers remain open. Maintain all current open space. I think it's. What I think is there's real problems there with the NYCHA buildings. We just found that there was a problem with ventilation in the NYCHA buildings- they're, not they're, not ventilated properly, which makes it much more dangerous for the threatening of the riders, and I think we just need to keep that in there like that, it's a real problem with NYCHA. You have one hand up Fleece. I just wanted to say that I thought that this was a really important issue and then maybe we want to consider moving it up in priority. We've also talked about what we could do as a board in terms of equity and inclusion, and so we should be taking a greater emphasis on what we can do to improve the NYCHA housing in our community yeah. We do not have a money much of it, but I think that I agree that should be. That could be moved up. Last question on this or last comment on this is Russell yeah. Also on the NYCHA point- and I do not know if we can combine it into this one or if it has to be a separate one, but what about services sort of basic repairs, lead removal, that's way behind things like that. I mean, I think, that's another thing that I think that's I think that's included them because it says community, centers and senior centers right maintain all current open space. So it does not address repairs, and I think I think, item 23, which you guys can look down to is probably where that may want to fall in that's right, yeah, okay, yes, and maybe that should be moved up too just provide more health and building inspectors for Natchez facilities, and I think that when we'd gone over it previously that this was sort of the one about lead and mold and everything we could be more clear about it. Probably: okay, yeah, okay yeah! I just I was looking at this page, so I did not see it but turn on turn the page number 22. I do not know why it says other expense budget request why it's put that way, but fund additional DCA inspectors for sidewalk, cafes and compliance permits regulation enforcement- I do not know if anybody's doing that now no they're not inspecting those right now, but again, fy 22, something will be different. You have two hands up, hopefully yeah, sherry and then gail. Perhaps that would this is may perhaps a better place to put in my suggestion on the Covid-19 enforcement as opposed to the other, which was the health department. Maybe it's DCA who's doing no idea. I do not think they do enforcement. What does not? It say the issue, I'm just what's that? Well, it says DCA inspectors would seem to imply enforcement. Okay. We also need to update the language, because it's no longer technically the DCA, it's dcwd yeah consumer worker protection. Do they have not do they do the enforcement? That's, but I'm not sure somebody is definitely enforcing like the number of people who are in restaurants and oh yeah. I do not know who who's doing that. Well, maybe we could research that, because it's not technically food inspection. It's in you know it's Covid-19 inspections, compliance inspection and compliance yeah, it's a compliance! That's why I'm thinking it may be more appropriate to put it here than in the previous number, which just dealt with health inspections. Next is Michelle and then Marco and Judy. I do. I just wanted to say that the DCA, when it refers to compliance here, it's permit compliance. They want to make sure they have permits, but the DCA is not an enforcing agency. That's what I thought, but they permits are working differently right now right, it's the permits like, for example, if a vendor has a permit, the DCA would deal with that, but if the vendor has an infraction, that's that sanitation, if it's a food vendor and it used to be the police, it no longer is so that's not what that means here. It's just compliance that they have a permit. Next, marco, I think who enforced the Kobe regulation is department of Health right now, all the restaurants, the Department of Health. They ask to the restaurants to comply with the 25% capacity. That's what they're doing right now departmental health, that's it! Thank you. Thanks and then Judy is the last person with their hand up yeah compliance for what DOT is issuing the permits, the DOT issues, they're doing the enforcement for their permits. Thank you, okay 23. I think we discussed it before improve public housing, maintenance and cleanliness. That's where that maintenance comes in. Should we put add repairs. Maybe if you have two hands up maintenance and repair, maybe marco and then Russell. I should put his extermination because I read the violations in NYCHA. They talking about bed bugs and I think they should be included in that part. Thank you, Russell yeah, so I would call out lead specifically also as another item that really needs to be addressed, but then to your suggestion, Barbara yeah. I think we should specify that we're also talking about the actual repairs and not just not just the inspectors. We have Rebecca and I would also call out mold specifically as well. Oh definitely, all right. All those are noted, marco. You said something I forgot. I forgot to mention: NYCHA has 3,800 complaints of repairs in the building and the majority is are the elevators and I think we can include that part in this case, so elevators and extermination of bed bugs that's what I read in the in the violations. Thank you. The last hand you head up. Okay, number 24 is Enhance park, safety for more security staff, police or park enforcement, and that's the pep offices, and that I got calls about that too. People want more pep offices, trisha hand up yes, so obviously, this is something that we get concerns about all the time with, particularly with the Misuse of park, space with dogs and other things like that, it's just something that we just need. We specifically we need pep officers. This is these. Are the people we call all the time for whatever comes up that needs to be addressed, so I just want to say that our parks and Waterfront Committee get these concerns a lot and Judy yeah. I agree with Trish and I would like to see this moved up. We have always had it at the end of the list. I think this is nothing really matters it is on, but I do not care where we put it. My personal opinion is I'd like to see it moved up. Certainly in this time of Covid-19, that is not going away soon. Our parks are getting much heavier usage than they had before, and I think the pep officers as Trish said, are extremely important. That's the last hand you had up for this item. The next one was to provide expand to enforce rental assistance programs. I obviously think that's very important. It's very general statement because most of the funds will be state or federal funds, and I do not think we're going to see that, but and they their answer is. This request has already been funded, so you do not need anything more because it's funded already. That's absurd answer. I think that needs to stay in no hands up and 26 is plant new street trees. Anything on that one hand up from Tricia. I would actually like to combine this with another one. I think that the Tree Street pruning thing, the one that we had already with trees. I think it's a different item. Yeah new trees is different than okay. That's fine! Just trying to trying to reduce. I think it's, I think it's a different item. That's fine! Marco has his hand up. I think, in this planting news street trees, I found a serious concern because in Manhattan we produce we build, we repair so many buildings and we change the use so many buildings, more than 25 and all of them are required to provide one tree within 25 feet and if they provide a one tree for every 25 feet they, if it's not possible to plant it. There is not a possibility to pay to give money, but that money go to the or the Department of parks and they plant whatever they want. But we have to ask at the same time is those trees. Those are trees that has been produced or in some way in our community. It should be planted within our community now with the outside of our community, and I think in that part it will. It will lead to to enforce properly the location of the trees, because otherwise we do we spent the most of the development. They do a lot of jobs right here and they plant in another communities, and I think we have to start thinking- is to put trees in our streets. Thank you, Michelle yeah. I apologize. I did not hear the first part of Marco's coming so he may have covered this, but I know that I have requested new trees and as long as I give them a location, the tree gets planted at the requested location. So I think, if we want to do this, you know rather than just say we want new trees planted. We would have to give them a list of locations or at least follow up. You have to do that. Yeah. Thank you and elaine. That's last handout for this. In reference to the tree planting we have in parts of the community Board development, going on where they're required to do planting. Many of them have confronted what we call vaults on the sidewalk, so they can't plant and so they've made a donation to the parks Department. There is no way for us to track this. I think this is important because we are going to as I'm sorry as president of East 86Th street requests that DOT the eleven thousand dollar donation for trees. They come back to the community. There is no accountability or transparency. What one goes on when a developer is required to use plant trees, but can't because a plant of vaults, so I'm asking to modify this to ask that any development that's required to have trees, and they all are that have come back to our community, if not in the present site, but in the location. So how we modify that, I really would like to see us do because we again are losing to other communities what it we are entitled to in our community. I'm finished. Thank you. Well, that was the expense budget. I think we pretty much agreed that all the items should stay in somebody had a recommendation for for a an additional item with somebody wanted to add an item. Trisha has her hand up, but I think Sherry was the one who was also asking Gary. You asked he had one. You want to go first. Trisha has already has her hand up so, since I can see her can I can I ask mine first, if Sherry's not, I do not know where Sherry is. Yes go ahead, okay, so this is. This is going back to our small businesses. We have nothing in here that talks about risk ball business recovery, and I can guarantee you that with one in six small businesses closing in New York City, we will have this problem in Fy 22.. I have no problem with that, but remember this does not feed in until July 2022., which is what I just said Barbara. This is going to be a continued issue. This will. We will still fill the repercussions of this for that long. So I think that we need, and I'm going to push for in a list of 26:27. I would like to see that this be above number 15.. I do not I'm not going to get involved the way we move it to, except if you want to go to 6 A.M, so put it wherever you want, I'm not going to I'm not going to get involved in that, because I think I was doing it moving. You know I would just like us to. I would like us to have, and will I'm happy to send you the language but I'd like us to ask for additional financial supports and other and other type of resources be allocated to our small businesses to help with recovery, and I am going to just ask that we move the NYCHA items up the maintenance of NYCHA items up to okay, yeah, sherry, head, Cherry hi. This is a recommendation of the voting rights reform task force every year. We have complaints that there are not enough voting in- person voting locations now for not only the regular election, but for the early voting. I would like us to put in a request for additional funding for voting locations and to have mechanics available to fix the voting machines when they break down. This has been a tremendous issue that they only have like one mechanic for the whole borough or something and there's no and they can't come there. So I have a dual request under voting reform resources. Huh. I think it's a good idea, resources to for additional in- person, voting and also res funding for mechanics to make sure that the machines are operating. That would be my recommendation. Additional drop boxes. Well, if you had, if you had voting more voting locations, you could have the drop. You would have been more drop boxes. I do not know. New York seems to have a model that they only want to have drop boxes at voting locations, whereas I know like in New Jersey. They have drop boxes at city Hall, but that does not seem to be the New York model, but I think if you had more locations, you would have more drop boxes, so I think it goes hand in hand, but it's just a continual issue and it does not seem like it's going to go away. People just do not trust voting by absentee, so I think we need more in- person locations. Let's see what happens this year, okay, anybody else, yeah one more Gilberton. I would like to second what Trisha has said about resources for the small business community, because, frankly, even when the pandemic is over, recovery is not going to happen in a year or two, so the more resources that we can provide to our retail to our restaurants, to all of our other small businesses. It's what we need to create the vibrancy that we want to bring back to New York City, and I also agree you know if we decide where we want to start to prioritize within the list and I'm sure barbara, that the funders look and the agencies look at all of them and they may not look at number one versus number 26. But I think that this is so critical to the economy of the city and the vibrancy that I'd like to also see that small business resources will go somewhere in the middle versus town. That makes that makes sense. Now, as we went along, some people were going to send in language. I think that's important to send will some new language with the understanding we do not know. If we'll be able to put it in the way he had to use the drop boxes, to get the language so right, he'll come as close as he can yeah, which makes no sense. While we have to do it that way, but right, okay, we recommended one year that they change everything. Of course they ignored us. Okay, yeah. I do not have anybody else with their hands up for expense, so Barbara Rudder has her hand up for expense. A little confused. The drop box is just a general category, but the language goes in. The explanation. Does not it that's free text. Am I right yeah, so the language is very important. It's explaining what the dropbox is. That's all I have to say. No, that's you're right. We just try to match the right things to the right things. Yeah, okay, does everyone er Rebecca, has her hand up and that's the last hand up Rebecca, I forget: is there a character limit for the explanation? I think so, but I do not have it up. I kind of remember that, but just if you're writing explanations maybe try and bear that in mind, because I vaguely remember there was one last year, but I could be wrong. Okay, is there a motion to adopt the expense budget for 2022, taking the 2021 budget and the changes we made go ahead? I think we have a list. There were a bunch of items about moving things up, I'll, tell you just okay, you want to do it now. You want to do it like a 2 A.M when we finish the budgets, I do not care when you do it. I do not I'm not looking at that. I do not. I can't deal with that right now. So just any changes anybody wants to make just we'll have to vote in each change and then go back and vote on the whole budget. Gail has her hand up and Sherry has her hand up. Well, maybe we can just as a group decide which our priorities are. I do not think there were that many that were going to be moved up. You know we asked for small business services. We asked for schools a couple of things with parks, so if we can just decide, maybe we can just do that pretty quickly, barbara, to make it easier. Okay, yeah! That's what I meant with the changes that were made and include those in the 2022 budget. Correct! That's what I meant! That's what I meant! I'm sorry. I was not clear. I can propose an idea that might help everyone and feel free to shoot this down. We could create a forum for everybody who is in the meeting and we could list the and let you prioritize in a Google form that you guys can do over the you know over the next few days, and then you know we'll build the list based on how you guys prioritize about the open meeting law. For that, I think we need to vote tonight. Okay, I'm sorry, I'm just concerned about it! No that's sherry! I would, I think we still need a motion to approve yeah I'd like to make a motion that we approve the expense budget for 2022. for 2020 for 2022., and I would leave it up to Barbara and will, after hearing our comments to change the priority or if there are not that many that we've requested to be moved up. I think that would be the easiest way to do it is there a second to that motion? Yes, I see, Felice gave a thumbs up and Michelle gave a thumbs up. Okay, anybody want to call the question Michelle. Is that what your hand is up for? Well, that's, okay, but what I was going to suggest is my recollection. Is it's only three items that we're requesting to be moved up and the request was specified somewhere in the middle, so I would be okay with Barbara and will just putting those threes somewhere in the middle and leaving it at that. Okay and I'll call a question. Second, so should we do election, we usually do anybody voting to know or abstaining. Yes, I think on calling the question or calling or the all in favor of coin the question: okay, anybody who wants to abstain or vote no, please raise your hand, rebecca Dengor. This is just a reminder for the record that Ed is not back yet, so we should not include him in the tally. I was going to read the list of people who are here. Okay, elaine has her hand up. Oh, she does not do you said 20:22 is not it the 21:22, no we're voting on 2022 that begins July 1st. That's what we're voting on tonight. We did the that's. We did the 21 22. now the fiscal year, 2022 is definitely fiscal year begins July 1st 2022. we're responding to. We reviewed the 2021 and now we're doing the 2022.. Okay, fine, I know that's how they do it. We adopted the one we adopted says fiscal year. 2021 was the adopted budget that I think he all should have gotten Russell. I think it's still a little unclear. Is it it's the fiscal year? 2021 is the fiscal year that ends in 15 in 2021 right. It ends in July 2021 and the one we're talking about is the one that starts in 2021 and goes until 2022. right, but it's called the fiscal year. 20. understood understand. I just wanted to make sure that yeah, so everybody is voting, yes on the expense priorities for Fy22 and I'm going to read off the names just so it's in the public record and in the video Barbara Chockey Barbara Rutter billy Freeland Brand, Correa, Craig, Later, Elaine, Walsh, Police, Farber, Gail, Barron, Marco, Tamayo, Michelle, Birnbaum, Rebecca, Dengor, Russell, Squire, Sherry, Weiner, Trisha Mamura, and we can move on to whatever capital or is that what you want to do? Barbara? Yes, okay, now we have the capital budget again. There's the responses there. Okay number one was services for the homeless. Department of Homeless service should work closely with HPD to fund much needed housing for the more vulnerable and out of our residents. We ask that this request be given the necessary funding and highest priority in the five- year plan and what their response was. This request has already been funded. Any hands up. Anybody want to say anything, no hands up right now. Okay, we do not have to re respond to the responses, because I'll just get too upset number two sherry Weiner has your hand up. Sorry, Barbara is the nursery. Is not this an expense item. I do not see how it falls on. We want them to build housing. That's an exponential capital, oh to build housing, all right, sorry, on much needed housing. They have to fund the housing and then Rebecca, Dan, Gore and Michelle have their hands up about this. I I'll let Michelle go. I was just going to remind everyone of what she said earlier about building new schools and I triple checked and it's definitely a capital expense, so it should be added. Okay, yeah Rebecca! That's exactly what I was going to talk about. I would like the building of schools to be moved to number one: okay, let's, okay, fine, it's! Okay with me. I think you have to request what kind of schools you want elementary middle and high school. Okay, I think they're all different different items. I know the way they do it. If they are all different items, then let them be one two and three with the most pressing, actually being high school and then number one middle number, two and elementary number three, because we have more elementary than I either of the others. Okay, it's okay! We have enough room for all of those. Okay, then what was number I'm not going to read, I'm going to read the old numbers. Okay, the next one was okay, so we still want to keep the request services for homeless in right, yes, but it would be moved to number five. I know I know, but I said I'm reading the old numbers. It's too confusing to me to read the new ones. The next one is creating a new or renovate or upgrade. This is the public library will do they put this on their list? This is my thing we put it in every year. The Yorkville library is not accessible, it needs a ramp and an elevator. Let me really quickly pull up what they said. Everyone yeah every one of you should have received a copy of it. They have for 67th street a ADA lift replacement, and that's the only thing. This is the Yorkville I'm going to still put it in, even if they do not, because the library heads told the local librarians not to include it, but you can't get into the library if you have senior with a wheelchair or crutches, and you can't get in if you have a child in the carriage. So I'm I Wanna, I I'm adding that one, even if they do not wanna add it. If everybody agrees, it's not accessible at all, no hands up so, okay, the next one is to provide funding to repair, restore and design the entire esplanade, including the piling on the lower level between 60th and 125Th Street and in soil below ground infrastructure. To expand water access along the entire Esplanade Trish. Is that right? Trisha has her hand up. The only thing I'm going to add is, I suggest, adding is expedited or in some way adding some sort of like kind of immediate urgent need for this. So if we can add some sort of language there, I'm happy to play around with it and will I'm I'll add something there to express that this is an urgent need. Okay, the next one is again a library one, providing funding for a new HVAC system on the Webster and Yorkville branch. Libraries tell me again what HVAC was. I think it's about the book distribution right. What was the question Barbara HVAC? What is that again? This is for webster and heating and air conditioning, and we have three questions or comments on this or I think, a couple. The library had that on their list. They did not well. I think okay then call on the people who want to make comments about this, marco and then Russell and then Judy I was, I was raising the hand on the Itunes number three I was. I was talking to one of the reps from the Park department, because how we're going to repair and do all these kind of jobs? If we do not know what is the condition of the sea wall, and if the sea world is not prepared, it's not well in good condition, you're going to keep repairing every single day and kind of waste money and the permanent parks they are reluctant to release. What is the conditions of the sea wall, because if somebody else coming with technical issues of piling, that probably is more likely there are, they do not understand. What's fine, there is a different kind of techniques for the sea wall and therefore to put something to waste money. I do not think it's a smart idea. We have to organize appropriately welcome. They have till July to figure this out, and I know we have to what we have to do is we can recommend to have a diagnosis, appropriate diagnosis of the series, much better? What are they requesting Trisha? Do you want to respond to that yeah? A couple things I mean? Yes, we've had we, marco we, you know, we've asked for we've asked for these reports. I can follow up with them. This is capital. This is not a even a even another, which and we've also passed a resolution calling for an immediate study to be done on the esplanade and it's and its structure. So I think that this is, I mean either. I think that I stand by this being this being the request, because it's a capital request and there's some actual structural repairs that need immediate, addressing and then in terms of the, in terms of the request for a for a study to be done. This is something that we, because this is Fy22 we've already asked for this now we've asked to be done immediately to in complete in a complete agreement with what you're saying. So this is something that we've done. We will continue to do, and I absolutely hear you, but this is this- is capital and I'm and we're calling for this. You know for that side of the budget. Well, I had to be in this agreement. This is not exactly what I'm saying. Probably you do not understand what I'm saying and the issue the bottom line right here is you kind of put money where is currently is in poor conditions, you kind of put money in the black hole. You have to keep putting money and money in the black hole and never can I end it and we have to stop that. We have to do something tangible, something that is safe, sound for everybody and no every single year. Oh, it collapsed right here. No, we repeat right here: oh they're, coming with different ideas of different problems, every single time and everybody go and take a picture. Oh look what they did! Look what we find it. That's not the way that we have to assess our the condition of the explanation we have to make. Something is something actually that we can follow up and the best way. This is a capital investment, and this is what we need to have an a real study of the wall, because at the end of the day, probably will be more likely right to repair one section. We have to start thinking to put a new wall parallel to the existence, but I do not want to come with the solutions without even understand what is exactly the condition of the sea wall and what we had to do is obviously to have an emergency repairs. Yes, obviously we have to keep having this money put to repairs, but meanwhile we have to have this study, but no one studied that just only one part of the section, we have to see the home the whole explanation. So then we can repair properly and see the outcome of this investment see and the future and the benefit of the community. But in this case it's not only the esplanade. The major issue is, it is going to erode and destroy the fdr, because when it's coming these kind of problems it erodes it continually to the to inside of the land and that it will be affected the fdr. So we need to do a something comprehensive and reasonable. Piling is something that probably maybe they use in all technology. We kind of use all technology and all ideas. These ideas are all we have to come in with more modern ideas and repair properly our explanation and I'm talking different what er Trisha said completely different: it's nothing equal! Thank you thanks anybody else. Yes, there's a lot of hands up right now we have Russell and Judy, then Michelle and then Barbara Rutter. So I think we had gotten to four. Also in my comments about four, and I think we should move this item way down. I think it's four is the HVAC system at the branch libraries, I think in terms of priority. It's less significant, wait a minute. You want to move that one down: okay, yeah! I think it's less of a priority. The capital really does not matter. I do not care where you move it too. Okay, I guess just sort of well so at a minimum. The other point I just wanted to make is there's another. I think there's another HVAC library item yeah, they may be separate. It helps to be all separated, but yeah they can be separate, but I would sort of also group them together in terms of okay. Well, I'm not saying I do not care where you put the capital budget. I would just move this one down to where the other library HVAC item is that's my suggestion and that's I'm done. Judy Schneider Judy disappeared, okay, Michelle with reference to Marco's comments. Since we have room we can do. I believe we should address it. I do not care which way the committee wants to do it, but I think we should address it. So we can have a separate request for a capital project on the sea wall or we can add it to number three put the word seawall in there. Whichever way you want to word make it stronger, I think it should be a separate one. Okay, so let's say that- and maybe marco wants to provide the exact wording since he very clearly understands the situation, but let's make it another one and we should cluster it next to this next to this one so that at least they're one after another. The sea wall item should probably precede this one just logically Barbara Rutter and then, if Judy had anything. She wanted to say about this item. Raise your hand again Judy, and you want nutrition also, because I want her to you know to have the discussion about it. I think this whole thing with the espionage. I have two comments. First of all, they do not just patch it the old days they just came in with plastic or whatever and shoved in a hole. They have an engineer going in now and they have some idea, but in terms of studies trish am I right that they do periodic studies and the next item. I do object to saying we need to do one study from 60th to 125Th, because it is impossible for everything to be done. You're talking about hundreds of millions of dollars, so I would I what I like is when they did was study to have the priorities and maybe to work on more limited. You know the high priority the higher priorities, one there seems to be this idea. We could have one study and fix everything at once, and you know unless we end up with a billion dollars. I do not see how we're going to do it, so I wish we would structure it. So it could be more realistic. I do not know Trisha. Do you have any comments I just want to so I want to just okay. I will try to be brief, so I keeping in mind that this is 20 that this is Fy22. I think that we need an immediate study of the esplanade, which is why we passed a letter. We got a letter so when sent over to the agencies, which is why we passed a resolution calling for an immediate study of the esplanade. The last study that was done was in 2018, completed at the end of 2018 into 2019, and we called for an immediate study of the structural safety of the esplanade. I think that needs to happen well before 2020 Fy22. I think it needs to happen yesterday and it needs to be done to look at the entire structure of the esplanade. That's why we are pushing for it and why we've continued to push for that. I understand I guess I do see if Michael, if mark excuse me, marco, is concerned about the word piling. I think that we can change that. We can add sea wall to that, and I think that and to be more specific about those things, but I do think that we are being broad enough saying that we need the immediate and urgent funding to repair and fully restore and ensure the structural safety of the entire esplanade. I think that is that is being comprehensive and taking this very seriously and pushing for this and not being specific as to or too prescriptive in that process, the other p. What was I thinking about the other piece to this and then in terms of adding another item to this calling for another another study to be done sure. But again, I do not think that that's capital. I think that that's expense. So that's my piece on that. I remember it being very expensive. Is the study still around a million dollars capital versus budget? That's what I I'm sorry capital versus expense in terms of budget, not a descriptive quality of how expensive it was. But I do not remember the exact the exact amount of the study, but the last one was done in 2018.. We've asked for a copy of that study and I and and we've also asked for another one to be: we've passed, resolutions sent letters. I've made phone calls on this. We've done everything we've been trying to do to get them to study the structural, the structural integrity of the entire esplanade. Now hey Barbara. Are you done yeah, okay, thanks Judy and then Michelle Judy? Can you hear me nash? I agree with what Trisha had to say and I, when you ask for the esplanade, you can not split the sea wall from the esplanade. It's integral part. You can't fix the top without fixing the bottom and to answer Barbara's very first question: HVAC means heating, ventilating and air conditioning. Thank you and then Michelle, Birdman yeah. I think the sea wall, whether or not you're separating it from the esplanade, no matter how the wording is Marco's, going to work on that. I think it does belong in the capital budget, because I'm not asking for a study we're asking for repair. We presume that when you want repair that they will send engineers out to do a comprehensive evaluation, I do not think we have to talk about that, and so the repairs of course I think, belong in the capital budget, Trisha and Marco yeah. I completely. I agree with that. Michelle Wholeheartedly, I think, repairs absolutely go into the capital budget, marco. In the in the last meeting with the Arks. I purposely, I ask the person from parks. What can the engineers you have, and I ask if they have a geological engineer, a hydraulic engineer. They are the expert. A structural engineer can not do that. It has to be a person that understands dealing with water, and this is where we, this is a specific field that is extremely important to have in their team, so when they have a contractor to repair any sink or any holes in the esplanade, he has to be right there, because you kind of give the authority to the contractor. The contractor must follow the instructions of the technician. This is what there is one specific field and that's what we need to hook that the parks Department should have one of these engineers to be present at that time. Not to give the contractor all look because they described that it has been looking everybody. No, the issue right here. It has to be an specific professional, because this is not simply matter to deal with. Water is hard, it's sometimes become impossible, but that is where there is a specific feel for that. So my impression is probably we can recommend in one of these items, that the Department of parks should have one of these engineers and their team so that we can have something better opinion about the issues that may raise in the future of the esplanade and in addition to that, it will lead directly not only to the erosion of the Fdr, but also may lead to the floating area and the three parts that specifica specifically happen in our community: low, 60s, mid, 70s, low or 80s, and then in 96 street that basically, it will describe how we're going to repair and how we tackle combine this problem that affect those buildings in that section. So not only is the Fdr, but also are the buildings that are affected and that's my concern. That's what I'm looking to have a completely to know that the completed situation of that of that sea wall, because once we know exactly or then we can recommend what we to what to do in the future. And meanwhile, if we can keep just only spending money spending money in reality, we need that. Definitely. But the point is we have to stop what the point to is: keep spending one and two usually small works are extremely expensive. If you have a big job, usually are less expensive. So for that point of view, only we need to have a good consider good diagnosis of the of the S plan of the sea wall of our district. I'm not ambitious to go to 125Th, but at least within our community, and that's basically, we have to discuss in the boundaries of our community. I do not want to be ambitious to go to 128, it should, but that is not our role to involve to other communities with us is too much already just imagine to include another community world if they are willing to come and work with us fine. But meanwhile we have to just only think in our section probably 96th street may we have to start thinking probably to what maybe to 100 or more because that section it flows in the area of the NYCHA buildings. So this is why extremely crucial is to have a good diagnosis of the sea wall. Thank you tell you have your hand up. Yes, thank you. While everything that Marco says is very valid, I think, for the purposes of this of our statement, our explanation, I do not think we can include it all. I do not think it's necessarily our place to tell the city engineers what kind of engineer they will or will not need, but I do not think it's a bad idea to include in the wording which marco is going to outline to just include in the wording before repair to just say, we'd like a complete diagnostic and repair, and you could maybe add so that the correct engineers are involved, but I do not think that's about. As far as I would go, I do not think it's our place to tell the city of New York. This is not their first rodeo, so I do not think we need to tell them which engineers they use and for what reason. But if you want to work those couple of words into a statement that would be appropriate as an explanation, I think that's a good idea. I have no problem with it. That is the last stand up for this item. Anybody else nope, no more. Okay, the next one, which we really discussed when we're talking about expenses, is a roadway maintenance example. Potholes, repair, resurfacing, Tren, trench restoration, etc, provide funding to New, York, City, Department of transportation for necessary materials and personnel to repair, potholes and repair avenue curb to curb and the major town streets more frequently than every 10 years within community board. Eight. This is what I'm finding very difficult to walk in the streets. I think this is extremely important and needs to stay in the capital budget, and the pandemic is not a reason to stop doing this. Russell Rebecca and Marco have their hands up about this whenever you're ready russell thanks yeah. So my comment is, I just wonder if we can be more specific than just to say more frequently than every 10 years, and if there is a every month when it's needed, I mean I do not know how. I do not know enough about maintenance. How often you need it, but I think you need to repair it when it needs repairing, certainly yeah, and I think- and I do not know what the sort of best practice is either, but I think you know more frequently than every 10 years I mean in addition to the fact that the you know the I think that stuns, because it's done about every 10 years now I think that's what that means. Okay, well, all right, you know if we do not think we need to change it, but I just like you after 10 years yeah I mean why do not we say on a on a regular basis or something like that which is not specific. We need it yeah. Well, I think the idea is well there's sort of two things right. I mean there's stuff that that's broken and needs to be repaired right away. But then, as I read this, it's also talking about just sort of regularly schedule stuff that's going on and I just think they should be evaluating it. This is getting worse and worse, it's worse than I've ever seen it. So that's why I feel very strongly about this one yeah, okay! Well, look if I mean when needed is certainly or as soon as needed. I guess maybe is even more strong than that, but yeah. I just thought we could do better than every 10 years. So that's my! I know I think that's made. That was a little sarcastic. It's probably done every time. I do not know if it's officially done every ten years. Okay, that was it. That's all yeah any other hands up: yes, Rebecca Dengor, Marco, Felice and Michelle Rebecca. Just I again, I think we need to include sidewalks here, but then the DOT does not repair sidewalks. They, the owner of the building, is often repairs the sidewalk, so the owner here, the owner of the building, that's the problem rebecca, so they have to give out. They have to go after the owners that do not repair them, but they do not repair they. Now the city does not pay for the repair or dinos yeah. I just think we need to include it somewhere. Well, maybe that needs to be a violetta sent out to say they have to start forcing this owners to repair them or repair them and build the owner. That's a different, that's a different approach, that's my opinion. Anyway. Okay, it's not a budget item really: okay, marco and then Felice and Michelle yeah Baldwin. Are you absolutely right? The sidewalks belongs to the building owner. They are responsible to preserve or maintain and clean all the sidewalks all the time and- and I think probably, what we can do is some enforcement, and if they I think we can do is what can enforce is especially the sidewalks and demand to the developers that have the empty blocks, such as the case of 79, First, Avenue, 79 and 80 street. This is this is the the developer. They find out that since they're going to put a new a new building over there, he makes some patch repairs and unable to give a good, sound and safe sidewalk. So I think probably we can work it out in that direction in that direction with the idea of Rebecca, I think that we can do that because the developer we do not know when he's going to build the new buildings, especially the buildings on 79th street. That would be a very good idea if we include, maybe at the end or in any other part, and the second part. Obviously I would like to mention I, but where I absolutely agree, and probably that's my first time that I'm going to push a little bit higher than number five, because once a senior fall on the street and most likely go to the grain, so this is extremely important for our community, especially for many seniors that we have in our community and obviously it's actually number eight. Now, because we put three items, it's just only my suggestion, but I think it's a very good idea. Thank you, police. I would rephrase the street repaving to focus on increasing the rate of roadway repaving in the community board to ensure the streets are maintained in good condition, since that's the standard that DOT uses good, fair and poor, and I think the focus is on Eczema street resurfacing, so we can make it awful. I think, there's right now. It seems to me that there's a big gap between when they're milling the streets and when they're repaving it- and so that's just left it in really poor condition for pedestrians trying to get acrosss there ha in recent years. The city has had a lot of money to do street resurfacing. I think in the budget we're going to see those numbers be being cut, and so I think it'd be important to focus on DOT doing street resurfacing to make sure the streets are maintained in good condition without referencing the year period. No, we did not take out the 10 years. Was that all you yeah? Okay, thanks, Michelle, okay, I would like to incorporate it incorporate felice's language, but also use the war and Russell's, but use the words ongoing basis as needed. Now. Pothole repairs are supposed to take place when they're reported. In other words, if you see a pothole you're supposed to, you can report it to 3- 1- 1 and those repairs are supposed to take place when they get. You know when they get those notices. Whether or not they do is another story, but I think we should have very strong language on an ongoing basis as needed with pothole repairs being re. I do not know well, we can include that in there we do not have to separate it out and then, of course, we all agreed to take out the 10-year period yeah. That was, I do not know why that was in there, but the ongoing basis as needed. You know all that is that's the strong wording. That's good wording will anyone else that was the last hand up on this. Okay, the next one was reconstruct or upgrade a park or amenity playground out of that. Okay, this one is talking about Rupert Park, which I know it needs a lead, definitely needs attention. I was called about Rupert Park so that that's in not in good condition at all, and it's really there's people volunteering to keep it clean. I know the borough president is concerned about that council members. Are it really needs attention? Trisha has her hand up on this. Thank you. Let's just I absolutely agree. Thank you for keeping it in there needs it more than ever. No, I know I hear from rito all the time yep the next one reconstruct or upgrade the pop over there. It's John Jay Park, which I know is a big issue too, with John Jay Park. It has become very controversial about the if it's a quiet park or an active park, and I know the equipment I looked at it myself- the equipment they have there they're supposed to be for seniors. Someone told me that when their kid was small quite a while ago, she never knew it was supposed to be for seniors and her kids played on it all the time. I could not understand how that's supposed to be for seniors and there was no signs up. So that's an ongoing argument about John, Jay, Park Trishi have anything to say about that yeah, just that this is so. This goes beyond just that one quadrant. This is for the entire park. I know that, but I had to throw that in because yeah the so most recently our biggest issue with this park has been the play mat in the playground area has completely lifted up from the surface, and so every time the sprinklers were on, which was one of the only way that was considered a cooling station this summer without the pool because the sprinklers were on there, it lifted up the surface and was a really unsafe hazard for every all the children who are playing on the playground there. So this is something was that taken care of that sounds like an emergency. No, it was not taken care of the response that they gave was that to shut off the sprinklers. So it is something that's very urgent and we need. We really need to address it as soon as possible will can you can you call about that right away? I'm not doing it, but can you see? What's happening, yeah trisha, you and I can connect offline about that. I mean the sprinklers- are probably not on anymore, but still they're, not on anymore. So it's not a non- issue right now, but it certainly needs to be addressed. Hopefully before next summer. It's not great any okay, the next one. Oh I'm sorry, no they're hands it's you're good to go! Okay! Oh! I should go okay! Oh this is the new sanitation, trucks and other equipment. We know there's more of a need. I do not know if the problem is not enough trucks, but we know we need more sanitation. We put it in the expense budget and I guess it needs to be here too well. This is for the Rat proof garbage can canisters and solar powered compactor, big belly type. Yeah any comments. Marco has a stand up. Marco, I would like to see to put in the in the language talk a little louder, marco, I'm having a heart. I'm sorry, I'm sorry. I would like to see in the language that this new garbage can should be anchor to the floor, because at any time they have a very strong winds and they can be rolling all over the city hitting cars hitting the pedestrians hitting the properties and we have to be resilient and the best that we're resilient is to do a proper installation of this method. That is, metal cans. Thank you, okay, that's it! Yes, okay, install tree guards, we're missing from or where new trees are go in. I know that's three guys that voice and sometimes have become very controversial because they say they do not have the money for it. But if you do not have tree guards, people are throwing garbage in the tree. Pits no hands up again with what the response was talk to your borough president and City Council member, oh Judy, has her hand up Judy am I am you yeah, that's parks. Department does not do tree enclosures, okay, that does not mean we can't put it in the budget. They do not. They do not, but we're telling them to do it. They do not do it. You need the approval of the landlord who owns the sidewalk, where you want the tree enclosure, it's an involved process. You can put it in it's just a waste of time. They do not do tree enclosures. They do not do a lot of things. Okay, the next one is upgrade existing facilities for the homeless. This is actually to air conditioning for all homeless shelters. I think that was started in 20 in this year's budget, but I do not know what's happened now, and I know they were trying to work on that because they had to improve ventilation, but I think that should stay in Russell and what the agency said. Besides, this request is not recommended for funding, because the homeless are not supposed to be comfortable. It does not say that I added that implied yeah yeah, I mean to me. I just I think. Maybe this is too specific and we talk about HVAC elsewhere, which is broader and includes ventilation. This is about the homeless. What are your facilities right and what I'm saying is, instead of just referring to air conditioning, I'm wondering if we should refer to HVAC. More broadly, which awesome yeah, you can expand that yeah. That was my comment. Okay, the next one is about again about the Webster branch, create a new or renovated, upgrade existing upgrade electrical system at Webster. Was that done yet? Does Webster have a new electrical system? Usually we have somebody from the libraries who attends these meetings. Well, this is a different kind of meeting. I know we usually have two people attend them. Yeah was that on their list, their list was only for that. One item at the 67Th street: okay. Well, I think that should be in there if it was not done yet. I think that's important to need a new electrical system. Okay, the next one fundamentally Judy has her hand up sorry who has the hand up Judy, Schneider, okay, Judy Barbara. I spoke to the 67Th street Librarian. Today they were told not to ask for anything. I know the Yorkville library has told me that in the past too, oh you're not going to hear from any of the Librarians. Oh, I know that the Yorkville library, I know, wants things and then they're told not to ask for it. I know just leave all the library things in yeah. I know that I know I know they play that game. It's the main library. No other hands are up okay, calling them. I can't see what hands are up. No, I said no other hands all right. Okay, sorry! Next one is fun to fully build park along the East River between 60th and 63rd street, on the esplanade, including future phases 2b and 3 of Andrew Haswell, Green Park, what's happening with that one judy you know- or somebody know about that. Yes, the phase 2b is being built as part of the east Midtown greenway and will be finished in 23. The day got pushed back and but phase three is not funded at all and we have a layout in the preliminary drawing and they're telling us it's going to be between 40 and 50 million dollars, because that's a very old building to complete it and well. I think it's very important that we leave phase three funding in there. Okay, I mean it. Does not mean we can't have a really it turns sometimes into a wish list, but maybe eventually we'll get something. That's the only hand up so you're good to go. This is the queen spiral all will return it to the community, but all year round. I guess we should leave that in right. Marco has his hand up and so does Trisha absolutely. Yes, all the parks. She should be stopped privatized. Thank you. We I think we made that clear to them. Trisha, you have something to add Trisha. No, I agree. Okay, the next one is affordable. Housing program requests, provide more affordable housing for all income, low and middle income. I think it should be low and moderate in middle income. New yorkers, which are in moderate right. The middle is not good enough. How they define middle, none of us are middle anymore, makes sense. That's important. That was something the housing committee was concerned about. Affordable housing was one of our needs. That was one of the top needs: affordable, housing. Okay, the next one wait there's two hands up on this marco and then Rebecca Tangora. I think I should include it not all in low income families because all low income families they have a definition for their city planning. This is building. This is capital. I know that. I know that my point is: we had to put not only low income, it had to be a very low income. That's the last thing I mean that's the only thing. The rest is perfectly fine with me: okay, no okay! We can stay very low. Well, we need new definitions for income because that's what it is, what they call affordable housing. Is your joke? Yeah you're, absolutely right! Thank you. Okay, any other hands, Rebecca Dangor Rebecca. I would like this to be moved up, and I know we were talking about the library HVAC being moved down. So maybe this could take its place. I'll love that that's, I think, that's and that's one of our important priorities on the needs of needs. Requests. Yeah! I do not. It should not be the last item before continued support, so I want it moved up. Yes, I agree. Okay, these are continuing support. That means an item has been funded and but not completed. So that's the those you can look at those the continuing support. We do not want to take it away because we do not want the funding to stop, but those are the the continuing support ones. Okay, Judy has her hand up about the continuing support Barbara. I do not have the list. I'm sorry is phase 2b of Andrew Haswell Green under continuing support, which one phase 2b Andrew Haswell Green Phase 2B, was listed under item 12, which was under continuing support because it's in the process supposed to be okay, then put it under continued support and just change the other numbers. Also we have another park. That's supposed to be constructed honey, locust. The funding has been allocated. Should we put that under continuing support? Yes, if it's allocated put it into continuing support? Okay, thank you. Now this the capital budget. I have to say I'm very concerned about because I do not know what kind of cuts we're going to get. Okay, anything else on the capital Budget Judy did I forget to lower your hand, or did you have something else? Well, that's it! I agree with you barbara. I think they're we're going to be in big trouble. Okay! Well, I have another item to throw out after we vote on this, so we there were changes made. Does anybody want to call the question with the changes that were made and the recommendations were that were made to move things around? You have a lot of hands that just went up so just starting at the top marco you're unmuted. Oh, thank you. I would like to call the question. Thank you. Oh okay, is there a second wait? Rebecca Dengor is shaking her head. No, so I assume I'm second. I was just re- looking, and this is important if we're going to vote on it since it was discussed about moving item one down and having the three school requests that in our description, we have that we ask that this request be given the next necessary funding and highest priority in the five- year plan. So, if that's no longer our top request, we need to edit that now we which item are you talking about item the original item, one for capital? I think we've already included that we made that four, I think I said, keep everything in and we just put the other three. On top of that is the five- year plan a reference to something in their agency. You know they have five year plans. So would that mean that it's? It is the highest priority for that agency. Yeah? Is that right is that makes sense, Rebecca yeah, okay, that works better felice. Do you have a question really quickly before we vote yeah? Sorry, we, this came up in the expense budget, but putting in the fencing on the Queensborough Bridge for the south outer roadways right, so we should put it in the capital side on funding for the defense, because I think there actually is some flexibility and a lot of pressure on. Let's say you have that to the capital, then too, okay, so the Queensborough Bridge, fencing yep, put it in the cab for this south out of roadway. Any other comments, nope. No other hands up the question been called. Somebody want to call the question you did. You did great second, okay, all in favor, if you're not raise your hand or push a button or something no you're good to go. Okay, anybody want to vote no or abstain. If you're voting, no abstaining, not voting for cause, please raise your hand. Otherwise, I'm going to quickly read the names who are still here and we'll move on to the district needs statement. Barbra Jockey before that: okay, Barbra Jockey Marco Tamayo, Barbara, Rutter, Billy, Freeland, Brian, Correa Craig, later Felice Farber, Gail, Barron, Michelle, Birnbaum, Rebecca, Dengor, Russell, Squire, Sherry, Weiner, Trisha, Shimomura, alright, you're good to go Barbara Chucky! Yes, I like this and if it's second there, though I'll speak on it briefly, I like to record we've done this in previous years, not recently, but a while back that we recommend, because this we know there's going to be federal, state and city cuts to 2021 budget and certainly to our recommendations for 2022.. I like to recommend that we ask the New York state legislature to do his wealth tax. Anybody want a second that I'll speak to it nobody's saying no marco has his hand up okay, yeah. Second, okay, I think with we know, there's going to be cuts and I'm not saying we can't we're going to have to accept some cuts, but I really do think our tax system is very, is regressive. It's regressive and the city is certainly regressive in the states and the federal government. We can't do much about that right now and I really think that people should have to pay more for taxes. We have to do more redistribution of wealth for this state and city, otherwise that people are really going to be starving, they're, going to be more people in the streets, there's going to be less services of all kinds and certainly no capital services. I think it's a reality. I'm not going to put figures on it. I do not know there's a lot of proposals in Albany right now for what's called the wealth, tax or millionaire tax or a billionaire tax, I'm not sure what you call it, but I really would like to see us recommend that you have a lot of hands up cool yeah. Marco did you have anything you wanted to add to that or your hand was up? First, no, okay, police. I just want to say that I would oppose that recommendation. I think we really need to look at the number of people. Who've been moving out of New, York and think about the well- being of the city as a as a whole. We need to the city as a whole needs to look at how they spend their money before they start. Looking at adding an additional wealth tax, I think the economic vibrancy of the city is dependent on having a wealthy population that pays, I think, close to 40 of the personal income tax in New York City. That supports all the progressive programs that we have. So I would be very concerned about promoting a wealth tax and I think the city and the city first look at how to do business more efficiently. Thank you, Michelle is next. Yes, I want to affirm everything that felice said. She took my comments right out of my mouth, but I want to add that, of course, the wealthy are the most mobile and if you make it difficult, they'll just move to another state and that's what's been happening. We are hemorrhaging the tax base. You can't put all these things in your budget, whether it be capital or expense for all these social services and not have a tax base to fund them, so with that being with them, the wealthy being the most mobile population with them paying the majority of the taxes. That's just the group that you want to keep in the city and we should have every incentive to keep them here. That's who will fund the other programs that you want, so I would be vehemently opposed to this. Thank you, Michelle Rutter, I feel uncomfortable with a specific wealth tax. I know there's been a lot of suggestions. I know this talk, we do need more money and it has to come from other ways, certainly cuts in the budget and redoing the redoing. Some of the city agencies is one way they're talking about attacks on a second home, and things like that. I just feel it's too specific Barbara. You know, I understand your point of view, but I think it's too specific. I would not be comfortable with it. This also was not on the agenda and I do think that there would be a lot of people that would want it we'll bring it up at the full board. Of course yeah. However, it's welded, so are you done Barbara? Yes, I'm not going to comment anymore on it. Oh no, that was for rudder hours, but yeah, sweater and shockey is better right, yeah all right. Sorry, then Rebecca Dan Gore is next, then billy, then craig than Russell. I can't be in favor of that, because I do not believe it's the best way. I believe in a value- added tax, not a wealth tax, but I could not support this billy. I support this Barbara. I do not know that we have to be specific, I mean there are at least a dozen different. You know what it was not specific. I just said wealth tax yeah, so I would say you know I would support something that speaks to, maybe in a generality about increasing taxes on the wealthy. You know worst city, where a hedge fund billionaire not long ago, bought a 238 million dollar penthouse, on which the effective tax is something like 0.1, and you know we talk about people fleeing New, York, but part of it is. Are we going to have the resources as a city to pay for street cleaning to pay for our schools to pay for public health, all sorts of things? We need to get the city back on its feet, so people are going to leave if we do not have the services that keep the city clean and keep it moving. So I think we have to look for revenue somewhere. We do not have to be super specific, I suppose about how to get there, and you know this is something I'd kind of take an interest in this question of. Are people fleeing or not? I have to say none of us know, because with Kobe we're an unprecedented moment, but there's a sociologist at Stanford, Crystal, Ball Young. He studied this people most likely to leave a city like New York, actually are middle class and working class people there's all sorts of reasons why the wealthy tend to stay and keep their roots in a place like New York City. So I would not necessarily take it as a given that people, the wealthy, are inherently going to leave and never return to New York. So I think we have to do something to plug the budget, hole and fund the needs of the city, and I think, there's a lot of patriotic millionaires out there. Who would pay a little bit more in taxes if they thought it was going to go to an important purpose for bringing New York back from code. So I would support something in General, Barbara Craig. If we, as a community board, are supposed to be a political, I'm very uncomfortable with us going down what could be a slippery slope, I think, and we some obviously we need to talk about revenues and obviously in transportation. We talk about congestion pricing, but that has specific ramifications on our community, in addition to a community- wide issue, but there are specific assets that impact us, whereas something like this is about as political as you can get, and it's, I think, dangerous for us to even start to discuss this. Whether there are merits to it or not, and I think we should not be entertaining this gal baron to second what craig just said. I agree completely. Excuse me. I think that we're making it a political issue- and I just do not think that's appropriate for the community board- that's it Sherry Wiener. I was wondering Barbara since was speaking in such general terms, perhaps in asking that the legislature enforce a tax structure where individuals and corporations pay their fair share of tax, maybe even more general, but gets the same message acrosss. That's really what we're talking about we're saying that wealthy individuals, but from and corporations, are not paying their fair share. So I'm wondering if that would be. I do not know if that's what that means, but I'll accept that I do not know. If you know I do not. I do not know. I mean I also hear what the other people are saying, that this is a political issue. That's why I was trying to make it more. Generic come on is a political issue to be honest right now, so I do not. I did not mean to be it's not a partisan issue. Well, it kind of is though well. Everything is, can be a partisan issue. Then now, let's leave that on Marco and Michelle are the last two of their hands up marco you're muted. Thank you. I support this idea of increased taxes, but no in the political arena. What I'm my concern is the city invested billions of dollars in the Second Avenue Subway right there, the city put billions of dollars. Now the developers are coming and they demolish affordable housing. So we have to put taxes at that specific location because the city put money and who cash it in is the developers. So we have to create a taxes for this kind. The situation I do not want to go against the millionaires. I do not want to go with those people, because, yes, it could be different outcome or all of that, but I had to go directly to those people that they cashing in the investment in great infrastructure such as the Second Avenue Subway. Thank you, Michelle you're, the last person to hope. Trisha has her hand up to now. Yeah I want to. I want a second craig's point of view. We should take this off the table. I do not think there's anything. I will not take I'm sorry. It's not we've done this number of years and I'm not taking it off the table. You can all vote no, but I'm not removing it from the table. I do not think I do not see it as political. I see it as inappropriate for this committee or the community. I know you do not barbara. I know you do not because you proposed it, I'm voicing my point of view. Okay, Trisha. Try that again, sorry does that work Barbara. Well, I myself am supportive of this. I do not think that I'm ready to vote on something tonight. I do think that there are a lot more people who would want to weigh in on how to address the economic crisis that our city's in, and that goes beyond this one tax that so I think that the better move would be to try to have another meeting on this, where we could properly post and properly get all the all the suggestions out on the table and really like talk about what the best strategy moving forward is. I think that there's a lot more that needs to frankly get done, so I can't, although I again am supportive. I can't I do not think I'm ready to vote on this night. I do think that we need that there needs to be a kind of broader, more kind of dedicated time to discuss with the with the larger audience yeah. I was worried for now, but I'm still thinking it's not inappropria. I do not think it's inappropriate. Okay, I'll majority from now. We now have the district needs statements and that's going to they changed this form. These forms too, so it made it much more complicated. I just want to say that three items that are our top items most important pressing issues facing the community board is affordable, housing parks and schools. I think that became obvious as we did the items on the budget as we reviewed the 2021 budget, and I think that I do not know the best way to handle this. I think everybody saw this previously. We know what the needs are. I think maybe everybody I do not know if we can vote on it now or people want to look at the items again and vote on it. Another vote on it, a follow- up vote. I'm not sure how to do this now, but those were our three priority items and I do not think any. We got anything that changed. That did we will no. I do not think so. Those were obvious and as we discussed the both expense and budgets- and I think we should just- I recommend that we just continue supporting in the 2022 needs to set whatever you call it. District needs continue using that saying those are our major needs and then the way you fit it into categories now, which they ins instituted two years ago, which made it much more complicated and confusing. I think that we should just continue supporting those as our three top priorities. All right. You have three hands up in response to that treasure, so I agree Barbara. I just want to say that I did not. I am submitted Barry and I submitted new language for the parks, one, that's just a little more, that's just more updated. We have to update the languages on it, but I think we can do that after we vote on it yep, so I mean I can say I will has that as well. I just want to make mention that how we describe our parks has been updated for Fy22 good. Then you have Rebecca Dangor, Russell, Squire and Judy Schneider. I know we did do last year, quite a bit of editing, so I think it's in good shape. The only thing I'm wondering about is if we want to directly advocate for building new schools, not just having more seats here. If that's going to be the first three items, where would you I think we should? I think we just directly state, maybe either replace the more? No, not replace, I would say, maybe in the next sentence, just say the path forward is we need to build more schools and just include it in the in the top threes, in the description on the top three yeah okay, would you just draft that and I'll put it in yeah I'll? Do that in the document thing? Thank you Judy Question Barbara. I do not remember when they we switched over to this format. At one point they said we could not have the same priorities two years in a row. Have they changed their mind about? That is not something they've told us and we also just lost Barbara. Oh sorry about that. No, I do not know what happened. I have not had this situation where was before you came when lather was here. Will yes, when we started with this, they said that you could not keep the same priorities two years in a row. They had to change, so I'm just wondering if they change their mind about. That is not something they have said so and they've exposed. We left these exactly the same as they were last year or yet I asked yeah but fine Barbara. Please do yeah Michelle I'm going to let you speak because you had your hand up but yeah. Thank you so to Rebecca's point. One of the reasons I raised my hand is because I wanted to see the wording. So now you put the wording on the screen. However, I can't slide down to see the end of that paragraph where it says school funding is in the same okay, let's trade, the city, all right. The only thing I would like to change. If you can go back up now to the first line, I can't move it yeah where it says: schools we need pre- k blah. I went off my internet shut down. I'm back now, okay, so I'm on my cell phone, so you're, small okay, so where it says high school seats, Rebecca had made the point earlier, and I agree with her that sort of sort of refers to like finding place in existing schools. So I would like to put wording in there to say build schools. We have under capital, that's what it should be yeah right, so it won't say I would say bill or renovate well, okay, yeah! All right we need to will actually renovate could mean it could be construed to mean that create more seating in an existing building. Okay, we say build, that's fine, so I'm worried about that, but we need to build more elementary middle and high school and high schools and create more seats for pre- k, Elementary middle and high schools. Okay, that's that sounds good. I think we get the building of the elementary Middle and high, and then we get the pre- k in there, because for that you could not create seats within those buildings, because there's really no expectation of building a separate school for pre- k or okay. So if you could change that wording, make it a little stronger. That would be great, but otherwise I think it looks good thanks. That's the only hand, that's up right now, Barbara so really quickly. Trisha is this where I this is where you're wanting me to insert that language, or were you wanting that in the parks at the end, yeah, so the I so we I looked at the entire district needs statement and updated every statement in there relating to parks. So the first one will that I put in your little notes. Google Doc sheet is the piece that you could put in there where it says top three priority, so you should be able to just copy and paste and then in other areas where we list the priority pieces for perks, then I upgrade I updated that as well, so everything should be updated for perks. Okay, so I cut this out and I put it down and you could put in just that first paragraph that I had yes, that's it not the additionally or with the additional it's two. It's two paragraphs. Okay, great did we vote. I went to my computer shut down and maybe it was out of juice. Did we did we vote yet on the three prop that the top priorities, I think you just can vote on the entire district needs statement whenever you get okay at the end, so we do not have to take a lot of time on this. Okay, that's what that's what I was trying to do, yeah? Why did my computer just shut down? Was it out of it's disconnected? Is that what it was you think yeah, probably okay, Rebecca Dan Gore has her hand up just because I'm reading Trisha what you added. I just want to say that I changed one thing to be community district 8 instead of the board, which is what we did a lot last year this one or did you already? I changed it in the Google Doc needs for parks, the population density and community district 8.. That's just what I fixed. Okay. What I put in there is right. I can't I can't see that oh one also has to be district. All right, marco has his hand up. Were you done Rebecca yeah and you can send it to me and I can look it over again. If you want yeah remember all of this will get. You know, you'll get a copy of this to vote on it yeah. So if there's anything yeah that needs to be changed at that time, we can always change. It sounds good marco, yes, Barbara in the district needs of 2019, you have some percentage of the deficit. I do not have 219 in front of me because on the 220 you remove that oh somebody removed. I think this percentage is extremely percentageable. I did not hear what you said: percentage of what of deficit or affordable housing because, for instance, the media average of affordable housing in the city of New York is 3.6 in the community. War is 2.8. This is extremely a statistical information for any person that understand housing and understand how crucial and how critical is affordable housing in our community. I do not know you have this year or not, but in the two and the 2020 I could not find it, but in 219 yes, this is, I think, it's still. The same okay, I do not know. Thank you so barbara. What would you like to do? Would you like to ask for comments on any of the other sections or I do not know? I think we just need to maybe vote on those three top priorities, and then people can look at it and see if they have any further comments later on. Does that make sense? I do not think you need to vote on just a small subset. Okay of the district needs statement. Okay, so then we just okay, because I do not think we want to vote on each section now. Do we? No that's. I think the thing I would like us all to avoid and boy that's what I'm trying to avoid too and we got to set it up for the bud committees. Otherwise the full board meeting will go to 5 am so then, if there are any edits or questions or comments about any of the other sections, we can jump to them or somebody could make a motion to approve the district needs statement, so move dog, so Rebecca and Marco have their hands up Rebecca. I make a motion to approve the district needs statement. Is there a second okay? Somebody call the question. Can I call the question? Yes, okay, call the question. Okay, I see Russell Ii said okay when they're voting. If anybody wants to abstain or vote, no, please raise your hand or indicate in some way, if you're still, not if you're not on youtube anymore. Just let us know any abstentions or no votes sing. None. It looks like the district needs statement is approved. I'm just going to read the names like. I did the last time because I think we would we a couple people go. Excuse me, go and come Barbra Jockey, Marco, Tomaio, Rebecca, Dengor, Barbara, Rutter, Billy, Freeland, Brian, Correa, Craig, Labor, Felice, Farber, Gail, Barron, Michelle, Birnbaum, Russell, Squire, Sherry, Weiner, Trisha, Shimamura, okay! Well, thank you. Everybody was very cooperative and it was really, I think, a good meetings. They could have been very complicated. So thank you and thank you will for doing all the work you did to prepare it yeah. Thank you guys, okay motion to Adjourn is there a second I see Rebecca Dengoro's second set. Okay, bye stay safe, everybody.",
            "summary": "And I now can see people because I did not have my computer working prior to now, This is what we're doing tonight is voting on the 2022 expense, budget, our priorities and the priorities of the capital.\n2022 is the budget that starts July, 1st 2021 It goes through June, 30th, 2022, and what I want to say is And I discuss this- to do a budget because we do not know what's going to happen.\nEven if this we're now in fiscal year, 2021 We know there's going to be city, state and federal cuts, most likely.\nWith, the Community Board's own budget, which I know, people have been asking for items and making requests.\n2021 cuts, because the year that ends June 30th, even if we get even if we get federal funds and even if there's a new administration- And I want to get political , What we're looking they're going to look at tonight is the responses to the 2021 budget, which we're in now, which goes for June 30th, and they you know when they respond, that they always do.\nI do not know if I have support from anyone, but I think that's the only realistic way , we're not going to have enormous cuts,, so I think we should start off with looking at the expense budget for 2021, which is the year we're in now.\nIf, you were able to participate in the last couple of years, you're at least a little bit familiar with the new portal that the Department of City planning has for our district needs in our budget?\nIt really does not matter if it's 10 or 11 or 12, if the in our priorities, especially when you look at the comments that we got back from the agencies which those of you who have worked with me before know what drives me crazy when they say if there's money, we'll give it to you, we're asking you to put money in the budget.\nMembers should be familiar seeing this, but it includes the priority that we had and then the agency's response to it now number one, I think, is more important than I.\nSo, you need to build the schools before you before you fund them Exactly, so this is expense, not capital, So, Okay, so we should put that should be in the capital budget, more schools.\nThink that asking having the expense budget items as well as the capital budget is fine.\nI think that we should have it in the expense budget, as well as in the capital budget, because you have to have the money to build the new schools, but you also need the expense budget to cover other costs.\nI would also think that we have to kind of take a general look as far as which initiatives overall are most important to the district and then drill down to the specifics within those areas or are any of those to be replaced with something else.\nWe need a high school, a middle school grammar school, whatever the new titles are, but the expense component is that you're looking for seats within existing facilities and they have opened different ones by either renting out or whatever.\nSo I'd like to see we have one request for seats when we look at the capital budget, make sure I was just going to add to the list that I think that we need some emphasis on affordable housing or housing to supportive house more supportive housing in here.\nAnd then I know that we're going over capital, but I think that it would help everybody to know that in our district needs statement for Fy21 that we said that the three most appreciative, pressing issues facing our community board is one affordable housing to go to Barbara, Rutter's, point parks and schools and specifically to Michelle's point.\nSo, if that helps the situation, I, know that we're going over these extra these specific budget requests.\nWe absolutely need this, and even if I know that this is all one list, I know that it does not matter too much, but even if we can bump this up, I would I would love that, because it is very important to us and the next one improve trash removal and cleanliness, that's in the parks and outside of the parks, because it's too different budget items, but we really need that.\nHas to be added, because it then different funding, sources, so I would suggest, adding it and either putting it like directly below or directly above And, then the second was about the new traffic or pedestrian signals, because I did notice that they asked for a list of specific locations and I'm sure they're going to say that again, next year.\nIf anyone here has an idea or if maybe we want to pass this on to craig and chuck and send a letter after transportation, and I think we I mean I would suggest, since we needed another number, we needed to put the trash in the park and outside the park that maybe we should for now should take out the pedestrian signals, because I've seen a number added this year.\nThis is an essential public health issue and we need to get sanitation to come back and do pickups the mayor reallocated funds to certain other communities and did not think our neighborhood was commercial enough or Covid-19 enough to have garbage pickup.\nI'd like to talk about it, another time, but we need to move sanitation, up, and I, make a motion to include right after the removal and cleanliness for the Department of parks and recreation that we put in the sanitation and requests for increased pickups.\nSo, item number nine is on increased funding for tree pruners and tree climbers, but I think with a lot of the extreme wind conditions that we've had, and I.\nThink one of the things the mayor said he was reducing- Was funding for tree pruners that that's something we really need to emphasize.\nI think there's a bit of a mismatch between the request and the explanation in terms of improving the trash removal So that means we're going to need two, essentially that the trash removal is two new items right, because it's trash removal in the parks, because that one currently does not cover it and trash removal in the in the on the streets And then the last point, is, I think, the way to to effectuate the point that felice made about the tree pruning is maybe in the explanation we can emphasize the public safety aspect of it and that that's the reason for it.\nWe need to keep the two trash pieces separate and that's fine and then just wanted to thank felice again for talking about the tree.\nIssue, requests increase, funding for the Department of health enforcement for all food vendor rules and regulations.\nIt's not just about right people on the street overnight If you had language that you wanted to put in just chat it to me, sorry, Russell Felice, so just briefly, because I do agree that the increase in homeless in this neighborhood is, is a real problem, maybe take out the reference to technology equipment because I'm not sure how that benefits, the yeah- You know they had to change it because of certain rules of the of OMB , I.\nThis is where it's strange: increased funding for the Department of health enforcement of all, for we did that already: food, vendors- 12, other expense, traffic, improvement, requests, increase the number of workers to inspect repair and preserve the Department of Transportation's infrastructure.\nInspection, on the one hand, sounds to me like a service, but repairing and preserving sounds more like capital, and So I'm clear why the latter two would be included in this one or if that needs to be a separate capital, item, and I think you know we may want to just suggest putting the repair and preservation portion of it into the capital.\nI think it depends on how much repair is needed if it goes in capital or expense.\nHe knows how the DOT funds that program, if you want really sure if this would be considered capital or not, but generally with in terms of maintenance, if it's a state of good repair, project, that's just part of typical regular maintenance.\nThat would be more capital related, which would be considered state of good repair as well, but not just typical general cyclical maintenance, So I, just I want to respond to Michelle's thing, so the esplanade sinkholes.\nIn previous years we discussed that it was about inspections and the number of workers to inspect and repair, which is the reason why I think it was an expense.\nSo I think we want to request the repair more So. At some point you will ask I'd like to make a presentation on behalf of the voting rights what to take out, because we can only have we can't have more than 25 items, okay, so you'll.\nMaybe just emphasizing the explanation that this is a pedestrian safety, issue, an instant to inspect and repair roadway surface and sidewalks and bridges they're, probably not city funded.\nIt probably is, it might be city funded, but I'm, not sure it impacts, Pedestrian, Safety, Illegal, conversions and uses of buildings, hire additional department of building inspectors for compliance and code enforcement and hire auditors for application.\nUprise, but we have yet in all my years on the board ever seen, acs come to us to discuss this issue, so I think it's an important piece.\nThink the point is just to emphasize that the people The school crossing guards are the part we want.\nIf we're talking about traffic enforcement officers, we also need to ideally have more more officers for traffic control at high volume, high congestion safety compromised locations within the district like near the 59th Street bridge and near the exits.\nWe know the issues on second avenue and even coming off the bridge at the Fdr drive in 96th street, where they're already there sometimes they're, really critical in terms of keeping traffic, hopefully moving, which of course has impacts on air quality and air pollution and safety.\nThe health inspectors who are doing it, But I think we should expand that we want funding for people to be going out to the different restaurants to make sure it's not even just restaurants.\nIt's July, Okay, no, I'm, not saying no, but I just wanted people to know.\nAlso on the NYCHA, point- I think that's included them because it says community, centers and senior centers right maintain all current open, space.\nI think, item 23, which you guys can look down to is probably where that may want to fall in Too, just provide more health and building inspectors for Natchez, facilities, and I.\nI do not know why it says other expense budget request why it's put that way, but fund additional DCA inspectors for sidewalk, cafes and compliance permits, regulation Perhaps that would this is may perhaps a better place to put in my suggestion on the Covid-19 enforcement as opposed to the other, which was the health department.\nThis is something that we get concerns about all the time with, particularly with the Misuse of park, space with dogs and other things like that, Are the people we call all the time for whatever comes up that needs to be addressed, so I just want to say that our parks and Waterfront Committee get these concerns a lot and Judy My personal opinion is I'd like to see it moved, up.\nIt's very general statement, because most of the funds will be state or federal, funds, and I do not think we're going to see that , I think that needs to stay in no hands up and 26 is plant new street trees.\nIf you had more locations, you would have more drop boxes, so I think it goes hand in hand, but it's just a continual issue and it does not seem like it's going to go.\nPeople just do not trust voting by absentee, so I think we need more in- person.\nI. Think that's important to send will some new language with the understanding we do not know.\n, I think we still need a motion to approve I'd like to make a motion that we approve the expense budget for 2022.\nYes, I think on calling the question or calling or the all in favor of coin, the question: okay, anybody who wants to abstain or vote no.\nEverybody is voting, yes on the expense priorities for And I'm, going to read off the names just so it's in the public record and in the video Barbara Chockey Barbara Rutter Billy Freeland Brand, Correa, Craig, Later, Elaine, Walsh, Police, Farber, Gail, Barron, Marco, Tamayo, Michelle, Birnbaum, Rebecca, Dengor, Russell, Squire, Sherry, Weiner, Trisha Mamura, and we can move on to whatever capital.\nThe next one was okay, so we still want to keep the request services for homeless in right, yes, but it would be moved to number five.\nOkay, then call on the people who want to make comments about this, Marco and then Russell and I was talking to one of the reps from the Park department, because how we're going to repair and do all these kind of jobs?\nThis is a capital investment, and this is what we need to have an a real study of the wall, because at the end of the day, probably will be more likely right to repair.\nWe have to start thinking to put a new wall parallel to the existence, but I do not want to come with the solutions without even understand what is exactly the condition of the sea wall and what we had to do is obviously to have an emergency repairs.\nWe can have a separate request for a capital project on the sea wall or we can add it to number three Maybe marco wants to provide the exact wording, since he very clearly understands the situation, but let's make it another.\nBut I do think that we are being broad enough saying that we need the immediate and urgent funding to repair and fully restore and ensure the structural safety of the entire esplanade.\nMy impression is probably we can recommend in one of these items, that the Department of parks should have one of these engineers and their team, so that we can have something better opinion about the issues that may raise in the future of the esplanade and in addition to that, it will lead directly not only to the erosion of the Fdr, but also may lead to the floating area and the three parts that specifica specifically happen in our community: low, 60s, mid, 70s, low or 80s, and then in 96 street that basically, it will describe how we're going to repair and how we tackle combine this problem that affect those buildings in that section.\nI think this is extremely important and needs to stay in the capital.\n, I, again, I think we need to include sidewalks here, but then the DOT does not repair sidewalks.\nWith the idea of Rebecca, I think that we can do that because the developer we do not know when he's going to build the new buildings, especially the buildings on 79th street.\nWe're going to see those numbers be being cut, and so I think it'd be important to focus on DOT doing street resurfacing to make sure the streets are maintained in good condition without referencing the year period.\nI think that was started in 20 in this year's budget, but I do not know.\nOne item at the 67Th street: I think that's important to need.\nI was just re- looking, and this is important if we're going to vote on it since it was discussed about moving item one down and having the three school requests We have that we ask that this request be given the next necessary funding and highest priority in the five- year.\nYes, I like this, and if it's second there, Briefly, I like to record we've done this in previous years, not recently, but a while back that we recommend, because this we know there's going to be federal, state and city cuts to 2021 budget and certainly to our recommendations for 2022.\nI think we really need to look at the number of people.\nI know this talk, we do need more money and it has to come from other ways, certainly cuts in the budget and redoing.\nSo I think we have to do something to plug the budget, hole and fund the needs of the city, and I think.\nIf we, as a community board, are supposed to be a political, I'm, very uncomfortable with us going down what could be a slippery slope, I think, and we some Obviously we need to talk about revenues and obviously in transportation.\nI just want to say that three items that are our top items most important pressing issues facing the community board is affordable, housing parks and schools.\nI. Think that became obvious as we did the items on the budget as we reviewed the 2021, budget, I do not know if we can vote on it now or people want to look at the items again and vote on it.\nWe just need to maybe vote on those three top priorities, and then people can look at it and see if they have any further comments later on.\nSo then we just okay, because I do not think we want to vote on each section."
        }
    }
}