{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCrp_UI8XtuYfpiqluWLD7Lw",
            "title": "Top chat replay",
            "publishDate": "2020-10-08",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "wiedwT9nox4",
            "fillerWordCount": {
                "uh": 210,
                "um": 362
            },
            "readTimeFullTranscript": "73 min read",
            "readTimeSummary": "9 min read",
            "wordCountFullTranscript": {
                "park": 53,
                "parks": 51,
                "ramp": 36,
                "project": 34,
                "street": 29,
                "esplanade": 25,
                "construction": 23,
                "thanks": 18,
                "work": 18,
                "place": 17
            },
            "wordCountSummary": {
                "parks": 13,
                "park": 9,
                "project": 6,
                "esplanade": 6,
                "pedestrians": 6,
                "ramp": 5,
                "work": 4,
                "place": 4,
                "street": 4,
                "agenda": 3
            },
            "fullTranscript": "Welcome: hmm, yes: okay, yeah, fine, you so barry! I know we're just starting in a few minutes, but I just want to say: welcome to fully hi police. It's nice to see you I'm one of our new members and if I'm missing any of the other new members. Forgive me thanks for coming police glad to be here. Oh hey, Taco, but I'm talking to you you're already a member of our committee. But it's nice to see you. What do you think Barry yeah I've got I've got exactly 6 30. go ahead, tristan! Okay, so I think we'll get right in and be prompt. Apologies if you hear any crying in the background, it is my son's bedtime, so the screaming is normal. It's really nice to see. You all welcome to the new members who are here. This is the parks and Waterfront committee for October. My name is Trisha Shimamura, I'm one half of the co- chair team, along with Barry Schneider, often known as the better half, no, not sure not true. So we are just going to jump right into our agenda tonight because we have a speaker for and our presenters here I think I saw will. I will long time no see. Thank you good to see you Gary. I do not know if you want to do any sort of introduction of will or the topic, but otherwise we'll just let them go right into it sure. Well, it's an update on the resumption of construction of the east Midtown Greenway and Andrew Haswell Green Park, Phase 2B, and I'm eager to hear that wonderful presentation. So to take it away. Will it's all yours great good evening? Everybody, my name is: will fisher from the New York City Economic Development corporation, it's nice to see everybody hope. Everybody is healthy and safe, and I'm joined here by my colleague, evie mcevely, who is on Edc's capital program, and she will be doing the presentation today, given that she is the project expert, but just as a way of a quick introduction. You know during the during the Covid-19 height of the Covid-19 crisis, particularly in April the governor. As many of you know, the governor issued an executive order that halted all non- essential construction work in the city. We had begun this project after a groundbreaking in November of last year, and you know so, of course we were forced to halt this construction of this project. It's important to note as well, however, that the you know broadly throughout the city. Obviously there is a very acute fiscal crisis being felt by the city government at this point, so as part of getting projects back to back to work. You know there were a number of projects citywide that we have not yet been able to resume. Essentially because you know when EDC is performing these projects, we are, you know the contractors will build see. Edc will build. That will build the city each of those takes time and requires the you know each of these organizations to have cash on hand. So, in order to be you know, conservative and ensure that the city has enough cash on hand for essential services as well, as you know, having EDC being able to maintain our basic operations. You know we have had a number of capital projects, citywide that have slowed down or that are currently paused, thankfully, because this project had already been beyond construction. It was quite easy in comparison for us to get the authorization from the city and from OMB to resume construction. So, just as of maybe about a month and a half ago, we were able to resume work. So you know we do have a. We have obviously incurred a significant delay, and you know that was probably five or six months all told, but we are still happy to be able to have a fully funded project and be moving forward. So generally, we're going to talk this evening about just remind everybody of the project extent and what exactly it is that we're doing here. We're really excited, of course, to you know, needless to say, to be bringing new green space and new connectivity to to the neighborhood, both seabees, eight and six, and so evie will get into the details of that, but generally we'll be going over the project details again, just as a reminder and then going through the through the schedule and what folks should expect to see and then, of course, we'll be coming back to the community board, with additional updates as the project progresses but excited to be here and with that I will turn it over to evie. Who has the presentation up here and then the Parks Department, I believe, is on hand as well and we'll go through the presentation which is pretty quick, probably just about 10 minutes or so, and then we'll take questions after that. Hey everyone. My name is evie mcevilly, I'm in Edc's capital program, project managers, working on the design and construction delivery of this project. So hopefully you can see my screen without any issues, so we will move right along one second, okay, so we lust came to Cb8 at the end of 2019, and I think at that point we had explains that we strategized and determined that the best way to deliver Andra, Haswell, Green 2B was to also pair it with east Midtown greenway, which is a larger project south, so just to provide a little bit of quick context. The east Midtown greenway project even further is part of a larger conceptual plan for the east Midtown Waterfront esplanade, so that was originally conceived as three separate sections going from south to north being the right of the screen. There's waterside, pier, there's the U.N esplanade and there's this east Midtown greenway, so east Midtown greenway is between 53rd to 61st street we're building an esplanade out in the East River. The access from the street is 54th street. There's an ADA ramp at Clara, Coffee Park there, and then it goes eight or nine. I guess blocks and it connects to the southern end of has will green to be, which you can see all the way north. Here and it goes through the heliport structure or palestinic pavilion, because this is such a long stretch in several blocks, the design team, which is comprised of stantec for Eastmantown, Greenway and Jacobs for Andrew Hussell Green2B. We wanted to have some unifying elements such as the park, standard, hex, pavers, standard, light fixtures and sea rails, but we also wanted to give a really interesting quality as you walk along this entire esplanade. So the landscape, architects have envisioned different experiences. So there's something what's called the birch point, which is a wider section of the esplanade that is envisioned for larger gatherings or for educational programming and then the path kind of narrows and widens as you go along for interest so along the inland side, is the bike path and then on the outboard side is the pedestrian area and they are at sometimes they're at different levels. Sometimes they merge in where they merge. There are a few. There are food points where they merge and that's where we have amenities like trash cans, water, fountains and whatnot. So, just looking here for a second, this is at East 54th street. This is something place park or Clara Coffee park. This is the existing park where we are putting the bridge ramp, access which goes over the Fdr and connects down here at 53Rd Street, and you would walk along this white box. Here is the Lsa Cup pavilion and then you go through that and connect to Andrew Howesville Green 2B. You would go further north for ADA access back to the city grid or you could go up the existing 60th street ramp, which takes you out onto York Avenue. I apologize I'm having trouble advancing okay. So, as will mentioned, we luckily were able to resume construction of the project and it's a really large area, so we're tackling it in in multiple spots at once in this beginning here, so this fall. We are starting right away with ramp repairs of this 60th street ramp, so that actually started at the middle of last week and it will go through the end of the year. The idea there is that we would basically fortify the ramp such that construction vehicles and materials can come down so that we could build the rest of the esplanade and then work our way back out and finish. So, as I mentioned, we're doing the ramp repairs this year. There will be a short pause and we would start doing marine demo and the pile installation starting spring of 2021. That would go for about a year and then again there would be a pause while we build the rest of the esplanade and then at the very end we would work ourselves back out of this water structure and build the upland. So this upland the landscape work the the improvements to the 60th street ramp. That would all be happening and being done, we're thinking, summer fall of 2023 and then just a note. While we are concurrent to this work that we're doing now here at the northern end, we're also starting work over at Sutton Place park at 54Th Street. Let's see working through the other bullets here, the bridge installation, that's this pedestrian bridge right here that will be done in 2021, Clara, Coffee, Park or something place park at 54Th Street will reopen in fall of 2021 and then the entire greenway, including Andrew Hussell Green2B, will be open in 2023.. Here's a view of the 60th street ramp from York Avenue. If you're looking up this is the Roosevelt island, Tram structure. This is the new sign to identify your park. These are the improvements that you'll see on the ramp with the kind of painted application and you would go. You know you'd go down to access the rest of to be in the greenway going north. We are looking into delivering this sign early on. So we're looking to do this in the next several in the next couple of months. Definitely by, I would say spring of 2021.. I just had a call with the construction manager today to see what we can do to advance this one piece: here's a view. This is about 62nd street looking down south, so you can see the alice aka pavilion, the artwork up top. This would be the newly planted landscape and there are some kind of monumental stairs for sitting and kind of enjoying the esplanade over here. This is a shared bike path that goes through the pavilion and then once it meets further South Basement town Greenway. Then it bifurcates where the bike path is on the inward side and the pedestrian walking area is on the outboard side. So I'm just leaving you with some renderings. This is one of the lookout points along East, Midtown greenway, where the bike path is higher than the walking path. So it's a chance for bikers to pull off and take a look out at the water in the landscape and then to the right is an aerial view of what the 60 street ramp would look like with the new pavement treatments, and then you can see that nice generous lawn implanting area that we'll be installing. So with that, I will end the presentation and open it up for any questions, and if I could just make one comment really quickly in advance, I think like evie mentioned, you know we are, as we do begin construction at the beginning. It may you know, be sort of piecemeal and bit by bit, but there will be a significant amount of construction activity. You know at a certain point, so we do have a and I'm going to I'm going to send this to will in the chat, and I hope that he can distribute it to the to the attendees, but we're going to have a periodic construction update that gets sent out to folks who are on a mailing list specifically for this project. So, if you're interested in beginning to receive those updates, we should have the first one going out soon, I'm going to send in the chat the email address, but it is east Midtown waterfront at edc.nyc and again we you know obviously want to you know, stay really close in touch with the community in regard to the construction activities, so that folks know what to see and there's no surprises out there in terms of you know where there are temporary closures or where work needs to be happening, so appreciate everybody's patience during that time and we'll also be sending out updates as we can well. Thank you very much greatly appreciate those updates. Thank you. So members of the members of the public or any questions starting with Judy hi. I have a few questions. The first is: can you tell us more about the sign on the tram station at 60th Street? What is that sign? Is it going to be a white painted sign? Is it going to be illuminated? How big is it it's something that has been of concern to us since the project started? That's my first question. Sorry, I can. I can answer that. So I'm pulling back up this rendering and you can see that the sign is comprised of individual metal letters that will be attached to this cross beam of the Tram structure. Do you have any idea how tall they'll be, and I take it- they're white they're metal, so they will have a silver finish in terms of the height. Let's see, I actually sent willa drawing today, which has the dimensions, but I do not honestly know off the top of my head without referring back to the drawing, but there they'll be mounted. However, deep that beam is, it will be on the face of that okay, the next is the ramp. Could you go into a little more detail about that? Is that being closed, while you're working on it? Does that mean that no police, car sanitation trucks or anybody can go up the ramp at this time? And if so, how long will this ramp reconstruction? Take that's a good question. Our construction manager right now does not anticipate needing to close the ramp in full, so they should always be able to maintain access down, but they have to shift that access to, for example, work on one side of the ramp, and then they would shift it over to work on the other side. But I do not. We have not gotten to the point of the logistics working around flow. Do I not remember correctly was not there also some reinforcement needed of that ramp because it could not take the weight of the construction trucks and so on. Is that being done as part of this we've got it in another time or from Underneath? Can you tell us more about that? Yep you're exactly right, so we call those the priority, number one repairs and that's what the team just started last week and will be doing until about December of this year, so they're reinforcing the ramp first so that we can then bring construction vehicles, but also bring the ramp up to the desired load rating for parks and D.O.T bridges. So that is part of this. That's what we're working on now, okay- and I have two more questions with this six months or eight months. Whatever wills Delay was. Does this? What are you looking at as a completion date now for the project? We're looking at fall? 2023, okay and my last question- is about a drawing that you did not show us if you could go back to it. I think it's one of your early drawings with Clara coffee color, because I've gotten a lot of questions from people in the area and also people from board six that I happen to know and come in contact with that's it yeah. I know that the ramp is going to be handicapped accessible. What they're telling me- and I do not know if this is correct or not, but the south end of that drawing going up to where the ramp is there going to be seating there, because a lot of seniors go there, people in wheelchairs etc how accessible and what will you have in that part of the park once it's redone? So then I can go back to them with an answer sure, so I'm not sure how legible this is in the drawing. But there are these darker brown rectangles. These are the benches that are along the walkway now so as part of the minor modifications to the park at the northern end, we also wanted to ensure that there would be spaces for companion seating within the existing park itself, and this is my last question. If I'm on a bike- and I want to go on the greenway and I'm coming off Sutton place south. Can you point I do not know if you have a pointer, can you tell us where, on this drawing how I would get access to that ramp to get on the greenway from the street? Where would I go through the park? Oh sure, so, for example, if you were going, I ca not remember exactly which way you were coming from, but if you were coming on, can you see my mouse? So if you were coming say from 54th street, you would cross that in place, and do you see this green area? That's new bicycle pavement and then you would go up this new red, detectable warning strip and then up here this is the landside ramp to get you up to the bridge going over the fdr okay. So then that still leaves the park where the people are sitting without the bicyclists and those people bothering them. They still have access to relax. Yes, there's our. We also added benches along this side of the ramp landing as well. Thank you very much. Evie you're welcome. I also wanted to catherine saved me with this information, but the letters are just over one foot tall for the Andrew has watering sign. Thank you. Thank you. I think Barbara was next right. I may have missed something, but will there be closures so that we ca not use the espionage? At any point I mean below 50. The below 60th street is not used now, anyway, what part would be closed off at any time that we wo not have access to the esplanade? I think it may have been Judy. May it may be part of Judy's question, but I ca not picture it. So yeah go ahead. Evie, oh, I was. I do not think there would be any part of the esplanade that we're closing off. That's currently accessible we're closing Sutton Place park, but that's below us. Okay, that's what I thought, because with the construction I could not picture where it be. Thank you. I look forward to 2023.. Sorry, I muted myself right so Barbara I mean the esplanade ends right at alice, aycock pavilion. So there is no more esplanade Judy's question. It was one of mine which was just that as long as the ramp stays open to pedestrians, then there is no. There is no closure there. Felice, you you've got the next question thanks. It's not directly about the Andrew Haswell Green Park, the Eastman Town Greenway and the work that's going on there does that involve repairs to the sea wall. I know we talked about that a lot at the last committee meeting and I was just wondering to what extent that's covered here. Yes, so this is correct me if I'm wrong on this. So the repairs to the sea wall that are going on throughout the esplanade are being overseen it by Parks, Department and- and this is an EDC run, projects excuse the baby, but and so you guys are not repairing any, you guys are actually building new esplanade. So there's no repairs to the seawall in this section, they're just expanding the esplanade, but evie. Can you say more to that and I'm just going to mute myself will so just if you, if you have to need me, please do sure I mean that's exactly correct. Actually, if someone from parks on the call is available to speak to the seawall repairs, that would be great because I right EDC is not involved right, but this- and this is a wholly new section of esplanade. So it's it! It's all new construction, the portion that EDC is working on. Thank you before we, after EDC, does their presentation. I know Barry has or will or I'm sorry, Wes Hamilton has updates on the esplanade, and we can certainly touch about those repairs, and I expect that Wes will have some updates on repairs to the seawall. Just before you leave marco. Yes, please call on marco yeah welcome. Ah, thank you. How much you caused this project? Can you hear me you're right? We heard you yep. You were asking about the overall project budget, 160 million. How many blogs? I'm sorry! What's that how many blogs it's nine blocks? It's from 53rd to 62nd? Okay, I find it your proposal of the attractive more inviting that addressed to the people to say what is the what is the name of this park and I think it's missing that party missing some decorations to enhance a signage and I think you lose also in the in the run. You lose a great opportunity to divide the cyclists from the pedestrians because remember at the parks, senior cities is going over there and you had to protect them and then obviously you had to provide access for the cycles. So you lose the opportunity to use the vegetation to help to have a more secure area for the possessions and allow more freedom for the cyclist, and I found that the entrance a little bit too far too flat, not much with demonstrated. That is the entrance to the park, inviting that this is a park. This is full of trees, flowers, something that really tells you as soon as you see it. That's the part without even putting offenses nothing, but that's you have to invite the community, even though most of the people that live in the community, they know very well, but other people that come in for a different sector of the city. It would like to know where is that park people right now when I walk over there? I do not know where is the entrance over there, but now later I understood as the entrance to the to the park. So I think this you're missing a lot of opportunities to do a beautiful design probably will increase your cost increase a little bit then the this the design itself, and I think you have to give more priority to the pedestrians and that's my impression. Thank you. Thank you, marco I will breitball. Has a question will and Barry I have. I want to ask a question too after that, but go ahead. Will sure thank you evie. Could you go back to slide six? We I feel, like we talked about this, the last time you guys came and presented. We talked about how, in this area where there is a shared space for bicyclists and pedestrians, maybe doing some sort of treatment to the hex pavers or something to sort of like show a place for bikers to be versus where pedestrians would really be walking. Was there any chance that you guys looked at that if there's any way to do something with the pavers or something to just sort of give a visual of where you might be expecting a bike to come by? Yes, thank you. Actually, that's a really good question not represented accurately in this rendering. So this is an older rendering, and since this, since this was produced, we actually had further coordination. I'm trying to see if I can find a graphic that shows it. Let me see if I can zoom in that drawing by the way goes back to 2006. Yes, it's a long time coming. Yeah so tell me about it for sure. Hopefully you can see my screen here. I realize it's probably pixelated, but I think you can get the idea right here. This is the this is the area where the esplanade transitions from a separated bike and pedestrian path into a shared path. So through these hex pavers, we've actually made a like a visual gesture by putting darker hex pavers in the center, where the bikes would go signify that the bikes would come through in this area, so we're actually going to continue that treatment through Andrew Hazrell Green. So again, this actually needs an update where this dark ray ban would continue further on north and it would connect to the treatment. That's further north on the greenway you go ahead. I see Rita and then, if you do not mind, Judy I'd like to just ask the question before we go into seconds, but Rita go ahead. We go back to the slide that I could get, which one two slides back. I think it was six the one where it showed the certain place, one more. Ah, that's what I have. Where is it that you have the sound? This is not it. The Southbound and northbound lanes of the Fdr drive, because I thought all this is on the actually on the northbound side, not on the southbound side, because the southbound side has all hospitals. Yes, this is on the southbound side. So if you can see my mouse here, here's the southbound and then the northbound is further east from that. So it's just further south from where the hospitals are so the southbound I'm trying to orient myself the Southbound the Southbound lanes. Do not I mean the Southbound lanes are on the west side of the fdr. Is that correct and the northbounds are on the west side of the Fdr and the East side? The northbound would be on the east side. Closer to the water, I get it now. Thank you. Hmm! I just got muted, so give me one second to mute. Her thanks. I guess I'll wait until Lowell gets a chance to ask his question so go ahead, will with Lowell. Well, you just have to confirm. Okay, I think I got it question about the pavers in the granite block. Are they being purchased in America? Are they going to get from China like they did with other parks projects? We have not gotten to the point of procuring pavers, but I believe the construction managers speaking with american sources yeah that would be economically beneficial for our country. Thank you. That's it great. So I had a question about the Al. I feel like we talked about this before, but my question has to do with underneath the alice aycock pavilion. I just feel like the last time you guys presented and this time we present- you show it, but it's not you. We do not actually get to see the inside of what that's going to look like and that's a pretty critical piece in my mind: it's one in our in our actual community board and two. It's the entry point to our community board from this other beautiful work that you're doing south of the district, and I and three there's just a lot of visual yeah, that's yeah, so this is the best that we've seen and I just do not know what that looks like deeper, and I do not know what your lighting's going to be like. I do not know what the signage is going to be like I I you know, that's an area that has been closed off to folks for a very long time, if not always- and I would love to- I think I asked this last time too. I think I would just love to see more more imagery and more visuals of what that's going to be like. I think that you're going to have a lot of it's just it you. I think that in general you will have. You could have a lot of just a lot of activity under there and I would love to know about lighting, and I think I do not even know how wide it's going to be. So I do not know if it's a pinch point for cyclists and for pedestrians in there or what that's going to look like if people are going to want to sit under there because it will be cool or if people are not going to want to sit down there, because it will feel unsafe, because it's not very well lit, there's just a lot of questions that I have about that section. So I do not know if you guys can talk more about it now or if you can share more details later, but but I am very interested in that section yeah. No, I think that's a really a really fair point. Unfortunately, we do not have any renderings showing what it would look like inside in this project, but I could I could try to do my best to explain so the hex paving will continue into the water side Bay. I believe the pinch point. The width here is about 14 feet, and then we are putting a fence kind of along this middle column, line to prevent people from going into this side, and then we also have lighting that we'll be installing on the columns. Okay again, I think that the next thing you guys can come back. I would appreciate more details. It does not. I mean, I know that you you're doing the best you can to describe, but I just do not think it really. It really is clear as to what we're expecting over there and it may be where our community board feels like they want to pass a resolution or make some actual suggestions for how that's going to be. I know it's not fully developed, and I know that it's not in this next phase of what there is there, but if this is what we're going to be staring at for the next foreseeable future, we may have some thoughts about materials or layout or lighting or other ideas for signage or whatever else, that's there. So if it's possible to get some visuals to see what you're, what you're actually expecting, I think that would be really good. Let me make a request of will fisher to get back to us. Please will with where we are on Andrew Hasselgreen Phase three and we've seen a number of proposals, but has have they evolved since the last time we saw you, so please try to arrange to come back to us in the next month couple of months so that we can weigh in on where we are on Andrew Haswell, Green Phase. Three I mean Barry is that, but that does not seem like it's phase three, that's being that sees like that's literally part of this project, they're touching it during this project. It's not phase three. Am I correct on that? Eb, that's correct! We're doing it we're doing kind of the minimum we're doing like work for a future phase three, so we can go back and pull together documentation to send that through will to you, so you can understand better the proposal underneath that I'm fine, we'll look forward yeah, and I think I think that trisha you're right that we did talk about this last time and the and parks may be able to speak to phase three, since we were not brought on board to do that part in particular, and I'm not sure if that project is funded right now. You know this is obviously a connection point between two other projects, so I think at the very least trisha. If we do not have a rendering, we can definitely provide some cross- sections or you know something describing what the basic stuff like you talked about in terms of materiality, how wide it's going to be in comparison to other places on the path and particularly where you have pedestrians and cyclists crossing and and what the lighting plan is going to be yeah. Thank you. I mean I get I've seen phase three. I think phase three looks beautiful. I understand it makes me a little nervous because it sounds like this is you're talking about like some transition between EDC and parks, and it does not seem like it just. I would like to just get some clarity for the community, regardless of what agency is overseeing it, and I do think that I just think that you are touching that area, but we do not know exactly what that looks like and particularly as you have, and I'm imagining cyclists going into this dark corridor and pedestrians going into the stark corridor, and it just seems like, even if it's not your project and even if it is parks overseeing. I just think that there's a real vulnerability here that I just want to make sure that we're clear on beforehand and can weigh in absolutely that's completely reasonable, and you know I guess, while the while overall phase three is not. You know in our in our jurisdiction in this project that Corridor is obviously part that connects the projects and that is within our scope. So you know in regards to the lighting and the safety materials, etc. That's something that we could definitely get to you great. Thank you good point. Judy. You had another question yeah two things now I had an answer for felice who was asking about what was happening to the sea wall and in this particular section, which has become part of this project under Andrew Haswell Green EDC will be fixing the pilings under that part of the park that need fixing. So in that respect, we there will be work done during this project for support of the espionage in that location. That is not the greenway part. The other thing is: will I think, when Stantec did their final, drawing based on all of our things? I do not remember. I have not looked at the drawings, I think they had as part of phase three a drawing for this part of where the bikers and the walkers go through the building. Underneath I think a drawing does exist if you go back and look that shows that part of it, I do not remember if it showed lighting, I'm also wondering I think it also showed seating in the openings I'd like to know if that seating is being done also as part of the bike path by the Greenway right. I do know that we are as part of the scope. You know, there's sort of a there's sort of a large wall there we're opening up that wall to bring in additional light and air into the into that corridor. You know, there's going to be other lighting as well, I'm not sure on those specific parts. I think, in regard to the work that stantec did while we do not have a formal rendering, of course we do have construction drawings and probably some other simpler diagrams. So let us go back and check and we'll send you all an email in the next week or so with some more information on that area. Great. Thank you. Barbara again, I'm going to ask so if what Judy said about the pilings, does that mean a certain section? Will be closed off? That's number one. I have two questions. Will we be losing we lose so much of the espionage? I hate to lose one more inch of it and I think that's why yeah the portions we're reinforcing is currently not open to the public. It's the it's the portion of that. Okay, great! So that's the same answer is my memory. Correct did not. We think that was not there something about us. The stairs go up. The stairs would be partially seeding, some very innovative design about going to the second level or something like that. Is that that's all phase three barry. Am I correct? Okay, yeah, so that that's later that's a few years from now right, a few years from now barry it may be good for us to put on the agenda in the future to get parks back to do another presentation on this. Since yes, Ma'am agreed Michelle. Okay, so I see no further hand shall we move the agenda great. Thank you. Thank you guys, we'll look forward to your your follow- up. Thank you again great thanks for having us. Thank you very much. Well. Thank you, evie have a good night me too. Thank you, okay. So the next item- and I forgive me if you still hear the crying baby in the background. I hope that you ca not but oh Judy is sharing screen. Sorry, Judy, okay, you're gone great, so back over the summer time when the city and really the entire country was seeing a lot of protests and a lot of discussion and calls for racial justice and equity. Elita had asked our every committee to think about how issues of justice and equity impact our specific committees and Barry, and I had already just given the timing of our meetings and what was on the agenda said that we were going to do just that, but wanted to had to put it now in the fall. So this is why this topic is up here today, and I know that generally we talk about projects in our parks, Committee and we, you know, look over designs and proposals and that sort of thing, but I wanted to give us the space to talk about this and to just get any sort of thoughts that anybody had on these issues. Here. I do not to be honest with you think that this happens in one meeting, and I know that this that a lot of people have thoughts on this, and I know that this may be better addressed in joint meetings or be addressed on one- on-, one discussions or in other groups. So I can tell you that I do not think that any sort of resolution is happening tonight and I do not think any sort of conclusions are happening tonight. But I wanted to just kick it off and ask if anybody had thoughts on this, you know really and I'll and I'll share with you just some of mine to start and then I'll just ask if anybody has comments on it and really. I think that over the past year, there have been a few instances where I've, where I've thought like this may be something that we want to talk about thematically later on one instance that came to mind was the whole Amy cooper situation in central park, where, where there was somebody who was using their power and their privilege to to influence and to you, know, harm somebody really bully somebody else, and we never took a stance on that. It is obviously being handled. But there are a lot of. I can think of a few other times where, where people have felt unwelcome in our parks- and I think that that's a real problem, that in general are, I believe that our parks and open space are vital to urban living, and I think that everybody has a right to feel safe and welcome in our parks, regardless of your race, ethnicity, sex, gender, Zip code or any of those things, and that we should be doing everything we can to make sure that everybody feels welcome and safe in our parks at all times and that these are. These are places that connect us all. That's why I love the esplanade so much and why you all know that I care about this is because the esplanade's not just ours, it's everybody's. It's it connects us. You know throughout different communities. That's really all I've got so far on this, and so I do not want to say too much more about it right now, but want to give everybody an opportunity to say if they have thoughts on this. If they had questions about why we put this on the agenda, if you do not think I should have put that we put this on the agenda. I take full responsibility, but I want to thank Barry for agreeing to be a part of this too. So with that, does anybody want to add anything? I think we'll go to elita first, because Elita is our chair. Yes, thank you. I just wanted to also point out that part of the issue in central park was that she felt so privileged that she was above the law and he had asked her to put her dog on a leash, as she was required to do under the park regulations, and she was angry about that. And so it's not just feeling safe. It's feeling that people are doing the right thing and that does not impact other people that everyone is welcome and that people are expected. I guess to also be thoughtful. I'm glad that you put this on the agenda. I think conversations even if I said something silly or foolish or wrong, are starting points and that the best, what we, what we can hope for, is to generate a conversation with ideas and different ways of moving forward, that it takes a while to get answers and it takes a lot of community input to get answers or even to get talking points to get thinking points and that this is. This is a valuable first step because the parks are open to everybody and the park should be a place of refuge and solace, and friendliness and cooperation among everybody I'm not sure how to start with that, but certainly the parks are critical and as what Kovitz shown us is that having space and air are essential in the city, so thank you Barry and Trisha for orchestrating this and initiating it great. You had something to say: yeah you perhaps if our members on the zoom have any questions comments, observations, thoughts, I'd like to share, please send them to will at the board office who will then disseminate them to Trisha, and I and me and we'll just we'll, try to formulate a a document and look at that document together in a group and we'll try to get some sense out of this right. Thank you. Sorry, Barry you're, absolutely right! So I mean this is not. I do not want to put everybody on the spot and we'll take any comments that people have now, but this is probably something that you know we anticipated was not going to be. Like a you know, let's figure this out all tonight so like really and truly, if you think on it or God forbid, or you know, is there another instance comes up in our parks that you think are really cool with you and you want to share comments. Just send them to send them to will and we will figure out how to go from there, because I think it may affect the next meeting or so I'm all for conversation, but I also afford doing something. Am I you know the health seniors? One of the things that has struck me for a couple of reasons is that we do not work with Cb 11 enough, particularly with the espionage. We are one espionage and 96th street is a man- made barrier. I'm on the Community Advisory Board of Metropolitan Hospital, one of the women that really hurt me. She said she talked about the espionage. She said the only work that's being done is below 96th street, and I said, oh, my god come to 77th street and let's see what you see there, but I think that may be a dialogue where it is not that fishing is in Cb11 and something else is in cba would be a very good way of starting and that's something I like concrete things rather than discussion is the way we're doing, and I'm trying to have the committee that Rebecca and I a co- chair of to work with that type of thing. We are working with Cb11 as a matter, so I would like more dialogue with Cb11 trisha. We saw what was his name Bob rodriguez, the assemblyman, who talked about the espionage and talked about how it is one walkway. I walk. I do not know when I cross over 96, I'm not saying oh gee. Now I'm in Cb11 it's one walkway, I often walk north and I would love to see more of a cooperation and I think that we would open up and have a better dialogue that way, yeah absolutely Barbara. I will say that we've been trying to we've reached out to Cv11 a handful of times to try to work on this together. There are a couple. I think that the esplanade is clearly the biggest best example of this, but there are a lot of other issues. Irma's brought up one too that that's on our border with one of the parks and developments that go on that's going on over there like there's a lot. I think that there's a lot of collaboration- very maybe you and I can put our heads together and see if there's another way, to engage, Cv11 and see, I think in part it's just a problem because they have their meetings. At the same time, we do so so they've we've not been able to- maybe it's easier in this virtual world to do, but we will try to work on this. I think really, I think it's a really great suggestion. We definitely will so billy, then craig then elita thanks, Trisha and Barry. I'm really glad this is on the agenda, so that this is terrific. It's good to see committees starting to take elitist charge really seriously. You know it's hard to know where to begin. I hope this is just the start of a long conversation. We, as a committee and many other committees, have on these issues. I thought Barbara's points were really well taken about working more together with Cb 11.. You know for me what comes to mind a lot of what elita was it a leader who mentioned Amy, Cooper or whoever mentioned Amy cooper, of course that's relevant and how we think about also policing in our parks and whether the parks are a place where policing in this sort of, certainly in the criminalization sense can be removed and things can go in sort of a more civil way or a way in which we rely more on arts enforcement rather than NYPD. Another thing that comes to mind is Carl. Schurs Park, where I know Trisha was incredibly responsive earlier in the summer, and others have been involved where signs were being taken away and destroyed and vandalized, and I think, or I hope, as a committee that we are, you know, aligned with the visual in Carl, Shares Park and the freedom of speech being exercised there and I think we've even best resolutions, perhaps in support, or at least we've sent letters in support. I think and then the last thing- and I do not really like I said I do not really know where to begin here, so I think we all need to kind of dig in. I guess two last things one is: can we bring in more voices from our community? Particularly you know, people of color in our community who are experiencing our parks differently than I am, and just an effort to bring in those voices to this type of meeting, I think would serve us well if we can find the right way to do that and then the last thing is just in googling around the this organization. The national Recreation and Park Association has a couple articles on looking at parks policy through racial equity lens. They look at examples from cities like Seattle and Minneapolis. I confess I have not read the whole thing or most of it, yet I just pulled it up, but you know if we all want to look at that and say: hey, are there examples where cities have dealt with this in a thoughtful way that we can learn from? That could also be instructive for us. So, like I say, I do not really know where to begin on this. I think we all need to sort of do a lot of listening and figuring out where we can play a role and hopefully bring this type of thing back on the agenda at a meeting soon yep. Thank you billy. I I'm making notes on this right now, so we are certainly doing that. I and billy you brought up a good point and then we'll go to craig and elita, and then Lowell is just that. I failed to welcome the folks. Obviously we have a nice sized crowd here tonight and I, if this is your first community board meeting, then I'm really glad that you chose parks. This is something that I feel extremely passionate about. If you could not tell, and it's how I got introduced to my Community Board was through this committee through Barbara, Rutter and Peggy price. Who are the chairs then so welcome? I would love to talk to you and can even stay on the zoom for a few minutes afterwards, if you have any additional questions about how this committee works or how community awards work, but we're very glad you're here, and I hope that you come back to this committee, and I hope that you bring your thoughts and concerns to this committee as well, so Craig, then Elita, then then Lowell and then I see Jessica right hi. Thank you. I just wanted to say I've been in that situation personally, the gentleman in the park with the dog, probably at least a hundred times at John, Jay, Park, specifically and several times also a car shares and no matter how nicely you ask or remind them that the dog's not supposed to be off the leash. You look like the bad person, no matter what and it's a very uncomfortable feeling- and I mean personally, I do not even think dogs should be in the park. If I had a kid, I would be very cautious about letting my kid play because there's excrement all over the place. It's a health factor, but you know when confronting someone I've been threatened physically verbally. You know race, creed, color aside, and it just it's a situation again. I think someone used the word entitlement previously and that extends to numerous other situations. But I've been in that situation and it's really uncomfortable, but at the end of the day it's a wild animal off a leech, and you have no idea what that animal is going to do whether the owner thinks it's a tame, animal or not, and you really have to protect yourself because there have been new. I have been bitten other times that it would have been bitten. Had I not protected myself and it's just almost a little bit of a chess match that you have to go back and forth with this person to get them to comply with the laws you know and I've seen parks, recreation. The lot pep come into the park, not right tickets, which just empowers people to do it more so, and I know it's a very limited force and they're cutting down on you know I'm because of budget constraints, but I just wanted to mention that. Thank you. Thank you. Craig Alita, Lowell Jessica, Trish Trisha. If it's all right, you can go to the public member to Judy and and even before, her Jessica who's, a member of the public and then come back. If that's right, yeah, that's fine! Thank you lowell. I hope you I do not see you on the screen. Are you? I hope you do not mind? I'm just going to go to Jessica first, just to give the public number a comment, an opportunity to comment. Oh! Thank you very much. First, I wanted to thank this is my first time attending. Thank you, billy for bringing up the vigil at Carlshaus Park. It's something that's very important to me that I've been attending for a long time now. I think that having a dialogue about racism and race is imperative in every space it should have, you know, should have been for ever. The support of the Community board, I think, would be really helpful. We have a lot of people who come and vandalize the vigil. Quite often we have people who stalk the vigil they drive up and one of the people who drove through the Columbus circle protest is someone who parks outside of our vigil and just sits there kind of harassing us and then there's one person from the neighborhood who comes, and I go so I'm the school teacher and my brain's litified right now torments a lot of the members and is very against what we're doing calling us fascists, our anti- fascists and any community board support backing us up that we are allowed to be doing. What we're doing would be very much appreciated, and if anybody wants to get involved, it's a fabulous place. It's a fabulous community, there's amazing conversations happening. I just wanted to share that and ask for your support. Thank you. Thank you. What do you say? Barry? No, I said thank you Jessica. Thank you. I want to get through the other comments. I saw Judy as the other public member and then we'll go back to board members. My comment goes back to what billy was saying about police officers or pep officers. We do not have enough pep officers, and I guess Wes can address this when he talks. I do not know if we have one two or three in our community district. I know call sures pays for one I think, will breitball we have a budget meeting coming up this month. I suggest people go to the budget meeting and put that as a priority to ask for more funding for pep officers for our parks. I think it's greatly needed thanks we're going to go to elita next, but actually Jessica. I just want to. I just want to respond to you really quick, because I do not want to ignore you, but I so I understand and I wrote it down. I do not think that we can pass a resolution tonight on this because we did not put it on the agenda, but I will certainly talk to barry about it and I will immediately we'll talk about if there's any sort of safety issues that we need to address if people are feeling unsafe immediately. We should talk about that, but we will talk about trying to find the best way to address this and to bring this up, and I- and I totally hear you- I do not want you to feel like you're being ignored on this but generally and welcome, and I hope you come again. Our general process is just that we have to post about something if we were passing a resolution on it so that we posted in the community and everybody has an opportunity to join us, and so because we did not specifically post about that. I do not think that it's. I do not think that it's totally okay for us to pass any sort of resolution on it, but I hear you and thank you, okay to Elita and Lowell, and I think Sandra was next thanks, trisha to Judy. We do ask for pep officers in every budget and we do not get a satisfactory response to Jessica and the other issues involving the vigil and the vandalism and everything else at Carl Schertz. I have not talked to Tricia and Barry about this in a while. I know when there was vandalism over the summer. The board issued a statement. We object to anything that endangers harasses, stifles free speech and that's on either side. Free speech goes both ways. That's certainly my personal opinion about speech. We support people being able to exercise their rights and do not support anyone who seeks to obstruct that exercise or seeks to vandalize or harass or torment. I believe was the word you used or anything like that and what's going on in Carl Schertz and some of the other action statements that have come to Cba come Cb's way are, are problematic and deserve of a full discussion and a plan, because that's it's wrong. It's wrong. It's wrong for the people who are there legitimately it's wrong for the members of the community that have been disenfranchised and do not have a voice and who those people who are protesting, whether they're board members or not, are seeking to give a voice to. All of that is just how it should be in this country where we, where we have freedom. But having said all of that, Cb8 is an apolitical organization, so that has to be taken into account as well. We are seeking to try and bring more equity to discussions to quality of life issues in the community, and I thank everyone for bringing all of these things up, because they're all important and they're all the start and the reason I raised my hand again. Trisha was in order to to look about and think about, Carl Schertz Park, because those are different issues than central park and and they deserve a discussion and where there is an action that threatens the ability of people to use the parks in any way, that's legitimate. That needs to be looked at and stopped. So. Thank you very much lowell. Yes, maybe we could do something. You know, as far as the arts to bring them into our parks from diverse artists, maybe even students not commissioning huge pieces but bringing art to a parks that show racial diversity and equality. Maybe we could have when they build a park to have an area where it can be displayed by students in the area, or you know local new yorkers. That sounds great. Thank you, hello. Thank you good. I see. There's a I see, sorry, okay, we'll do we'll do Sandra cause she's been waiting and then we'll go to Betty after that, hello, all! Yes, so I want to just echo some things that Jessica stated. Thank you Jessica for speaking tonight. She has been there actively with us as well as others, since June 2nd of this year, as we all know that there is civil unrest throughout this nation car shoots. Park is a public park and sadly there are some individuals that do not want us to gather there nightly to fight for black lives. We are there we're not going to stop. We are non- violent. As you some of you may know, there was a a signage that was put up to say absolutely no protesting there and it was taken down by the Parks Department. Thankfully, but you know that's just some of the things that we face, trying to make change in our community and beyond, so it's nice to have the support of the community board, but mainly the support of the community, which is very important. So we do have a lot of people that embrace us. We do have a lot of people that come out. I had a fabulous talk, the other night with a gentleman last night, a couple of two days ago, just saying that he understands and how he did not understand things until recently. You know how bad things were, so we are on the right side of history and that's basically it I just wanted to. You know thank Jessica for speaking and Echo, and I wanted to just echo that, yes, we are facing some issues out here, sometimes nightly, sometimes every other night and some threats that are coming to some of our social media platforms. They're dm'ing us so, but we're here to stay until we decide to pack up. Thank you. Okay, great, we said Betty and then billy has offered to step back until others who have not spoken. Wanted to say something: so can we let Betty go and then craig who has not spoken yet, but he just hit Star six. Do not you hello? Okay, I'm here you can hear everybody hi. Yes, I'm very interested in the discussion about the park, bad car shirts, because we have had people. I've had several calls from people who say that the park this does not have to do with the with what was just discussed, but that the park in general is not being kept up, and I was surprised to hear that and- and I called the person that I thought was the person who was the president of the association- and I did not get a return call. So my question is have says this committee, or has the board been in touch at all with the Cross Shirts Park Association leadership? Yes, so did you call Patrick Betty because Patrick's the president of the Carl shirts, Part conservancy? I do not have the name now in front of me. There were two men. There were two names, one was the president and the other one was someone else, and I left messages for both and I never heard back so. You've brought some of this up with them. What kind of reset? What kind of response did you get? Sorry Betty, I'm, I think, there's a miscommunication, so we are in contact with Patrick who's. I mean we. We've continuously been in contact just in general about things we've most recently. We heard that I mean we have not specifically spoken about this. I do not know. If they've had a stance on this, we can talk to them about it. They have recently just communicated with us and told us that all their programming has been postponed or canceled this year. No, I'm talking about the general condition of the park. People were complaining, so I just wondered because that's been going on. I just wondered if that had ever come up at the Park Committee, to have called them to find out why it's not being kept up, they do have funds for the police and for the workers so so that issue has not been raised. Then I mean when you've spoken with them: they that was not an issue that we've talked about. We have not heard about it before this unless barrier, unless I'm mistaken on that, but we can certainly bring it up with them and follow up Betty. Actually, it has not been brought up to us betty. It has not been brought to our attention that the Park Crossroads Park has been disrepaired, but now that we've been alerted to it, we shall pursue it. Thank you. Thank you very much and also that yeah and they also in the past they've always responded. So this time I just wondered, I thought maybe they're not in town or whatever. So it's good. If you follow up, that would be great. Thank you, craig hi everyone. So first I want to just second what Lowell said. I was thinking the same thing in terms of arts, whether it be actual physical art or whether it be other types of arts and culture. I'm hard- pressed. My point of reference is cultures, pork, since they live right next to it, but I'm hard- pressed to think about any specific events that have taken place that are meant to attract a wider audience and just thinking about cultures park in General. I do not feel, like you see a great amount of diversity within the park, certainly not what is in line with the rest of the city or even perhaps our community district, and then I guess one of the things that keeps coming back to my mind recently is with the increased police presence that's taking place. I wonder how welcoming it feels to people, especially those people that may already be intimidated by a lot of police preference. I want people of color to feel comfortable coming into environments, and we know people of color sometimes are not comfortable when they see large groups of police gathering and barricades in place and an environment that does not feel welcoming and then my final thought is. I do not know whether we can do this, but I do not know if there's any type of signage that we could put up like a welcome sign, that's sponsored by Community board aid that actually talks about some of our values for parks within our community district and talking about acceptance and talking about respect and treatment and welcoming and such so. Those are my thoughts I want to thank you for having this discussion. I think, is really important and I look forward to being part of it in the future. I really like that idea will or craig I'm sorry I'm looking at. Will I really like that idea, craig. Thank you so much. I wrote it down. All everybody's comments are being written down. Thank you, okay! So we're getting towards the end. Here I see Barbara. I see. Oh I'm going to sorry flutter of comments. Okay, so we'll go to Rita. First then Barbara, then billy good, it's very hard to do what you want to do, but it can be done and that signage should be done by the people that were trying both sides doing that sign or the artwork around that sign. It's very difficult and as much as that, we have the same problem with schools is that schools are representative of a neighborhood and therefore we're segregated by neighborhood, and you know, my stances is that we need affordable housing to integrate schools and neighborhoods, and that would help right now it's difficult, but it can be done according to. I would like to combine his artwork with this. Welcome sign. That's all great, thank you, sorry, Barbara and then billy. We said first of all, I love Rita's sentiments, but I'm going to bring up another park. I do know when I was a new commun parks chair and I do not remember who it is, and I you know it's not the issue. I did get a phone call to say the pool is you know, justice, neighborhoods and people from other neighborhoods are coming. We need, of course I did not hear this issue. Needless to say, we need to do more than talk, but hopefully that the pool will be open next year. Let's have faith that it will be. Although I'm doubtful, we have to make sure that we know that our parks are city parks, that people from any place can come, and particularly our pools. So that is another. What I said before about the esplanade- and I agree with Cultures Park- I do think John Jay Park, particularly the pool when it opens up, would be an area that we should spend time talking about and making sure that it's welcome for everybody from every area of the city. Thank you. Billy's got the last comment on this, but I just want to say that I remember. I just think that your comments are really well are very good ones. I think that, just in general, some of the stuff, some of the some of what our conversation has pointed out today, are things that clearly we need to just address and put on future agendas and figure out how we're how we're going to address it, but and but I think that some of the things that you're talking about are just are just like values that we have to keep in mind or things that we have to keep and remind ourselves with every park that we address and every issue that comes up. So I just I appreciate that and I and I hope that I'm just going to repeat what I say I think talking about values is one thing and trying to do. Something is something else of course, and that's just that's just my thinking not that I'm successful with it, but it's my thinking and my hope to one day, my late stage of life to be able to do that, and I just feel there are ways of doing that. Great! That's fine thanks! Thank you. Billy you've got the last word on this one. Just two quick points: one is, you know, I think, as we you know, continue down this path and get an understanding of you know the racial disparities. I think, particularly in funding for parks, I'd wonder whether we'd ever consider something along the lines of trying to pair up the people who volunteer in our parks, which are often you know, well resourced, both financially and with volunteers, and trying to help pair up those parks and those conservancies with parks and communities of color that are maybe less served by sanitation and by other government services. I suppose we first want to identify whether there are those disparities, and maybe that goes back to Barbara's point about pairing with Cb11, but perhaps with others, and then the very last thing I'll say is if we are taking up the carlsberg's park vigil at the next meeting, I would encourage everybody to try to make it to one of the vigils. If I'm allowed to encourage that, you know it's at 7 pm it's every night and it's really terrific it's at Carl Shares Park, and it will give you a sense of the great sense of community that exists there and has for more than 100 days now. So I hope folks will check that out before the next meeting. Great. Thank you Barry. Are we okay moving the agenda forward? Yes, ma'am! Yes, please, let's hear from Wes thanks guys unless, if you'll unmute yourself, how am I doing? Can you everybody hear me now? My name is Sir hey good evening. Everyone. Thank you for coming out on zoom, it's great to see everybody tonight and we've had some really great topics here, really great presentation with the east Midtown Waterfront project and a great discussion about Carmel shirts much to get into, but I'm going to move on to a couple other topics a little a couple of park updates. My name is Wes, I'm the park manager for district 8. for the Parks Department, and just a quick update on 70 on the esplanade at 76 East 76th street, where there was a collapse there. We got a lot of complaints about stoppage of work, etc, but we wanted to explain that we had to make a revision of the project after we excavated the hole and took a closer look and see what all the damages was. There was a lot of damage that was a subsurface that we would not be able to tell until we excavated it so the first project, the step of the project, was to excavate and to inspect, and then we had to revise the you know the completion of the project and determine the best way to correct the problem. So that's been done and we are currently there. Our emergency contractor is back at work on the site and we expect the completion to be done anticipated by the end of the year and just for a few more updates on that as well. That when I say we expect to be able to have the path back, it may not be completely repaired at that point in time, but we expect to be able to have it opened up and the path redone by the end of the year and I'm just going. To paraphrase a little bit from our chief of staff, who is heavily involved with our capital construction teams and provides us with this information, so bear with me. If I'm looking at another computer screen, I have old, I'm a parks employee. So my technology is very old, I'm talking into a phone, but I'm looking at a computer, so I do not mean to be rude on zoom, but basically it is part of the phases two and three of the Overall East River espionage, which includes sections at East 114Th. That was a topic that came up north of 98, which is East 14Th street through 117Th street, and also East 90th through east 94th streets and east 62 and each 63rd street. So all those are tied into another phase of the East River project and the final completion of 76 will be included in that. But, as I said earlier that part that section of the complete design is in the design phase. We expect the design phase to be completed at the end of the year and we expect the path to 76 to reiterate, to be open by the end of the year, not completed but opened by the end of the year. So if there's any questions on that I'll talk to that or try to answer as best they can and just a few other updates we've got. 24 sycamore park is a project that was stalled for Covid-19, but is back on project racked on point and moving forward as well as cat bird at coral shirts. I was actually there today they're making great progress they're about ready to do the safety surface the play equipment's getting installed. So there was a slight delay in cat bird, but we expect that to be completed soon. That's getting really close and pretty much the other projects are in the same situation. Honey Locust is awaiting procurement. St Catharines is in the design phase, but I'd also like to announce October is also our it's my park day. So we have several volunteer projects coming up and, as I said, with the Covid-19 we've kind of had to modify and change things we're working through some of those changes. So we had some conversations with the Muslims for new Yorkers for Rupert, I'm trying to work out some of the details. That was something that was brought up last meeting as far as supplying them with tools and we are working to solve those issues, but we have projects going on in Rupert, Siebert Seaberry, Carl, Shirts, Haswell Green, several of our parks planning to do some volunteer projects, so we're really excited to get moving back forward in that that's really going to help us a lot. People do not realize how much volunteers helped us in Parks Department, they're a great force and we're excited to be moving forward with that with that being said, I mean our permits are kind of the same as it was last month. We're only permitting youth sports at this time and first amendment right type permits and small events such as birthdays in our parks, nothing any that would draw any entertainment or draw additional people in. So our permitting is about the same with that I open it up is any questions for me with the parts Department for parts, maintenance, Theolita and just really quickly. There are a few people who are chatting me through the chat, and I just want to remind everybody that the chat is not for asking questions. We'll do I'm sorry, Wes does not see it. Trisha does not see it. Barry does not see it, so you just have to use the participants button at the bottom of your screen to find the raise hand, button and you'll get your hand raised. Barry and Trisha will be able to see you and you'll get called on, but chatting me is not going to be where you get your questions answered and if you're on the phone, it's star nine and I think I saw after Elita, I saw Lynn Cashman raise her hand great. Thank you I'll, be quick Wes. Thank you for the updates. Can you tell me if there's a time of day that shadows on parks cast by buildings have more impact than at other times of the day, go ahead? Well, let's say four hours of shadow starting at nine in the morning is that different than four hours of shadow, starting at 12 noon or four in the afternoon? Well, that varies. I mean if you're a plant and you need a certain amount of sunlight. Absolutely if you are somebody that likes it cool or somebody likes the sunshine, it's going to affect you, but it does not really affect much on the concrete, except for the overall temperature around. I tend to notice that the East side's warmer in the morning and cooler in the evening, so I know I typically sometimes occasionally have to do. What's called the Pearl rider about once a month, I have to travel the entire borough and check on parks on the weekends as being the only manager. We all each take turns doing that, and I can tell you for a fact that in the middle of July and August, I am going to cruise the east side in the morning and the West side in the afternoon. Because of the shadows, I meant I meant for plants, I meant for plans kind of when the seasons are changing. If it matters, if it matters to them, I do not really know how plants work. Well, we did not replant plants, it does matter to plants, but good horticulturist try to take that into account when they, when they do planting- and you know some plants do well with afternoon- sun and some plants do well with early morning sun. So what you try to do is evaluate what you have at a certain site and you also get refracted reflected light as well in some of the cities, so that can also and what we call micro climate. So those are the things we watch for as horticulturalists to look at a site before you plant it before you design or decide what plants to use, and we usually take that into accommodations when we, when we plant the parks. Thank you. I see sahar and then we'll go to Diego next and craig. If you do not mind and then we'll go to craig after that, good hi everyone. How are you thanks? Trisha for letting me speak. I just wanted to announce some of the details. That Wes was just mentioning right now and it's about October 24th that when we are participating in the it's, my parks we're doing it on the 24th at Rupert, Park and we've been like they will be around we're allowed to allowed around 25 volunteers maximum, so we'll be planting around 1000 bulbs. So hopefully next you know spring the place is going to look gorgeous and obviously we're coming in with the volunteers, so we'll be cleaning the park pruning it. We're meeting the gardener a day before S is like in arranging all of that and we're working with our coordinators well Ashley, who are both amazing, so we're working with them to do the best that we can. Given the you know the social Distancing Protocol, and also that we are allowed only 25 volunteers, but just wanted to say that if any of the neighbors would like to participate, walk- ins would be difficult because of obviously the given. You know understandable reasons because of Covid-19, but if anyone is interested, please reach out to muslim volunteers for New, York and we'd be happy to work with you all right. That was all I wanted to say thanks so much. Thank you very much. Go ahead, Diego! Yes, I just have two questions. One is regarding the playground of asphalt, green and the second ramp, and I assume this ram has been on pause because there's no money- and I just want to know- if there's any news about it- I hope it never gets done because it's going to affect the playground and the other one is relates to the Cbe 11, the Mars Brothers playground, which covers our community board and that playground has. We were promised when they built the secondary subway. We were going to get a new playground and there's nothing there. So I just wanted there's any news about that. I currently do not have any information when you say asphalt, Green, I'm guessing you're talking about the Kovacs playground, which is one of my playgrounds. I do not have any updates on the second ramp at this point in time. We will update the community board as soon as we have anything on that. As far as Marx brothers, that's actually, as we said earlier- that's kind of our borderline there and Marx brothers is actually another managers area. So I do not have any information at this time, but I can look into it and get back to you and the Community board and follow up with that. If there's any, if there's any new information on more explorative diego, when we reach out to cv 11, which we've done in the past, we've asked them to talk about both Marx brothers and the esplanade. So we'll do that this week again to follow up with them and just keep an eye out for our next meeting. We'll try to update on that. I'm sorry, I forgot Lynn, I said Lynn, so we'll do Lynn and then Eliza, then craig, okay, hi. I want to bring up the subject again about the closed bathrooms by conservatory water in the park. The restaurant has been sold. Of course, it's closed. Now it's been sold, but people are using the woods to relieve themselves. It's absolutely it's unsanitary. It's really terrible! You have a lot of families there with children, there's no place for them to use a bathroom, and the bathroom was also closed outside, where the boathouse is. I do not think they were running that bathroom, which was near the row. Boats and the park is really being you know it's used now. You know really used, which is terrific, but something has to be done. I do not know who's going to operate. Those bathrooms yeah Wes. I think that last week meeting we had thanks Lynn for bringing this up again. You had said that you were going to maybe follow up with the central Park Conservancy or whoever is the operator. Is there to see if they ca, not open up the bathrooms? Have you have you heard anything back on this? I have not heard back with them. I'll, follow circle back with them and follow up with it. Some of the things we were asking them is like who maintains which bathrooms, and that was that kind of was like. Oh, they did not know how many bathrooms they were even talking about, but it's a little bit easier. If I could just follow up on the boathouse, I can probably do that and I'll follow up and try to get as much information as I can from Central Park Group there Barry can. We just make sure I'm going to make a note, but maybe we can just put this on the agenda for next for next month, just to like actually make sure that we address it thanks Lynn and thank you for bringing it up again, Eliza and then craig Eliza you'll. Just thank you. Okay, thank you! So much I appreciate it. This is a message in relation to what Wes Hamilton had been speaking about I'd like to check I'd like to ask him if he would check the area right where the path meets the ramp that goes up into Karl, Schultz Park, there's another large hole. I just noticed, starting to cave in also, I hope, they'll consider at some point redeveloping that area, so that the lighting would go on the walls, perhaps along the high, where the highway wall is and widen the path, as well as to fix the holes and also to consider what to do about the area for the pedestrians to keep them safe in relation to the bikes which, somehow, especially in that narrow area, make it so that they're kind of in competition for the teeny space and for the elderly and pedestrians. This is a safety issue for everybody. It's a safety issue, especially now, since people are really walking a lot more in this area because of Covid-19. This is getting an enormous amount of people plus also because of the fair. The ferry now brings a lot more people into the into crossroads park as well, back and forth. Thank you, Eliza. Can you just for clarity? I'm just I'm taking notes over here the specific area that you're talking about for lights. Switching the lighting. Do you know streets absolutely so, where the 70? I guess it's this, the large ramp at 77th street. I guess it so if the area where the where the new hole opened up, yeah- okay, so go north yeah, just at the spot, where the large new ramp is that goes up in 81st street yeah, 81St, Street, okay, sorry yeah, so right there, literally at the spot on the on the walkway on the Bobby Wagner Walkway area. Just at that spot is a big whole gaping area. That's starting to open up. I was standing there today. I thought. Oh, my gosh, I looked down on my feet and I said, looks like you could fall through. So that's somebody's going to get hurt there! Wes! Can you double? Can you is it possible to check on that as soon as possible, the 81st street at the base of the pedestrian ramp yeah? Now, if I'm not mistaken, there was the base of the 81st ramp is at 79th Street and there was a complaint about a hole there. I will double check it just to make sure there's not a another one, but we did notice observe a small hole. I would say a large rodent hole, but we are monitoring we can put yeah and the idea that I had is because that area is so narrow and the bikes and other scooters are going through there and I've seen people have almost near accidents or problems with each other in that area and elderly trying to walk in the area. So at some point, when the Greenway plan expands a bit to that spot, they should consider the designer should consider- maybe there's enough little space in there to widen it and take the lamp posts and put the lamppost somehow on the wall between the where the highway is and where the people are walking, and that would give you more space for people to walk. But I also think at some point: it's really got to be considered how to handle the bikes and the and the pedestrians, and it it's becoming a greater issue. Since the Covid-19 situation. It's definitely a much bigger issue than it was, and that's something for the designers and the architects to think about and part and in parks and force parks, Department right, which that would help. In other words, that everybody should think about how you're going to streamline or not, it's not really streamlined, but how to extend that area around with all of the you know. The there was discussion earlier about an area where bikes are separated from pedestrians, and I think this is going to increasingly be an issue for that whole area to be considered and I've seen a lot of issues along the both the ramp, both at the top of the esplanade and in that Teeny narrow area and the bikes. Obviously, either they're going really fast or they must go slow because they're bottlenecked, so it's, but it's if you're a pedestrian. It's quite daunting. So you know those are there's issues for both the pedestrians and the bikes, and I've also seen other types of vehicles going through there as well, electric bikes, etc. Well, as I can see, those are some challenges that challenging for everybody, with electric bikes and electric motorcycles and the scooters etc, but we definitely see what you're talking about we know about it. I think, if I'm not mistaken with the east Midtown green, that's why they're trying to have two separate lanes. We try to separate it wherever we have the space, and so our designers are aware of that and in our pinch points or our smaller areas, where we ca not do it. The only thing I can really say is we try to you know, engage pep as often as possible right it's a narrow stretch in that area. It's very narrow! You ca, not even walk. Two people abreast. It's really like one person can walk through, let alone a bike. So it's a it's right where that other big large hole is it's just north? In other words, it's just where the it's exactly at the spot, where the ramp meets the that walkway, it's literally at the base right near the water, it's on the water side. So obviously, is it top flat or is it on the side or is it off the side of the it's where the railing is to the water? It's where exactly where the railing begins it. The railing begins again: it's where the railing begins again from the ramp. The ramp finishes gets down to the walkway, and it's exactly at that spot. There's a hole. Okay, we'll take a look at that and it's definitely the potential to have a real cave in right. There. Okay, we'll take a look at this, a lot of people going by and tons of people walking through in that area and bikes, but it's definitely caving. I could see it today, so thank you very much. I'd really appreciate your time. We'll take a look at it and we'll report it to our engineers to have them further study it some more okay, yep. Thank you. So much you're welcome sorry, craig we're just going to go quickly to Lynn and then we'll do craig. I wanted to ask a question about in central park: are electric scooters allowed and all that I see a lot of people zooming through central park on all kinds of electrical vehicles and not slowing down? I do not know what that rule is. I'm not familiar with central park is so large, there's so many different rules in each area. I can tell you in our playgrounds: there's not no bicycles are really technically allowed in our playgrounds, but regardless of what the rules are, enforcement is very challenging. We have that same issue as well on our streets. You know I've heard it from NYPD trying to enforce the rules. They in our same situation with our pep would enforce it in the parks some places we can easily enforce it. Obviously, if somebody's riding on a motorcycle inside of a playground that's easily enforced, but when it comes to scooters- and you know, electric bikes, it gets to be a little bit challenging to try to enforce that in areas if they can ride a bike. So we have the same problem on our D.O.T streets where you have bike paths and people are taking mopeds and electric scooters down there. They it can be enforced, but it's challenging. It has a lot to do with how much I guess enforcement and how severe the problem is. So the areas of central Park, like I say I mean if it's a bike, if you're going to allow bike paths, you're pretty much going to you're, going to see everything, that's from electric vehicles. I think at this point in time we have had parks. Even when I'm from Staten Island, we used to have bike paths where people went too fast, we can actually put speed limits even on bikes, so it does not matter, then, if it, if it's an electric vehicle or a bicycle. But again those are very challenging things to try to enforce. You see this on our highways and expressways and streets every day everywhere in the country you know trying to enforce speed limits and the proper vehicle. So you know all we can try to do is try to design ways to prevent that as much as possible or to separate great thank you. Okay, craig and marco thanks, Trisha hi Wes, two questions and we'll come back to holes and cave- ins in a second. But I was first curious: does parks do any counts in terms of park usage just because, just as a planner I'd be very curious to see how much park usage has been impacted by Covid-19 and whether we've seen the spikes that at least seem apparent here in Carl Sher's park, where I live just over the past few months and on the esplanade as well, especially- and I mean to answer your question: do we monitor usage? Yes, I've constantly mentioned how usage is up. We do that, though, for various through various means, it's kind of a guesstimation, if you will so, for instance, and it depends on what you're looking for as well, so for me being maintenance. What I tend to look at specifically is how much garbage how much tonnage we're pulling out of our parks. That's a real, simple way. That does not necessarily mean that you got more people, although it usually does, but you could pay people bringing in more garbage. So, if you're going to design something, our designers typically spend time on site looking at it and trying to get an actual count of how many people are there and how it's being used, is it being used by bicycle riders or strollers, etc? So, there's lots of different ways to look at the question. We also look at permits, but right now with Covid-19, like I said, a lot of our current permits have been denied for various reasons. So permits are not a very good way to see an increase of usage during the Covid-19, as you mentioned, and, as you said, with Covid-19 like everybody, we're relearning everything. We have to relearn everything and try to figure out new ways to determine it. So, but the one thing that has not changed is how much garbage you pull out of parks and that we kind of monitor we do not always keep a like a ticker tape. You know count on how much garbage we pull out, but I definitely know how often our garbage truck has to go and dump and how much garbage we have needing to be collected in our parks. So that's one quick, easy way to determine how our usage is. That's helpful, thank you and then the other question going back to the esplanade, and this is sort of a follow- up on last month. So at this point I've sort of lost track at all the locations where we have holes and cabins that have occurred. I've noticed one recently that I do not know if I had seen before, which is at 94th street. Clearly it's been on the radar of parks, because when I looked at a Google street view from July 2019, the area was barricaded, but it did not seem like there had been any sinking or apparent thinking or clearly a hole. But now it's very apparent. It's like a three foot wide hole where the pavers have all fallen in it's a relatively deep hole. So I just wanted to make sure that was brought to your attention in case it's new and just to again ask how can we the public, be assured that the area is safe and not just having that little barrier over? There is enough to know that it's not going to expand at some point. Well, it's a good question. I'm glad you asked that I mean we barricaded it and we barricaded it before the sinkhole developed and a lot of this comes from our engineers. They report to us that they see something and a lot of times. Our staff is inspecting it and we report- and I report and my staff report to the engineers if we see any activity such as linear, crackage or any type of depressions or- and that could be my guys, see it or just now. Somebody reports to me and I'll go, take a look at it and then we'll report to engineers and then we'll go, take a look at it even closer. So we are aware of that site. It is barricaded off and it was. I just mentioned that it is part of phase two and three or is which is currently in design for repair. As we speak now so 94th street we're aware of it, we have it barricaded and we actually have plans to prepare it. My engineering department has probably given you know, I believe I attended one and you were there. I believe at the Community Board meeting and we'll try to get them back as well to give us updates on the condition of the espionage specifically with the peers and the safety. So they do monitor the condition underneath the espionage and they report on that and then as well, that we have to ensure that the barricades are placed properly and that we monitor any expansions of sinkholes and we notify engineering as well for that regularly. So that's the best thing. I can tell you to try to monitor to keep the public safe right, and that was really the main element of my question because, right now the barricade is, I think, like within a foot of where the hole is so it's there. It would seem like it's okay, but you never know what could happen if the storm were to come through and such so I just want to make sure that it's where it is and does not need to be expanded right I mean, according to engineers, that's where they said it. You know they do occasionally get moved the barricade. So you know, if you have, if you're walking a small pet or you're with children, I would try to maybe go a little further away from the barricades, but but generally speaking, most of most of the sinkholes or in most of the situations actually are occurring from not necessarily like going right into the sea. It's actually where we have storm drainage or outlets that go out to the sea, and it's usually, the old piping system is deteriorated and now that what you see is collapsing and as we saw with like 76, it did create a hole, but it fell within the area that we had cautioned off as well. So it's you know, that's the best thing I can tell you is we try to monitor as best we can? We try to look for any hazards and we based upon our engineering and we try to go by science just like we do with Covid-19 and use the science to determine where we should have them closed on yeah and there it is just so. You can see what I mean with the barrier. Coming up very close to the hole all right, thank you yeah. We try to move them. Our staff tries to move them out and occasionally people push them back in, but we do check it and try to pull those barricades to the right, proper location. We're also looking into alternate fencing, we're looking into trying to get something other than barricades and going with more like a chain link, fencing more like a construction type fencing and surround them as well. All right, thank you. You're welcome, Marco! Thank you! Wes! You hear that sinkholes and sink holes and sink holes every time. It's like that. 76Th street, you said you open. You make an assessment. My first question is: can you think, do you have a geological engineer? Do you have a hydraulic engineer or you do not have that this kind of engineer, I'm sorry Mark? I could not understand what you're saying about my question is in your team. Do you have a geological engineers hydraulic engineers mark I'd have to get back to you on that I mean. I know we have engineers. We have several different types, engineers that, but they actually work out another division. I I'm more of the clean it and paint it and cut it kind of guy, so we can look into it and I'll get back. The question is, I mean I'm coming for the issue of. I ask for the assessment of the seawall condition, because if we do not have this seawall condition, actually we just going to have meetings behind meetings and you will come one more hole, one more complaint, one more goal, one more complaint and one more repairs and I think to stand it's time to stop that train. It has to have some more comprehensive as a technical evaluation of the seawall. Once you fix properly. Basically, your job will be much easier and the city will spend less money in these repairs because the smaller the repairs, the more expensive it is so tiny repairs are excessive, excessively expensive, a large repairs. It makes less expensive. So when you have this kind of condition, the best approach is first is to know what is the condition of the sea wall, and that is, I asked the last month and you offer to or at least to have, an old study, which I am anxious to read that the study, also you say, on 76 Europe, you make an assessment. I would like to read that technical assessment of that part, because this is basically will tell me what is the condition of the sea wall and then, basically, we can start preparing for some strategy. This is the main point in because if we do not have an idea what's going on in that part always we can have, we will have the same complaints and we have to stop that because this is too much too expensive for everybody and it's time consuming for you management, this area, and I will appreciate to have especially the technical assessment there, I'm anxious to read that. Please do you think that what you have available, those at least at least I would like to have even the old ones? That's that would be fine. Well, marco. I wish I could introduce you to the gentleman that built it, but they probably have all well passed away, but I will introduce you if they've been to the community board before we will try to get them to come back. Our engineers that currently work for us now and we can bring up some of those issues with there. I think a lot of the issues vary from location to location because the espionage was built, as I mentioned a long time ago, and there was different practices used at different locations, so it's challenging for the engineers, but they've done a remarkable job, and I pointed my attention to what they did at Carl Schertz at that area, which you know they brought the challenges to the board and had and fixed it and repaired it. So you know we'll try to get them to come back, and maybe they can address some of your questions that you have as well. For that, please make available the status. That's how many interested me myself, and then we can discuss later. Thank you thanks, Trisha Wes, I just have a quick question. I would like, on behalf of Cb-8 in the community, to have some kind of memorial at at Carl Schertz Park, a verbal thing with poems, maybe or statements from any religious or other leaders, and I'm wondering do. We need a permit but well we're going into some unchartered territory, especially with what's going on at Carl Schertz, but generally, I'm not sure with. I know with some stuff that falls under art. Basically, where we're at now with the 86th street plazas, that's considered a temporary memorial. I mean that kind of memorial nature. I'm sorry I do not mean I do not mean a permanent or freestanding memorial. I just meant an opportunity to just express ourselves verbally with that kind of memorial like more like a service, but not a service, because it's not religious kind of thing. It kind of goes into a couple different things. So, if you're out in the park, you want to read poetry you're more than welcome to do so, you can even play acoustic guitar as long as it's not amplified. So if you were to speak into a microphone or to use any kind of amplified instrument, maybe you were doing something I would acquire myself and you visited there and wanted to read poetry you're more than welcome to do so. I lost you. I do not know it was my computer or your computer. When you said about to use a microphone, then we need a permit correct. If you have any kind of amplified sound you would, it would be required to have a sound permit from both from the NYPD, which NYPD would not issue a permit until we approved your permit. So anything with the amplified sound requires a permit. Anything of that that you're doing as a group would be considered a special events with groups over 21 people. So, but if it was just one individual wanted to go out there and read poetry you're welcome to do that. Okay! Well, I'm just busy formulating this, but right now I guess: how long does it take to get those because we're thinking before it gets too cold on November 1st, with a rain date a week later, but will can follow up with you offline so for anybody listening? This is what we're kind of planning. I hope it's it and would love collaboration or if anyone wants to submit anything to be read or distributed somehow to just email will at info cbam.com thanks will and thanks Wes and thanks Trish and barry you've got if I could say something, though, currently right now under Covid-19, as I mentioned earlier, though, we're not issuing any permits for anything that would be like entertainment, wise that would draw people in so, but it would have to be maybe hopefully someday later down the line we could. We could look into that. Hopefully we get past this cova situation, but but yes, okay, thank you, okay, folks. I think that that's it for our agenda. Unless anybody three brief updates, tramway plaza, the current activity is still ongoing and the completion date is still expected to be spring 2021. That's good news, some point on the esplanade which I got very late today. There may be some night work at the 76th street site on the bulkhead in the coming weeks. The work can only be done with low tide and low tide may occur during the overnight hours. So there may be some construction noise. That's where it's coming from they'll, do the work as expeditiously as possible and on a much lighter nose, but a very pleasant note: Central Park has been named the 11th most relaxing place in the world, an apple called, unified cosmos. A media meditation website has dedicated to focusing on the positive aspects of everyday life. Releasing the most relaxing sounds in the world study on Monday and the Central park was placed number 11 in the world. So if you need to relax and think a good thought head off to central park with that, I say: well, I think we I see. Barbara Rutter has her hand up so before, while I'm in a relaxing mood. Barbara give me something to relax about. This is to relax and to add to what Barry says. I went to see a couple of times the statues of the three women. It is beautiful and it would add to your joy, Barry good, thank you, I'm adding to the relaxation and the joy and everything else. May I offer my thoughts each have a relaxing, peaceful good night and tomorrow and tomorrow and tomorrow, good night, all you.",
            "summary": "We are just going to jump right into our agenda tonight because we have a speaker for and our presenters here Well, it's an update on the resumption of construction of the east Midtown Greenway and Andrew Haswell Green Park, Phase, 2B, and I'm eager to hear that wonderful, presentation.\nMany of you know, the governor, issued an executive order that halted all non- essential construction work in the city.\nDetails again, just as a reminder and then going through the through the schedule and what folks should expect to see and then, of course, we'll be coming back to the community board, with additional updates as the project progresses, but excited to be here and with that I will turn it over to evie.\nThink at that point we had explains that we strategized and determined that the best way to deliver Andra, Haswell, Green 2B was to also pair it with east Midtown greenway, which is a larger project south, so just to provide a little bit of quick context.\nThe, east Midtown greenway project even further is part of a larger conceptual plan for the east Midtown Waterfront esplanade, so that was originally conceived as three separate sections going from south to north being the right of the screen.\nThe design team, which is comprised of stantec for Eastmantown, Greenway and Jacobs for Andrew We, wanted to have some unifying elements such as the park, standard, hex, pavers, standard, light fixtures and sea rails, but we also wanted to give a really interesting quality as you walk along this entire esplanade.\nThis is the existing park where we are putting the bridge ramp, access which goes over the Fdr and connects down here at 53Rd Street, and you would walk along this white box.\nThere is that we would basically fortify the ramp such that construction, vehicles and materials can come down so that we could build the rest of the esplanade and then work our way back out and finish.\nThat's this pedestrian bridge right here that will be done in 2021, Clara, Coffee, Park or something place park at 54Th. Street will reopen in fall of 2021 and then the entire greenway, including Andrew Hussell Green2B, will be open in 2023.\nSo, it's a chance for bikers to pull off and take a look out at the water in the landscape and then to the right is an aerial view of what the 60 street ramp would look like with the new pavement treatments.\nAnd, there's no surprises out there in terms of you know where there are temporary closures or where work needs to be happening, so appreciate everybody's patience during that time, So members of the members of the public or any questions starting with Judy hi.\nThink it's one of your early drawings with Clara coffee color, because I've gotten a lot of questions from people in the area and also people from board six that I happen to know and come in contact with that.\nAnd I do not know if this is correct or not, but the south end of that drawing going up to where the ramp is there going to be seating there, because a lot of seniors go there, people in wheelchairs etc.\nI know we talked about that a lot at the last committee meeting So the repairs to the sea wall that are going on throughout the esplanade are being overseen it by Parks, Department, This is an EDC run, projects excuse the baby, but, and so you guys are not repairing any, you guys are actually building new esplanade.\nYou lose a great opportunity to divide the cyclists from the pedestrians because remember at the parks, senior cities is going over there and you had to protect them Obviously, you had to provide access for the cycles.\nThen the this, the design, itself, and I, think you have to give more priority to the pedestrians We talked about how, in this area, where there is a shared space for bicyclists and pedestrians, maybe doing some sort of treatment to the hex pavers or something to sort of like show a place for bikers to be versus where pedestrians would really be.\nThe entry point to our community board from this other beautiful work that you're doing south of the district, and I and three I you know, that's an area that has been closed off to folks for a very long time.\nIt may be where our community board feels like they want to pass a resolution or make some actual suggestions for how that's going to be.\nAnd I think I think that trisha you're right that we did talk about this last time and the and parks may be able to speak to phase three, since we were not brought on board to do that part in particular, and I'm, not sure if that project is funded right, now.\nDo think that I just think that you are touching that area, but we do not know exactly what that looks like and particularly as you have, and I'm imagining cyclists going into this dark corridor and pedestrians going into the stark corridor, and it just seems like, even if it's not your project, and even if it is parks, overseeing.\nNow I had an answer for felice who was asking about what was happening to the sea wall and in this particular section, which has become part of this project under Andrew Haswell Green EDC Will be fixing the pilings under that part of the park that need fixing.\nElita had asked our every committee to think about how issues of justice and equity impact, our specific committees and Barry, and I had already just given the timing of our meetings and what was on the agenda said that we were going to do just that, but wanted to had to put it now in the fall.\nYou know, look over designs and proposals and that sort of thing, but I wanted to give us the space to talk about this and to just get any sort of thoughts that anybody had on these issues.\nI think that over the past year, there have been a few instances where I've, where I've thought like this may be something that we want to talk about thematically later on one instance that came to mind Was the whole Amy cooper situation in central park, where, where there was somebody who was using their power and their privilege to to influence and to you, know, harm.\nWhat we can hope for, is to generate a conversation with ideas and different ways of moving forward, that it takes a while to get answers and it takes a lot of community input to get answers or even to get talking points to get thinking points and that this is.\nPerhaps if our members on the zoom have any questions, comments, observations, thoughts, I'd like to share, please send them to will at the board office, who will then disseminate them to Trisha, and I, and me I do not want to put everybody on the spot And we'll take any comments that people have now.\nShe said the only work that's being done is below 96th street, and I said, oh, my god, come to 77th street and let's see what you see there, but I think that may be a dialogue where it is not that fishing is in Cb11 The way we're doing, and I'm trying to have the committee that Rebecca and I a co- chair of to work with that type of thing.\nIt's one walkway, I, often walk north And I think that we would open up and have a better dialogue that way, I will say that we've been trying to we've reached out to Cv11 a handful of times to try to work on this together.\nWhat comes to mind a lot of what elita was it a leader who mentioned Amy, Cooper or whoever mentioned Amy cooper, of course that's relevant and how we think about also policing in our parks and whether the parks are a place where policing in this sort, of, certainly in the criminalization sense can be removed and things can go in sort of a more civil way or a way in which we rely more on arts enforcement rather than NYPD.\nSchurs Park, where I know Trisha was incredibly responsive earlier in the summer, and others have been involved where signs were being taken away and destroyed, and vandalized, and I think, or I hope.\nYou know, people of color in our community who are experiencing our parks differently than I am, and just an effort to bring in those voices to this type of meeting, I think would serve us well.\nI think we all need to sort of do a lot of listening and figuring out where we can play a role and hopefully bring this type of thing back on the agenda at a meeting soon If this is your first community board meeting, then I'm really glad that you chose parks.\nIf you have any additional questions about how this committee works or how community awards work, but we're very glad, you're, here, and I hope that you come back to this committee, and I hope that you bring your thoughts and concerns to this committee as well , I just wanted to say, I've been in that situation, personally, the gentleman in the park with the dog, probably at least a hundred times at John, Jay, Park, specifically and several times also a car shares and No matter.\nOften we have people who stalk the vigil they drive up and one of the people who drove through the Columbus circle protest is someone who parks outside of our vigil and just sits there kind of harassing us Then there's one person from the neighborhood who comes, So I'm the school teacher and My brain's litified Right, now torments a lot of the members and is very against what we're doing calling us fascists, our anti- fascists and any community board support backing us up that we are allowed to be doing.\nTrisha was in order to to look about and think about, Carl Schertz Park, because those are different issues than central park and and they deserve a discussion and where there is an action that threatens the ability of people to use the parks in any way.\nI do not feel, like you see a great amount of diversity within the park, certainly not what is in line with the rest of the city or even perhaps our community district, and then I guess.\nWe have to make sure that we know that our parks are city parks, that people from any place can come, and particularly our pools.\nJohn Jay Park, particularly the pool when it opens up, would be an area that we should spend time talking about and making sure that it's welcome for everybody from every area of the city.\nAnd, but I think that some of the things that you're talking about are just are just like values that we have to keep in mind or things that we have to keep and remind ourselves with every park that we address and every issue that comes up.\nWe have several volunteer projects coming up and, as I said, with the Covid-19 We've kind of had to modify and change things we're working through some of those changes.\nA safety issue, especially now, since people are really walking a lot more in this area because of Covid-19.\nIt's definitely a much bigger issue than it was, and that's something for the designers and the architects to think about and part and in parks and force parks , In other words, that everybody should think about how you're going to streamline or not, it's not really streamlined, but how to extend that area around with all of the you know.\nThere was discussion earlier about an area where bikes are separated from pedestrians, and I think this is going to increasingly be an issue for that whole area to be considered.\nAnd I've seen a lot of issues along the both the ramp, both at the top of the esplanade and in that Teeny narrow area and the bikes.\nOkay, we'll take a look at this, a lot of people going by and tons of people walking through in that area and bikes.\nSo the areas of central Park, like I, say I mean if it's a bike.\nIt's been on the radar of parks, because when I looked at a Google street view from July 2019, the area was barricaded, but it did not seem like there had been any sinking or apparent thinking or clearly a hole."
        }
    }
}