{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "title": "Youth",
            "publishDate": "2020-10-16",
            "shortDescription": "",
            "lengthSeconds": "2:08:35"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "WjmYJ2m4400",
            "fillerWordCount": {
                "uh": 345,
                "um": 357
            },
            "readTimeFullTranscript": "85 min read",
            "readTimeSummary": "10 min read",
            "wordCountFullTranscript": {
                "school": 132,
                "students": 66,
                "kids": 46,
                "schools": 44,
                "children": 43,
                "teachers": 38,
                "day": 27,
                "guys": 26,
                "building": 26,
                "education": 22
            },
            "wordCountSummary": {
                "school": 40,
                "students": 14,
                "kids": 12,
                "children": 9,
                "teachers": 8,
                "principal": 6,
                "parents": 6,
                "home": 6,
                "days": 5,
                "learning": 5
            },
            "fullTranscript": "Hey Ira, can you unmute and just do a sound check good morning, excellent I've been my computer's been a little finicky with the sound, so I wanted to make sure it was working tonight looks like we're good I've. Actually gotten myself on the network and I'm on an actual cable. My connection has become much more stable and reliable yeah. I find I have a a hard wire to my router and it makes a big difference. Hey Julian, hi guys looks like we're. Recording too okay good. I guess we're all set up. I apologize for how bright my shirt is. I did not go off well, if that's the only orange we see tonight, then that's fine, hey! We have a visual on Blanche. I do not think I've ever seen you on camera before this is great blanche. You're muted, though whoops we lost your screen there, your camera blanche, usually it's in the bottom left- hand corner to Unview click here. What am I now on you're unmuted you're unmuted, but we do not see your face. Good and hey principal Washington is, with us, hey great, to see you great to see you too mark thanks for the invite hello. Everyone, hello Committee, was delighted that you could join us delighted to be here such an interesting night in interesting times. Oh, you could say that you could say that any number of causes there's Doug. Let's see you have some attendees too. Let me just make sure that I do not miss anybody. Am I still with you. We hear you that's great. Okay, that's fine! I went through identify, hydrants, stop signs staircases, crosswalks about five or six different, just to prove that I'm not a robot, oh okay, I've! I have not had to do that, but that's an interesting approach. Oh I do it every time, hi everyone. This is Natasha hi Natasha, I'm Natasha Blanche hi. So I guess oh Stephen is with us there Stephen I'm here, I'm going to put myself on a I'm going to give myself a pause. I wanted to jump in, but I'll be right back very good running around at the last minute. Well Principal Washington is with us, but we're hoping for principal Zimmick and principal Barry as well. So hopefully we'll get everybody in short order. There's courtney, terrific hi! Everyone hey good to see you, okay, hey doug, I'm glad to see you made it doug and I were speaking earlier and he was in. He had quite a quandary as he attempted to get here. Excellent nice Stephen, the NYPD pulled the man safely off of the New York Times building. I witnessed it here. So it's great to hear. Oh, is somebody trying to climb up the rain screen again? Somebody did. I saw him probably on floor nine. I could not tell maybe it was eight and I saw the NYPD pull them off just 20 minutes ago yeah I saw somebody try that when they first built the building, you know you build a rain screen like that on eighth avenue. You can't be surprised when somebody's trying to do a philippe petit on it. You know. Okay, we got ta, wait, let's see if some people filter in there at 6:33, so we have a little bit of time. Hey Steve Lance. We made it blanche and I had a normal visit before to go over technology, so I was supposed to confirm she got in I'm glad to see, I think, there's an element of mistrust. I have to go through a routine every time to prove that I'm not a robot there's something happening here, she's being told, I think we have long suspected that, like Austin powers we're a little concerned, but we're I think Mark might have put that in there manually for yourself because rumors we heard at a meeting once. But how do we know you're, not a robot blanchey. I do not know. No, they give me several tests might as well join the party of people blaming the chair of the board for whatever's going wrong. So, okay, it is, of course my fault. So I'm going to say a quick word of thanks to our three principals. Who've joined us Carlin Washington from West Prep, Academy, Henry Zimmick from the computer school and Monica Berry from Ps87 favorites of mine. If I'm allowed to say that out loud, so I'm very grateful that you all responded to the call it was Steven and Blanche's idea to organize this. I was just lucky enough to be the mouthpiece as it were, so I'm going to hand it over to Stephen and Blanche and with my profound thanks and look forward to a great discussion great well, you did some Intros, so I did do some preference, since you did the Intros I'll. Let you do I found out a little bit about each one of you so but we'll sort of jump in with the conversations- and I surely want to acknowledge, Kim Watkins from the cec who's here as well, so she'll bring her expertise to the conversation. What I thought to do is just talk about sort of a quickly, an agenda which is very informal a little bit of the process and how the meeting will work and and then jump in. I do have one logistical thing that we need a volunteer and we need to take minutes, and I acknowledge that I sort of sent my email out a little bit later than I do. But I think the hopes that Lolita was going to take the notes because she sort of switched up, but I do not see her on the call, so I'm hoping that somebody on the committee might volunteer to take notes today. Lolita is a poll worker and probably is in training for that. So my guess is that that's why she's missing an action? She's training workers got it. So anybody going to volunteer, I know we've had. I know I think Ira Courtney Julian, you guys have taken notes. Anybody else want to volunteer I'll call a couple names. Thank you Doug. I appreciate it. I I saw your motion, so I appreciate you taking the notes great. So let's just talk about sort of the agenda which was look. I think education is the forefront of everything we're doing right now. We're then, obviously we know our times, but I think in terms of the major factors, the issues I think particularly that are important to everyone. Education is at the forefront for many of us and the million plus kids in the system. The parents, teachers, the schools, everyone around them are all are concerned. So I thought it would be a good idea, as we entered into the year after post start just to get some administrators like yourself, particularly in the district, to talk a little bit about your experiences. The and what you're experiencing maybe give us an update, and I'm sure that we'll have some probing questions from our committee members. The general process is that we will probably carve out about 10 minutes for each of you. I know that sounds small, but we're also they're going to have a large Q&And a session and I'm very confident knowing this team. That there'll be lots of questions to continue the conversations. But what I thought we could do is start out and perhaps give each of you a you know again 10:15 minutes to sort of talk about what I thought would be. You can speak whatever you like, but I thought people might be interested in terms of you know the challenges that you got, that you felt in terms of opening the school what's sort of the status. Now. What do you feel now and then one of the things also is what are the concerns in the future, because those are the things hopefully that we can support help. You help all three of you so with and then after that, we'll go kind of around and will allow generally each person committee member to ask a question or so, if we've got to have not gone into the participants vehicle participants, we try and have the community as well ask, but you guys are the ones that are doing it. So I think a lot of us are reading articles in the post or I'm a chalkbeat person. So we hear lots of things but we'd love to hear it from you, because you guys are leading it, and so with that, if there's any without any questions, I thought to start out with principal barry. Perhaps you could sort of start out and again you're free to speak as you like, but I think those kind of would be the general topics at this point and then again, I'm sure people have specific questions for you when we get into a Q&A sure hi. Everyone. Thank you for inviting me here tonight, as you can see, I'm still in my building. So that's a challenge knowing when to go home because there's a lot to do, I mean I think that for me, the biggest challenge that we have had besides. Well, actually one of the biggest challenges was the fact that we had to start so late in terms of planning, because we were given guidance over everything in such a late period of time. You know we had to make a lot of decisions without really knowing what things would look like very difficult for me as an elementary school principal, especially inviting in kindergartners and pre- k, students and trying to get parents to make decisions about whether they'd want their children to be learning in the school building or at home, with having no experience in the school at all was very difficult. Having the rolling the rolling admissions into our remote setting was a huge challenge, especially because of the lack of staff. I mean we do not. We did not have enough, or we still do not have enough teachers to cover all of the areas that we need to have need to cover and so think about how it is. Now I mean it's, some things have settled, but it's still there's still a lot of changes that keep coming, there's still a lot of unknowns and we're trying to plan without knowing everything- and you know with changes just even as recently as today, we found out first that we have with random testing we're thinking about. If people did not give consent, they would have to go into our remote setting and then I'm hearing today. Well, that might not necessarily be true because we started making plans for how are we going to account for the number of kids who might not get tested and have to go remotely, so we spent all this time figuring this out and then it's like well that actually might not be happening now, and so it's like, I feel, like that's, been a frustration, but one of the things that's been great is since the kids have been able to come into the building is seeing the joy that the kids, you know the kids are happy to be back in the building. I've been really impressed with our five- year- olds, who are coming into the building by themselves without their parents without tears. That's never happened in my 11 years here at Ps87. You can tell that they were ready to be out of the house and not have to sit in front of a computer. So that's been great, you know, and with our remote Pla our remote area, the people who are in the full remote program, you can see that you know there were a lot of things that we had done in the spring that were like. Okay, we have to make this better for when we come back and it's just it's very it's a very different experience for the kids and for the teachers. So that's been great future concerns. I'm concerned about burnout. So, as I was saying before, I do not our staff, my teachers are teaching in person and they are planning online lessons for kids as well. That's they're basically doing two jobs. They are exhausted already, I'm exhausted already, and I'm worried about burnout for sure for my staff, I you know, and what that means- and I have a very experienced staff who can decide to retire whenever they want to retire and that's a concern. I do not think they would ever do that to our community, but you know this is something, though that is on our minds, at least for, like the end of the school year. How many people are you know how many teachers are going to stay, how many are going to go and will we be able to find teachers? I mean right now we're looking for teachers, there's some money out there to hire in new teachers, but it's not like there's a ton of folks. You know knocking down the door to come, teach here right now, and so that is something that I am concerned about for the future. That's it for me! Well we're going to have lots of more questions, for you trust me we're a chatty group, but thank you for sort of. Thank you for that feedback in no no other order, perhaps we'll go to principal Washington, who I would always say has been a friend of the Community board has been involved on multiple levels. So thank you for coming again today, good to see you Stephen. Thank you for the invite Sir. I am the principal of West Prep Academy, we're a small middle school. We are currently enrolled with 185 students, and this has been very challenging. I'm a principal who likes to you know, get things in order and we use a lot of our resources to do a lot of summer planning, and so we always hold a teacher academy every prior to Covid-19 to get ready for the students in our school. You know we can't wait around for the two days after labor day to get ready for school, and so we always that has always been a part of our culture, and so you know at the end of June, when the mayor came up with a plan for hybrid learning. I I'm a former social studies teacher, so I can naturally be cynical at times, but thinking about New, York, City and how diverse we are and how every school operates different. You know, even in our own building, you know schools could be in a totally different district. I was very skeptical that this hybrid plan would work, and so you know thinking about what remote learning looked like since March- and you know we were on this CB7 meeting back in June when I invited some students and we had a conversation. I think I brought up the fact that I really do not think that this is going to work out, and so I'm thinking about all summer and how we waited around for guidance. We waited around for our budgets. You know we could not hire teachers when we needed to and then once we were able to. There was a hiring freeze put in place. We get to the middle of August and we're. You know it's about time for school to start. You know it's time for us to get our planning together and we still have no guidance, and so you know rather than wait for the dle to issue guidance. You know we went ahead and planned a week- long teacher academy, the week of August 24th through the 28th to plan out some type of school year, because at the end of the day, September 10th was always going to come. So I'm not sure what the mayor and Chancellor were thinking with this late planning, and so that Wednesday, I believe, was when they issued the guidance around having three teachers essentially for per class you're. The remote learning teacher, the in person teaching plus some new position called a virtual content specialist, whatever that is, and so it's like. Okay now we were already planning the year, we're already planning for school. Two weeks before you know here's the DOE coming up with this new mem around a agreement and so as a staff. We looked at that and we said well, this is kind of crazy. You know this might work in an elementary school. Maybe I do not know I'm not an elementary school principal, but as a middle school principal with content specialist. You know I'm thinking about hiring. You know two extra teachers for every content, specialist that I have, and so you know I'm a practical person, and so I can't think beyond things that do not make a lot of sense to me, and so it's already hard to staff my school in the first place on a regular school year, let alone a pandemic. Then you throw on top a hiring freeze that gets removed after you issue this guidance saying we need more teachers. Well, then, you can't have a hiring freeze if you need all these extra teachers, and so what's the messaging there and then thinking about my community and I'm very protective of my school community in terms of who I hire and who are allowed to come into my school, and so the idea that I would be hiring a lot of teachers who may not be tech savvy who may not, you know, be in tune with the common core curriculum. Whatever? What have you know? That was just something that I could not think about, and it was something that my school community also I rejected initially, and so in speaking with my teachers, you know we decided outright to reject the memorandum that the deal we came up with and we decided as a school. What would work best for our children is for us to be fully remote, and if children choose to come to school, then we would support local child care, as the DOE is asking us to do. But in terms of giving children an education, we would need to do things fully remote so that they can have access to the teachers that I hired for them at all times, and also we are a school with a lot of special ed students. We have about 40 special ed this year, which is three times the district average and so making sure that I'm honoring all of those iep agreements and expectations was also a challenge, and so again we decided to do fully remote, and so fortunately, because we made that decision back on August 28th at the end of that Friday, you know we have not experienced some of the challenges that the other schools had in terms of trying to hire and waiting to last minute and playing around with the DOE about sending central staff members and hiring CUNY professors and all the other things that were taking place. So what was frustrating for me as a principal is being the messenger and having to go to my community every week and say: here's what's going on here's what's going on we're ready to go, but here's what's going on, and I did not like the fact that was placed on us. You know with all the misinformation and going back and forth between the mayor and the Chancellor and the governor and whoever else I was making decisions and not asking principals again. I love to give my comments, and so I wish they would have called me back in June. I could have told him a couple of things that we probably would not be sitting here on October the 15th. Still in a position where you know we are still trying to figure out how to play school for the year and that's disappointing on so many levels, particularly for our children, who are missing out on their academics and that's what school is all about. You know they're not going to learn anywhere else with school, and so, if we do not have this together, whether it's remote, whether it's blended, whether it's fully in person or not, you know in the middle of October something seriously wrong with that picture. And so you know what's what we really need is technology. Unfortunately, my school was in a position to make sure that we gave all of our laptops out, and so we did not want any children using ipads for their learning. We had we gave out all of our computers, but we have run out and now we can't buy any more. So that's an issue, and so you know part of my thinking around in June thinking about how this is probably not going to work out for us, because and while we were planning to go to school, you know we did not plan to stay in school, and so you know it's all about get to go to school. Go school go to school, but you know there was no planning around making sure that these children, who would have to be at home at least two or three days a week and looking at high schools four days a week and maybe all week because they can't get in the building. They were going to need technology and they were going to need Wi- fi access at home, and so, while we spent all this time thinking about PPE and all these different things and going back and forth with all the unions, you know the deal we and all the money that we have might have could have potentially do not have. They did not spend any of that money on technology and making sure that the least among us had the necessary tools that they would need to have learning five days a week and nobody thought about that. And so that was very disappointing and that's that continues to be a disappointment for us, but otherwise, I think we're doing well. We have 70 of our students who chose remote, and so only 30 percent of our students are coming to the building and every day that number gets smaller and smaller, because parents are realizing that you're doing the same thing at school that you're doing at home, and so that's one thing, but also it's just not the same thing. It's very weird and like principal Barry, I'm very concerned about burnout, not only for myself, because I love my job, but this has been very frustrating to say the least, but for everybody else you know it's like you're coming to school, either waiting to get sick or waiting for someone else to get sick or you're waiting to be shut down or you're waiting for something to happen. You know, and it's not magical, and it's not learning and it's not children smiling. So that's not what you're coming to school to anticipate and that takes the magic and joy out of our work. And so that is where we are today on October 15th from West, Prep, Academy. So I'll turn it back over to you. Steve thanks and I did want to clarify something because I think I figured it at the end. I think at one point you said that your teaching is a hundred percent remote, but then you said, seventy percent is thirty percent coming in. Could you clarify that? Does that mean that you're sort of teaching online and when the kids come like all the teaching and it's assuming my son's going to high school hmsc all the teachings online in the morning and then when they do have him, do have in person? He goes in the afternoon, but it's a different. It's he's not really taking classes. Could you just clarify what you meant by that or so, and I can't speak for any other school, but the way it works at our school is that we have essentially child care providers in the classroom. So those are regular teachers who are essentially babysitting children, but they are teaching remotely to every child, and so we have children in their grade level classes. I have three classes on each grade, and so I have a teacher in the room who was you know physically supporting the children in the in the space, but they are teaching their regular teacher program on a computer. So everybody is sitting in a classroom with a laptop with earbuds, and then they have access to their teachers whenever they show up whether they're physically there that you know you've worked it out where they're being taught- and I just wanted to clarify one thing- and I'm very familiar with that guidance that I think was very devastating to all of you. If that guidance did not come forward, you know, were you prepared? Would you would you have been prepared differently? I mean, would you have been able to teach in? Have some teachers teach in school if you did not have to adjust to sort of a three teachers teaching as opposed to one? Well, you know this gets into a bigger conversation about the data that was used to make these decisions. You know no point that 75 percent of parents ever say they wanted to come to school, because the survey only they only surveyed a third of the families in New, York, City and so out of that third 75 percent shows that they want to be in school, and so it's all in how they pose the questions. And so you know again we were operating with very loose data, and so it's with the do. We kind of made assumptions in June that this many people probably won't come to school, because in order for this to work, you're making assumptions that people are going to opt out because with social distancing, you can not have a whole full program and with nine kids in the classroom, when most class sizes are 30 plus in the middle and high school, you know you're, assuming that two- thirds of the school won't come to school, at least a third, so that you can put them on a rotating schedule. And so we were operating just like my principal barry said without a lot of information, and so yes, I was prepared to do whatever we needed to do for school. Could we have done it in person learning and the other person learned? No, that could have never happened, okay. Well, I want to keep on going and there'll be much more time for questions and principles of mech. I guess if we were going alphabetical order. This makes sense. So here you go and pleasure to meet you with the victim of alphabetical order, my entire life, so nothing new there. Thankfully, this is a short list. First things. First, is there a fly on my head? I just went it left it left a few minutes ago. It slid off. I want to thank Mark and the board for having for inviting me and for doing this and for all the support you give us behind the scenes and say hi to my colleagues. They've already spoken very eloquently about the same struggles that I think all the principles acrosss the city have been facing. The most frustrating parts for me were that we were not being either heard, nor were we being trusted. I think that, both individually and collectively, we had a lot of answers that would have worked in our schools and they were not always the same answers, because our schools are not the same schools, yet we were number one, not given information in a timely manner to the nature of the information was constantly changing, so whatever information you got you know in June was useless in July and that you know so on and so forth. We were asked to design programs that fit into very rigid models that we had to build around, rather than ask to brainstorm models that work best in our school. Given our staffing situations, giving our students situations, given our overall philosophies, our technology capability and so forth, so that lack of being heard that lack of feeling trusted were to me the most upsetting parts of this whole ordeal- and you know my colleagues and I we've been around for a while- we've had to deal with lots of directives that we were not comfortable with that. We were not, you know in agreement with, but so long as we had time to adapt and we had the time to kind of roll it out to our communities. You know we rolled with it and you know in this case that was not afforded to us. We were left in the lurch and you know I personally feel incredibly thankful to my staff and my parent community that they trusted what I was rolling out to them and you know, did not sort of hold me accountable for the lack of information. That was. You know that you know I was sort of the conduit for so you know at the end of the day, the d.o.e sort of succumbed to the reality of the math. You know this, and I said this to my colleagues and we sent out a letter essentially saying that there's a math problem embedded here and it's a problem where number one the numbers are constantly shifting and changing, and not the same for all of us right and number two in the does you know plan the numbers did not add up and we could not go ahead with plans that met the compliance aspect of what the DOE wanted and have it add up. So we wound up deciding which way are we going to you know, and I'm going to be careful. What I say here, but we're going to you know, turn a blind eye to the plan so that the does plan so that we can run a school. You know where were we willing to take our lumps, and I think I do not want to speak for Carl and then for Monica, but in our case the does plan kind of gravitated to the common sense plans that we were putting into place, because you know it just became pretty apparent that city- wide the math of their plans was not adding up beyond that. I have to say you know at the computer school again I feel blessed to have the community, the staff that I do and you know they've been in the business of making me look good for a long time and never has that been more true than this year. The person I probably bore the brunt of the constant fluctuation in the plans was my assistant principal who was in charge of programming, and we had a zoom call in fact where she was trying to explain the latest version and she just broke down in frustration, and you know what she said was. I just do not believe in what I'm doing and saying here you know and that's. I think the position that we were put in for a long time now that things have shaken out and settled down. I think all of us are feeling a little bit more comfortable with you know what we're doing and the repercussions of what we're doing and also you know, we're energized by seeing the kids, none of us got into this business to to teach remotely or to be remote administrators. So there's been a little bit of a a rebound on the part of myself and of my staff in having the kids actually in the building. A lot of the staff who were terrified of the notion of you know what happens if a kid comes in and their mask falls off and I get exposed. I have young children at home, we had seven maternity leaves last year, so a lot of our teachers are dealing with. You know young children at home, and- and it seems that, once the kids got here on that first day, their fears sort of largely dissipated, there's some still a lot of unsettled things that we are you know going to be facing. We've been having lunch outdoors, we've been keeping the windows wide open when the weather changes, I'm not sure how that's going to work out, and you know we're not even into cold and flu season, yet we have not had to use our isolation room. Yet, what's going to happen when that starts getting active, you know there's a lot of unknowns still, and I think I can speak to my colleagues in saying that, at the end of the day, we're taking a one day at a time approach. Yet when you, when the kids go home at the end of the day or when school ends at the end of the day, if we can say we got through that day and there were no major issues, it's a successful day and that's what I think it's all about right now, it's just piloting one successful day on top of the next on top of the next and dealing with things as they unfold so, but I can only I can say that my respect for my colleagues, my principal colleagues has only grown through this experience. You know: we've listened to each other. We've sort of supported each other and you know I think we all feel each other's frustration and pain and anxiety, and you know it's sort of gratifying to know that you're not alone on an island messing up. You know that you know we're all we're all together in this. So great, can you just also clarify just what does your hybrid program look like? Could you just elaborate a little bit on that? What does my program look like your hybrid program? Is it a you know, just how did that? You know? I think it's like everyone worked what was best for the school, I'm just curious. What years was it we have? We have three student groupings for in person, learning an a group, a b group, a c group and our teachers have been willing to teach in all three modalities. You know without us needing to do an sbo for it, so I'm thankful for that. So you know we've made it work, and but I you know, I'm not taking credit for that. I think I'm fortunate in that I have a relatively no low number of teachers who applied for accommodations to work, 100 remotely, and my colleagues know that that's varied from school to school and it's sort of a luck of the draw thing. If this were last year and I had seven maternity leaves going on, I'd have half my staff out, and you know I'm also fortunate that while we have been getting that drip of students going from blended to full remote, which has created some strain, we still have a preponderance of students that are staying with blended and we actually had two or three students in the last few days that have come back to blended after choosing full remote and one issue that had come up- and I do not know if you guys dealt with this- is that some of the students who chose 100 remote right from the get- Go were not successful in the spring in the in the full, remote format. So those are the students we were looking most forward to having in the school building. So we can sort of break that. You know that sort of habit of disengaging, so in the last couple of days some of those students who have not been engaged in 100 remote and we've been on them in a much more effective way than we were back in the spring have opted to come back in, and so you know again, it's a one day at a time thing and we're all learning as we go. I hate the chances expression with building the plane as we're flying it. You know, but it does sort of apply. I think you know well I'll agree with your dis dislike of that term, but I'll keep silent at it and principal barry. Could you also just elaborate on your hybrid program a little bit about it? I think lots of us are interested in that because again we read mostly through the news on stuff. Like sorry muted, we have two cohorts in my school and so children come to school either two to three days a week and we did not choose. We actually moved the alternating Wednesday. So basically I have a group that comes in on Monday and Tuesday. I have a group that the two groups alternate on wednesdays and then I have another group that always comes in Thursday and Friday, so that was the model that we chose here, and so I actually have 27 of my staff. I've got medical accommodations, and so we were it's interesting because we were able to cover our full remote classes. You know and the classes in person it's that who's teaching the kids during the remote time who are in the hybrid model. That's the tricky point for us. We do not have enough teachers for that. We have enough for the we have two teachers. We do not have that third teacher further, which is which has been tough for us, and I would say that you know a part of it was that we needed more of those teachers to teach in the remote settings, because we had a large number of kids who chose remote early on before the school year started like by the deadline, and so we needed like for in fifth grade. I have two full remote classes same with fourth grade, I think, with every grade, with the exception of third grade right now we have multiple classes that are full remote and I was able to cover them with the accommodations which is great, but then that leaves the kids on those remote days. There's we're lacking teachers for that space, which is interesting because that's one of those things when I can't remember if it was Carlin or Henry who said where the chancellor went back on things. That was one of the things that he said he's like on those blended remote days. Everything can be asynchronous because there's no way there was going to be enough teachers in any school or I should not say in any school. There may be some in some schools, but from folks that I've been talking to having three teachers per class. Just was not something that was happening, Stephen now, you're muted. Well, I did not want to speak. I wanted to be polite. I feel like that was sort of the last bomb that kind of came in that may have screwed up a lot of the models and just is: are you? Are you seeing any flow from hybrid to full? Is it sort of saying steady, I'm just curious: has there been any movement or any feedback in how that's been flowing thus far? Well folks, there was a lot of movement in the beginning when there were so many changes for the start of the school year and what's going to happen so we had a number of people who moved from wanting to be in the blended program to wanting to go fully remote and right now it's that stabilized. We have not started we're actually going with the enrollment periods for moving from remote to blended and so in the end of October. That's when that supposedly is starting and so we'll see what happens at that time. Got it okay, great! Well, I'm going to start to I'm going to make my quick I'll make a quick statement then start going around to the to our other board members. But I just want to thank the principals. I mean as someone who again I've got a son in a high school level, so I've been through this process and I just find it completely ironic that I think it's the administrators and the principals, who have basically been the glue of this year having to put all this together and I'm not I'm not saying this just to say it. I truly believe it ironically seem to have the least amount of say in what is going on, which I find just incredible, and I know that in my own school my principal presented three different models over a three week period. Each and every time a new piece of information came out, they'd, say: okay, here's the new model. Now that we have this and I just I could not just could not imagine it, and I think anybody wants to be in a job where you know there's whether it's sports or the business world. You want to be put in a position to be successful and I think that you guys have been handicapped the most I've ever seen. I mean to be giving key decisions on a Friday that literally had to do with how many principles you know teachers you had getting no questions about it and then, within days being able to put it together, is unfoundable to me and I could use stronger words, but I'm going to stay positive today, but I just want you to know that I completely admire what you guys have done. I think you guys have been the glue of the year. That's my applause and you know I just empathize incredibly in terms of the challenges you guys had and want to take a moment to acknowledge that, so with that, I'm going to have go around the room and I'm going to start with. Blanche is my co- chair and allow her to ask any questions. She has Steve. This is sort of in a way following up on what you just said and indicative of my ignorance of how the whole system works, but what I've heard our three guests say reminds me somewhat of what's going on nationally, like the administration, federal Administration saying to governors. This is your responsibility. You go find respirators. You go find this. You go find that so my question: is there any representation or input principles, representatives of principles in the d.o.e decision-, making process like who came up with remote, hybrid or whatever? Did anybody go to well? What is the role of the principle in the overall decision making and planning of the DOE? If any, that's my question, monica maybe you'd, be the best qualified to answer that since you're on the advisory committee. Yes, so I'm on the executive superintendent's advisory committee, they did not ask us about it. I can tell you that, so I would say that there's pro I mean I was never asked once about my opinion about anything I, like Carlin, really enjoy giving my opinion about things and no one asked my opinion at any point, I will say this: I do have a friend who is another principal here in district 3, who said that he was invited to a meeting where they were presenting things to them and apparently everything that the principals had said at that meeting was ignored. So that's what I that that's, obviously that's rumor, it's secondhand information, I'm not surprised, because I do not think that anyone who's working in a school building would sign on to the things that we've seen. I mean that's right. I do not think they contrast. I do not think principles were asked. It sounds that way to me. Okay, so mark you've been you're, Stephen, you're, muted. Again, I'm having my technology problems today I apologize but Mark Lovedy love to hear from you in terms of starting. Thank you I expected to go last, but I will absolutely take the chance. I guess the thought that I wanted to ask the principals. Well, two things. One is an easy one, which is if we were to advocate for a budget item for your schools. It sounds like more technology equipment is the right thing to be advocating for because we're running low and it's probably now a seller's market, so I'm seeing nodding heads so I do not have to ask that question formally. So I guess the thing I would want to be curious about is the impact of all of this on enrollment vis- a- vis. What you expected well I'd say what you expected in June versus what materialized in September, but really it's probably what you expected in March and what's materializing in October, we hear lots of things about people with options to go elsewhere, taking them and thinking back to five and seven and ten years ago, when there were overcrowding, questions, and there was an issue about whether there was certainty or uncertainty that your zoned school would actually be available to you or whether the school that you were most interested in on a choice system was going to be available to you that parents were taking other options that were certain even if they were not ideal. So with that, as prologue and my usual prolixity, can I get your thoughts on on what happened with enrollment versus what you were expecting and do you see anything in that way changing as we go forward? I'd love to speak to that. Thank you for the question mark and I would say, as in March, you know when we had a conversation back in June about how were we handling the pandemic. You know it's tough, because you have a certain segment of your population who just have so much dysfunction going on that they're not going to be able to perform on it on a good day anyway, and so you know, when you have a school with a lot of those people, then it's a struggle because you can't go inside someone's home and fix what's happening there, and so you know looking to the future. You know it's interesting that the mayor wanted us to go back to school so badly, and so he started putting together these videos that he was spending money on using. You know Columbia two people who worked at Columbia University and people with advanced graduate degrees trying to persuade people to go back to school, and the conversation started to go around lower income students and what about poor children and they have to go to school. They have to find some food and they have to be taken care of when those are the majority of the students who have chosen to remain home. And so it came down to you know us feeling like we were essentially becoming babysitters. As I said in our June meeting, I'm not no fan of charter schools at all whatsoever. I'm not a fan of public competition as it relates to public education, and so, but I find it interesting that the biggest charter schools have decided to go fully remote for the best interest of children for the best interest of their learning. And I never think charter schools are doing anything out of the best interest of children, but yet here they have stepped to the table and still stepped up to the plate and decided to go fully remote in the best interest of children because they realized this come to school. One day come to school two days out of the week is not an acceptable model, and so I just find that quite interesting. Now to your point about our numbers, September 1st, I was 50 of my students were coming in. The building. 50 was not when school was delayed for a week that number dropped down to about 40 percent of the students choosing to come in and then with the second delay that number dropped down to about 35 and then we've had a few students over the past week or two, you know, come to school and see none of their friends there and they can't switch classes and they can't go to gym and they can't go to the cafeteria and hang out and so they've decided to opt out as well, and so again it's the numbers game and those fluctuate every day. So at the computer school, our overall enrollment is probably down about 15 to 20 students. Out of a school of, we were anticipating or a little bit above 400 and now we're down in the 380s. It does not sound like a lot, but it's a big chunk of funding. You know, like the you are funded yeah, and so we just have to be careful not to overspend. But in the case that the deal we you know ask for that money back based on register loss. So you know that's just the reality of it. I think the reasons why people left varied and where they left two varied, some went. You know to their homes in the country, some switched to parochial schools. Some you know, left the city, you know for other states because there was a job loss, but you know I would consider ours ourselves fortunate that it was limited to that number yeah 20 students, but that may not sound like a big number, but that's almost a whole teacher right yeah. That's in that ballpark, so I was not as lucky as henry we're down 150 students. We had yeah, it's a huge number, so you know all of the years that we fought to open for more schools to keep Ps87 from being overcrowded, there's space for you now. You know it's not an issue and just like henry people left for many different reasons. You know they. Some have gone on to private schools that are that have in person five days a week in person learning five days a week or they have moved right, they're staying in their country, homes or and going to school. There, where they have more in- person, teaching some have left the city. An interesting thing. Funding wise, I mean it'll, be interesting if they come and ask for money this year. Considering we're supposed to have three teachers for class, then we're really in trouble, because I owe a lot of money. You know just for that number of kids who are not coming, who have not returned, but thinking about next year, a number of the people who left they said well we're going to leave for this year and we're coming back, and so when we have to make our projections about population for the upcoming year, it's based on historical data. We might not have enough money to accommodate all the students that will be returning next year, because we have this huge drop, so they're going to think you're not going to need that much money, because you have so few students, but people are saying you know it's just you know a number of people asking it's like. What's my writer return, you know, I have a number of folks who are planning on returning to the city once things have settled down or if there's a better plan in place or whatever sorry there's a the lights go out every now and again I'll get it back on in a second. But that is something that has been that's something I'm wondering about one. If they're going to ask me for the money that we owe and what's going to happen next year, when we have to say how many children we think we will have and will I have to go through the appeals process with the department of education which takes a while and by that time it's like. Will I be able to hire the staff that I need? Will I be able to get all of the supplies that I need because I'm waiting for this money, so that's a concern. Can I clarify it's 157 out of what was expected, I'm just curious, so it was 150. We were expecting around one about 865., so it's so the expectation was 860. You got around 710, yeah, okay and we're going to budget light bulbs for you we're going to put that in our district. No, the light bulbs work, it's just that the timer needs to go on for a little longer. The same thing happens to me all the time. It's more dramatic at night, though, just to add to what Monica was saying, there's also the issue and I'm sure my colleagues are dealing with this, of compliance with special education mandates with Esl mandates and so forth, and the funding conundrum gets really complicated and the personnel conundrum you know, having your staff so thinly spread, makes it impossible to have the amount of you know, periods where children have two teachers at the same time, you know that they would normally have in an ict setting. So you know, we've all had to sort of you know creatively problem solve to get maximum compliance for what's in students, ieps out of the personnel and the scheduling that we can manage so yeah great, I mean thanks for elaborating okay, so we're going to a guy who volunteered goes next. He gets early privileges, Doug Mcgowan. Thank you for the hands up and maybe a small reward for doing so. Thank you, Steven. I appreciate the reward. First of all, as a father of a Ps87 full zoom kid in kindergarten, Claudia Zoy, I wanted to personally. I've certainly witnessed principal berry what you've done and it's been tremendous and I'm sure out of principal Washington and Principal zimmick. Your communities are as proud of you. So thank you for all that you guys have done. It's been frankly, truly unbelievable to watch how you've engaged and maneuvered through what can only be described as really difficult times. So the question is really pretty simple: what can we do as a community board to support you at the end of the day? The mission you all have is one of the most important missions that we deal with here as a community board. So how can we support you in your efforts or is there anything we can do anyone want to I'll jump in and just say, and thank you for the question Doug and I and thank you for acknowledging what is definitely difficult times for us. So I appreciate that and you're in good hands with Miss Barry over there. So I'm glad to share with her. I think it's about advocacy. You know, like Monica Berry said you know, we do not mind, sharing our opinions and I know I can be very opinionated, but it's all coming from a good place, because I care about people, I'm a citizen of this planet and we have to take care of each other, and so when something is happening you know we speak out about it. I think you know I do not want to get too political, but I will say that you know it's great when you have the mayor and the chancellor making decisions, but when it filters down through central and tweed, through the hundreds of people, making six figures, salaries and the executive superintendents and then the superintendents and by the time anything gets to us, it has been watered down and has been. Discombobulated has been made to be bigger so that we can include this bloated central staff to make sure that they have a piece at itself to give them something to do for this salary, and I think you know that's been my biggest concern as a principal in New York City for the past seven years is that you know there's so many people in between me and the chancellor, which means there's so many rules and so many expectations so and so many other people that I have to deal with and speak to. And you know I was watching Cnn last week and they said about governments and how they're being tested now, governments that were pretty strong are doing. Okay and governments that are shaky are not doing well during this crisis and we think about the DOE as a bureaucracy, and you know we can be on some shaky grounds on a good day, and so then this pandemic is really showing what's happening. You know a lot of the departures that are happening in central office and it's like well, I do not even know those positions exist and I do not know what they are for and how they are supporting student achievement at my school, and so you know and advocate in any way you know to think about the structure of our central services and how many people we have to answer to and how many people are supporting us for the sake of having a job or supporting us for the sake of really supporting students and helping their growth and development. I would say, outside of mark already acknowledge. The technology needs that we have, and so that notwithstanding, but just as an advocacy for you know, schools as you're listening to us talk about how we have to better brunt of all of this. You know the Americans sit on TV and tweet and create videos all day, but we have to be the ones to say. This is what this looks like in my school and when parents hear you know, I'm promising you full instruction. I promise you live instruction at home and you know all these over promisings that he gave to the families and we have to come back and say no. I can't do that, for you know, there's a disconnect and then that creates mistrust, and I think that Miss Trust was created back in March. When again, we were being asked to come to school while the rest of the world was shutting down, and so I think that mistrust was created there and then you come up with policies and, like Henry said when the map does not add up, but you want me to do it anyway and force it it's like it does not work. If it's not it's not going to work, it's not going to work, and so I think just we want to share our opinions and to go back to Blanche's point, and I do not want to speak too much longer about you know us having to say you know. The unions support us in certain ways, but they also do not support us in certain ways, and I think that the uft is definitely stronger than the csa, and so they are the ones who are treated differently. They get first, they get the first questions and they and they get the ones to dictate the policy, and that has been very evident throughout this process because they often do things before we knew things. And so you know you have a teacher just coming to us saying well, this is what the new policy is and we're like. I did not get that. I did not get an email. My superintendent did not send me that my union did not send me that, and so thank you for this information. Now I need to figure out what to do with that, and so that should not be the case when we have to answer to everyone and then our jobs are on the line, because either we've done something correctly or done something incorrectly, and so I think, just more advocacy for the principal boys to be heard. The trust there we've gone to school. We've been teachers, we know how to organize and protect the school. So we do not need 12 people between me and the chancellor. You know trying to dictate policy and make rules right. Well, I just could not agree more with almost every aspect of what you said from budgeting at an administrative level to having more of a voice with administrators and in that group, but I'll leave it at that. Okay, Carl in the saying you know from a principal's perspective and all of it you know, we've all been teachers and so forth. You know the hardest part is feeling the pain of the teachers, because they're really bearing the brunt of this. You know, especially the ones that would normally you know, work themselves to the bone, trying to do right by kids. They and Carlin had mentioned he's worried about teacher burnout and it's true that's what weighs heavily on us. I do not think our workload is. At least I can speak for myself and say my workload is not substantially different than it normally is it's just the stress and the need to support is greater than ever and the need for support you know, and so just knowing that the community understands what our teachers, the heroic work, that our teachers are doing under these circumstances, and even if it's not working perfectly, it's not for lack of trying or lack of effort. You know that's very much appreciated you know. One thing is our higher- ups like to comfort us or try to comfort us by saying? Well, we were principals once too, and sometimes it just does not feel that way. Well, I can assure that we all empathize and feel strong for teachers as well and multiple people on this committee of teacher backgrounds, and so we certainly share. I mean agree with you 100. On that perspective. That being said, I think we're sort of trying to figure out how this year is going to keep much. You know, sort of going along and and empathize with your challenges as well Ira. I see you patiently waiting and since you know sometimes you you're not as patient, so I'm going to reward your patience and let you got to go first. I commend you now. You can not mute yourself. Are you having problems there, you're going to lose your spot? Ah there we go okay, and I did not had I known that I that you guys were all cse members. I would have wanted my Csa T- shirt, different local, but what I wanted to ask was a very similar question to what Doug had asked, but he got to it before me, but I had one answer to it, which is one of the things we can do. I think for the schools is: make the school's problems more known to the larger community of the upper West side. That is not aware of, what's going on and looking for ways that they could help us. The Audi Kim is the president of the CDC and her immediate audience is primarily the parents that have children in the district schools. Our audience as a community board is for a broader. We have we and quite different, but certainly the way we represent people who are going to have children in school who live next door to children and have had children in the district. So I think we might be able to look at some different aspects. I do not know what those are other than trying to get you guys to come to some of the meetings, perhaps as as the same way that elected's come and maybe that's something that Kim could do as well. Just as the electives come to the community boards, and perhaps some of the principles can come some of the assistant principles, so everybody knows what's going on in the schools. So that's my answer to Doug's question, so I was actually hoping to ask the principal stuff bibi to it. So, thanks for asking in regards to Monica Berry's reporting on her school, I have three kids in school two or in district schools. One is at a ps and one is in Ms School and are they're all in blended learning the child that is in different. They have a similar decrease in enrollment of approximately the same number. This reflects itself in decreased parent contributions, which our school has often relied on to make up the shortcomings and some of the funding mechanisms where the school demographics do not necessarily justify some of the funding. So that's going to hurt some schools. My school happens to have a somewhat less favorable demographic than Ps87, definitely a less favorable demographic than ps199, certainly a better parent capacity and then a lot of our district schools. But it's going to hurt us. The other thing that's happening is that's 150, kids, who just are not in the school, but that's not talking about the kids who are sitting in grandma's house in La or Uncle Bob's in Boston, or something like that who are who may or may not be coming back, but stay within that right of return and they're sitting there on the screen taking New York, City DOE classes, but their ability to fully contribute. They can't go that over to their friend's house and work on something which I do not know what that impact is, and I and I pose that to any of the principles. If anybody wants to address that of the students who are in remote learning but are actually physically remote from New York, and is that having any impact or even aware that of how many people are in that setting? So I can talk about that because we have kids all over the globe who are attending school at Ps87 and one of the things that I would say that has been a struggle or something that we're concerned about, so that we have children who are in Asia right now and we have children who are in Europe right now and part of the academic policy. Is that to be counted as present in school? Is you have to attend a synchronous session? So it's like? How are we going to engage a young child who should be asleep? Who is in Asia, you know and making sure that he's there to? So we can say: oh he participated in school today. You know I mean that's one of the things that you're trying to figure out how again when Henry says, there's some things you follow and then there's things that you say what makes sense for children. I do not want a child up in the middle of the night going to school, you know, and so that is, that has been a strain on some families like if they're out, West, that's, there's a three- hour time difference there, but I will say this that the families who have made those choices they do know. You know I would say that they're, very cooperative and trying to get the kids to you know still participate and do all that they should do because they knew what they chose. And so I will say that they've been really great about that, but it does still concern us as educators here in the building, because they we still have very young kids. I would say I'd be concerned about a child at any age, but we still have young children and they're still developing and they need to sleep and they need a schedule. You know it's like it's a so that is something that it happens. The families are working, you know to make it work for their kids, but it is something that is definitely something that we see here. We have materials for kids who are working fully remote and we'll say you know we can come in and pick up materials you know, and then it's just like well we're in Bosnia. You know it's like something: it's like what do we do? So that's you know one of the things. That's you know in figuring out how to how are we going to get things to people and all of that, and I also would say that a big challenge. You know one of the things that I would say just community, wise or culturally here at Ps87 we are a school, that's known for our community and we spend a lot of time together and bonding, and all of that and really it's been a struggle for us to try to think about. How are we engaging the families who are working remotely? It's something we think about all the time like we'll start to make plans, and it's like right that works really well for the people who come in to the building, it's like. How are we going to make sure that we do not have the families who are not here with us physically and two? This still goes also with talking about people who are out of town, because there are people who are working remotely, who will see every now and again, because they're still in New York, but then there's people who are not here in New York, it's like how do we? How do you engage people? Virtually I mean we have ideas. Obviously this is one way, but it's still not quite the same and we're trying to figure out how do we keep that same community feel when people are all over the place? So that's something that we think about a lot. Thank you now, one more question. Well, I'm going to Ira with these guys. I know that principles mech has to leave at eight there's about five other people we can kind of get down. I want to be the fact that principal Barry's still in her office and I believe she lives in Brooklyn. I think we want to be sensitive to everyone's time, so let us get to some other people. If we have time we'll come back. I hope you understand Natasha if you want to- and I just want to ask if we can be quick and concise with our questions and again these guys have been we're praising them and and but they're working hard. So, let's you know we want to yeah that we all have time, but let's be concise with our sort of yeah. I know I just I had one comment, which is that I just wanted to thank all three of our guests back when the pandemic started. We started hearing of these central workers, which were the doctors and the nurses, but I just want to thank you for your service because I think you're way up there in terms of the essentialness of your service and how it will contribute to the vibrancy of our city and our country. So thank you very much. I did have just one brief question: do you know if the DOE has said anything about assessing or reassessing this plan, and when will they come back to the drawing board to see if the current model is working or not? Is there any kind of deadline for that? Thank you. The short answer is no yeah, and the longer answer to that is that you know. As I said, you know, the idea of us going back to school was just that. Was it go back to school and then figure out what that looks like for your school and every school can do that differently, and so I do not think the mayor is interested in reassessing that, because I think he's kind of dug his heels in that schools must remain open. You know again me talking about the charter schools and how they made a conscious decision to go fully remote. He has all but said that we are babysitters, and so if children need to be babysat in order for the economy to move, then that's what we have to go to school to do, and so I do not think that he's going to go back on that and, like I said earlier too, you know that's why we're waiting to see what's going to happen is if someone's going to get sick or we're waiting to be shut down. Are we going to be and one of those zip codes that gets shut down, and so that's where the uncertainty comes from and that's where all the confusion comes from, but it would be nice if he would. You know, reach out to us and reassess, but I do not see that happening. Okay, catherine, did you have a question? I saw your hand thanks Stephen, so I also want to say thank you to all of you for the work that you're doing and that, as a as a teacher, I can understand how hard it is to feel like you're, not hurt and you're not trusted and that whatever you're describing it's so much harder than that than any of us can know. So I want to thank you first too. My question is: who are the students that you're that you're most worried about and what do you need to better connect or support them? So who are the students that you're most concerned about and what do you need to better connect with them? Any aspect of that including absences or absence, is an issue. That's my question. In our case, we are, you know, trying to focus on a rather small, thankfully group of students who are not engaging with the online portion of what we're doing the you know, most of what every kid has, whether they're 100 remote or not, is remote, and so, if they're not engaging, is it a technology problem? Is it just a teenager problem? You know and that's the challenge you know we're trying to every day reach out and reel those kids in so, and there definitely are some demographic. You know concerns in terms of who the students are that are not engaging. So you know we're discussing that in our equity team meetings- and you know, with our parent association and trying to work on ways to make sure that every student has equal access to whatever it is that we're doing you know it's sometimes hard to get to the bottom of what a student's particular issue is. You know, as Carlin says we can't get into every student's home to find out. What's going on, so you know, but we've been very proactive in that challenge and we're going to continue doing that great. Can I add to that too I mean so two things, one just speaking Ps87 like specifically about Ps87, I'm also cons very concerned about our students with disabilities. We do not have the staff to fulfill all the mandates that the kids should. You know all of the services children should be receiving and all of that, because of the way things are set up right now, it's extremely concerning to me and we're. You know, obviously we're doing the best that we can with what we have. But it's not it's not right. I mean, and I would say that I feel from what I've heard everywhere. You know that's a huge issue. The other thing that I would just say is just district- wide, I'm on the district equity team along with principal Washington, and you know that lack of access and talking about the the disparities with who has and who does not, who can connect and who can't it's a huge problem for our district, and so I think that we're all as a district worried about that as well, because as all of you who are familiar with district three, this is not a new issue when it comes to equity, and so this is definitely something that is on our minds and the fact that folks are told to reach out to the department of education for a device and the department of education that says, reach out to the schools is an issue we gave out every divide like Carl and we gave out every device that we had back in the spring and so coming to me to say I need a device, it's like well, I'm hoping that one might come back. You know so that we can give it out. It's like. That's not okay, so there's a number of kids out there who do not have devices to even connect, you know and participate in school. So those are the kids that I would say that all of us are very worried about and should really focus on. So going back to how you can help devices and access you know to the remote platforms is huge for us. Can I can I just like what is the number of people who do not have devices? Out of curiosity, if you had to just estimate, I recently saw online that it was about roughly 200 000 students who are lacking proper technology to engage in remote learning and just how about at your schools as well just on a local at my school, I would say probably four or five, because we deliberately made sure that all of our students got our computers and I was able to get a few more at the beginning of the year. So we do not want our children using ipads at all, so we gave out all computers. I may have two more left in the building than that those break and just to speak to my point, I had a student who's coming from a challenging home. Who's broken three computers. Now, do I give him another one, or what do I do and do I deny him access to an education? And so those are the things that we are facing that are difficult for us as a principal, but I would say no, I can't speak to any other school. I would imagine some other schools are having more problems, because I get a 100 of my funding. I know some schools do not, and so I would imagine they would have a problem with securing laptops for their students yeah. I know that so I mean I have 133 students who need devices they're sharing devices in their homes now, but now, because all of the children have these times that they're supposed to be logging in for live instruction. That makes it difficult for everyone to be in class. You know because they have multiple siblings, all trying to use one adv one device or they're on a phone. You know when all of that, so that's a huge problem, there's a I have 133 students who need their own device in order to fully participate in remote learning and there's also students that have the devices but do not have consistent Wi- fi access so come on courtney, you're up hi. Thank you guys. I have a. I have a five- year- old and a three- year- old, who I think made a I made an appearance earlier. My five- year- old is in is in kindergarten, our first our first experience here, and so I echo everything that everyone has said about. Thank you. My question is similar to Catherine's and I'll just do a follow- up. I am also very concerned with the populations who may be struggling and not getting what they need, and I want to actually look ahead and you may not have the answers to this right now, but looking ahead, what can we do to as we think about what we should be advocating for in the next year or two to try and accommodate and think about the learning loss that has happened and how do we help these students, who are really struggling this year, catch up in the next year or two to the degree that is possible? Are there things we should be thinking about and putting in place now? You know one of I'm glad you brought that up courtney, one of the things that we we're struggling with. Is you know this whole mantra about know your students? Well, never have I felt that I know my students less well than I do right now for incoming students we did not have any assessment, information, attendance, information and so forth that was really valid or reliable, and even for our students that were here last year since March, you know, since there were no state test scores there were. There was no way for us to do our typical end of year assessments and there was no way to really reliably gauge how engaged students were with the work that you were doing, how much plagiarism was going on. You know, like just you know: information sharing between students and so forth, so knowing where students are at has been a challenge for us to to pinpoint- and you know so- that's been a focus for us early on and then you know, as we move forward we're hoping that we can get a better handle on that, but that's been a real challenge for us. Thank you bev. Yes, thank you. I am very impressed with all three of you and, as a former long time ago, central DOE worker. I always believed that the principals were the only ones who really knew what was going on so you've reaffirmed that belief in me tonight. I did want to ask a question about a DOE program, the name of which I can't remember, there's so many of them. That, apparently, is only limited at this point to students who are in the blended programs, but it provides a place outside of the school building. Typically in a non- profit for students to go to during the days they are not in school, in order for their parents to be able to work and so on. Are you familiar with this program? Is it working well, and do you believe that the non- blended, fully remote students should have access to a similar program? I'll start there? You know I my school has a lot of I'm a title, one school, and so I have a lot of students who are working class and first generation students in the country, and so I think a lot of parents opted in for blended learning, with the idea that we will provide child care, and so the question becomes what to do with my child in the other two or three days that they're not in school, and so the doa came up with this idea of Learning Bridges over the summer, but it was not implemented as a principal. I can honestly say I received an email from Learning Bridges on Friday and so Stephen tell us about these Friday evening emails that we get, and so just this Friday I'm finding out what our learning center partner is, which is the community center. A block away from our school, but parents who have opted out of blended into remote are no longer, that's no longer a viable option for them, and so I think it came too late. You know it says, even in my email, that these programs began September 29th, but I got the email on October the 10th, and so you know again it's a little too late to start making these decisions and I'm not sure how many parents want to exercise that option. I spoke to a parent who was a parent of a special ed student and she was so pleased with what we put together when and so thankful for our honesty about the whole process, and I told her this has come up now. So now you have an opportunity for five days of engagement. She said. Well, I know I would not get what I get at your school there and I do not even know what that is- and it's a little too late for me to make that decision, and so that would be the response from my communities. I think that came out just a little too late and some people already made decisions about five days of care and now that they're getting it here in the deal, we is no longer accessible to them and I would say I have not received an email from learning purchase, so information will be coming to Ps87 even later so Friday Box maybe come this Friday. I do know of people who were contacted directly. There were other DOE employees who were contacted directly about it did like I guess they were trying to gauge if you'd be interested- and maybe it's because of the lack of you know interest in my community, but I have not heard from learn. I personally have not received anything from Learning Bridges. I have not either at this juncture I unfortunately have to leave the call. I just want to thank everybody and Kim. I see you there in the background. I look forward to talking with you more about the community and the model. Cec work that you're doing and the rest of you been a pleasure meeting. You I'm sure I've bumped into many of you along the way and have a great rest of the evening, and I will check in with mark and others later to find out how this ended up so take care. Everybody appreciate you coming my pleasure. Okay, julian. I think you were the last hand raised in here so you're up. Thank you Steven and thank you principal Washington, Principal Barry for coming, I'm actually a student. I go to high school, I'm a senior now my model is actually very similar to Principal Washington's and I was originally going to ask you about learning loss, but I know that was already asked by courtney because, like actually my like a small antidote about myself, you know like my grades. My performances stayed pretty much the same, but I know as a fact I am not retaining the information that I am learning. I'm meeting a lot less with all my classes, based on my school's model. We have about 40 less instructional time and, although you know the assessments and homework is adapted for that, so that students can still perform well, it's just not sticking and I'm a senior I'm graduating it's different, but I'm really worried about what the implications of that are going to be two three years down the line, especially you know, summer learning loss is already so great and what it's going to be like when the learning loss is a year or longer than that. So that's a big worry, but I wanted to ask you instead about community building, which is also the deal. We also call this bridge to school as well. They have a document regarding that another bridge component and I enrolled in my school's blended model. I switched back after attending the first few days because my school is so large. I have four cohorts, so I barely come into school at all, but I found there was very little. You know, opportunity for community building and engagement. It felt almost shoved in there like it. There was not really a place for it, and I'm just wondering you know what are your schools doing you know, despite you know, the lack of you know instruction or direction from the DOE to you know, create community building. Are there any creative solutions you have to like increase student interaction, be that in person or especially virtually yeah Monica? Do you want to go? Okay? Well, Justin, congratulations on making it to your senior year, and I wish you all the best of luck and I no doubt that you will go off and do great things just by you being here tonight as a school, we try very hard to make sure that students understand our community Wes Prep was our mascot is the Titans, and so everything that we do is titan pride, Titan time, Titan, Spirit, tight and strong, and so you know we promised our families. You know we had to again listen to what the mayor had promised to families and we told families we'll get you about 90 to 130 minutes of live instruction each day. But we also want to leave room for physical education, wellness education as well as different kind of clubs and activities that you can do virtually. And so we built in a period where we do where we are fortunate enough to partner with wellness in the schools and so they've agreed to do live cooking classes and the live physical education classes for us two to three days a week for all of our grades. And so we have that we also are doing work around social, emotional learning, and so that's one period a week for all students. What we're engaging in thinking about our feelings and our emotions and talking about teen living, and you know, college and career readiness. And then we have a program at West, Prep called Studios titan studios, which are essentially clubs, and you have an anime club and you have a performing arts club where you're making beats, and you have a green scheme. A green screen club, where you're, making videos and movies, and so we've been able to incorporate all of that into our remote learning program so that we can engage students in something other than academics because, as a part of Westprep's philosophy, we like to engage the whole child anyway and so the what really concerned us the most when we were doing our August planning is how do we make sure that we retain that West Prep Magic when people walk into our building and they feel the connection? They feel the love by you being disconnected by you not being there. We created committees where we would make sure that you you're getting your physical and wellness education, we're making sure that people are getting communication, because it's easy for you to say I did not get that email. So I do not know you know. I did not know nobody told me, and so we were making sure that you get the information that you need, but also making sure that we building celebrations and we're going to do a lot of virtual celebrations. We started those in the spring and we did a graduation and I went and messed up and I passed out diplomas the last day of school, and so we want our students to know that they're a part of our school and when they came and picked up their laptops or did it in exchange. We made sure we gave them shirts and we gave them armbands and West Prep Mass just so. They know that you're, a part of this school community, whether you're in the building or not- and so that's what we did Monica do you want to share yeah. You know just to add on to what Carlin was saying one of the things you know we're in elementary school and so a big part of our community building also revolves around parents and things that the parents Association has done, and so a big part of what we've been talking about. How do we cr again, as I was saying before? How do we recreate a number of the things that we had done before and so in talking with the Enrichment committee, where we would have in school things such as the National Dance Institute would come in or dancing classrooms or center for architecture, and things like that and talking about what can we do on the remote days to still because kids are looking forward to? They know when I am in this great? This is something that I'm going to do. So, how do we still bring that to them and trying to figure out how to make that happen and doing it where the children are not just in their pods only in their certain classrooms? You know where they see the same 10, kids, all the time. I think that that's really important for them still to be able to see other children in the school so that they can know someone else and actually, just today I was walking down the hall with one of the second graders and a little girl comes out of the call, and they start talking to each other, and I said, oh, were you in the same class last year? It's like well, no, we see each other on. You know on the remote days, because we're in the same group, when we have our morning meeting, you know before the day starts, so we're still like. How do you make connections with children in that space and thinking about the remote side of it too? Again, that's the space where it's like. We have to really work to make sure that they're, the kids, who are learning fully remotely, have an opportunity to see other kids there's a whole other group of kids who are in you know as a part of the school we had when we first started off. We had drop in cluster classes where we'd have like our drama teacher, would do activities with all of the kids in a gray there were, you know our gym. Teachers would do something with all of the kids and they could see the other children, and you know it was really great. It was one of those things that was a fantastic plan. Once we put it in place, it was difficult to execute, so we still have them, but they're now optional, it's not required for everyone, but I still think that we still are having a large number of kids who are participating in them, because again it was something that kids were looking forward to and being able to see other children and feel like they're, a part of the community. One of the things is we have. We have four tenants here in our school and every year at the beginning of the year I hold an assembly. Everyone comes to the auditorium. We talk about the four tenants. I read them a book. Well, we, since we can't gather in an assembly, I made a video, for it, went out to all of the kids, so they can watch the video, and I still gave my same spiel and read a book and we're still going to do our book of the month. I'm going to read it for the kids this time and send out the video you know so different things that we've always had we're trying to figure out. How do we, you know, make it? How do we? How do we adapt it so that kids can still feel like they're part of the Ps87 community, but it's definitely work but we're going to try and our best to do to do that, because we do not want people to feel like they're outside of the community. Thank you. So we've got just, I think, a couple more people, including our Cec members, Mark. I thought. Maybe there was oh. We just lost someone. I just say a couple: people waited a long time and the attendees I do not know if they wanted to speak. I see now only one person I see cindy as well on there. I do not know if you can speak to how we would coordinate with that. Otherwise we can continue on another thought. I chatted with cindy. She is, I think, content to to listen in the person who's on the phone. I'm not sure who that is so perhaps I'll, try to find that out in the meantime. So why do not you go to Kim and Rosa and and proceed as you would ordinarily, and it is already eight o'clock, so maybe we should be thinking about last licks on questions and comments. Whatever you think is right as co- chairs yep. So let's start to sort of wrap it up. I did I did forget. Paul Fisher did put a put a question in the chat and his kind of question was- and I know that this may be more at a high school level and you guys may not have an opinion, but his thoughts were. Has there been any conversation, and maybe again maybe you may hear from other schools but about fast- tracking seniors in terms of majors or putting them to work? I mean: are you guys hearing anything about sort of innovative programs like that around the high school senior level, and the answer may be no just because you're not in those schools, but I do want to honor Paul's quest he did he did ask to ask him. Oh, have you guys heard anything about that? If the answer is no, then you know that's fine. I have not. I do not know. Have you carlin. I have not heard about that I'll. Take that as a note, okay, Kim our partner at the cec anything you want to add question appreciate you showing up and billy and joining us today. Well, thank you Stephen and hello. Everyone thank you mark. It's always so nice to be here. Hi naveed. We we've been in a couple of zooms with each other. Today you know through the through the conversation tonight. I a couple of themes kept coming up in my in my head, and I wanted to make sure that I touched on specifics around the needs of the students who are most vulnerable right now, and you know where people are falling through the cracks, our budgetary needs, and, potentially you know, sort of this issue of the enrollment and what happens typically at the end of October, which is that final kind of check- in on enrollment and what potentially could happen as a Monica principal Barry, already remarked about whether or not you know budgets are going to be we're going to end up having to deal with that math. You know that sort of strange period of time where the DOE asks schools to give money back and then also for some of our schools in district 3.. That is, that is similarly the time when over- the- counter students end up coming into community schools because they are counseled out of charter schools. Now I do not know the extent which that might be applicable this year, but it is typically something we deal with in district. Three, quite a lot. The thing about the the students who are falling through the Cracks families that are falling through the cracks really closely and dovetail together our students with special needs in our technology shortfalls right. It's not a secret that we do not have enough physical devices and the dewey made a colossal error in spending as much money as they did on ipads. When so many schools knew. That was not the answer to digital education right. We most students need to be able to type and okay, just stop it at that. But chromebooks are backordered, apparently until May and and and parent groups are sort of springing up and doing gofundme pages for to try and fund these kinds of projects on their own right now. Naveed- and I were literally just on a call with a parent in Harlem who was raising money, has raised like thirteen thousand dollars because kids in district five in district four do not have technology, so I think they they, where we need support, really. Is that tech piece? But it's also an access right. There's like the universal access issue, but also it's tech support. Something we were talking about at our cec meeting last week. Is that one of the like disengagement factors, one of the reasons why some of our families are not sort of ready to work is because they do not know how to use the technology properly and the DOE tech line is a joke. So we're trying to cobble together like our own, like cec tech, you know kind of a thing in order to help support some of the schools that you know, because families, like literally they do not know how to get to. You know to coordinate the different programs properly and make their tech pieces work and then and then, of course, there's the issue of not getting special education services delivered, which is a direct result of the staffing requirements and the last thing that I'll say to just where my you know, sort of straddled hat between CB7 and CB10, that you know a lot of black and brown students. Families selected all remote because of the realities of Covid-19 in their homes and they're living with the disease and experiencing the start of school. From the perspective of the public health crisis, still actively engaged and dealing with, not grades attendance. You know whatever other sort of scholastic issues, that more affluent families get to deal with right, and so I think one of the things that is really critical, and I do not know the answer to this. I'm just sort of saying this because I've been just talking about it with another group earlier that black and brown families and parents are really concerned that not so much about the loss of learning, but just about the sort of sense that we're just going to kind of keep marching to the drama of the DOE. And nobody really cares really what's happening to the kids who are not engaged but where they can't be really engaged in the same way. So we've got a lot of work to do to try to like expand the community outlook and try to figure out how to work together to get back to some semblance of normalcy and we're just all desperately hanging on by a thread. I'm sure. But that's really what I wanted to say thanks Kim, so I want to wrap up now. I certainly want to let our speakers leave and appreciate so much for staying and informing us. What I would like to put out to the group and again you guys, can it's going to take five minutes, but you could stay or feel free to jump off. But you know what I heard was advocacy and our support could be helpful and I would be I would be supportive of a resolution that would be very simple and straightforward and from my perspective that resolution one would sort of acknowledge the challenges leading up to the year, the ch and but more folk, but and then asked the DOE to do the things that I heard specifically, which was number one they should be listening to our administrators and our and our principles in terms of in terms of before decisions are made. And that's you know, that's paramount, and the other issue is just to continue to sort of advocate for these schools on a technology level and I'm certainly open to other people's thoughts. But if we're all you know, if we're all in favor of sort of moving forward with the resolution, you know if anybody is not comfortable, then let me know, because I got a feeling by sort of heads moving that that's a positive we could do as we've done in the past. Mark is usually kind of kind enough to sort of draft something together, we'll put it around, but I would be in favor of putting something forward. That would be supportive, particularly this group, acknowledging the way that we did and again acknowledging their hard work. So does anybody want to speak against or have an issue with sort of moving a resolution forward, even if I could jump in quickly? I think that the call for transparency and involvement of our of the people, who actually know what's going on is a terrific way to sum up this meeting and prepare a resolution to that effect with respect to the technology aspect of it on Tuesday night we're going to be doing our budget priorities, reconciliation with other committees, and so the right place to advocate for funding for devices would be in that form rather than in a separate resolution. So I would suggest that there are two different things to go forward with. Okay, I mean I do not particularly you know. You know me mark. I do not really have a you know a particular you know. However, we achieve things are fine, but I do think acknowledging that as an issue, because it's an obstacle that these principles have to overcome, not preparing them and putting them through the decisions that they said are challenged. I mean I want to be brief and move forward, but I'm just my words before are an understatement. You know I would use the word malfeasance leading up to this year. That would be the word that I would use for the million students, parents, everyone involved, I'm trying to underspeak and be sort of be a co chair that sort of tries to stay in the middle, but my thoughts are extremely passionate about what has gone on. You know I if, in a moment I support the no confidence vote that this union put out. I mean, if it was up to me. I would I would support the no confidence vote, but but I'm coming up short of that, but I can't tell you the as a parent and as a person who's seen what's going on and you do not have to be so. I'm angry I mean I am stum- founded at what has happened and I am dumbfounded at what these principles has had to go through, and it is to me in my lifetime, the largest malfeasance, that I've participated in government because there may be others. This is I'm involved, though I got a kid. So that being said, you know I've kind of got off to the right. I just want to say that let's put a resolution forward, we need to support these principles. There's a lot of stuff that went wrong. One of those is that these students are not getting the technology they want, and then these principles are being handed the problem and I have a problem with that. You know so. If we do not want to advocate for them, we want to acknowledge the challenges of having 133 students not have technology devices yeah. What does she do so? We can acknowledge that, but I think that the place to fix that is in the budget priorities and the place to advocate for the the rest of what you're saying is in a separate resolution. That's what I'm saying that's okay, so I would like to acknowledge the challenges and the way that I would say is that we need to acknowledge the challenges leading up to the year and then talk about the solutions moving forward, and that's how I would I would summarize it if other people would like to speak. You know I'm trying to chat or just jump in mark. Can you hear me or what I sure can? Okay, I would say I think we need both things. I agree with the resolution in terms of a strong advocacy position for a host of things. I got an education tonight, frankly, not a very welcomed one, but a needed one. So I think a strong resolution, but I think we need to be protective somewhat of what was said by the three principles, so it did not sound as if they came to us and complained about a relationship with DOE. We could advocate for their positions without putting them on a spot in a sense. But I also think in support of what mark has said that we need to include in our district needs budgetary part of the statement, a dollar figure for devices, as they're called. I think we could come up with a guesstimate as to how many I think we can determine how much each device costs do a simple multiplication and come up with a dollar figure. I do not think we have too many dollar figures in our budget, but I think we could certainly come up the three schools that were represented here, maybe 150 another 30, and just think of how many schools come up with a figure and make a presentation for the budget in the district needs budgetary process. So I think we're doing two things or we should do two things I agree. Does anybody else want to speak before we vote on the resolution? I said one thing is: if we're going to talk about the devices we need to talk about connectivity and that's absolutely critical, for whatever it has to work for home, we have to figure out how to provide connectivity provided with the devices either way, not just what was done last year, where the connectivity was limited to the DOE it has to somehow or another, allow children to reach out in greater parts, the web, other educational programs, and maybe it's a curated web access, but they need to have web access, that's equal to what their, what their peers have as well or else their education is limited only to what the DOE wants and that's to that's about the capital and operating expense. Okay, excuse me Bev. I hear you want to speak and then I want to make sure please nobody drop off, because we need to have a quorum here. So I want to get this before people talk, dropping off, go ahead, just that the third piece, besides the connectivity in the devices that principal Washington made the strong case for and also was the actual tech support and that's people, and so I think, that's the third leg of the stool that we need to ask for. Okay, great, I have one thing Steve I promise I will be fast: everybody drops off I'm going to kill you go ahead. I'm really worried about like listening to these principles and hearing that they're, not that there's like no accountability to them and they know best, and so the tech issue is like the immediate crisis, but there's going to be additional crises, and so the root of the problem that I think we have to address in the resolution is the lack of accountability and communication with the schools. That's like the root, and I think we have to be really concrete about that. So if the principles that are here, if there could be like communication about like what, ideally it would look like if there was communication and accountability if they, if there were opportunities for them to reach out and then to be accountable to kind of take action on what you say and then I think the tech is like one example and the lack of tech support, but there's probably a lot more. You could name right, there's it's probably so much and it's just going to get worse because the challenges are going to get harder. So I think we should communicate with them a little bit more as we're drafting. So a hundred percent agree that you know the issue is transparency, communication Friday, night emails. You know we made a joke, but to me I do you know again. The devices is a is of a manifestation of that, but we'll make that in the spirit of it. And lastly, if you guys want to email us and say hey, these are a couple things we'd love to see it in this. It's going to be about supporting you guys so over the next day or so. If you said here, there's a couple words or this is an example of something that should be in that we will most definitely put in, but this is about supporting you guys. This is about the advocacy that you talked about Principal Washington and hopefully this is about your community, supporting you saying you guys need to be heard and whatever we can do to get. That done, I think, is important. So with that, can we just do a vote because we got ta deal with a quorum, so it's a little technical issue and I'm worried people are going to jump off. So can we get a vote of committee members in support of this and I think it's small. So I do not. I guess we could do both the chat and the pay and raising, but can we all raise our hands and who are voting yes for this, so Mark I'm going to read out loud and then I'm going to look here as well. So we I see, can you just take my name down, so I can write the minutes. Yes, it's one, two, three, four, five, six, seven and Rosa. I do not see your hand raised just making sure that you're not raising your hand. So that's eight right. So it's one two, three, four, five, six raising your hand, seven she's, just doing it in the chat got it. I had not opened it, so I was going to go to that next. I think. That's, eight! Nine! Oh that's right! Blanche rate! So that's nine is Paul in the chat. I do not know if Paul's still with us Paul I'm going to look in the chat real quickly. I see you here. I always forget which one of these is hand raised or not your participants. Yes, he said. Yes, he wrote in the chat great. So that's 10 right! So that's 10, yeses everyone raised her hand. Is there any? No? Is there any against that's ten, zero and okay great? So we've got a little bit more conversations, but we wanted to thank you so much for watching as well. If you'd like exactly so, we have one non- committee member says: Doug and Mark does not mind. So that's two and I assume zero. So once again, thank you so much for your time. It's as Blanche said I think for us it was very enlightening. We learned a lot and again, I think from all of us. Thank you for all your hard work. We acknowledge it and understand the challenges and from our us and our kids and our and our friends. Thank you so much for the work you guys do. Thank you. I can. I want to say thank you all for being so supportive. I do not. You know, I know principals in different parts of the city and I do not know if they're getting the same level of support from the community as we are so. Thank you. I mean it's really we're very grateful. So thank you. So much welcome you and I just want to echo that thank you so much you guys have always been a partner of West, Prep and Ps145 and Steve and Kathryn. We go back to the playground days and mark you were there. My first day of being the principal and Kim, we appreciate your support with the cec for all that you all do for the district and Julian again, I'm wishing you the best year and Iris good to see you again and the rest of the CB7 people. I appreciate you again feel free to reach out to me and principal barry. We've been absolutely fine, sharing our opinions as you can see, and we have a whole lot more where that comes from so please, you know, engage us but also know we're running schools during these uncertain times. So you know if we do not respond quickly. We are still thinking about you, but yes, I would love to absolutely conversation and share more. So. Thank you. Thank you. Thank you very much. Thank you all. You got it okay, so the last thing that we need to go, as I mean for the committee, is just to close out our DNS the DNS was sent. I think there was some comments. I think we tried to be reflective of it. The last sort of rough draft laugh draft. There was not any post comments, so we've sort of taken that as a final, we can have some bit of conversations, but I think the process is, as we finalize there's a little bit of tweaking. I think I think Blanche brought up, maybe putting some dollar amounts marked that we do figures yeah, so we're going to add some dollar figures, but this is sort of the it's sort of it's sort of done, but if there's any passionate conversations to be discussed, but again, I think we tried to be respectful of everyone's input. I do not think that anybody who gave an idea at the very least did not get included at some point, so anyone any thoughts last thoughts on that. Otherwise we have our DNS for education. Great, thank you that there you're ahead of a lot of committees and I'm grateful, especially since we are going to be sort of slamming this together a little bit, but but so thanks everybody for a good process, all right so mark between now and next week. I think Blanche has some price figures. There's some budgets that you know. Maybe we want to chat. I'm not sure how to get I'm open to doing. I do not know what it would be budgets, but between now I think. That's the only thing that we need to add yeah. So if somebody would pull out the budget requests separately from the DNS and just have a standalone document or two documents, one that's the expense priorities and one that's the capital priorities and just list them out so that they can be shared with penny. Who will then share them with the entire steering committee and then on Tuesday night you will, as co- chairs will advocate, for whichever ones you want to put up front as priorities and, of course, trading off with other committees to come up with a unified and integrated list. Okay, great and then. Lastly, our blanche. Do you want to just give a little bit? We we've started on next month. I think we've already got one speaker Blanche. You want to just give a highlight of what we're thinking about for next month. That would be November. You have one already and I'm thinking of inviting not our usual library representatives but representation from library headquarters as it were, who, when she responded to my request for give me some dollars, she outlined what the library system does, and you know we just think of the library and books and you come you check out or whatever a book, but it is quite remarkable where the library is providing services. They are going into senior centers community centers they're, going into jails they're, going into some places that I frankly never thought of and providing services for them. So I just saw the overview of what all the library is doing, not only in Manhattan but certainly borrowed and with an accent of course on our particular area would be another guest great. If anybody has any ideas, we do not have anyone for December we're always looking for proactive ideas, so I think December. I had a thought of inviting representation from the local community centers like godard our own children's aid and I'm interested in knowing and you all might be. Also. You know this extra money came in to the community centers. That was re- apportioned from the NYPD budget and I'm curious to know how that was distributed amongst the various community centers, particularly for the youth oriented programs in our area. So that was another. It would be a Susan nieves who heads up she has oversight for godard and for Lincoln Center Community center, as well as I believe, the 63Rd Street Y. I thought we could invite her for November. How has the financial, how has Covid-19 affected you and how has it juggling also to report on what DYCD has done and so on? So that's going down to December, okay! Well, that's sort of just letting you guys know what we're thinking. We can certainly morph an ad, but that's wanted to share that and then again as we get into future ones, we're always happy to have somebody have ideas or even sort of I'm not going to say sponsor. I know Julian's been kind enough to sort of put together one for us and run it for us, so I think it's been very helpful. Doug did you want to say something yeah. I noticed that Rosa asked a question in the chat and I had a similar question: can devices be donated to the particular schools and I and my takeaway tonight- and this has been an education for me by the way I went to Ps87 and wrote that in the chat we need internet service providers, we need tech support. We need devices, it's so tangible to me and we have so much wealth in this neighborhood that I think we can we can. If we can get. You know we got the blood alcohol devices for the NYPD and granted. Those were only a couple of them, but I know we can do it and perhaps and mark correct me if I'm out of line saying this, but you know Michael Dell is building a build, a cantilevered building here, two of them right and you know. Surely it would be nice for him to donate some computers to the neighborhood to which he's in shadowing. I agree I I'm just. I know we can do it. I just feel, and so anyway the question was not really answers. Can we can we donate? You know individual devices, but also I was thinking that I have two devices right now. I have a chromebook and an ipad that I could. I do not need them. I do not use them. So what? How can I get that to them? While we were talking, I emailed principal Barry, to thank her and also to ask Rosa's question so we'll get an answer to that. It may well be that there are requirements of that a device needs to meet in order to be able to put them in the hands of a child. I could understand and actually maybe even support that, on the other hand, when you've got a school with 133 children without any device I'd like also to believe that there might be some flexibility, and so I will await an answer to that question I'll. I copied Rosa on the question, so you'll get the answer. When I do, I hope, and as for advocacy to Michael Dell, I'm all for making that pitch. I think we should make it with the cec, and maybe our council members and everybody else we can think of I'm going to bet you a good beer that there's not a school district in America that has not reached out to either Dell or to Hp or to you know all the above. So I mean it's also. You know, there's a huge announcement now with apple and verizon for 5 g right. They are billions of dollars. Now they've got their challenges, but I do not know enough about this, and perhaps this is already in the works, but for these massive internet service providers I have to imagine there are some programs to give bandwidth to some of these families and just to irish point, you know you have several children in a in a household that all need access and you see what happens in our own community board meetings when people's wifi starts to you know if the bandwidth is not strong enough, we so I do not. I do not I'm just thinking entrepreneurial and is there anything we can do to reach out into the private sector and, let's find out, what's already being done before we start doing that. But yes, that's my question, one that one chromebook for every market rate building apartment that comes before housing mark another something else for us to consider. One of the comments that I think principal Washington made is that the the students who are studying from home parents have a lot of responsibility and many parents are not familiar with. Devices are knowledgeable in technically speaking if we can start thinking of how to reach parents to provide them with technical knowledge that they do not have and that they need in support of their children, and it just occurred to me that libraries could be a big help and a bridge in doing that. But anyway, I think that future whatever it is, I was actually on the board of directors of a not- for- profit that tried to do exactly that. It went bust. So well, maybe it's time to revive it or something. But I think we need to reach parents because they're having so much more responsibility for their children's education, because the kids are learning from home. This is important, Sorry blanche. This is Doug just as the parent of a a kindergarten zoom who is quite tech, savvy and with a wife who is tech savvy even for us Tech savvy folks. The zoom process is extremely difficult to navigate through all the links. So there is a tremendous need for that tech support. You have no idea how that resonates with Blanche trust. Me, oh tell me about it. I get an emergency call, 10 minutes before every call, and we the day that I'm a troubleshooter. I got problems. He knows it's true, okay, let's it's all! We all had a long day. Lastly, any new business I mean is anything that generally did anybody wants to bring up about any subject from a new person? I just want to repeat Steve that this has been an education, tremendous education. I I thought it would be. I mean I'm. I think there is a handful of us that are parents, and that does not mean that we know more or think more, but you live it and then, if so, it's an education to me and each time that I go to a meeting you know about a school, I'm I walk away. You know somewhat dumbfounded but educated as well, and so I just thought that this until you hear it from somebody who's at school talking about it, you read about it. You see this, but when you hear it from the proverbial horse's mouth, I think it becomes educational. So to that degree, I'm very glad that it was fruitful from that perspective. Yep, great, okay, well, thank everybody, great meeting, and I will see everyone soon and we'll get that resolution out and we'll get your feedback on it. Okay, thank you. Thank you. Thanks. Everybody.",
            "summary": "You can speak whatever you like, but I thought people might be interested in terms of you know the challenges that you got, that you felt in terms of opening the school Do you feel now and then one of the things also is what are the concerns in the future, because those are the things hopefully that we can support.\nYou know we had to make a lot of decisions without really knowing what things would look like very difficult for me as an elementary school principal, especially inviting in kindergartners and pre- k, students, and trying to get parents to make decisions about whether they'd want their children to be learning in the school building or at home, with having no experience in the school at all was very difficult.\nI'm, a principal who likes to you: We use a lot of our resources to do a lot of summer, planning, And, so we always hold a teacher academy every prior to Covid-19 to get ready for the students in our school.\nWe can't wait around for the two days after labor day to get ready for school, So we always that has always been a part of our culture, and You know at the end of June, when the mayor came up with a plan for hybrid learning.\nI was very skeptical that this hybrid plan would work, and so you know thinking about what remote learning looked like since March- You know we were on this CB7 meeting back in June when I invited some students and we had a conversation.\nYou know we went ahead and planned a week- long teacher academy, the week of August 24th through the 28th to plan out some type of school year, because at the end of the day, September 10th was always going to come.\nSo I'm, not sure what the mayor and Chancellor were thinking with this late planning, and so that Wednesday, I believe, was when they issued the guidance around having three teachers, essentially for per class you're.\nYou, know two extra teachers for every content, specialist that I have, and so you know, I'm a practical, person, And, so I can't think beyond things that do not make a lot of sense to me, and so it's already hard to staff my school in the first place on a regular school year, let alone a pandemic.\nThat was just something that I could not think about, and it was something that my school community also I rejected, initially, and So, in speaking with my teachers, you know we decided outright to reject the memorandum that the deal we came up with And we decided as a school.\nWhat would work best for our children is for us to be fully remote, and if children choose to come to school, then we would support local child care.\nBut in terms of giving children an education, we would need to do things fully remote so that they can have access to the teachers that I hired for them at all.\nYou know we have not experienced some of the challenges that the other schools had in terms of trying to hire and waiting to last minute and playing around with the DOE about sending central staff members and hiring CUNY professors and all the other things that were taking place.\nWhat was frustrating for me as a principal is being the messenger and having to go to my community every week and say: Here's You know with all the misinformation and going back and forth between the mayor and the Chancellor and the governor, and whoever else I was making decisions and not asking principals, again.\nYou know they're not going to learn anywhere else with school, and If we do not have this together, whether it's remote, whether it's blended, whether it's fully in person or not, you know in the middle of October something seriously wrong with that picture.\nGo school go to school, but you know there was no planning around making sure that these children, who would have to be at home at least two or three days a week and looking at high schools four days a week, They were going to need technology They were going to need Wi- fi access at home, And While we spent all this time thinking about PPE and all these different things and going back and forth with all the unions, you know the deal we and all the money that we have might have could have potentially do not have.\nWe have 70 of our students who chose remote, and so only 30 percent of our students are coming to the building and every day that number gets smaller and smaller, because parents are realizing that you're doing the same thing at school, that you're doing at home, and so that's one thing, but also it's just not the same.\nAt one point you said that your teaching is a hundred percent remote, Does that mean that you're sort of teaching online And when the kids come like all the teaching and it's assuming my son's going to high school hmsc All the teachings online in the morning And then when they do have him, do have in person?\nEverybody is sitting in a classroom with a laptop with earbuds, and then they have access to their teachers whenever they show up whether they're physically there that you know you've worked it out, where they're being Have, some teachers teach in school.\nWe kind of made assumptions in June that this many people probably won't come to school, because in order for this to work, you're making assumptions that people are going to opt out because with social distancing, you can not have a whole full program and with nine kids in the classroom, when most class sizes are 30 plus in the middle and high school, You know you're, assuming that two- thirds of the school won't come to school, at least a third, so that you can put them on a rotating schedule.\nI have to say you know at the computer school again, I feel blessed to have the community, the staff that I do You know they've been in the business of making me look good for a long time and The person I probably bore the brunt of the constant fluctuation in the plans was my assistant principal who was in charge of programming, and we had a zoom call in fact where she was trying to explain the latest version.\nThink I'm fortunate in that I have a relatively no low number of teachers who applied for accommodations to work, 100 remotely, and my colleagues know that that's varied from school to school.\nYou know I'm also fortunate that while we have been getting that drip of students going from blended to full remote, which has created some strain, we still have a preponderance of students that are staying with blended and we actually had two or three students in the last few days that have come back to blended after choosing full remote and one issue that had come up, Is that some of the students who chose 100 remote right from the get- In the in the full, remote format.\nWe do not have that third teacher further, which is which has been tough for us, and I, would say that you know a part of it was that we needed more of those teachers to teach in the remote settings, because we had a large number of kids who chose remote early on before the school year started like by the deadline, and so we needed like for in fifth grade.\nThere was a lot of movement in the beginning when there were so many changes for the start of the school year And So, we had a number of people who moved from wanting to be in the blended program to wanting to go fully remote and We have not started we're actually going with the enrollment periods for moving from remote to blended, and so in the end of October.\nI truly believe it ironically seem to have the least amount of say in what is going on, which I find just incredible, and I know that in my own school my principal presented three different models over a three week, period.\nWe hear lots of things about people with options to go, elsewhere, taking them and thinking back to five and seven and ten years ago, when there were overcrowding, questions, and there was an issue about whether there was certainty or uncertainty that your zoned school would actually be available to you or whether the school that you were most interested in on a choice system was going to be available to you that parents were taking other options that were certain even if they were not ideal.\nYou know it's tough, because you have a certain segment of your population who just have so much dysfunction going on that they're not going to be able to perform on it on a good day, anyway, When you have a school with a lot of those people, then it's a struggle because you can't go inside someone's home and fix what's happening.\nYou know Columbia two people who worked at Columbia University and people with advanced graduate degrees trying to persuade people to go back to school, and the conversation started to go around lower income students and what about poor children And they have to go to school.\nYou know for other states because there was a job loss, but you know I would consider ours ourselves fortunate that it was limited to that number Yeah 20 students, but that may not sound like a big number, but that's almost a whole teacher You know all of the years that we fought to open for more schools to keep Ps87 from being overcrowded, there's space for you, now.\nIf they're going to ask me for the money that we owe and what's going to happen next year, when we have to say how many children we think we will have and will I have to go through the appeals process with the department of education which takes a while and by that time it's like.\nThink you know, that's been my biggest concern as a principal in New York City for the past seven years Is that you know there's so many people in between me and the chancellor, which means there's so many rules, and so many expectations, So and so many other people that I have to deal with and speak to.\nThis is what this looks like in my school, and when parents hear you know, I'm promising you full instruction.\nThey can't go that over to their friend's house and work on something which I do not know what that impact is, and I Anybody wants to address that of the students who are in remote learning but are actually physically remote from New York, and is that having any impact or even aware that of how many people are in that setting?\nI do not want a child up in the middle of the night, going to school, you know, And, so I will say that they've been really great about that, but it does still concern us as educators here in the building, because they we still have very young kids.\nWe have materials for kids who are working fully remote You know in figuring out how to how are we going to get things to people and all of that, and I also would say that a big challenge.\nYou know one of the things that I would say just community, wise or culturally here at Ps87 We are a school, that's known for our community, and we spend a lot of time together and bonding, and all of that How are we engaging the families who are working, remotely?\nIt's, something we think about all the time like we'll start to make plans, and it's like right that works really well for the people who come in to the building.\nWide, I'm on the district equity team along with principal Washington, and you know that lack of access and talking about the the disparities with who has and who does not, who can connect and who can't So , I think that we're all as a district worried about that as well, because as all of you who are familiar with district three, this is not a new issue when it comes to equity, and so this is definitely something that is on our minds and The fact that folks are told to reach out to the department of education for a device and the department of education that says, reach out to the schools is an issue we gave out every divide like Carl, so there's a number of kids out there who do not have devices to even connect.\nIf you had to just estimate, I recently saw online that it was about roughly 200 000 students who are lacking proper technology to engage in remote learning and just how about at your schools as well just on a local at my school, I would say probably four or five, because we deliberately made sure that all of our students got our computers and I was able to get a few more at the beginning of the year.\nThink a lot of parents opted in for blended learning, with the idea that we will provide child care, And so the question becomes what to do with my child in the other two or three days that they're not in school, and so the doa came up with this idea of Learning Bridges over the summer.\nI think that that's really important for them still to be able to see other children in the school so that they can know someone else and actually.\nWe have to really work to make sure that they're, the kids, who are learning fully remotely, have an opportunity to see other kids there's a whole other group of kids who are in you Know as a part of the school we had when we first started.\nI'm going to read it for the kids this time and send out the video you know so different things that we've always had we're trying to figure out.\nBut it's definitely work But we're going to try and our best to do to do that, because we do not want people to feel like they're outside of the community.\nAnd I were literally just on a call with a parent in Harlem who was raising money, Has raised like thirteen thousand dollars, because kids in district five in district four do not have technology, so I think they they, where we need support, really.\nBesides the connectivity in the devices that principal Washington made the strong case for and also was, the actual tech support and that's people, and so I think, that's the third leg of the stool that we need to ask for.\nBut I think we need to reach parents because they're having so much more responsibility for their children's education, because the kids are learning from home."
        }
    }
}