{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB2",
            "channelId": "https://www.youtube.com/channel/UC3wplvgutfIOHKy3y0QRUQw",
            "title": "2020.09.23 - CB2 Youth",
            "publishDate": "2020-09-25",
            "shortDescription": "Brooklyn Community Board 2 (CB2)\\nYouth, Education \\u0026 Cultural Affairs (YECA) Committee\\nWednesday, September 23, 2020 // 6:00pm\\nremote via Webex\\n\\n00:00:00 - Welcome \\u0026 Process\\n00:01:30 - Roll Call \\u0026 Introductions\\n00:02:30 - Approval: Agenda\\n00:02:55 - Discussion: August 2020 Committee Minutes\\n\\n00:03:42 - Presentation \\u0026 Discussion: Brooklyn Boatworks - Executive Director Marjorie Schulman; youth alum Jasmine Abu\\n\\n00:29:15 - Presentation \\u0026 Discussion: GenVote - CEO/Founder Brianna Cea; National Organizing Director Ramya Gopalakrishnan\\n\\n00:54:57 - Chairperson's Report\\n01:02:54 - Other Business\\n01:03:03 - Community Forum\\n01:10:36 - Motion to Adjourn"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB2",
            "normalizedName": "Brooklyn Community Board 2",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "twitterHandle": null,
            "dateCheckLast": "9/18/2020",
            "status": "live"
        },
        "properties": {
            "fillerWordCount": {
                "uh": 131,
                "um": 239
            },
            "wordCountFullTranscript": {
                "students": 59,
                "school": 46,
                "people": 45,
                "vote": 38,
                "youth": 32,
                "schools": 27,
                "year": 27,
                "program": 25,
                "community": 23,
                "lot": 22
            },
            "wordCountSummary": {
                "vote": 12,
                "people": 12,
                "community": 8,
                "youth": 8,
                "voting": 8,
                "rights": 8,
                "school": 7,
                "year": 7,
                "students": 7,
                "lot": 7
            },
            "fullTranscript": "So I'm calling the meeting to order, even though there is no farm. Yet it is about 605, I think yeah and there should be a recording right, yeah, okay, so the meeting of the youth education and cultural affairs committee of cb2 is called to order, it's being recorded for public access on the cb2 youtube archive. In accordance with the new york city, open meeting law, we conduct remote meetings with all committee members cameras on. We encourage all public attendees to leave their cameras on, especially when you're given the floor to speak and please keep your microphones muted when you're, not speaking, and if you have any questions that fall outside of public comment time, you can type your questions into the chat and we'll address them if they're relevant, if it's relevant or you could call the district office and we want to provide access regardless of people's limitations and now we're supposed to have the roll call of our committee. So I'll introduce myself on betty fibers for the chair and can our secretary introduce herself hi everyone, I'm meredith, phillips almeida and I'm the committee secretary and a member of community board 2. great and sent frontier? Can you introduce yourself good evening? I'm santiago committee member and a board member great. Thank you. I'm glad you joined us tonight and oscar hi everyone. My name is oscar luckett. I am a committee and board member fabulous. Okay. Are there any other committee members that I haven't seen? Oh alec is here duffy and I'm a public member, welcome good to see you okay, so we received an agenda by email. Is there a consensus that we can go forth with the agenda from our members? Is there any discussion about that hearing? None! We will go by our agenda. We will. We can approve the minutes. Okay, we have five, so we do have a quorum. We did get the minutes by email. Thank you. Meredith does an amazing job with minutes and she takes she does them. While we're talking it's amazing. So from the committee members, you've had a chance to read them. Are there any corrections or questions about the minutes additions? Subtractions? Is there anybody, since we do this by consensus? Is there anyone who has a concern with any of the minutes hearing none. We approve the minutes by consensus. The first presented divine angels, I believe, are not here yet. Is that correct? That's correct, okay, so our next presentation or our first presentation will be by an organization called Brooklyn boatworks marjorie schulman is the director and she brought some young people. Ah, so we turn it over for a presentation and then q a and so on so miss ms marjorie shulman hi. I'm marjorie thanks for having me today and jasmine I'm pointing down, but I know you're ordering, probably not my order. Jasmine abu is an alumnus, an active participant and a employee starting on saturday. Actually as well and she'll speak after I do so. We Brooklyn bullet works. I'm the executive director, I'm not the founder, but Brooklyn boatworks was founded by two brooklyn-based naval architects. As a volunteer effort in one school in Brooklyn in 2005, then we gained our 501c3 status in 2009 and I joined in 2014.. The mission of our organization is that we use wooden boat, building and maritime exploration to uncover the skills that students already have within them, and I guess we're our the our teaching model is that we meet students where they are, and that means geographically. So we are inside of the schools in communities throughout new york city, we're in three different boroughs, and also we meet students where they are with regards to their learning needs this year. Meeting inside of schools means we're doing everything remotely, obviously, but we are doing some in-person education outside at the moment, in a socially distance pod, like family pod manner. Traditionally, what we do is we have a school year, long program that involves that focuses on wood and boat building, but within the build we're emphasizing social and emotional development and stem skills, development, interpersonal skills, communication, perseverance on the long-term project and all of those all the things that go into any project that begins in October and ends in June, which is a really long project, especially for a young person, and we infuse our what we do with leadership, development and peer learning, as well as part of our programming. We traditionally take field trips to the waterfront and to the new york city, harbor school, so that if students are interested in continuing to pursue this from an educational standpoint, they can consider the harvard school as a potential next step for high school. If they're not already in high school, we do serve 5th graders through 12th graders, but our core is probably 5th through 9th grade. That's where most of our students fall in the summer. We do on water programming using the boats that have been built by the students, and so we do sailing education. But we also do water testing and stem experiments and a variety of different field trips, the coolest of which jasmine will mention in her discussion. But we send students on a week-long journey on a boat to be crew members, and they start in one place and end in another, and it depends every year is slightly different and then we have an alumni program. We have an alumni leadership program, also which jasmine was a part of we're. We love jasmine she's, a very active participant and she's amazing, and we did a five-week specific leadership. Development training this summer, that incorporated self-development and personal identity, and we also are developing an alumni council. This fall, which will meet in a way a very similar way to the our board, which is a quarterly meeting that would enable young people to provide input on our programming and our both for alumni and for students, and we also hire our alumni to participate in the education of our young people. So that is our ultimate goal in sort of student empowerment. So I told you what our traditional program looks like, but obviously, since March things have looked a lot different and this has allowed for a lot of innovation on our front, although obviously we'd prefer, if we didn't have to innovate in this manner at this time, so we converted and marched our curriculum to a virtual project, so we weren't doing boat building, but we were incorporating all of the other things that I mentioned. We have now over 20 stem lessons on our youtube channel, so those are free and open to the public, we're also going to integrate them into our virtual classrooms. This fall so feel free to access them they're. Between three and ten minutes long, we held our weekly classes with the same schools that we had been but online to keep the community going and then, at the end of the year we usually have a boat launch, but we did that. We didn't have boats to launch this year because they were only half constructed. So what we did was a really celebratory graduation in June we started a podcast and jasmine was part of that and students interview each other, and then we also have instructors interviewing students and we're going to open that up to students interviewing their parents or teachers or other folks that are leaders to them and in their communities we did. We also did and continue to do, weekly calls to alumni and students resource calls and that the resources we provided changed over time but started with health information, funeral information, housing, information, educational options where to pick up a computer all of that sort of stuff. So that was something we had never done before that we're doing now and continue to do for the foreseeable future. And then we also had virtual events and field trips using a the variety of social media that we're on so we're able to take students to the waterfront. Even if we couldn't do it in person this summer we did. We did in-person socially decent field trips to shirley chisholm park to busch terminal park and to domino park as well as there's a park in astoria which I'm now forgetting the name of, but we did field trips basically to areas where we have a number of students, and we did water testing and history of the park and beach cleanups and things like that and now starting in July. We started doing the boat building that I mentioned before, and so we're sort of back to roots with that. We can only continue that through probably October beginning of November, depending on when it starts getting cold and windy, as it is right by the water, but with that is we're going to hold them every saturday from now at least until October 31st family pods are can sign up, please feel free to do so. If you or other folks, you know, might be interested and we're also having a name the boat contest. So we are, we are constructing a boat and we are looking for for everyone to put names in the hat and then we're going to have our alumni shoes vote on the appropriate name in the fall, and there are some prizes involved in this as well, so feel free to participate in either of those challenges that are going on right now. This school year is going to be a hybrid. Well, we don't know what it's going to be: we're prepared to go fully remote. We're also prepared to go partially remote and partially in person, starting in January. If that's possible, I think it's going to be. If it's not a statewide mandate or citywide mandate, it'll be a school to school decision and we will we're prepared to do whatever it is. We need to do what we've we are not doing: wooden boat building, but we're sending kits home to all the students who are participating not with tools but with a variety of other educational supplies and nautical a rope to tie nautical knots and very basic things to learn some basic skills. And we are also teaching tinkercad, which is an online free online design tool where students will be asked to construct their design and create their own sailboat or their own boat. It doesn't have to be a sailboat and we're planning to print those on a 3d printer and then, hopefully, in person have a launch, but we may have a remote launch depending on how things go and we incorporate environmental justice and neighborhood planning into our curriculum as well, and we did that last year as well, but we're doing it differently slightly differently this year because of the remote learning that we're that everyone's doing so, I think I'll now hand it over to jasmine to give her perspective on things hi, I'm jasmine avu and I'm a ninth grader. Currently. So, oh sorry, I'm just so. I'm a ninth grader currently and I'm going to fort hamilton, high school. So I'll tell you about my experience with Brooklyn boatworks, so in 2018 around the fall, when I was a seventh grader, my ela teacher recruited me to join the Brooklyn boatworks club and I thought it sounded interesting like why not build a boat in school and so what we did in the beginning of the class or the program was we basically got used to materials and tools and try to get used to getting comfortable with them, especially when we're going to actually build a real wooden boat, and so what we did is one of the activities we did. We did a lot of team building active activities and games, and I remember we were we were the fastest class or one of the fastest school to build the boat out of all the schools in the program and yeah, and so we were also featured in the new york times magazine. We had a few journalists, come every few weeks and interview us about our experience in the program, and so when it came to launching day and launched the vote. I think this was around maybe June, basically the undead school semester or school year. We went to the pier the Brooklyn pier and unfortunately it was raining, but it actually made the day better because it was more fun and we're all soaked, but we still ended up sailing the boat. And so all the schools that participated in the program came together and we all launched it together and that was really fun made a lot of memories and it was. It was just really fun for all of us to participate in that, and so I think yes that year or yes, that the year of 2000 the summer of 2019, I also I also participated in the harvey damage, harvey gammage trip, which was for five days in massachusetts, and we basically sailed around in the ocean and, I have to say it was probably one of the best experience of my life just because it really felt like I was a sailor. We basically learned how to of ropes, and I was able to see the stars and the milky way and just really beautiful scenery. So I went there with three other kids from new york, and one of the one of my friends was also from the same school, so we just became closer because of that and also during that program during that summer. I also was in the Brooklyn boatworks summer program at the pier front, and what we did is we just. We sailed some of the past sailboats and we also kayaked and also tested the water at the pier to see to see the salt levels and other things about it. So that was also really nice and this summer. Unfortunately, with the pandemic, we did a virtual. We did a virtual program, and so I was in a five-week leadership program and there we just we exported our identities and we also explored so we exploit our identity and we also explored about our personalities, our interests, hobbies and just trying to find ourselves and I've also participated in the podcast, with one of my friends from school who's, also at the harvey gammage ship trip, and so we did a podcast. We were just interviewing each other about the bow and just life in general, and so I was also I'm late also during the summer. I think I also went to a few of the domino parks trips and we did a few workshops there, as well as also learning about the park in general, and this week I'm going to internship at domino park as well doing the helping out with the workshops and just I think, we're building boats and we're just helping around so yeah, and thank you for having me here. It's an honor and does anyone have questions so first? It would be the board members of the committee, so the members of the committee do you have any questions for jasmine anybody on the committee. Oh here's dorothea, you didn't introduce yourself. I didn't see you before take a moment to introduce our go. There are you still muted, you might still be muted, dorothy thompson, manning co-chair of youth, education and cultural affairs. Great good to see you so is there anyone on the committee who wants to ask jasmine about her experience with the Brooklyn boat works, oscar you're, a young person. Yes, ask another young person a question and then we'll jump in sorry to say no questions at the moment, but I know that's nice to have a question. Thanks. Ask meredith unmute yourself! Thank you jasmine. It was wonderful to hear from you. Do you attend what high school do you attend now and do you think that anything that you've been doing and working on via Brooklyn boat building is influencing choices? You're gonna make about college so apparently I'm attending for hamilton, high school at bay ridge, and I think I think it will affect me in college just because I'll have I'll, have experience, building things and also being familiar with some tools, as well as some sailing sailing facts or how to just sell the basics, and I think also just it's just also cool to sell ships so yeah great, so fort ham is near the water. So are you aware of or have you asked? Are there any clubs or activities that fought ham that are related to maritime, if not boat, building but water testing and some of the other activities that you mentioned? I don't really know too much about the clubs there. They did a virtual tour, but it was really quick and I know I have a friend who's a sophomore, but I'm not exactly sure what kind of programs or clubs they have yet they haven't really explained that yet so I hope I'll figure out I'll figure it out soon and then you could invite them to start a club, I'm sure, because it sounds like you're, a student leader and you're quite immersed in the maritime world. So yeah are there any questions. Oscar has a question. Well, thank you. Jasmine for presenting first, I was asked if Brooklyn boatworks is exclusively a middle school program. It is not we serve about a third of our program as fifth graders about a third is middle school or a little more than third is middle school and then the remainder are high school students. You know we, our curriculum is the same. It we just each differently, depending on the developmental needs of the students, all right thanks and I would definitely encourage if anyone to all of our podcasts are on our website and they're, also on podcast apps, but jasmine's interview co-interview with her friend and fellow boatworks. Alum is really thoughtful and thought-provoking, so I would definitely recommend anyone wants to learn more to listen to that podcast. Can you give us the details about what the podcast is called or how to find it? It's called boatcast. It was actually named by jasmine by the students at ms88. As far as I understand, which is jasmine's old school and it is about you know the challenges and student challenges and resilience during this time. Thank you. So you mentioned that jasmine went to ms 88, since our cb2 is in more in downtown Brooklyn than in that's in district 15. We have mostly district 13 schools. Can you name offhand if you can any schools in district 13 that have your program and how a school would reach out to you if they wanted to do this type of club or after school, we're not in district 13 right now, but we are always open to forming new partnerships with schools that are interested in the program and we are actually in the process of onboarding schools right now. Usually it's already done, but because all of our school partners from the past and the new potential partners are unsure of what the school year is going to look like they're, hesitant to they're worrying about putting you know, making sure the school day is set before worrying about after school, which is really understandable. So if there are schools in the district, we're happy to speak with them if they'd be interested or we're happy to conduct outreach to them as well. How would you like, if you were reaching out to a district? Do you write to the superintendent or the superintendent's office? How would a district find out about you know it varies? We don't actually do a lot of outreach because at the moment most of our schools are, you know either a principal recommends to another principal at another school or a city council member recommends us or a parent asks us to come to their school and we don't have the capacity we haven't had the capacity to to do significant outreach and then say yes to everybody who wants it. So that's been a limitation, I don't know if it'll be a limitation this year for better or worse, because I think we'll we may lose some programs that will come back next year, but they can't figure out how to accommodate all the programming that they used to have this year. So it's just a conversation with a principal or the school leader. We prioritize title 1 schools. We require at least 50 percent of the students who participate are females or gender non-conforming students, usually the other, require the other requirements are no longer necessary. But it's like a space for us. You know a classroom that we can work in and then turn you know we're a leave, no trace organization and then and then pack everything up and store it away and a closet for that sort of thing, but that's obviously not relevant, at least not right now, so we're happy to speak to schools that might be interested in and fit what we're looking for and are interested in hands-on learning through maritime education. Thank you. This is very exciting. I think, if I do when I not if, but when I get to speak to the district 13 superintendent, I will certainly mention this program. So how is this funded? How are you funded for this? It's a split between we do get a small amount of funding from city council. We govern private, sorry, private foundation, grants individuals and program revenue, it's all sort of a mix of how we get how we get our funds, but we do we're always doing fundraising in a variety of different ways. So is there any additional alec? Did you have a question? Oh yeah. I have a question. I'm sorry if you answered this before, but in terms of programming, what constitutes that is it? Do students pay for the the process or students never pay, but the schools do pay for under half of the program cost and during the summer we work with the girl, scouts and other and community organizations that we either get give a scholarship to and they pay a small fee or they pay sort of. Excuse me full fee, so that's this year, we're actually our board is raising money so that we can provide our services for much lower rates than usual cool. Thank you. I'm sorry. Are there any other questions from anybody who's on this? On this meeting? No questions. Okay, so hearing no more, no questions, I want to again thank both participants and I think it's very exciting I'm I know people in the boat building world and harbor school and so on. So this is a really a very special program. So thank you and I hope we hear from you in the future that you keep in touch with us and since our community borders on the waterfront, it's especially important that students have the opportunity to experience the waterfront, not just it's on the other side of the highway. We know we're near the water. Thank you for having us. I really appreciate it: okay and feel free to stay for the rest of the meeting or leave whatever you prefer, but you know that it's the meeting is open. So thank you. Okay, so [Applause]! Next on our agenda is the gen vote. Rihanna. How do you say your last name brianna? You can on youtube. Yeah sia like see you later alligator type of deal, and my colleague ramya is also here. Okay, so pl. Thank you both for joining us and please tell us about your program, especially any involvement specifically in our community, and I want to thank oscar one of our youth member for suggesting the organization. So thank you. Oh awesome, yeah and I love seeing all the young folks on the call. I sure wasn't doing this at your age and I still consider myself pretty young. So it's really impressive to see you all here. I will be sharing my screen since we have a little presentation. So, however, we can make that work right. Okay, all right, share content. Let's see, can y'all see my screen now, if you're seeing powerpoint, yes, okay, great all right so hi everyone again, my name is brianna sia and I am the ceo and founder of generation vote as a Brooklyn community member. I believe my community board is community part. Eight. I am so thrilled to be with you all today to share a little bit about our work at generation vote and how we are advancing youth voting rights both in new york city and throughout the state, I'm also joined by my colleague and partner in crime, who can introduce herself hey y'all, I'm romya I've been with a generation vote for a little while in college and recently earlier this year I became the organizing director. So we have a lot of exciting initiatives and stuff to share with y'all. I'm super happy to be here on this call. Thank you, wonderful all right, let's see if I can move along okay, perfect. So at generation vo we are a youth-led movement organization aiming to build a movement of young people to stop the youth. Voter suppression, crisis, advance youth, voting rights in new york and beyond and transform the way young people engage in local politics. This is not a flattering picture, but I think it also shows the reality and the difficulties that we are facing during student, organizing in the age of kovit, but we launched generation vote pretty recently. It's a new organization. We launched it in the fall of 2017 at binghamton university to basically spread what we call the gen vote model of engagement, which is our training curriculum that supports young people involved in local, progressive and advocacy campaigns and ramya was one of them. We first piloted the program for one year at suny, binghamton and suny albany, which is right in our state capital and since then have actually expanded to eight campuses across new york, and we also have chapters in Florida and are developing other chapters across the country and so on. The screen here you can see the chapters that we have in new york, as well as some of our lovely gen vote team leaders, the ones that are starred, are all based in new york city. So I'm not sure if we have a campus in your community, but I'm sure that we have students that may actually reside where you all are. But we are also always looking to expand our program on other college campuses across new york. The way that the gen vote team generally operates is that we work with students to start gen vote teams that usually consist of five to 15 students and mentor and train a student in specific skill sets to both advance local campaigns, and, in this case, for us, especially around youth voting rights and romney, will touch a little bit on later. A new model that we're developing to expand our gender program to not only college students, but also to high school students and folks who are not affiliated with universities. So we are also in the process of building out that membership structure as well. Okay, so I was asked to share a little bit about some of the hurdles that we have been facing, and so I probably can go on forever to talk about what we're up against. But before I talk about kovan 19, I'm actually kind of go back a little bit into our history of how we started genvo and why we started working more on youth voting rights and fighting against youth voter suppression. So when I started generation vote two and a half years ago and was spreading this model of getting young people involved in the political process, I realized that a lot of my peers in college campuses across the state were encountering a lot of barriers to both registering to vote and actually getting to the polls in new york state. So, for example, that looked like trying to arrange rides to inaccessible off-campus poll sites and my friends at cuny at the time trying to navigate the opaque vote, registration resources and requirements for our city-based students, and so a lot of gen voters were expressing confusion and frustration when just trying to exercise their fundamental right to vote. I remember when I was a student at binghamton waking up at 5am to vote in my very first election, because at the time new york did not have early voting and I had to wake up early and go to the po go to the polls before my classes before an exam and before my jobs. So as a result of all of these challenges that young people were telling us about at generation vote, we decided to roll up our sleeves in our network and get involved in a coalition called let new york vote. Some of you may be familiar with new york vote is the largest statewide coalition fighting for voting rights, and there are a lot of organizations that are based right here in Brooklyn, like the Brooklyn voters alliance, who are active members of this coalition, and we have been involved coalition. Basically since its founding, as the lead young organizers, constantly fighting for not only new yorkers right to vote, but making sure young people's voices are being heard in this conversation. So we got involved in the latino coalition to basically overhaul new york's election system which, prior to 2019, which was just last year, had the basically worst one of the worst electoral systems in the country and fun. Fact. One of the new york state also had the second to lowest youth turnout rate in the country in the past midterm election and I think that's reflective of the archaic laws that we had prior to 2019. And so we expanded our work to fight against youth suppression with the let new york vote coalition. But I also want to take some time to highlight that voter suppression, whether it be intentional or not goes beyond new york new york state, did a huge overhaul of our election system in 2019 passing laws like early voting, which we just got in the past year, pre-registration of 16 and 17 year olds, electronic poll books, but we have a long way to go, but even beyond new york from new hampshire to Florida and wisconsin we've seen young people, especially young voters of color, be forced to jump over immeasurable hurdles to exercise our right to vote and Covid-19 19 has only amplified the impact of these attacks, and some of the headlines here show that, and so this is. This is what we mean when we talk about the youth voter suppression crisis and why we're fighting for youth voting rights, both in new york and beyond, and it's right here just a little fun fact. The second to lowest, youth or turnout rate go new york. Sixteen point four percent, I think arkansas was last placed yeah. I know I'm not that many people know that. So that's so that number. When I first saw that number I wasn't surprised again because I was we were familiar with all of the issues that young that new yorkers in general are facing when trying to register, to vote and actually vote in new york state. But we saw that new york state has a lot of work to do, to get out the youth vote and to pass reforms that advance youth voting rights and tear down the barriers that make it hard for young people to exercise their right and so generation vote is the co-chair of the let new york vote, youth working group with citizens union and we are paving the way for our youth voting rights movement right here in new york in November of 2019, we developed the first new york youth voting rights platform at the first youth voting rights and engagement summit in albany new york, and we had students from both high schools and colleges across new york, city and new york state come together to vote on this platform. Some of the reforms you can see here. So these are some of the issues that and policies that we are advocating for. As part of the le of the youth voting rights platform and ramya will be dropping a link in the chat to our report, so you can actually learn more about these reforms and why they are so important for young new yorkers and we need everyone's help to get the word out about this effort. So on the screen here, you can see things like extending time off to vote to schools, mandating on-campus poll sites, lower the voting age 16 for state and local elections, and I think, I think, is really important in 2020 showed us this passing a student voter empowerment act for suny and cuny colleges to make sure that our public universities are giving our students the not only the information to register to vote, but how to vote and also investing in civic engagement activities on their college campuses. Since then, since November of 2019, three-fourths of this platform was formally endorsed by the let new york vote coalition and three of our platform bills have passed the state senate. This included things like online. Voter registration mandating on-campus poll sites and opening the door for lower the voting age in which a bill was passed this summer to lower the voting age of 17 for primary elections. These bills passed the state senate. They did not pass the state assembly before session was over, but we have young p. Our gen voters and coalition members have been talking directly to leaders in Brooklyn such as state senator zelner, myrie and others to get the word out about our youth voting rights platform, and we have seen a lot of interest and success with our state legislatures on this issue, and I also share information about the let new york vote coalition, because if any of you are interested in joining our youth working group, we have calls monthly and you can contact us directly after this call to be added to our listservs and those calls are open to the public and would love to plug you all in to the coalition just shared this slide about what we've been up to in the terms of the past three months, to show that our network has been busier than ever, especially during this time of mass confusion amongst young people about how to register, to vote, how to vote safely and how to organize our peers to vote in this upcoming school year. I want to particularly note what we learned about getting out the youth vote in the new york primary, since this may interest. Folks in the community, I think we learned a lot this past June about barriers that young people were facing to actually vote in their first presidential primary. You know, usually our students have told us that they've seen confusion and frustration with the options of the adequate options, inadequate options to register to vote in new york, since our online voter registration system is not currently active, but hopefully we'll be active next year, but this year really presented unprecedented challenges for our students when trying to register students and get out the youth vote for the primary, which happened during the lockdown or shortly after the lockdown, and when schools were out of session. The current public health crisis disrupted schools across new york right before the primary, bringing a lot of our own civic engagement initiatives for a standstill and leaving a lot of young people with limited opportunities to register, to vote and to understand their rights and how to exercise them during a pandemic. Some of these issues included, you know, students who are registered at the college addresses and were soon displaced as a result of their schools closing suddenly and were at risk of not receiving the absentee applications. We even had young people, not just students in the community who never received the absentee ballots, and I think ramirez was one of them, and so that also resulted in folks kind of losing faith in the new vote by mail process in new york or at least nothing new, but the more flexible options to vote by mail in new york and at generation vote. That is one of the reasons why we worked so hard to do a bunch of online and virtual educational events to provide as many resources to college campuses and high schools across new york city and new york state to help educators, understand the ever-changing laws during this pandemic of how to vote and make sure that their students are getting the correct information, and we will continue to do so in the lead up to the general election so happy to talk more about what we learned during the primary and if any of these things on this screen interest, y'all we're more than happy to talk about some of these initiatives as well. It's been a busy year busy few months, and so I guess we'll end it with just talking about upcoming gen vote campaigns and I'll. Kick it off to ramya to share some of our initiatives that we've been working on since the start of the school year and the end of September end of august and early September and the lead up to the general election. So I just dropped in the chat the power to the polls campaign. So y'all can look further into that. If you would like I'd specifically like to highlight how people who aren't affiliated with colleges or universities can get involved in this very important work and this very important fight. So if you're a high school student parent and any non-college member, essentially you can. We would love your help on any of the initiatives listed here. Sorry about there's always a motorcycle going by so something that we find really important for the new york city. Hubs to focus on especially leading up to the election is just providing information and in an accessible form to people who are going to be voters or potential voters, and just community members. I'd like to develop a long-standing relationship with the parks department, specifically because being the sanctity of parks being sort of just this public space that people go to without the intention of really like spending money and us giving people something that isn't a product that we're selling and sort of merging this. Just this is something that people do. People should partake in it's just giving and receiving knowledge and not products right because they're so much surrounded by that kind of stuff. So the parks are a special place and I really love parks. So I want to launch a campaign with the hubs where we every weekend have young people sort of tabling where we have just free information for people and we can provide them with voter registration forms and direct them to how they can submit this stuff properly, because there's a lot of issues that we're seeing where things are being discounted. Because of oh, this one thing is wrong, or you didn't submit this in time or oh, this hasn't been checked off and so us being hopefully knowledgeable sources of that information can provide that for people, and they know that somebody is going to be at this geneva table on every saturday at this at the various parks across Brooklyn new york city, wherever we can have people- and so that's, I think, a very important starting point for the hubs, because this is a very new campaign that we're doing, and so, if anybody wants to help out with that, please let me know I'll drop, my email in the link, sorry email in the chat- and we also have a website that y'all can go to sign up for volunteers on any of that stuff I'll. Actually kick it back to brie if she doesn't mind to talk about specifically the initiatives at the top of this list. Sure, yeah, and so you know, brownie basically outlined our upcoming gen vote hub program, which again we I would love to have folks involved in this community to help us engage community members outside of our college network. In terms of other campaigns that generation vote is focusing on in the lead-up to the election. Not only are our students getting out the vote like every other voting organization, I think in this country, before November 3rd, we are also providing resources and organizing volunteers for two major initiatives in the lead-up to election to protect our vote. That looks like recruiting young people to be election workers, whether that be with not to the board of elections directly, and so we are doing that through our power to the polls website, which you all can sign up and have any questions about the process. Please let me know we were involved in the national election worker recruitment day and I've been talking to folks about how important it is for young people like myself, who has signed up to be an election worker. This November and the second major initiative is election protection. So if you are able, we not only need folks to get out the vote but to also protect the vote, and that looks like monitoring poll sites throughout new york city to make sure that guidelines are being followed with PPE, for example, as well as opening on time. That does not know and there's no long lines, and the second way that people can plug into election protection is to help us with digital monitoring. So if you are interested in either signing up to be a poll worker or protecting our vote during early voting or on election day, you can reach out to us directly since we are leading the youth election protection effort with common cause, new york in new york, state and new york city. So those are some of the major initiatives and we can end it there with any questions that you all may have and hear our emails, you can contact us directly. We are always open to chatting about ways to support y'all and not only getting out the youth vote, but also advancing youth voting rights. Thank you. This was an amazing presentation. I learned really a lot. I think one of the things I heard is that you're trying to recruit more young people in this effort and it might be hard during this pandemic, because students aren't at school or gathering in the typical way that young people gather. I was wondering if you have ever reached out to chalkbeat, which is the online newsletter information about the new york education system. That's an independent entity that many teachers would be so. Oh what about you, or maybe you could post information about some of the activities so that high school teachers, especially who are interested in civics and government, and that type of thing could share with their students. Are you familiar with chalkbeat? I actually am from with trophy, but we have not been in direct contact with talk fee and that's actually that's a great idea, especially as we expand our hubs and we want to have more high school students involved in generation vote. Definitely we'll reach out to them. That's a great that's a great suggestion. Are there any members of sure any members of the committee who have a question for either of the presenters? Let's see or members of the community who, yes, I have a question in the library. Are you? Oh? Okay, sorry is it okay thanks? Well first, I would just say thanks again for presenting. You know. I think a lot of the policy initiative you guys are you guys are working on. Is you know very similar, align pretty much with the you know, my goals for these elections upcoming the upcoming election. I was curious about you know which campaigns you guys support and that selection process right on. So do you? Are you referring to political campaigns that students have worked on? Yes, yeah, so we've so generation vote? We have both a c4 gen vote action which advances our youth voting rights, work and with the lightning your vote campaign, and we have a 527 which allows our students to work with local progressives running for office, and so we've worked with all different levels of campaigns from literally school board and county board in upstate new york to congress. So, for example, in just this year alone, our gen vote cuny queen's college students worked on their first primary election in new york, five, which, in a congressional primary campaign which was exciting. We have students also working on a congressional primary congressional campaign, this November in upstate new york, but we also have students working on the state senate races. So we we've kind of done it all, and it's really cool to see how our gen vote model of engagement is flexible enough to support young people and all different levels of races so happy to show you the names of the candidates. You know offline if you'd be interested but all different levels. Right yeah, I mean I was more just curious to how you sort of pick those campaigns to support. Oh right yeah, so our students have a whole candidate agreement process that they go through and consult with national staff, and so that process is basically an agreement between the gen vote, students and the campaign to ensure that young people are at leadership positions in a campaign, so not just volunteers making sure that young people, students are actually staff members on the campaign and ever say that the candidate is actively endorsing their youth platforms. If their team has developed one or in general principles and platform ideas that they can't that this, the gen vote team supports, as well as dedicating funds to youth specific, get out the vote efforts so making sure that the campaign is actually investing in getting out of the expo in their district thanks. That's awesome! That is wonderful. Are there any members of the general community who would like to ask it? I don't think I see anyone. Okay, so thank you. I know that some people will engage with you and check your website and so on, and I look forward to seeing something introverted about what you're doing, yeah absolutely and I'll drop the web. Unless, oh awesome, you all have the website so feel free to check us out and again email us, and we appreciate you all having us. Thank you. Thank you can stay or we, you know, feel free to stay or get better things. Yeah we've got more youth workshops to do so. One of my work with young people is that these workshops go super late. All right. Thank you later. Thank you, bye, okay. So the next item on the agenda is the chairperson's report. So I just wanted to follow up on a few things. We were talking last month about outreach to district 13 to follow up on some of our questions about the district statement of need, so we've been kind of playing telephone tag and email and so on, and I'm committed to try to get some of the information from the superintendent and who are the chair of the cec and I'll continue to work on that. As you know, from the media school starting has been very bumpy, with the dates changed and now staggering, the first days of school for different age, students and students with disabilities, and so on. So it's a big challenge and we're all. Following this closely, I received an email from john do one of our community board members, who suggested that we kind of like reach out to high schools and suggest that students, as part of some of their school work about civic engagement or community work that they can attend one of our meetings, since it is remote and they can do it from home and so on, and that they write a report for some type of credit. I mean, in my opinion, it's a fine idea. We've in the past, we've always had students, maybe more college and graduate school students in journalism and in public policy, and so on, come to some of our meetings, but this would be in a more formal way and for high schools. I'm just concerned that any reaching out to high schools at this point with everyone just so overwhelmed and not knowing what today looks like let alone tomorrow, you don't want to overwhelm school leaders with yet another ask, even though it's a small ass, just letting teachers know that this is available. So what some of my committee members think about that? Well, I wait never hear me first just I know my internet's been a little spotty. Okay, you know I. Obviously we don't want to put too much on principal's plates right now, it's a very stressful time, but I think like especially considering that we're less than 40 days away from the election, and there are a lot of high schoolers who maybe aren't registered to vote, maybe don't plan on voting. I think you know joining a community board meeting is a great way to specific, engage a life of civic engagement and potentially means. So I think that, coupled with a get out, the vote campaign in high schools might be something that could work well. I think those two pair well nice together nicely together. You know, obviously I think it's it is time sensitive and it is the sort of thing that we might have to wait for school to begin to start that outreach, but I still think it's something worthwhile this just to clarify mr didn't suggest it was. It would be about voting or getting out to vote. It would be that they would join one of our meetings or many of our meetings and write a report, so I mean writing a report. You don't want it just to be a narrative. Well, this one said this and this one said that you'd want to ask some essential questions for students to respond to more analytically. I would think so. What do some other people think about how to get something like this going? If that's our theater dorothy is speaking asking students to consider joining one of our meetings is fine, but as far as talking about writing reports, I don't think that's something that we can be involved in. This has to be a school decision, a teacher decision. We don't know how the schools are operating at this time, how students are getting grade or anything. We don't know that. So I don't think that's something that we as a committee should even suggest, but if we want to- and maybe I'm not sure how this would work, because things are really a little crazy, I don't see it being an issue asking if, when things get a little bit, maybe more settled and we know school has started if the teachers choose to ask, tell their students about the community board and that would have to be all community boards, not just community board too, and that there's an opportunity for them to get involved in civic engagement by going online. That's just that's just the way I see it. Thank you anything else, yeah I'll. Just add that I I'm curious. You know, I know that there are actual, like meetings that are being held. That might be a little bit more dramatic than something like ours. That might be really that might provide a hook for high schoolers, for example, meetings around rezonings that are really contentious and where there are people from both sides of an issue coming at things in really compelling ways from each side. I don't. I don't quite know how to identify those, but I'm just I think it's a great idea to find ways for high schoolers to plug into the community and wonder if they're, yes to the idea of potentially these meetings, but also wondering if there are ways that we can put together a calendar or list of online meetings involving rezonings. For example. I know: there's a actually an online court hearing related to the Brooklyn botanic garden rezoning process- that's going on tomorrow, for example, things like these, which I think might be really compelling. In any case, I just thought I'd mention that. Thank you, somebody's child is making very musical sounds. Yes, is that your childhood? That's alex kids, that's right, very musical, okay, okay and then the last thing I wanted to share is that I believe that next month the Brooklyn public library will be presenting I'm not totally clear whether it's to our committee or the whole community board 2 about the new branch and maybe they're going to be moving into one clinton street soon the Brooklyn heights branch. So we can look forward to hearing a lot more from our library. Colleagues next month, so that is the end of the chairs report. Is there any other business that committee members would like to bring up? Okay? Is there anything that anyone from the community who's not on this committee or on the board would like to share with us is online if she is still online? I would like to ask her a question about the clinton hill library sure she is here: yeah, hi tracy. I want to know for clinton hill. When are we going to be able to start returning our books, because mine have been sitting on my bookshelf for months and months and months, and I want them out of my house. So what can I do with them? Where can I bring them all right? That is a really good question and it's one of the reasons why I'm here tonight we don't know when we're going to go to lobby service, yet they have expanded lobby service so that walt whitman is one of the lobby service locations and you can return your items at walt whitman in community board 2 right now, walt whitman has lobby service. The annex has lobby service and a lot of the patrons are also going to central. Also we have extended. We are now giving out library cards at five locations during their lobby service hours. The one that would be closest to the clinton hill community is central. I'm going to put a link in the chat with the branches with the library card service. This is for people who want to get actual physical library cards. The problem with the e-cards is the e-cards will only let you check out ebooks and use our electronic resources, but if you want to check out the print books put holds on print books and pick them up, you need a regular card, so you can either apply for that online or you can go to one of the locations now the five locations during your lobby hours and get a regular library card, our Brooklyn connections. People are also working with teachers to see about getting cards to classes so that the kids can actually have regular library cards so that they can check out print items if needed. But in terms of us going to lobby service, I can't give you a date at that point in time. Unfortunately, the annex, what is the annex, I'm unfamiliar with that? What is that? That's the adam street location, adam street yeah, I'm gonna, see hold on a second I'm gonna, see. If I can get this into the chat. I went to the red book library to return some books. Yeah, you can return to reddit. This I sent through is the locations with the card service, the other ones, with the lobby service. Okay, I just wanted to know. I mean I realized that we're not getting fined, but I just wanted to know where I could possibly return the books I'll just wait as long as I don't get fined. It doesn't bother me no right now, yeah right now, everything that's been checked out is not due until November 2nd and if, for example, you check something out from lobby service, you are going to get a due date and if you don't bring the items back, you'll get fines, but if you do bring them back, the fines will be removed. So anything that's been checked out prior to the pandemic is due November, 2nd and then otherwise. Anything checked out during lobby service you'll have regular due dates, but you're not going to be charged fees. Okay, thank you. Thank you. Do you have anything else to tell us to update us about the library? Well, we've got the library cards being handed out at the different locations. We've expanded lobby service with us. They are revamping our meeting room so that will hopefully be done soon. We'll have a totally redone meeting room. We created a team space. We are still doing a lot of virtual programming. So if you look at our website, you will be able to see a whole range of virtual programs and they've started doing some programs at the university of the open air in the prospect park. Boathouse clinton hill has a web page. We have a sorry, a facebook page and we're posting the virtual programs that we're doing and we're going to be expanding them even further in the next couple of months, and then I understand there will be a big meeting in October where the library will be presenting to you. Yeah are libraries voting sites in any of the libraries we've had that question about that. I've been doing chat reference like three to four hours a day and that's been coming up at this point in time, we're not aware of them being voting sites, but that might change some of the branches. The lobby service have been putting out voting forms so that when people go for lobby service, they can actually get a voter registration form at the same time, but we have not been given any instructions at this point in time about being voting sites that may change yeah, because I understand that the chancellor doesn't want the schools used as voting sites. They don't want more people who potentially have more germs in the schools, so I imagine they're still looking for voting sites yeah, I'm not sure exactly what would be going on with that. We have. That has actually come up in chat reference and we're waiting for instructions about that, but we have been giving out forms in lobby service, so people when they pick up the holds, can get a voter registration form too. I thank you so much so it's good to see you, even though we can't see you in the library we see you the fourth wednesday of the month. Well those meetings, I'm sorry I was going to say these meetings have been very informative. I've actually come back and told my staff about them, and the one with the district 13 superintendent was really informative, good job, I'm glad it was helpful. So was there any other questions, business items that people want to bring up? Okay, so here yeah sorry, I'm just gonna remind everyone, I'm sure you all have already. But if you haven't there's another seven days to fill up the census in new york, it seems that the people who are civically, engaged and involved in this seems we get hundreds of emails a day to do the census, we're not the people that need a hundred reminders a day. Somehow that messaging, I don't know it's not well directed in my opinion, but thank you yeah. So is I don't hear any of the discussion items? Is there a motion to adjourn sentences and it is what 7 16 okay so have a good few weeks I'll see you at the general meeting, which is on the second wednesday of October, so happy fall and we'll see you then okay.",
            "summary": "What we do is we have a school year, long program that involves that focuses on wood and boat building, but within the build we're emphasizing social and emotional development and stem skills, development, interpersonal skills, communication, perseverance on the long-term project and all of those all the things that go into any project that begins in October and ends in June, which is a really long project, especially for a young person, and we infuse our what we do with leadership, development and peer learning, as well as part of our programming.\nMy ela teacher recruited me to join the Brooklyn boatworks club, And I thought it sounded interesting like why not build a boat in school So what we did in the beginning of the class or the program was we basically got used to materials and tools and try to get used to getting comfortable with them, especially when we're going to actually build a real wooden boat, and so what we did is one of the activities we did.\nIs there anyone on the committee who wants to ask jasmine about her experience with the Brooklyn boat works, Do, you attend what high school.\nI'm sure, because it sounds like you're, a student leader and Jasmine for presenting first , I was asked if Brooklyn boatworks is exclusively a middle school program.\nDo students pay for the the process or students never pay, but the schools do pay for under half of the program cost and during the summer we work with the girl, scouts and other and community organizations that we either get give a scholarship to And. They pay a small fee or they pay sort.\nI am so thrilled to be with you all today to share a little bit about our work at generation vote and how we are advancing youth voting rights both in new york city and throughout the state, I'm also joined by my colleague and partner in crime, who can introduce herself I've, been with a generation vote for a little while in college and recently earlier this year, I became the organizing director.\nVoter suppression, crisis, advance youth, voting rights in new york and beyond and transform the way young people engage in local politics.\nWe, launched it in the fall of 2017 at binghamton university to basically spread what we call the gen vote model of engagement, which is our training curriculum that supports young people involved in local.\nSo, for example, that looked like trying to arrange rides to inaccessible off-campus poll sites and my friends at cuny at the time trying to navigate the opaque vote, registration resources and requirements for our city-based students, and so a lot of gen.\nI. Remember when I was a student at binghamton waking up at 5am to vote in my very first election, because at the time new york did not have early voting and I had to wake up early and go to the po As a result of all of these challenges that young people were telling us about at generation vote, we decided to roll up our sleeves in our network and get involved in a coalition called.\nSome of you may be familiar with new york vote is the largest statewide coalition fighting for voting rights, and there are a lot of organizations that are based right here in Brooklyn, like the Brooklyn voters, alliance, who are active members of this coalition, and we have been involved.\nNew york state, did a huge overhaul of our election system in 2019 passing laws like early voting, which we just got in the past year, pre-registration of 16 and 17 year, olds, electronic poll books, but we have a long way to go, but even beyond new york, from new hampshire to Florida and wisconsin we've seen young people, especially young voters of color, be forced to jump over immeasurable hurdles to exercise our right to vote and Covid-19 19 has only amplified the impact of these attacks, and some of the headlines here show that, and so this is.\nWe saw that new york state has a lot of work to do, to get out the youth vote and to pass reforms that advance youth voting rights and tear down the barriers that make it hard for young people to exercise their right and so generation vote is the co-chair of the let new york vote, youth working group with citizens union We are paving the way for our youth voting rights movement right here in new york in November of 2019, we developed the first new york youth voting rights platform at the first youth voting rights and engagement summit in albany new york, and we had students from both high schools and colleges across new york, city and new york state come together to vote on this platform.\nSo you can actually learn more about these reforms and why they are so important for young new yorkers Here, you can see things like extending time off to vote to schools, mandating on-campus poll sites, lower the voting age 16 for state and local elections, and I think, I think, is really important in 2020 Showed us this passing a student voter empowerment act for suny and cuny colleges to make sure that our public universities are giving our students the not only the information to register to vote, but how to vote and also investing in civic engagement activities on their college.\nIssue, and I also share information about the let new york vote coalition, because if any of you are interested in joining our youth working group, we have calls monthly and you can contact us directly after this call to be added to our listservs and those calls are open to the public and would love to plug you all in to the coalition just shared this slide about what we've been up to in the terms of the past three months, to show that our network has been busier than ever, especially during this time of mass confusion amongst young people, about how to register, to vote, how to vote safely and how to organize our peers to vote in this upcoming school year.\nFolks in the community, I think we learned a lot this past June about barriers that young people were facing to actually vote in their first presidential primary.\nCurrent public health crisis disrupted schools across new york right before the primary, bringing a lot of our own civic engagement initiatives for a standstill and leaving a lot of young people with limited opportunities to register, to vote and to understand their rights and how to exercise them during a pandemic.\nThat is one of the reasons why we worked so hard to do a bunch of online and virtual educational events to provide as many resources to college campuses and high schools across new york city and new york state to help educators, understand the ever-changing laws during this pandemic of how to vote and make sure that their students are getting the correct information, and we will continue to do so in the lead up to the general election.\nY'all It's been a busy year busy, few months, and so I guess we'll end it with just talking about upcoming gen vote campaigns, Kick it off to ramya to share some of our initiatives that we've been working on since the start of the school year and the end of September end of august and early September, and the lead up to the general election.\nHubs to focus on especially leading up to the election is just providing information and in an accessible form to people who are going to be voters or potential voters, and just community members.\nSo I want to launch a campaign with the hubs where we every weekend have young people sort of tabling where we have just free information for people And, so us being hopefully knowledgeable sources of that information can provide that for people, and they know that somebody is going to be at this geneva table on every saturday at this at the various parks across Brooklyn new york city, wherever we can have And, so that's, I think, a very important starting point for the hubs, because this is a very new campaign that we're doing, and so.\nAnd, so you know, brownie, basically outlined our upcoming gen vote hub program, which again we I would love to have folks involved in this community to help us engage community members outside of our college.\nIf you are able, we not only need folks to get out the vote, but to also protect the vote, and that looks like monitoring poll sites throughout new york city to make sure that guidelines are being followed with PPE, for example, as well as opening on time.\nWe don't want to put too much on principal's plates right, now, it's a very stressful time, but I think like especially considering that we're less than 40 days away from the election, and there are a lot of high schoolers who maybe aren't registered to vote.\nDon't think that's something that we as a committee should even suggest, but if we want to- And, maybe I'm not sure how this would work, Because things are really a little crazy, I, don't see it being an issue asking if, when things get a little bit, maybe more settled We know school has started if the teachers choose to ask, tell their students about the community board and that would have to be all community boards, not just community board too, and that there's an opportunity for them to get involved in civic engagement by going online.\nThen the last thing I wanted to share is that I believe that next month the Brooklyn public library will be presenting I'm, not totally clear whether it's to our committee or the whole community board 2 about the new branch Maybe they're going to be moving into one clinton street soon the Brooklyn heights branch."
        }
    }
}