{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC_-DD7pj1DnRCaO2fN-HDbw",
            "title": "CB 3 Manhattan",
            "publishDate": "2020-05-12",
            "shortDescription": "Meeting Agenda\\n1.    Approval of previous month's minutes\\n2.    Certificate of Appropriateness: 538-540 East 11th Street aka Free Public Baths of the City of New York – removal of blue glazed mosaic tile on entryway walls and ceilings and replacement with hard wood cladding\\n3.    Vote to adjourn",
            "lengthSeconds": "0:33:51"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "wulekhvNcIk",
            "fillerWordCount": {
                "uh": 3,
                "um": 3
            },
            "readTimeFullTranscript": "17 min read",
            "readTimeSummary": "2 min read",
            "wordCountFullTranscript": {
                "tile": 20,
                "facade": 14,
                "screen": 9,
                "minutes": 8,
                "residence": 8,
                "staff": 8,
                "wall": 8,
                "interior": 7,
                "restoration": 6,
                "building": 6
            },
            "wordCountSummary": {
                "facade": 3,
                "staff": 2,
                "level": 2,
                "exterior": 2,
                "wall": 2,
                "ramp": 2,
                "member": 1,
                "vote": 1,
                "agenda": 1,
                "vestibule": 1
            },
            "fullTranscript": "Okay, there you go yep, so welcome everybody to the Landmarks Committee meeting. Thank you for attending Sarah on any other public member who shows up we're going to try to operate in the informal way. We usually do with some discussion among us. If you're, not a committee member, please register your attendance and Sarah. You can test this out now just go to the chat and enter your name and affiliation. Please stay muted! Unless you were speaking just this is just pretty prevent the ambient noise for messing up the meeting. Please raise your hand if you wish to speak. Does everybody know how to raise their hand? I won't go into the details. Okay, after we approved the minutes, the presenters will speak, as always after the presentation committee members will discuss. Public attendees will then have an opportunity to speak and ask questions when you speak. Please state your name at the beginning, so that you'll be on the record and finally we'll formulate and pass the resolution so our agenda for tonight. It's very simple like that's. Why I do not think it's going to go till 10 o'clock? Okay, we're going to do approval of minutes. Obviously we're going to hear this certificate of appropriateness- and we have potentially two speakers say Murdock- is the primary speaker. Mary may have may not marry- is his backup and then we'll create the resolution and vote on that and then we'll vote to adjourn okay, so first I guess I should just leave that agenda right up. There should not I, we can go back and forth to it. If we want to now how do I switch back, Clint I need your help. I want to switch back to see the full screen now just leaving this agenda here in case we want to go back, hope, you're, muted, okay, sorry, so just go up to the top and you stock shares huh. If you hit stop share there, it is great there we go all right. Good, okay and somebody has his hand up already. That's you David yeah I was wondering I. Do not remember seeing the minutes of the last meeting. Nothing that's terribly important, but we're going to be voting on. It was the minutes where there was an informational meeting that we had that time. So there was not a resolution. Okay, yeah I. Remember that, okay, thank you give me. Mine does not need to send out the minutes to people. Now. All right may I have a motion to approve minutes. I move to approve the minutes of the last meeting. Yeah I think that's a kick roll call in this, because otherwise you, if I, can raise my hair right I can do a star nine say yes, Adams, yes, and here Jones. Yes, okay done now. Let's move on to the presentation, so we have certificate of appropriateness and our main presenter is Shay. Murdock Jay. Do you want me to put up your presentation? I can do it it's probably easier. If I do then I can scroll through it. You share. My screen host is able to attend a screen sharing, you're muted, it says: host disabled attendee Xiao hold on one second of okay, I'm, going to I'm going to I'm, unable that here, let's see if I were doing it, I'm not going to okay, so I think you have to make him a host to allow it. There was an option, but it seems like in this meeting set up. They do not have it. So that's all so I'm going to do that. Yes, okay, yep! Actually, because yours, you are the original host Linda just make him yeah, oh no, that's not what I meant to do make the right person co- host! Yes, okay, give it a try, now shake! Okay. Could everyone see my screen? Yes, okay, great so introductions, I'm, Shea, Murdoch, Murdoch's alone, architects. We are the architects for 538 East, 11Th Street, and this is the free public baths of the city of New York. We call it the bathhouse just tour to shorten that title. This was originally built by Arnold Brunner, well-, known New, York architect in the turn of the century, and it was completed in 1905, 1904- 1905 and in 1996 around then it was converted from its previous use to a single- family residence which it is now still to this date. The new owners have undergone renovations and we've. We been- we've worked with staff for most of this, and this just happens to be one item where staff was not comfortable. They felt like it should go to the Commission and therefore-. You know to see B3 as well right, so one of the just-. This is a you know, Italian style, Renaissance facade and we are not we're not touching that facade, so nothing we're doing is on the outside, which is why staff was not sure if they, this should be a Commission level hearing or if they could do it as staff, and ultimately they decided. We should just go ahead and run it through the Commission. So we're not touching the outside of the facade. There is a plan in the future to restore it, but that's to be done as part of a you know: bigger restoration program with the front facade not at this time as part of the Interior and I'm skipping ahead, because well you're all familiar with this building. I assume you've seen it in the neighborhood. It stands out a bit from all of the you know: tenements and Brattain dark brick buildings around it. It's a two- story structure and the ball three stories. If you include the cellar, so what the focus of what we're doing is on the interior of the front facade, so there's a but it is exterior. So it's a vestibule, that's still exterior, but through the threshold of the of the main facade and so we're calling it a it's a vestibule, but it's an exterior vestibule and in when they converted this in the 90s they installed throughout the residents. This blue mosaic tile and the owner feels it's cold and wants to put something warmer, they're more inviting- and we have already in the if you look at G, 101 image, five and image six. So this is the on the second floor of the residence there's, an interior courtyard behind the front facade- and this was already approved at staff level and has been installed as well as a rear garden on this second level, on the exterior, also not visible from any public way where the same application was approved by staff and installed in the rear. So we're about to. We finished with that floor of the residence and we're moving on to rented we're phasing of the residents work for a number of reasons, but we're on now to the main level of the of the residents than the r and the restoration and the renovation of that and we're bringing that same theme of the wormwood down into the interior of the first floor. So this is where it's already been applied on the exterior in the rear and in the interior core. These are just some renderings of what's going to be happening. This is all interior, and this is also all its staff level because it is interior. So the areas that we're here to talk about today are these areas here indicated with the blue lines. These are now that blue tile, so the street is out here. The sidewalk I do not know. If you can see my mouse or not. Yes, we can okay and then there's blue tile along this wall and this wall, and this is a ramp that runs down that was parking in the basement and then there's a small steep ramp for loading things on in the Eastern Gate and the center gauges remains the entrance to the residence so we're proposing to remove this tile or clad over this tile with this with a similar wood that we're using on the interior and this right. So this is the areas that we're talking about. So this is the East facing wall, Interior of the Exterior facade, the West, Wall and then down that ramp- and these are these- are minimally visible from the street. I mean you can see, there's it's North facing, so it's always kind of in shadow. But you know it is visible up close as you walk by. So that's probably why we're going to the Commission the ceiling, so we will not be being clad, we're working with staff. We want to just paint those we want, those back to a limestone, color or something like that, but this wall, the ramp side and that's the ramp going down into the basement, and then this shows these renderings show where we're using it on the interior. So immediately, when you walk in past this you're going to have see this wall, which is the slats of the same material, and in that instance, we are using the same IPE wood on the ceilings and we're just trying to sort of tie the whole design from when you penetrate the four main facade- when you actually experience the rest of the residence on the interior. So this is more generated really from designs that are happening on the inside to tie the whole thing together, and that is pretty much the scope. So you can see the before and after of the front facade scuse me so there it is! That's the area! That's the blue! Tile same areas represented now in the wood, the front facade, you can see, there's no change so really. If I'm walking down the sidewalk fairly close to those I, guess those are like what are they cast iron they're metal gates, they're black steel gates, yeah I'll, go back up to some photos that are a little closer I would see through those gates and I would see. I would now I would see blue tile right now. You would see blue tie. You can see a piece of it here and you can kind of see yeah. You really have to come into the residence to really experience it Wow, no, it's minimally visible, but it was enough visibility that you know. Staff just was not comfortable. Just okay, Danny community members have questions. Please write to hand. If you do see, I do not see any raised hands, though Mitchell and David. You guys have no questions. No, it's more of a comment than a question. I realize that the mosaic tile is not historic and I. Do not know what you have in mind when down the road you're talking about restoring the facade as to whether those exterior spaces beyond the arches will be more visible or less visible. I'm. Assuming that the existing gates are not historic, it seems to me that your expectation of entering a bathhouse and I realize it's now a private residence, but your expectation of entering a bathhouse is closer to seeing tile. When you enter then see this would that it's just a comment yeah and that tile you know, was put in the 90s. It looks like it's from the 90s, you know it's not an old Mosaic like your bath house might have it's not it's not a very pretty tile and you know crankbaits it. It's an aesthetic thing. You know the owner does not like it. They feel like it was. It was somebody trying to replicate a bath house poorly and with a with the tile, which now today, 25 years later, just looks old and dated, and that's it's, but to your first point, the intent and the restoration is really that a restoration so when these gates were put in, they are not original, but they are what was landmark so they're going to be when it was landmarks in 2007. You know we have no intention. There is no intention of removing these gates. Most of the restoration work is going to probably be cleaning and repairing some of the limestone, but nothing no modifications to the facade which would include the gate, so the visibility would not increase beyond what it is now in any restoration. The facade is kind of kind of cool like you have I, do not know if you can point to these tribals better at the top of them on that top a lot where it says three public baths, and these little trident sin there yeah they had a nautical theme on that they did pick up on, is analytical themes in that at the top. Okay, so David did you have any comments or questions. Many members of the public wish to speak. Please raise your hand if you do hello. This is David, I, think I kind of see what Mitch was saying and it would did strike me that anyone know what the original walls were like when it was made, and fortunately now, oh so, but as you said, it's just it's a little bit of a an awakening to see that it's also so modern, and this building does not look that old. That no I mean it sort of may not met. But if you do not know what was there before I do not know what we could say about it, yeah, nothing yeah, so I do not know we can. We can each take our own aesthetic approach to what should be there, but that does should not I guess be limiting to what the owner wants to do. I kind of I mean I was like mature to be able to jarring, but it says we have no historical context to put it into. So what can we say? Yeah I mean it was an odd selection to begin with, honestly, with this design from the 90s, where they put a aluminum, storefront, very modern storefront. You know almost curtain wall system at the at the interior. This is this we're jarring in any of the finish treatments on the side, but there's not much. We can do about that. That's just with all the aluminum yeah. So, although there to be comment, I do not think anything that would change the effect of what you know change anything. It's two words. He owns the building and he's not damaging the front or anything like that. It seems a renovate and in context, so I really can't object too strong. It's what's happening here. Okay, I'm going to go and mood again to other people talk any! Thank you! David! Okay, we have public comment from Sarah. Well, you put in the chat that you're commenting just so we have it's kind of makes the minute since we do not have. We do not have speaker sheets and then you go ahead and speak hi. Yeah I'll do that, so the blue tile was put in the 90s. It was there any kind of like probe to see what was underneath to try and figure out what the I mean I'm, assuming that it would have been stone at that vestibule. You know when you were looking in to the arches and stuff like that, and so the question is, you know. Typically, whenever there's a there's, a new cladding over something Architects are looking underneath to see what's there. So my question is: has any kind of research been done as far as that goes? Shei? I'm! Sorry, can you hear me now? Yes, it's just the it's the party wall Brick, so whatever material was in there before was removed, it's just the brick and it's really not in very good shape, which is why we're going to encapsulate it. We we're not even removing that tile because of for fear of any damage that might happen through that process, but it's just the it's the brick walls you can they're on there on the inside of the residence they're just exposed regular red, brick, okay, so there's so. The interior of this vestibule that was open to the street was clear Rick. It was not no, it may have had another finish on it, but it's not a parent, it's not there anymore from where we did probes this whole. This whole wall is brick, so we did not probe everywhere, but we believe that it's brick behind there all right. All right, that's my question. Okay, anyone else have a question long hand. Okay, we had one letter from the lower Eastside preservation initiative. So I will, if you will kindly give me back, sharing the screen. I will put that out. Yes, okay, great, let's see if I can do this again. Okay, close this one, mm-, hmm I closed the window by mistake. Okay, I'll learn how to do this next time, I'll be a pro one, more thing, while Linda's pulling that up just I know, there's a few more people that have joined since the beginning of the meeting. If you are a guest or a member of the public, if you could go ahead and in the Chat box at the bottom of the screen, if you could just type your name and your affiliation since we do not have a sign- in sheet, that's how we can keep track of it for the meeting minutes and the records. Oh thanks for giving us that. Okay here comes lessees comments. They were brief. They essentially said that Lefty understands the work to consist of the removal of non historic blue tile from within which you're not actually doing right, you're just covering it over and its replacement with IP hardware funding, as this work appears to become confined entirely to non historic portions of the building and will not involve any changes to the historic Street. Facade. Leslie has no objection to the work, as shown in the architectural drawings that it will not change any of the character, defining features of the historic architecture. So that's that that's it any other public comment speak now or forever hold your peace. Susan has her hand up actually higher than the hi everyone thanks, and it may be a moot point now, but when I saw this listed in the meetings, I was most interested as I live two blocks away, so I went by and took photos because I did love the hue of the tiles and I'm involved in a developing community project. Where we had just been talking about tiles for an outdoor community project on Ninth Street would it would take a while, but now as I understand it Shea and in the description that I read online, it was possible. There were two options that it would be removed or covered over and I understand. Now that's already decided that it's going to be covered over I. My interest was in learning about I understand the tile from Mexico. I spoke with someone who knows the former owner and I wanted to know about historical value, so I learned all of that and I know that it's not now, but about the potential for removing it. That was all so I understand it's too dear safety of the of the walls. You can not remove it safely to do its job. Well, we might be able to it's a cost thing. So I guess the question is their interest? I mean you know, I can go. I can certainly discuss it with the oven or, if there's interest in perhaps repurposing, that tile I do not know how well it will come off. But if you, if you want to connect with us separately, I can I can ask her if she would be interested in I'd love to explore that great to another cause yeah, it's a community project, that's just developing and so well. I'll speak with them and I'll reach out to you anyway, and I would love to have that conversation and see if anything can come of it, and you know great thanks any more public comment. Ok, let's move on to the resolution then I drafted, something which we can modify as we as we like back to sharing the screen again. Okay, so first the first sentence is just routine, whereas the free public baths- architect Donald W Bruner, was built in 1904 1905 in the NiO to Italian, Renaissance style used the Indiana limestone on the facade and whereas the designation report published in 2008 makes no mention of the blue mosaic tile, the applicants we replace and whereas the blue Misiek tile was installed around 1980 I think it was 1990. You say with that was a guess on my part: 1990 neat to be able to just edit as we go right into our screens. Yes, can you see it no you're? Actually, it's your windows, explorer' I, think you need to share your other window. Maybe really yeah I thought I did know how to change that. So, if you go to share, it will bring up a couple different options. You can share just the program or your full screen, oh cool, so you can choose your word program or you can share your entire desktop and screen. I just want to share this. Let's see if it comes up better now, is it better yep? That's it! Now you got it okay, so going down to the designation report makes no mention of the blue tile, which I found kind of interesting I. Guess they just were not interested in it, whereas the blue mosaic tile was installed around 1990 and it's not historic, and whereas the proposed hard wood cladding would be minimally visible from the exterior I think that was correct. Just take my parent that agree mark out of there I wish I could see my keyboard. That would be really nice supposed to light up and, of course it does not light up until you hit a key and you can't get a key cause. You do not know what key ok minimally visible from the exterior of the building and where is no alteration to the facade of the building is proposed so therefore be it resolved. Cbt3 has no objection to the project and approves the CFA application. Comments looks good to me. I would David, we say, no objection, it's fine, but you say approval I'm, not 100% sure we can say we do not disapprove I, know Krissy. They say people are jarred by it. I do not know if you want to use the terminology. Approval, okay does not leave it as it is. Okay seem, okay to you shaking me. Yes, thank you. Yes, thank you. So much welcome. So there we are, and yes, we have to actually wrote. We do have to actually vote and we will actually vote. Okay may I have a motion. I move to approve the resolution. I move not to disapprove I'll. Just do a quick poll here, Mitchell I vote. Yes, even I do not disapprove about yes, okay! Yes, that takes care of that. That's why I have to hide my face. May I have a motion to adjourn motion to adjourn everybody that was good. We did not take too long. I did not, let's just be on the line for another hour to make it feel recognized. There's somebody named John. They do not recognize there unless you already put yourself in the chat. Let's see, I see Susan but I do not see John. Who are you huh Yo? Somebody who chooses not to sign in I'll just leave it at that? Okay, we have agreed to Adjourn. So let us adjourn. Thank you very much. The presentation, good luck to you with the Commission. Thank you. A couple of weeks me to approve this before it's official, but I'm, pretty sure nothing will change. Okay. Thank you very much. I'm going to end the meeting and I just have one procedural question raise your hand. Oh you have not after you, I should have gone through, though I still have asked. If everybody knew how you see a button at the bottom that says participants. Yes, you click that and at the bottom of that list, you'll see be raise your hand. Yes, all right. You're welcome. I did not know that either so Thank You, Linda, I sure did I should have gone through it. I thought I could also vote from there-. There's a yes- or- no button as well. I do not see a vote not to disapprove, though I have to speak to Robert's about that when that were not Supremes.",
            "summary": "Thank you for attending Sarah on any other public member who shows up we're going to try to operate in the informal way.\nMary may have may not marry- And, then we'll create the resolution and vote on that Then we'll vote to adjourn okay,, so first I guess I should just leave that agenda right.\n, it's a vestibule, that's still exterior, but through the threshold of the of the main facade and so we're calling it a This is the on the second floor of the residence This was already approved at staff level and has been installed as well as a rear garden on this second level, on the exterior, also not visible from any public way where the same application was approved by staff and installed in the rear.\nSo, this is the East facing wall, Interior of the Exterior facade, the West, Wall and then down These are these- are minimally visible from the street.\nWe want to just paint those we want, those back to a limestone, color or something like that, but this wall, the ramp side And, that's the ramp going down into the basement, and then this shows these renderings show where we're using it on the interior.\nSo The facade is kind of kind of cool like you have I , do not know if you can point to these tribals better at the top of them on that top a lot where it says three public baths, and these little trident sin there Many members of the public, wish to speak.\nOkay, I'm going to go and mood again to other people We have public comment from Sarah.\nThey just were not interested in it, whereas the blue mosaic tile was installed around 1990 and it's not historic, and whereas the proposed hard wood cladding would be minimally visible from the exterior Just."
        }
    }
}