{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "title": "Traffic \\u0026 Transportation September 2020 Committee Meeting",
            "publishDate": "2020-09-17",
            "shortDescription": "",
            "lengthSeconds": "2:42:50"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "WwTHnmXfFhE",
            "fillerWordCount": {
                "uh": 218,
                "um": 472
            },
            "readTimeFullTranscript": "95 min read",
            "readTimeSummary": "13 min read",
            "wordCountFullTranscript": {
                "parking": 73,
                "street": 55,
                "traffic": 53,
                "helmet": 34,
                "drive": 32,
                "project": 32,
                "minutes": 32,
                "intersection": 29,
                "vehicle": 28,
                "safety": 27
            },
            "wordCountSummary": {
                "parking": 20,
                "street": 18,
                "streets": 9,
                "project": 9,
                "intersection": 8,
                "traffic": 8,
                "safety": 7,
                "viaduct": 6,
                "cars": 6,
                "concerns": 5
            },
            "fullTranscript": "Nycdot, better buses and look for 181St Street the draft plan. A first draft plan was presented at the most recent meeting and while it does not get to what hours and days the bus way would be in operation or what hours of the day it did reflect again, a pretty solid first crack and also sort of it seemed mindful of the specific concerns raised through that community Advisory Board, specifically as it related to- and I know for people that have said on this committee. They'll know this specifically as it related to looking at the broader area, because the 181St street can't really be looked at in isolation, because so many people move to the surrounding blocks to get around. Not all our blocks are through blocks. As people know, we have a lot of action on that strip, so they are looking sort of 175 to 182. They are being mindful of street vendor issues raised by the bid they are, although that is a tough nut to crack and they are and sort of acknowledged the issues that the neighborhood has particularly on Friday afternoons. So anyway, if you have not already take a look online at that at that again that first draft I anticipate, but it's not confirmed that DOT will be presenting to this committee on that matter in November. Second CitiBike installation, as most people probably know by now the first half of the CB12 installation has largely happened. So again that goes from the southern part of our southern boundary on CB12 to 184Th Street. It is too soon for real data and I'm saying that because I've asked and but anecdotally it appears that you know bikes are definitely leaving those stations. I think they do have issues of bikes not coming back up the hill, because since we're up high things tend to leave and they do not necessarily come back, but so hopefully there'll be some update from DOT. You know when more data is available. I know we're all you know eager to see that, or I'm certainly eager to see that as a reminder, DOT will be back to us with the second half of the northern section of CB12 in early 2021. So that's from 184th on up. So this is kind of a little bit out of order, but in various fashions we have a few spots in the district that we have been hearing about as relation to speeding or drag racing or unsafe conditions. Generally, one thing: that's sort of been talked about a little bit at this committee is Riverside drive when people are exiting the highway near henshaw. We continue to hear from community members about that. We have. We have somewhat related to that, although not absolutely directly. Writer's alliance is on our agenda for October, with an idea that relates to an alternative to the existing. The way the existing bike lanes are on Dikeman West, Sorry West of Broadway only just because that lane kind of does not go through anymore because of the dining plaza anyway, so they writers alliance will be here in October to talk about a proposal and idea that they have again on that strip. Dot did do some signal timing, adjustments along that strip, but we're still hearing things. Let's talk about a bigger next bigger thing: that's coming up, and I think most of this will lead to later in the in the meeting, but just on the topic of safety and traffic calming and drag racing and excessive speed. There have been three major rex accidents on Amsterdam since may. I think May, June and August were the dates of the big acts and Hi Mary and Yeshiva University led a letter that included signatories from the all sorts of small businesses in the area on that off on that area of Amsterdam as well as electeds, etc. I had them the idea to have them. Maybe you know to basically have them raise it tonight, but have it on the agenda for October. If we can move things along tonight, it does not get too late. I do have it on new business, and then you know we so we'll come back to it in that fashion. Chanel also distributed to the committee the letter that went out with all the signatories, it describes the issue in more detail. As many know, there was a large community forum during the summer about noise complaints of many forms, a lot of community board members were on that on that session, and a group has formed out of that meeting called which I know some of some people on the community board are also involved in about you know a neighborhood group sort of looking to get at this decibel level issue they reached out to this committee about speed, bumps and other tools to address some of the streets related aspects of that and as a reminder, while this committee used to be quite involved with speed humps as they're called about two years ago, D.O.T changed that so members of the community can go right in on their site and make those requests for speed bumps. So people should be aware that group has sort of gone through what their idea recommendations are about that and put those put those requests through DOT, but obviously we should all keep an eye out. They were focused on dikeman between Semen and the highway semen between Dikem and Aisham and Broadway from 190Th to Dikeman. So a lot of stuff sort of surrounding dyckman, but extending in each of the directions next community district needs will be coming up. I just want people to sort of start thinking about it, because we're going to have to leave all of that. You know the ranking will happen in October. I will probably circulate just to you all what we had on last year and some ideas I had about maybe new things so we'll have to get a lot done in that October meeting. So just look out for some communication from me on that sometime in this week, D.O.T moved forward with the implementation of a a project that this that CB12 provided a resolution on saint nicholas between 165 and 170.. I have not been down there, so if anybody maybe wants to tell me about it later, as far as I know that happened, maybe D.O.T can fill us in like two weeks ago or a week ago and remember that was an opportunity both to sort out the intersection at 165Th and St Nicholas, amongst other things, as well as 160,170, in that crazy spot, where saint Nicholas and Broadway Cross, but also add 20s parking spots, just south of 165Th on I'm sorry 168Th on Saint, Nick Seventh. I think I'm up to Riverside viaduct project. That is an ongoing project, as people may know that I think in total a five- year project or has about four years left or some such there is a construction liaison who's in touch with the community around there. You know since well before it started and throughout the project, an issue has emerged with respect to significant vibration, and there is a meeting set up tomorrow between DOT and the community to discuss this issue. Bruce Robertson has kindly agreed to attend that it's mid- day and if anybody else wants to join in on that, I'm sure DOT would welcome anybody and then maybe hit up bruce for the meeting information. Thank you bruce. This is a little bit, maybe more for D.O.T, but just saying we continue to have. No, there is no update on Cabrini street lamps because we still do not have street lights. So, looking forward to hearing what that story is ninth Washington Bridge again, not the George Washington Bridge, the Washington Bridge. You know which you access from 181St in Amsterdam, is going through emergency repairs, and I also attended a presentation on how that was all going to get done, that very busy artery with a very needed emergency repair, and I assume that is on ongoing and will you know take a couple months, so I will have more to say but just sort of a general comment, as was the case, I'm pretty sure. Last September, it's always a long meeting when we come back after the break, and so while sometimes I am happy to have a little latitude about conversations. I will try to be a little stricter than maybe is my average just with the time again. People have two minutes to speak, but one thing that sort of tripped me up by now is that when a committee member a board member, even a member public, commenting have a question. That's pointed at a panelist that- and you know you need to get an answer. We need to have a little more time to accommodate that, so we jim and I are going to experiment or with Jim's help with sort of three minutes when we have that back and forth. But by back and forth again I mean a question and answer that involves the panelists. As usual. Jim would like us everybody to remember that back and forth amongst us is not permitted. If I could just make one tiny invention we're talking about not panelists but presenters. So when a presenter tells this stuff, we are changing, and this is not, and by the way, a year ago, this committee under Nick's chairmanship did exactly the same thing where we loosen the rules a little to see. If we can do it and if it works successfully in our committee, then we can loosen the rules for everyone. So when we have this questioning of presenters you're going to get three minutes for the entire set of questions, so you know and then we'll go on to the next person, and but that's questions and answers, and it's not back and forth and just to reiterate- and you know the whole key of Robert's rules is no back and forth discussions between members because they discovered hundreds of years ago that leads to fights. So that's one of the reasons we do not do it. Thank you very much, debbie all right, thank you, Jim and just for you know stating an intention like we are so fortunate to have the engagement of our community because that's what this is about. It is always amazing to me how many people are like spend time understanding the issues providing feedback following up letting us know what's happening out there at the same time, sometimes or whatever. These are these the tone of how we speak to each other in the current years is challenging, and I know I'm losing some elasticity to respond to that. So I just ask everybody we're not always going to agree but like let's all bring our best selves and and know that I really appreciate everybody who makes time in whatever way that they can to either be at this meeting or get to me in some other way or get to another board member in some other way, and I hope that everybody understands we, you know if ever I'm cutting people off it's just like we got ta. I just want to keep it moving as well, because at a certain point, after very long meetings, you know we start to, I think, lose our ability to be effective and tonight certainly we have some hot topics. So let's just do the best we can with that. Our first up is the D.O.T team again for the new people. Dot presented a project that addressed a few things in one around the area of like 158Th Street from Riverside, just about to broadway a lot of pedestrian safety kind of issues at intersections, but there was also one component of that proposal. That was a little different, and so we passed a resolution supporting the other work, but we- but we took this one bit and said we needed further consideration, because it's a dramatic bit and that's and so D.O.T. This is them coming back for our further consideration of this issue. I think we have kimberly Rancourt, Carissa, Lindstrand and Dan Wagner. Is that right, that's right and I'm going to let Karissa and Dan take over? I just wanted to just that was a great intros. Basically what I was going to say. I was just sad that this this component does have sort of the achieves two or addresses two issues that we've heard a lot about from the community. One is the safety at 158Th, Street and Riverside drive and the other one is the desire for more on street parking, especially in response to the parking loss associated with the viaduct construction. So that's why we, this is sort of an exciting component of the project, but we're curious to hear what the board feels after seeing some more information, some more background and just whether you've had some time to consider this over the summer as well. All right can somebody enable screen share so Chanel, that's Carissa Lindstrom on the who will need the scripture. You should be able to share your screen now. Okay, thanks Janelle, perfect, all right! Let me see. Okay, let me know if the slides do not advance. This has happened before when I go into full screen mode: okay, I'm Karissa Listran, I'm with the pedestrian unit at DOT, and I'm here tonight with Dan and kimberly, my colleagues and we're going to discuss the street conversion on Riverside drive between 158Th Street and Riverside drive west. So just a little background, because I know a few of you are newer to the committee and there may be people from the community that were not on the call in May, so just want to recap a few things first, so this project as a whole Riverside drive from 155 to about 161St Street. We've been talking about it for a year and a half now starting in late 2018, and did you already move it yeah I moved? Is it not working okay, not being in full screen? Sometimes that works better yeah, okay, yeah! Let me I'll just leave it at this, so there have been a number of walk throughs with elected officials as well as community members. Our D.O.T street ambassadors team, as you can see in the photo on the bottom right, has done outreach at 158Th Street talking to people in the community about the intersections along this corridor, and then in may we presented to your committee to talk about the whole project and like what was said before the committee supported the improvements between 155Th Street and 158Th Street, but wanted us to look more at the design and function of the street conversion proposal that we had so just to visualize this. What we're looking at is an aerial, a Riverside drive on the left. We have Riverside drive west and on the right we have Edward Morgan place and the 158Th Street intersection. The area outlined in Blue is the area that was supported when we came to the transportation committee in May. This included the lane reduction to make it feel more like a residential neighborhood, as well as the concrete medians at 157Th Street and the enhanced crossings there and then the area that you see outlined in red is where we're proposing the street conversion and that's where we're asked to look at more design options and so taking a closer look at this intersection, there's been throughout the community engagement process. There have been a number of conversations about how unsafe it feels as a pedestrian walking in this space or as a per someone who is driving through this space, because there are so many different streets, it can be confusing, not knowing which street you're allowed to travel on or not to travel on. When our street ambassador team was on site doing a survey, they asked the question: would you support making a two- way street one way if it could add parking and increase intersection safety and 69 of respondents said? Yes, we also have heard that, because of the viaduct construction, the community is interested in added parking to the neighborhood. So looking a little bit more at the existing conditions of this intersection. As you can see, there are so many different streets that come into this intersection. There are six different ones and typically an intersection is four, and so what this does is. It creates different angles for the intersection which makes longer crossing distances for pedestrians. You can see that in the top right photo, it takes 84 feet to get from the West corner to the median, and then this intersection with it being six legs, creates the unclear movements for vehicles traveling through this space. We're also very aware that the Bx6 and Bx-6 SBS travels southbound on Riverside drive and we'd like to keep the bus traveling along that route and then in the bottom. Right are the vehicle volumes for this intersection, and we've acknowledged that there are low vehicle volumes for the vehicles. Traveling northbound on Riverside drive between 158 and Riverside drive west than there are traveling Southbound. So, just looking a little bit of the last five years of safety data at this intersection, there have been several pedestrian injuries, as well as quite a few motor vehicle occupant crashes. While we do not have all of the details on all of this data, the injuries can point to kind of the safety concerns that we just talked about with it being a confusing intersection for all modes. Okay, so now we're going to talk about the proposal, but before I jump right into our proposal for tonight, I want to show you what we proposed last time, so we can start with that. So on the right side of the screen, you'll see another ariel of Riverside drive. The bottom part shows 158Th Street, where we're proposing the large concrete, curb extension, and then the northern part of the screen shows the intersection partially of Riverside drive west. So in May we had proposed to keep the parking along the West Curb and then also add additional parking along the East curb, which is that retaining wall for the park space there, which would include about 50 new parking spaces. We also proposed the large concrete, curb extension, which would help reduce the crossing distance for pedestrians and then through discussion. There were concerns about space for vehicles to load and unload against the West curve, since that's where the residences are and then because the roadway is a little narrow at times there was concern about the bus being able to travel smoothly through this corridor, and so we're asked to take a look at the design a little bit more, maybe remove some parking in some spaces. Add some loading or unloading along the West Curb. So tonight we we're looking at the same image on the right except along the west curve. We would like to add two no standing any time areas so that vehicles can load and unload or pick up and drop off people, and then that's highlighted in the pink along the West Curb and then along the East curb. We would like to propose spot parking, so we're acknowledging that this is kind of a curvy road, and so the dimensions of the road varies throughout this quarter. So keeping the parking and kind of the northern and southern ends gives more room for the bus to travel through there, and it also we keep some of the parking, which is something that was voiced during the community outreach process, and we also still get to keep the concrete curve extension at the intersection of 158Th Street, and so we can revisit this. But I just want to talk about the benefits of this conversion, so, as you can see in the top right photo, this is the existing condition. If you're a vehicle traveling north on Edward Morgan place, you have five different locations, you can travel. The bottom photo shows that when we remove that northbound movement on Riverside drive, it reduces the number of locations that the vehicle can travel lessening the confusion, but it also provides more visibility for pedestrians by being able to build out that large, concrete, curb extension, it reduces that crossing distance for the pedestrians traveling there, as we saw before getting from the West corner to the median, was 84 feet and that's significantly reduced here. It also adds we can add time to the signal for pedestrians crossing along that north curb because we're removing that northbound movement and then also adding about 26 parking spaces with that spot parking, and so knowing that with the conversion, comes a diversion route. We wanted to talk about kind of how you might be able to get to those residences if you wanted to travel Southbound or if you used this route previously to travel, northbound, say you're going to the George Washington Bridge. There are alternative routes and one example that we would like to walk. You through is the yellow arrow on the image to the right. So if you're at the intersection of Edward Morgan, Place, 158Th, Street and Riverside drive- and you want to go to a residence, that's on Riverside drive, you can no longer go northbound. You can follow the yellow route, which is about 2,400 feet, to kind of loop around to travel Southbound and if you're, a vehicle traveling about 25 miles per hour. It'll take about three to five minutes extra to get to this location than it would have. If you could just take a left previously- and this is not the only option- it really just depends on where you're traveling from and where you're traveling to there are options like Broadway as well as the henry Hudson. You could go along the northern section of Riverside drive as well as for Washington, so we can discuss that a little more, but those are some alternatives. Questions. Thank you, Carissa I'll, just go back to this one, all right. Let me just go through my committee and see yeah. I have a question in an early chart. There was this three- letter abbreviation that had a k in it, and I do not know what that is. Oh, yes, is it this one, the ksi right? Thank you. Yes, so that's killed or severely injured, yeah, not a great acronym, but luckily there have not been any fatalities at this intersection, but we would like to prevent that from happening by making it as safe as we can do, I mean I guess I was hoping for a little more diversion information. I mean, I guess, that's the key one, but well actually I'm not going to formulate a question. Do I have anybody from the from Tnt who has questions about this, and then I have Natalie. You have a raised hand. Was that about the recording issue, or do you want to be in line to comment? That's me joining the queue okay just bear with me. I mean, I guess all right, so I do not have anything from the else from the committee right now, but before we go to Natalie and then I guess, I want to say that to the extent so they sort of see two things here like there is a safety issue, pedestrian safety issues related to the six- legged intersection that is what's is addressed in a here, but that also a big part of this was sort of to address parking concerns raised by the community when they lost 180 spots to the viaduct project. So I will just say that you know I just that's something that you know it sounds like we were trying to address, so I I'll be interested to hear from people that live around there Natalie. Why do not you go ahead and I'm just going to scan to see? I have a lot of raised hands in the oh Chanel. Can you promote Steve Simon? Please Natalie go ahead, yeah hi! This is Natalie from the office of Manhattan borough. President Gail Brewer, just a quick going back into the summary slides where you said that the Community board supported or like the idea. I was not quite sure what that was referring to. If that just meant your general con, you know sense of it or was there a resolution and what date is that referring to so I think you're, referring to this one, where we talk about transportation committees, supported changes. Is that correct? So it was for this section here, the blue, so between about 155Th to 158 it was the May 4th. I believe Transportation Committee presentation that we gave this was supported, but we needed to look a little bit more into the conversion and diversion okay, but you're inferring support just from the discussion, but not because a resolution was issued right, Deborah, correct me. If I'm wrong, no, we did issue a resolution yeah, we did definitely yeah. We passed right. We passed a resolution to capture everything in the blue space and the blue lines, and we moved this. You know what we've just seen the presentation on for the red line. We moved the red line to September right, so this is our further consideration. No, I appreciate that because the so the resolutions are not all posted online, yet as far as I could find. Ah I had one in February, but there was not anything added since so I had that. But thank you. Okay. I mean okay, all right. I have a few raised hands amongst attendees. I do not know what order they have been, so I'm just going to take it for how I see it on my screen. Is there a Lawrence Lee still here and you can go ahead? Oh and bruce you, oh sorry, yeah, I did sorry yeah when you get when you get a chance to. I also have a few questions. Okay, so actually I'm sorry Mr Lee, I'm going to redo what I said Bruce, you wanted to say something yeah in light of the viaduct project starting another project along Riverside drive adjacent to it might be really disruptive to the pedestrian and traffic flow, because the viaduct project is like it's like a war zone over there and it's so I guess the question of the DOT is: when did you and originally you had anticipated starting this like now, but I'm having second thoughts about how much tumult there would be with yet digging up. Riverside drive at the same time and that's basically what I'm asking okay. I definitely understand those concerns. Bruce it's a lot to have a lot of different construction going on. At the same time, we would like to move forward with the concrete. This fall, we're still figuring out a few internal capacity things because of covered, but that we kind of wanted to this meeting happened and see what the discussion is like, but the plan would hopefully be to move forward in about October or so and bruce just to add to that I think that it's definitely a point well taken, but I think that the in the scheme of the length of the viaduct project- this is a very small implementation timeline relative to that, and so, while it might be challenging in the short term, I think that the benefits that it would have would really outweigh that sort of shorter term challenge, because it really these kinds of projects are really only typically a ford. Of course it can say better, but I would say between four to six weeks, maybe a little more I I'll chip in, I think I think you could probably safely say in a few months. This would be finished. Thank you, okay, Steve Simon! Oh I'm, sorry. I keep doing that to you, but I keep. Then I get committee members who want to talk angel. You had something sure yeah, so I am new to the committee, and so, if you could give me just a quick two cents and summary of what the viaduct project is, I live in the neighborhood and I've seen construction, I'm not sure if that's what you're referring to so just wanted to get a little bit of historical piece there and then two. If you could just summarize really quickly, I guess what is the main difference between what was proposed and what is now and what I guess the new proposal. What issue does that new proposal seem to try to solve sure so the viaduct project? If you can see my screen right now, along Riverside drive west, the structure that this road sits on is was kind of in disrepair needed to be fixed, and so it's what I think Deborah was saying it's about a five- year process to kind of restructure that and it's being done in phases, but they're redoing. The structure that the road is on. If that makes sense, yep that's correct and then so we presented this section last time or the whole section, and actually it might be helpful to go to. I think you just slide yeah okay, so this is what we proposed last time. So if you look at these two cross sections so existing it's two- way, you can go north and south and there's parking along the West Curb. And then we had proposed keeping the parking along the west curve and adding parking along the east. But because it's about 30 feet, there were concerns about the bus not being able to get by. If someone was double parked to you know like ups or fedex was dropping off or if someone was getting picked up or dropped off in a taxi or uber, or something and so okay yeah. So we are now coming back to say we can still keep the parking along the West curb. We can extend it a bit to allow for more space. We're also proposing two no standing zones along the West Curb to allow for people like ups and fedex, or people picking up and dropping off to pull in and make those deliveries, but also allow a few sections where we can add some additional parking to alleviate the parking that was displaced by the viaduct work. Great, thank you for clarifying, I think for me. I was not connecting like the Ups fedex type trucks needing a space to stop by. So thank you for that. Thanks Angel, Steve Simon. Finally, this time, I'm not going to cut you off and I have to believe Marieluna wants to say something after you, oh my god. Okay, thank you for putting me before Maria, but by the way angel. I think the point of having that no standing area is not just for fedex and ups. It's for taxi drivers. Anybody who's, dropping people off along that stretch, but I have three questions. The first is, I think it might be helpful if you actually provided the stats on the north and southbound traffic along this section. I was thinking that it that it might make more sense if it's going to be one way for it to go northbound but you're, saying that's. That does not make sense at all the we collected traffic volumes last yeah last year and the northbound movement is significantly lower than the Southbound right, both in the am and the pm. But if you do not have those statistics with you, could you provide them to us afterwards they're in a slide yeah? So we have so we have traffic volumes here and then we also have an appendix slide that I can show you as well. That includes the whole project. Okay! Well, I can't I can't read them on my on my phone, okay yeah. This will be available tomorrow on the DOT website. Okay, all right! So what question number two, the parking that would be provided on the east side is that parallel parking or yes, it would be parallel. Yes, because you know we have guard rails right along that whole stretch of the park, so the people on the passenger side of those vehicles would would not oh, that they're coming. Where are they coming they're coming yeah? So if you look at it so that the people on the driver's side are not going to be able to get out of their cars, so we have so. During the last discussion, we were asked to widen the parking lane along the West Curb, so we could actually reduce this to the standard, which is eight, and that would give three more feet to the parking space along the east so that there's more space to open the car doors. All right, so you'd paint some kind of a line there to indicate that people should not park within three feet of the what we call the embankment. Yes, we would add the parking lines as you see here, okay. Well, I think that's the only way that could work. Okay, be mindful of your three minutes. Okay and my last question is: is it possible that we could consider this to be like a pilot project as during for the duration of the viaduct project and then reevaluate it at that point to see whether or not it it works and should remain in place? Are you referring to just the conversion or the entire project? No, the conversion? Okay, I think the answer is. We do not have to consider it a pilot project. I think in four years you're welcome to come back to us and we'll be happy to re- evaluate and we will. We will be doing analysis as the as the months and years go by on our own anyhow, so we'd be happy to continue to work with you yeah and you do not have to wait four years. Okay, very good! All right! Thank you. Thank you, Debbie. Thank you, Steve Maria. Do you want anything you'd like to say I have a lot to say my dear I'm, sorry, one minute is not going to do it. Two minutes is not going to do it and you know I am trying to. I am trying to stay as cool as I can about the testimony that I have heard from Miss, Lee, Strand and few of the members of this committee. So if you allow me I'll start talking- and I am going to begin with the statistics provider for the accidents happening from 2014 to 20 whatever it is, can you go back to that? You get a screen all right, so from 12:14 to 12:18. In five years there was a total injuries of 40 people, of which severe injuries is three fatalities. Zero and Ksc. God only knows the Kremlin, the Kremlin a system is three. Now I have the bicycles one. In five years, motor vehicles are occupying terrifying, severe injuries, three zero and three. On the other side I just want to. I just want to point out the average of accidents happening. I do not want no one injury to happen in this area, but I just want to point out to all the members of that the number figures that they are providing about this all these accidents that they complain having in my area, okay, I just want to lay that out now, let's go, let's move out to the to the curve going from 158Th Street through 164Th Street. Can we go that to the screen? Please this one? Now? Yes, one of the questions that Simon just asked is about the width of the area from West to Western East on that curve, and he also pointed out right now that there is a a watering structure to keep safety on that area. If you know the area is racks when it rains and it pours racks, come down to that particular area and blocks traffic. Those are right and the trees. What are you going to do about the trees? Are we going to lose trees along the way to accommodate the number six bust to go through without interference with the ups and the Feather Express? Now we all know that the commercial strip on the lower Manhattan, the commercial area, the traffic there is commercial only this particular is residential. We do not have deliveries of ups or feather Express from about maybe seven unless there's something emergency until the following morning. So I do not know what's blocking this traffic is about Federal Express. I know that this plan is to provide parking additional parking to the fancy people who have moved and purchased apartments in this area. Millions of dollar apartment- and you see the literature that they're providing to the people to come to our area, you'll fi. You will find a lot of parking there's, not a lot of parkings you to accommodate rich people coming into our area at the benefit of them at the and the negative of the people who live in by West side of the area, which is where I live. Now I saw some pictures of someone walking since that you did to some people in the community. The only person that I can identify is a baby and Dukkha and Bruce Robertson in those pictures. No one alone: eight three and 835,825 839 845,853 x67, 863,869 alone. Two all the way, all the way to the corner, the red building, where the five famous boss that you want to try to facilitate the transportation. The way they made the term and it took us a lot of time to get them to have a stop there to accommodate the people who come from the overdrive to take the bus number six there all right. So now you are going to block I'm sure some of the area where the people with the steps are to accommodate the fancy angular parking that you intend to do. Not only are you messing up with the with the area without the beauty of our area, to accommodate parking for rich people that are coming to our area, and I hope that the all the elected officials that took you know a copy of this resolution, or this proposal really took a you know very seriously my complaints and the complaints of our area. I saw something saying that they put flies around here. I have not seen a flyer. The only flyer that we see around here is the chinese food that is delivered or the domino pizza nothing was put in any of the building that I will be affected by changing parking in our area on my area, I'm a district leader, I'm also responsible for the well- being of the people who reside on this particular city. Now, let me Maria, we are your army, I'm going to just make it quick. Okay, because I can thank you. I can also speak very fast, but with my accent, I want to make sure that people such as Mr Basket, that does not realize the impact that something like this is going to have in our community and his community if he says that he lives in this area. Now let me go back now to the area where, if I'm coming from downtown, I come from the 150Th street from the henry Hudson parkway. I go all the way up to Broadway to Morgan Place and 158Th Street. I mean Riverside right the fancy area that we have around here and then I go around the 7, the 801 Io7 765,779, to go around the block to go down to the bar and then stop on the light in the corner. It takes more than three minutes take more than three minutes to get there all right now, just you are blocking the area because of the construction of the bioguard, and then you have all the bosses. Your bosses stop three and four one behind the other waiting for their time to start and go back to the bronze to accommodate the people who go to. Maybe Yankee stadium, it takes more than three minutes and if I come in the titan, it's going to add me to about two or three four dollars more from my pocket that I can not afford. Now. Let me go back to buy where this Simon live 765 in the corner. You have to wait for the light and then you come back to the buy a dog and go all the way up to the corner. In order for me to come to my building, which is on 8:35 8,39 Riverside drive, it takes more than three minutes. Okay, wait! A second wait, a second wrap it up. We need to. We understand that everybody wants to talk. We want everybody to hear each other, because we know we Maria. Can I talk? Please Maria! You had more than three minutes already. We listened it's not that we do not want you to get the release and the last time that's right. We did actually we did. Actually. We did because I took the minutes also, so we did listen to what you were saying. So what I'm trying to say is if we want to respect everybody else who has their time and their three minutes. We also have to abide by those three minute rules as well, and if you have something else to say after everyone's done speaking, you may come back at the end and get another three minutes and then after that, if there's nothing else to say then there's nothing else to say at that point, but the three minutes we have to stay within those confines, because everyone gets a lot of those three minutes and we're listening. But this is the way this is the rules we have to follow them. Okay, I just want to make sure that everybody understands that, so when the next person speaks as well does not take as much time thinking hey, I thought it was three minutes, but somebody else took 10., so I should get 10 as well. No, it should be three. Let's stay within, let's stay, concise with what we want to say as well. That's what I'm trying to say right now: okay, so question! I hope you guys come back to me all right. Thanks Maria, so let me just by the way we are now having sorry to interrupt we're now having a discussion. It's only two minutes. It's only for questioning of a speaker. That is three minutes, but this sounds like a discussion and for discussion. We have two minutes. Thank you. I'm going to move to the attendee side now and Mr Lee you're up hi. Can you hear me we can all right great, so I'll try to make a brief. Thank you. So I live at 835 Riverside, which is directly in the path of this, and I've been here for about 10 years plus, so a couple of things I'll just write them off really quickly number one. Thank you for this consideration and I do agree. There are some issues with the traffic flow number. Two. One of my main concerns is the impact to emergency vehicles going in the uptown direction. So, if you're going to cab, it's one thing: fire police ambulance and we do get quite a bit of that traffic, especially in the evenings. I'm just concerned about the extra time that would take so I'm just going to. So. That's point number two point number three about if this has been mentioned, but I am concerned about the parking on the the hill side, because the driver side door etc. I know you can widen the lane, but I am concerned just about the overall width of the travel lane for the bus, etc. It just all seems very tight. The next point I wanted to ask was since the when the viaduct work is complete, we'll get all that parking back. So then I do not understand why we would need to increase net parking overall in the neighborhood. That's a smaller point and then just my final two points. Even with loading zones. You know my observation is people tend to park wherever it's convenient and I am concerned about just sort of backlogs of traffic where people just decide to stop. I later I saw this happen on the upper drive just this evening. There was a backlog of three cars because someone just decided to stop and unload someone, and there was traffic going out almost to the intersection. So I like the idea that the nose standing zone, but I just wonder how would that be enforced, I mean, could we could we get some sort of improved enforcement of that of the traffic flow and then number five? My final comment is: I appreciate all the effort that's gone in here, but given my greatest concern is perhaps that of access of emergency vehicles and timing. I just wonder: could we mark off the parking lane and begin this by simply blocking off the traffic uptown, not adding parking and just converting Riverside this stretch to downtown only so that we can see what the initial impact is before we start adding parked cars and going on with the other items. Thank you. Those were all very great comments, I'm not sure which one are you looking for us to respond to these as we go. I know there were a number of comments and questions from Maria that we did not respond to so I'm just not sure how you want to have yeah. Let's do our best. I mean we're trying to keep to three minutes for the ask and answered. I know we. I lost the thread there so, but let's go back to it. So why do not you just yeah go through as much of Mr Lee's questions at this time as you can, I think the quick answers and I'll let Karissa respond or elaborate if needed. We did review this as we do with all of our plans like this with fdny understand your concerns with that has gone through them. We have spoken with them about the proposal and also just reiterating that the well parking is one of the benefits. The other is the intersection at 158Th, where we really heard a lot of concerns at our walk through and just generally over the over the past two years about safety and comfort at that location, and I think not adding in parking is something we can certainly look at as an option as a phasing option and get back to you on that. Thank you, and were you also going to respond to Maria Luna's points? There were many. I think it would be helpful to have specific questions or comments. I have some notes here, but in general I think we hear the concerns about the detour, some of the other things, I'm not sure, impacts on trees. I think that this is not really changing that aspect. I'm not sure if we could maybe come back if she spoke, speaks again and wants to have some very clear questions that we can answer, I'd be happy to respond to them, but in general we hear the concerns about the diversion, but we do still feel that there is we're responding to community concerns here at that intersection and community requests for parking at this time, Paul D hi. I live on Riverside drive in the area in question and Mr Lee, who is a neighbor of mine, covered many of the topics that I had concerns with. To add to that would be the the concrete barrier that would be blocking the northern access to that portion of the bride the drive initially I mean I almost see that as a safety hazard, where people who are not accustomed to this change are going to drive right up and on it. I've seen trucks knock over the stop light. That's in the island that exists there now and drag it halfway up. Riverside drive, so I think you know, in addition to the concrete Walkway area that you're adding there should be some sort of abutment or some sort of way of keeping people unfamiliar with this new traffic pattern to from driving right up and hitting pedestrians who might be waiting in that area. Number two. If you look to the northern section of Riverside drive where there's parking on both sides of the street, I've observed this area with an Eagle eye view of the street for over 10 years now, and just to be honest with you, people are going to stop where it's convenient. Regardless of these loading zones, which are going to just basically turn into free parking, people will abuse that I have to say, but if they stop in the area, where there's only one lane of traffic between two parked cars to decide, that's going to be the fastest and easiest way you will have a build build- up of several cars and a lot of noise pollution within moments of that occurring and people just won't move their car because they want to unpack their groceries where they want to unpack their groceries, even if it's just a quick uber ride, pickup or drop off so anywhere, where you have double parking on this avenue, it's going to just cause that backup immediately as soon as somebody pulls up to where they want to pull up regardless of loading zones. So those are big concerns. There's a lot of noise with honking horns and anytime, you can't have access to get around a car. That's double parked! It's going to cause an immediate backup, and I just I just see the additional parking as unnecessary. If we're looking to create a greener city, attracting more cars to the area, I think is counter intuitive to an idea of having a greener city down the road, especially if we're getting back the 100 and some odd parking spaces once the viaduct is completed. Thank you. Thank you Paul. I just want to point out in case it's not clear, because it's not it's hard to see in this graphic that, while those there are the two Nsa locations, there's also several other spots where people could pull over not. I still understand what you're saying I'm just making sure that that's clear so up where the hydrants are and where the crosswalks are. So there are not just two places where people could pull over right a bit further north, where there's parking on both sides, people will, regardless of being anybody's, being conscience. Conscious of anybody else's concerns, will literally just stop and go the road and take as much time as they want with no other way of cars getting around those double parked cars. Even though there's further down the street the open areas and those loading zones provided very thoughtfully. I just noticed the habits of what happens in this neighborhood and people stop where they want to stop and they do not really care who beeps and for how long and it gets very noisy very quickly. So when that happens now people are driving to get around them they're driving into the other lane of traffic against traffic. Yes, and sometimes there's a little bit of a you know. I was here first approach to who goes past, but it usually works itself out as long as there's room for cars to maneuver on the upper level. There's one way and it's only one lane, but they have the sidewalk which people utilize. If it's a ups truck, they pull themselves up onto the curb which allows free flow of traffic or somebody decides to park in the middle of the road. People will drive up onto the sidewalk and go and have an opportunity to go around them. Yes, it's not legal, but they do it and it seems to work so anywhere. There's going to be a bottleneck of one lane, only you're going to have people stopping and disregarding other people's timely egress and degress of this all right. That is our time for this particular back and forth. Thank you, Paul! Thank you Kimberly and Carissa Ira Gershenhorn. Sorry, let me make sure you can talk. Okay, go ahead. Hi. Can you hear me yeah just speak up a little bit: okay. First, the Steve yeah you're creating parking spots when the general trend is to reduce them. I guess other speakers have addressed taking away the parking spots when the construction is completed. Does anyone go 25 miles per hour there now and what's to prevent someone from going 40 miles per hour? And why can't you reduce the travel lane to 10 feet and Lawrence Lee had great comments about, because if someone is parallel parking, the travel lane is blocked, so that means no bus, no taxi, no emergency vehicles, just a backup and backups lead to honking. And of course, if you want those other people to get through, they can't so. I have a no standing zone near my apartment. It's always used for free parking. So, okay, I can answer a few of those comments, so the travel lane is typically 11 feet when there is a bus along that corridor. So we'd like to keep that at 11 feet if possible- and I just want to point out that I think Kim mentioned this before that we heard so many comments about how unsafe the intersection of 158Th Street felt from a pedestrian perspective, as well as a motor vehicle perspective when you're driving through there, and so that's what made us look at converting this street from two- way to one- way and that would get us the benefit of the large concrete, curb extension which gives so many pedestrian benefits and the reason we've been looking at the parking along the eastern curb is because we had also heard from a number of people in the area that they wanted additional parking, because the viaduct project is so long, and so we that's. What we're trying to do is accommodate that with these spot parking measures. But if it's, it seems like it's a big concern, so maybe that's something we can discuss more. If that's a phased approach, like I think, Steve Simon mentioned or if we do not do the parking at all bruce working, is it okay to come back to you after I just work through the last of the yes, I actually just have a quick question from what Carissa just said, which is Maria, made a comment about the people who are involved in the feedback for this project over a year and a half ago and Carissa. You said you polled other people in the neighborhood. Do you feel there was a representative sample of others? Besides just Vivian, and I thank you yeah, so the our street ambassadors team was out two days. I believe it was a weekday and a weekend last summer and they spoke to, I believe it was close to a hundred residents and people who work in the neighborhood during that survey period and based on the survey data. It seems like it's well representative of the neighborhood based on the census data. I can look back at the survey to see if there was more comments about additional parking, but the one question we had asked was: would you support making a two- way street one way if it could add parking and increase intersection safety? And that was a yes, but I can look more detailed at that survey to see if there was more specifics about the parking, if that's what you're getting at first, I'm just getting at the question in general because we want to be representative of the community. That's definitely next door to Maria and her block, not just people around the corner, who are not going to be as directly impacted as she is Diego Alexis is next Diego. Are you still in yeah? I'm here sorry, my name is actually christy Maya, I'm a resident of the river arts building at 15900, Riverside drive west and my apartment actually faces the backside, so my apartment faces the street, that's in question about adding the parking and the one- way road. So I also, I would also like to say that I own a car and I pay for a parking spot because of what's going on with the parking situation, so I'm speaking both as a resident of the area and as a driver who drives in this area. So as a driver in this area. I can tell you that if you make this street a one- way street, my grave concern is that the upper portion of Riverside drive, which is a very narrow street, will become an obscenely crazy mess, because people will use that to go from Southbound to northbound to get to Riverside drive in the hospital and all that way, and that's one of my biggest concerns and that's a extremely populated residential area. The streets very narrow people tend to park on the sidewalk itself if they need to pull over, and that's my first comment. My second comment is: I want to echo the other residents that have spoken on here. I think Mr Lee was one of them that talk about how people will just pull over every anywhere. They want not necessarily the space that you're providing for them, and that's absolutely true, I mean, like I said, as a driver driving this area. I can tell you that not only the street Riverside drive is, I think, when I drive that way in the morning, during like rush hour traffic, I ca- I can tell you, there's about three or four cars double parked on the westbound side of that street every single morning, and they are not fedex and they are not ups drivers. They are everyday common people that are unloading, their groceries that are loading their children in to go to school or they are. You know the elderly that are being picked up to go to dry doctor's appointments and they are parked right in front of you know the big apartment building complex because they're right there- and my third and last comment- is this: there is talks and plans of a high rise going on that stream. That is, I think, it's towards the north end of that block, and so this will completely change the face of this box. So I think that also needs to be put into consideration because it looks like it's. It might be happening, which is a detriment to this community in general that a high- rise is being put on a very low residential block, but that's not the place for this conversation, but that should also be considered. So I just want to go on record that I as a resident and a driver. I think this is a terrible idea. That's all right! Thank you, kirstie! Thank you for being here, Jerry Culligan, hello. You are unmuted. Yes, I'm going to echo the point about the building. That's about to be constructed or proposed to be constructed. Part of what they are doing is saying that this is a wide street, because both parts of upper and lower Riverside drive are considered. Riverside drive and D.O.T makes that then a wide street, and if there's construction going on there, it's going to be a total mess. It's at that at the exact spot, where you have the Red zone, the upper Red zone. The second thing is, you talked about the fire. Are you checking with the police about the traffic changing traffic pattern? I would ask you to check with the firehouse who often makes that turn onto Riverside drive to head north when they're on calls. The third thing is upper Riverside drive is a very narrow street. You indicate on your map as if it can be used as a diversion. All you have to do is take a look at the exiting from the hospital at five o'clock four o'clock: five o'clock when that street backs up for three blocks because of people trying to go through a five car light at 165Th Street and that's an impossible route and the same thing will happen when we get through Covid-19 and traffic returns to normal on Riverside drive heading north in emergencies. So I have real questions about you doing this as a permanent thing, and I suggest that Lee's suggestion to try it out as Southbound and see what happens, because I think it's going to cause lots of problems that you have not anticipated. That's the end of my comment. Thanks jerry, I can respond to one quick thing in there. He said we did. We did take it to the fdny. They have already provided us with approval on the proposal. All right, I'm surprised, I'm surprised, do we have. Is it Senator Jackson's office, somebody here from Senator Jackson, my piece hi? This is Dar from Senator Jackson's office hi. My question was mostly to D.O.T. Have you guys considered angled parking on one side only as a mitigation between having both sides parking and only one side parking, so angle parking requires a wider width of the street than we currently have. It would be about 36 feet that we would need and there's about 30, currently, okay, all right, thank you and that's based on which angle on the 45 or the 30. That's on the 45.. Okay. Thank you. I would like I might come back with a question, but I prefer to yield my time right now. Okay, I'm we! It is getting late. We still have a couple more items on the agenda, so I think I'm going to have to sort of cut us off for first for a second round of questions, but I still have Jim Berlin yeah. I have two comments. One of them. Let me just check my notes is in your presentation. You said you asked people, you know what would they think of making a street one way if it increased more traffic? Now I would imagine you asked. Let me just start my own timer. You asked that general question now. Had you asked the more specific question? Would you want that specific streak made one way which, for whatever reason you did not do you might have gotten in fact very different answers? So that's one point now my second point- and this is going to make your DOT hair- stand up on the back of your head, but on a lightly traveled two- way street. Where generally there's no one, you know not that much traffic, the other lane the opposing lane is a de facto diversion. So when there's a ups truck parked in your lane and there's no one coming in the other lane, you go into the other lane and there's a whole other lane and that's how these streets work. The same thing happens on Audubon Avenue, which is a narrow street with all kinds of double parking. People are careful, they actually drive. Slowly can you imagine- and they have to, of course go into the opposite traffic lane, but that's how it works. So I think that's and again, this is not orthodox DOT traffic school thinking, you're never supposed to cross that line unless it's an emergency God forbid, but on real streets here in Washington Heights on Wadsworth, which is narrow and edgecombe, and this street and audubon like I said this happens all the time. It's the only way these streets work and, ironically, which I know totally infuriates your D.O.T mentality, the fact that people have to drive slowly and carefully actually limits accidents and with all these double parked cars cluttering things you can't go fast now. This is the philosophy of congestion actually causing safety, which again is anathema to D.O.T type people. But and again you know there may be some great flaw in what I'm saying, but the reality of this neighborhood and I've lived here for 77 years is that's how these narrow two- way streets work and what you're proposing does not have that quality, because the second someone stops ups truck inconsiderate Creep, you know with their basket of laundry whatever the whole street stops, and that does not happen with the two- way street again because of the reality that we live with up here. Thank you very much, just in response to that. I hear what you're saying I think that does not mean there is not room to kind of rethink, how this behavior happens and how the street can be designed to sort of get around that opposing entering the opposing lane, and also just to reiterate again that it's not the entire that most of the stretch that's proposed here does not have parking on both sides. A lot of the stretch is actually open and allows that kind of passing behavior without any opposing traffic. Just to speak. For the first time, oh okay go ahead, Richard I'll, try to be brief. I came into tonight's meeting really wanting to hear the discussion and not sure what the right outcomes were here are some of my observations from the discussion from looking at the Q&A number of people commented on the negative impact on bicyclists of this project. I have not heard any consideration or response along those lines in response to those concerns or ways of addressing them. Secondly, as people identify themselves tonight, it seems to be a very substantial number of the people who live in close and who are most impacted by this project who are saying whoa. This does not look like it works. Well. Third, we were told that the viaduct project is a motive. Is one of the motivating factors for this project? I'd like to suggest that the viaduct project, though it's going to last a while, is not a permanent project and should not be met with a response of this scope. Fourth, the other thing that I've heard most as a motivator here is more parking. That's inconsistent with everything that this community board has done as long as I've been aware of it doing I had a car for quite a while I would have loved more parking, but that has not been our approach to problems here. I am a little bit concerned with more than a little bit concerned with what's said about the pedestrian problems at the southern end of the project, but I think the approach that is being proposed here is sort of the classic metaphor of taking an elephant gun to shoot a fly, and I end up having trouble seeing why this project should move forward at this time and that there may be some more limited or totally temporary solutions that may be appropriate. Thank you. If I can respond, I think, on the DOT side, it's helpful. It would be helpful for us to kind of get clarification on whether the concerns are about the conversion or the addition of parking, because, as Carissa said, the conversion is really tied into the intersection geometry, and this intersection has been looked at for a long time and we've tried to come up with sort of more simple solutions that do not require a more dramatic change and ultimately to be able to sort of take out one of those legs. It does require something more substantial, but I think we're hearing concerns about this proposal, but it sounds like a lot of that has to do with adding parking and with like constraining the roadway. So I think it would be helpful for us to get an idea if that's like just kind of separate those two concepts a little bit and then, as far as the cyclist, I'm not sure what the I'm not sure where those questions are coming from. Obviously, the 158Th Street two- way bike lane runs through this intersection, and we have heard concerns from cyclists about the safety here, so improving the intersection would certainly benefit them. This is shortening the crossings and the sort of the way traffic moves on the side of the street where the lanes are so if someone wants to speak up and be more specific about what the impact on cyclists is that they're concerned about, that would be helpful as well. All right, I guess my question to the committee is: do you we are ready to have an up or down vote on this, and if so, then somebody needs to motion for it or I just interrupt kimberly. Could you stop some sharing your screen, so we can see one another. Please thank you. So again we can have an upper but down vote tonight or we do not. We do not. You know nothing is requiring us to move. We can you know, I mean I'm open to suggestions. We can go back for sort of more surveying to sort of to sort of capture get at the issue that the questions were asked in sort of generalized and linked ways and to try to get underneath these two, these two threads here about and to sort of separate the parking issue from that intersection. But yeah, so that's it! So I guess I would say I'm not. This is a funky one, like I'm personally comfortable. Seeing us keep this one out here because I feel like or if somebody feels, if you all think we're ready to go up or down vote then so be it, and somebody make a motion Richard allman. What can you say to us? I would move that this issue be tabled to the call of the chair. I second that the committee still has to vote on whether we want to table it and there's one other twist. I want to throw into it since actually before it's very important- and I understand this because I have great sympathy for DOT. I taught physics and there are similarities between traffic and electrons, for example. But anyway you want to reduce the from five legs to four legs that dangerous intersection. Maybe you can kill another leg and not this one and keep the street two way now. I do not know whether that was ever part of your thinking, but that's another little twist we really ought to pursue. Thank you all right. So you know that I am not the person who ever wants to postpone or kick the can. I always want to just say: we've heard enough: let's move on, I just I feel like there were some really interesting things that came up in this longer discussion as it relates to you know whether really yeah there's a lot. That's interesting things that came up. I think yeah like I, for one would like to have some thought about having a having yeah some ability to pers to deal with this in the future, I mean and get feedback in a more detailed way on the places that we need. It bruce and D.O.T. Do a survey of Maria's neighbors on that block just to satisfy their perspective on it all because it's going to affect them directly, in other words, from 158 to 160., I want to play Jim's usual role. Motion to table goes directly to a vote. Okay, so let's do it Mary wait! Sorry, Mary! Do I need to unmute you? What are we voting on? Please emotionally voting on voting to table it or not, and then we can talk about it. Next time, because there are too many things to think about tonight, thank you. Sorry. Can somebody marry yeah? Can you hear me now? I can't okay. So I vote yes, okay, omar! Yes, Jim! Yes, Angel! Yes, Mariella! Yes, Bruce, yes, Richard! Yes, okay and I'll vote. Yes have I missed anybody is robin with us: edith broad dangle votes, no, all right! So sorry, no garage said no. Oh, my god, yeah Gerard, I'm sorry, you doing hi! Sorry, just one more time! Hi! I vote. No! Thank you. Okay, all right! All, right with that, the motion to table has passed. Thank you to the D.O.T team. Can I jump in? I know that at the beginning of this you mentioned saint nicholas 165 to 170. Chris and I would normally step off, but we were also heavily involved in that project and I want to know if we can help in any way before we go yeah before you go. If you could just say, did the ins like? Is that implementation done or is it not quite started? I just did not was not that aware of the dates, but I knew it was happening. It started on August 18th and it's still ongoing. We still have to do some of the painted pedestrian spaces and paint the bike lanes and add some of the delineators for the pet spaces, and do you remember how many total parking spaces at the end of the day that created? Is that like 18 yeah? It's close. I should know this number off the top of my head yeah. It's like 18 to 20.. Okay, all right, I can get you the number, though no thank you for that and then I will follow up with lyle about our street lime lamps issue. But thank you for that, because I would have forgotten about thank you guys and we will. We will talk about sort of next steps here. Thank you very much all right. Okay, thanks everybody! Chanel are you still with us, Carol, Antonez or aunt Tunis was needing to get promoted, I'm here hi. How are you? Oh, you are up. You are okay, great! I am just going to give the floor to you great. Thank you so much for giving us the time today, I'm here today with our CEO Frank ray. We we're going to try to go through our presentation fairly quickly. Just so we can open up the floor for questions. We do have a heart stop at nine. We had to shuffle some things around, but really happy to delve in now, so I'm just going to share myself Carol real quickly. What's your role with Revel right yeah, I am the community affairs manager at Revel. Thank you yeah! Absolutely. I think I have the ability to share my screen now. So I'm going to do that. Okay, great perfect, thanks, Carol hi, everybody like she mentioned Frank Reek, here CEO and co- founder of Revel. Just thanks for taking the time here, I'm going to try and go through this pretty quickly because I'd imagine there's going to be questions and it's already getting pretty late. Just for some quick background. You know I'm a native New yorker born and raised here spent first 18 years of my life on Staten island. I've spent the last close to 20 in Brooklyn, and I started Revel mostly because I was kind of fed up with trying to get around this city. You know, especially when you live in the outer boroughs, like I did in Brooklyn. You know, every subway is basically built to do one thing to get you into Manhattan, but if you want to do any other trip sort of good luck, so that was really the genesis of Revel back in 2018 we did a small pilot of close to 100 vehicles in the summer of 2018. We then expanded to a considerable area in Brooklyn and Queens in 2019, with over a thousand vehicles, and earlier this year in March, we expanded throughout Manhattan and the south Bronx during sort of the height of Covid-19, where we worked with Corey Johnson, the speaker, the D.O.T, to basically offer free rides to health care workers. So just for some background there. The fleet now is about 3000 vehicles. We've done about 12 million miles in New, York City as a system, and I'm sure some of you saw the oh carol, I'm just giving some background here. You have to go through the slides. I have done about 12 million miles in the city right now and I'm sure many of you saw sort of the press. You know in a short period of time we had several serious crashes that required us to. You know what let's suspend our service right now, let's take a step back, let's regroup, let's reset think about certain safety enhancements safety features and we worked with city. Hall worked with NYPD worked with elected officials, worked with the D.O.T commissioner to get signed off for our relaunch about three weeks ago, so Carol maybe start at the first slide. I just wanted to give sort of a little bit of background here, so I'm sure folks have seen rebel. You know street legal vehicle with a license plate rides and parks in the street fully electric. I think one of the great things as well, especially any community that cherishes parking spaces parks, 90 degrees to the curb you know- does not take up too much space in the community Carol from day one from 2018. When I launched this company bootstrapped it never use gig economy. Never will I have do not even want to touch it, so every mechanic, every battery, swapper that you see out in the field every field, tech, every customer support agent. They literally have the same health insurance that I do as CEO. Sorry about that. I also live acrosss the street from a fire station Carol, something else we've had since 2018 is an access program, so we have over 2500 folks signed up for that. It's basically about 200 thousand dollars that we've basically given the community because they get 40 off every single ride. So anyone on local state or federal public assistance, so I could be medicaid that could be somebody who's in Nitra housing. We're pretty liberal with that designation carol. This just kind of shows you so you know graphically sort of the growth may of 2019. That was basically the end of our year- long pilot from 2018 sort of expanded throughout Brooklyn and Queens over a thousand mopeds, and then here we are call it June, 2020 or even as of today, September 14th really expanded throughout Manhattan throughout the Bronx and even more broken and Queens. As I mentioned about 12 million miles now and close to 4 million rides, this goes back to what I was mentioning before. Working with Corey Johnson, the speaker working with the D.O.T coming into Manhattan, and the Bronx that was sort of at the height of cobit free rides for all health care workers. Here carol this sort of gets into the meat here of, as we worked with commissioner trottenberg as we worked with the mayor's office as we worked with NYPD, we had two issues and I think one of the things that happened was you know coming out of Covid-19 call it from April. Through July, we signed up over 200,000 new users in New York City, to bring our total to over 350,000 users, but I think hundreds of thousands of people in a very short period of time were looking for a way to get around the city that was safe way to social distance while getting around and frankly just had a lot of fun, especially maybe after being cooped up in their apartment for 10- 12 weeks. Two things we noticed, though one of them was we've been operating this city for over two years and starting in May the amount of folks not wearing a helmet increased significantly so sort of helmet compliance was an issue. So what we did was over the last month, as we worked with the DOT and city hall, every single time you ride now and you'll see it out in the street. If you see someone renting a rebel, when you hit start ride now, you used to just turn on you're supposed to open up the helmet case. Put a helmet on and you're off problem was not enough. People are putting the helmet on a lot of people were not putting the helmet on so now. Every single time you ride. When you hit start ride a helmet case opens the moped does not turn on. You, then have to put the helmet on. You do not have to take a selfie, prove it to us that you're wearing that helmet. We check every single picture and then you're able to turn that vehicle on so basically totally separating helmet use from turning on the vehicle and just from what I've seen talking to D.O.T the last three weeks of in our relaunch my employees, myself, the amount of helmet usage has exponentially increased, which is exactly what we wanted to see. If there's a passenger, you also have to take a second selfie and if, for some reason, you think it's funny to take a picture of your foot or not wearing a helmet guess what you're suspended. So I'd recommend not doing that, and I think people are realizing that we do take it seriously and we check every single photo here, Carol and then outside of helmet use. The other thing that we realized, and one of the reasons why I'm at this community board meeting today is certain neighborhoods like Inwood, for whatever reason from you know may through July there was an increase in rider behavior. That was unacceptable. You know I saw it. Community saw it and we needed to attack that head- on so we ended up doing was working with D.O.T. We basically developed a safety training, so all 360,000 users when we relaunched three weeks ago, they were not allowed to ride again until they took the safety training. So it's 42 questions long. It's pretty significant you're talking 15:20 minutes. You also have to watch a tutorial video, which is another couple of minutes, and the safety training goes into all the things you need to realize. This is not an e- bike. This is not a regular bike, not that you should be running red lights, on an e- bike or a regular bike either, but that's another story, but this is a motor vehicle. It needs to be treated with a certain amount of respect and you need to understand the rules so really making people go deep into that safety. Training, 42 questions understand the vehicle they're getting on and I think that's done a really good job. The last three weeks since we've relaunched our fleet of 3000 vehicles, I think the amount of rider behavior that I would say is unacceptable. I mean tell me if I'm wrong, but I think it's decreased in a really good way, which is exactly what we needed to see with the relaunch some other safety initiatives that we built over the last month that we had shut ourselves down and worked with D.O.T with increased lessons capacity. We now have lessons in Ford Boroughs. You know Brooklyn Manhattan, Bronx Queens. I used to just be at our headquarters in Brooklyn. So that's a lesson you could book right through the app seven days a week. You know eight hours a day. These things are staffed, so we're given a lot of lessons every day, which is great something else that we've done is I'll talk about community reporting on the next tool, because I do not think it's here, but also automatic alerts. So my team of data scientists and engineers on the back end with this relaunch. Now we took data from New York, City DOT on every single one- way street and we've built the infrastructure around those alerts. So, since we have a GPS in every vehicle and we have the back end data from DOT on every one- way, street we've been able to marry those two. So if you think it's the right thing to do to ride down a one- way street the opposite way for three or four blocks, guess what now we know exactly what happened and it's all automated and you're suspended. So we've taken a pretty cutthroat approach to that, so it's one- way streets and also green space. So I know, parks and Inwood were an issue back in June and July with this relaunch. Anyone going to a park now is just suspended, we'll not be using rebel. So we've all that is automated. Now, there's no manual review. We know the GPS, we know where the parks are. We know where the one- way streets are, and we've suspended a lot of users and I'm okay with it. If you can't ride this vehicle the right way, we do not want you riding and I'm sure this community board does not want you writing either. There's a bunch of other things too, but just for timed cow and then in- app community reporting too. I think it's important for this group just to know that exists. We get probably several dozen a day, if not even maybe 100 a day of just reports from the community, it could be a bad parking job and you do not need to be a registered user. You do not need to have paid us a sign up fee. All you need to do is download the app you can also do it through our website. If you do not have a smartphone or you want to use a computer or desktop, you do not need to be a user, though you have access to that community reporting tool, the ability to upload a picture. Let us know the license plate if you have it. If not, that's fine, just tell us the time, the date, the address, what you saw and we take a lot of action that way as well any sort of reckless behavior things that are going on, and you know probably another thing. That's relevant for this group as well is with this relaunch with the sort of sign off from D.O.T and City hall. We are shutting the service down between midnight and 5 am so that's been the case the last three weeks during this relaunch, so you can't rent a rebel during those times. I think that might be a carol unless I'm missing something okay, so I will pause there and happy to take any questions and sorry about the noise in the background here. Thank you for that. I'm just looking through we're going to start with Gerard Dingle right. Thank you. I'm going to note my two minutes because I do not want to go over good evening. I had a couple questions for Revel and Steve Simon. Are you still on the call Steve? Well, I was hoping Steve would be on because some of my questions relate to that. Possibly Steve's committee should have been or should be part of monitoring the rebel experience. You know my thoughts. Are the helmet exposure glad to hear that Revel requires you to use their helmet, but I look at these this Revel as a super Covid-19 spreader. What's the mitigation we've heaped tremendous restrictions on our businesses throughout Washington, Heights and Inwood? We have tremendous restrictions for them to clean disinfect before, during and after people sit at their restaurants with social distancing, we have literally people getting on Covid-19 spreaders like Revel, putting helmets on there's issues of. What's when is it being cleaned? When is it being disinfected and other things that go along with health issues related to sharing a helmet? There's all other kinds of things that should be considered. The touch services are not being cleaned and disinfected like it's required to be in other areas, liability limits, Revel was a scourge in our community in England. I'm glad Frank that you noted all summer the things that were happening, but it took debts for rebel to finally do something, but you knew all summer long that it was tormenting communities like Inward, Washington Heights, who were being chased down blocks and streets sidewalks by people on rebel. But I'm glad you finally did something about it and suspensions at what point is someone banned after they keep doing things on rebels? So those are a couple of questions, I'm very interested to hear about the Covid-19 concerns that I'm addressing they're in place in every business except Revel. So what's happening so I mean just to give you the idea when we expanded with free rides for health care workers back in March over 3000 doctors and nurses signed up for that program because they realize it's a lot safer social distance, you're alone on a vehicle riding somewhere. Then it is a bus or a subway or anyplace else, where you're going to be with other folks. So I think, in terms of being a Covid-19 spreader, I'm going to have to politely disagree a bit in terms of the helmet use every single time we battery swap vehicle, which in Manhattan is literally every single day, because the demand is so high. They get 10 plus rides a day in Manhattan. So every single day that vehicle is battery swapped. This goes back to. We do not use gig economy right. Every single employee is trained by me. Actually cares about. The company cares about the vehicle. The reason why I bring that up is as Covid-19 happened since they're my employees, I'm able to train them and change procedure very quickly, whereas many other companies can't do that they're in sort of my space of shared mobility, where you do not actually have any touch point with the employee, because they're not an employee, so every single time we battery swap those helmets are cleaned. All the touch points on the vehicle are lysoled. It's just part of the process of how we run the company, so that vehicle is constantly being cleaned. We also have the ability if, at the end of the day, you want your own helmet, that's fine! You can buy one right through the app at cost. I do not make any money off that you can get it for about 30 of what you would buy at a motorcycle shop or a moped shop, and then, of course, you can also just use your own helmet if you have one. So I think you know nothing is perfect in this world that we're in, but I think was that a timer for me. Yes, it was okay. This is a three- minute window. You can conclude the answers to the questions Frank. Can I just tell gerard that I'm still on the call yeah. I do not think some of my questions were even really answered, but Steve. Maybe you could take that up in health. You know there's definitely issues of cleanliness once every one sort of battery pops out and it's used ten times. That's not all the time someone's writing that ten times different people once okay, all right all right we're going to. I think we're going to have to stop there, but on that back and forth. Sorry, let me just see who's up next Sally next yeah, I'm just okay. So nobody else from Tnt, yeah, okay, Sally. I think Deborah. Just to the other question that you mentioned around suspensions. Every sort of violation has its own suspension policy and we're very transparent about it. Now it's right in the app it's on our website. You see all the policies so take helmets, for instance, if you're the person who takes a photo of their foot thinking, you know rebel's never going to check this photo. I'm not wearing this helmet, no one's going to tell me to wear a helmet okay. Well, we do check that immediately and then you're suspended for seven days as a temporary suspension. Once that happens, we send you an email. We send you an in-, app notification you're suspended. This is why it's for seven days, if, for whatever reason, you think it's a good idea to do that again, the next time you ride, you are forever banned from rebel. You will not ride ever again right. So that's just an example of like one suspension policy that we have for a violation- and you know for things like riding up a one- way street for five or six blocks. There is no warning. You decided to go. Upstate blocks one way, the wrong way: you're just gone forever, so drought, it depends on the violation, sometimes they're, temporary, sometimes a warning. Sometimes it's permanent off the bat. Can you just frank for the record and the recording? Can you just what's the url, so people can review that if they're interested the violation, yep Carol, do you have it or maybe you can message everyone or just start like yeah type it in and we'll yeah our website is, go revel.com. If you go to go revel.com, it kind of. Brings you to everything, great sally, I'm mute, I'm you sally! Sorry! Do I need to wait we're going to come right back to Sally Natalie, hey, I'm unmuted, but now we can go first. I do not. My questions are really clarification. First, regarding the helmet, is it a smart helmet or can I in fact unlock the helmet? Take a picture of me with the helmet on and then put the helmet back? You could in fact, do that sally, okay. Well, why would you this is my question? There's a new player on the block which is wheels. I do not know if they're in New York yet, but they actually have a smart, integrated helmet system that can detect their sensors can detect whether the helmet is being used, and when it's returned, I do not think it's efficient and they actually in the write up on their smart integrated. I can send that to you. I mean telling someone that they are required to take a picture, and that equates to helmet use. It does not like telling someone to you know. I just do not understand. I do not understand any technology, that's out there, that is for a vehicle that would not require helmet use and would not use technology to ensure helmet use. It's like renting cars without seat belts. It makes no sense. So we've clarified it. It's not smart integrated, it's basically taking a picture. Second, in terms of things like riding the wrong wind, a one- way street going in parks going on acrosss bridges, etc. That's also a violation which you should have zero tolerance, for. I do not know what a suspension would be, but I guess my recommendation would be guess what, next time you turn off your bike, it's right over. You can't turn it on and you're suspended for life. These are sally, run the same page highways parks one- way streets. That's it you're done. How long are you done for life? Yeah you're done? Okay, that's not when these things were communicated and depressed after you made. These quote: unquote changes that was not what was communicated. I think the only to get really to get really specific. It's not a suspension so to get really specific here. Something like a highway done like there is no there's no gray area you're on a highway like you, never ride rebel again, something like a one- way street sally. The way we've set this up because we're using GPS. That is not perfect at the end of the day and everything is automated. On the back end, so I mean you can read the suspension values yourself around the website, but there's a certain mileage where I think it's like 0.1 miles where I guess you could technically go. One block up a one- way, the wrong way because there's a margin of error here I can't be suspending a whole bunch of people when they did not actually do that. It's the GPS ping, it's Midtown, it's just it's not perfect. So there are mileage markers that we have set up for both park riding and one- way streets. Where once you reach a certain mileage like we have 90 percent of surety that, like no that's, not a GPS error like you're done right and it's all in the suspension policy. What those mileage markers are it's pretty small, it's really just to make sure there's no error with the GPS. My concern is with the parks. So how long are you done for us? Is there suspended for life once you once you can ensure that it is running we're at the three minutes, so we can't the answer. Sally is yes, you are you just need to reach a certain mileage marker so that I know it's not actually just error and you're just traveling down central Park West and it's pinging in the park. So I'm saying just the suspension policy is. There is very public, it's all laid out and if you ride in a park and you're just doing donuts and riding around, I can tell you right now: you were suspended for life. Let me just jump in with two and carol two questions, and I know you guys are turning into pumpkins and you've been with us for a while how many lifetime suspensions are you up to, and I'm also curious. So when you did the restart and everybody had to do the 42 question quiz and all that stuff so of the like 300,000 people that were on pause when you guys were taking your pause, how many have what percentage of that 300,000 have come back and taken the test? So a lot have not deborah and I'm okay with that. I think we're at like 65,000 right now, 70,000 around there so literally, like one quarter of my users have come back, but clearly, I think the last three weeks. The reason why our relaunch has been successful is that you know it's the right users that have come back taking this seriously. Taking that 42 question safety training watching the video taking the helmet selfie, so I think you know I've lost a lot of users, but I'm okay with it because we're a better company and a better service for it. So as people come on, what is your lifetime suspension number at this point? It's definitely thousands yeah, okay, Natalie hi yeah. Thank you! Debbie! Really quickly. When you were introducing your presentation there, you said you made reference to getting a sign off for the relaunch from elected officials. I'd like to know who you were referring to so the Department of Transportation Commissioner Trottenberg. She does. She sent us a letter after quarterbacking with the different agencies, whether it's the transportation Council of the city, the city Council, the mayor's office, and I was on many calls with them over that month. All sorts of elected officials, the mayor's office D.O.T basically every day, so we basically got a written letter signed by commissioner trottenberg, saying we approve of the safety enhancements you're, making we're looking forward to working together and you're approved to relaunch on the streets of New York. So that's a that's a letter from the commissioner of the D.O.T. After working with all the different well I'd say I just wanted to clarify the elected official whose support you got signed off on was the mayor. So let me put this as there's always politics here, but I'll say the commissioner of the DOT is not going to sign a letter approving of our relaunch without approvals from certain people, but just to ask that we have been working closely with City Council members in all four boroughs who we consulted. So I guess relevant to the support community board 12. We did speak with Dennis Rodriguez and we also met with congressman Espaiad. So they were aware of what our plans were for relaunch. Thank you I'm going to just if you'll give us just maybe eight more minutes. I've got a few people and from the public, I'm actually going to start with Allegra Legrand. Oh sorry, Allegra I need to on okay. You can talk. Now can y' all hear me yep, okay, super! So I have a few questions. I'm just going to read them off. So if you make a complaint via the rebel app or website you're, not a user does rebel, collect any of your data, and what does it use that data? For my second question following up from Sally, is: why do not you have a camera on Revel that can operate when it's in motion to identify? If someone has their helmet on or not, it could also be a double for whether or not rebels are parked on the sidewalk third, so there was some drag racing of scooters and mopeds. Do you monitor a jerk or changes in acceleration to make sure that people are not doing that kind of thing? Third, you just mentioned. Uncertainty with GPS do not also use Gsm. Fourth, when someone does a violation going the wrong way up a one- way street that should have points being put on their driver's license. So are you communicating those violations to D.O.T this? Why do not? Why do not you make the training mandatory instead or having a motorcycle license mandatory? Why is it only optional? And finally, why did you try to set up in a residential zone, you're training and not in a commercial zone in Park Terrace? Thank you. I did not have a pen or paper, so you might have to remind me of some of the questions. So let me maybe work back to front so the first one was around where we set up lessons so Allegra. I think the biggest thing that we look for when we set up lessons is subway access, so that people can actually get to the lessons, location and someplace quiet where there's not a lot of traffic motor vehicle traffic, because clearly we're going to be giving some lessons and you're not going to want a lot of vehicles around like a commercial district. I think you mentioned so. I know there was some feedback from the community around our lessons location in wood Carol. I think you can speak to that because I think we took that feedback and then immediately changed the location. So we got the feedback and within two hours we had shut down the lessons and moved the location and we actually reached out and tried to coordinate the a better location so that we have a new location for Inwood and Washington Heights people that it's really just like in a very quiet area, there's really no residence on either side and we were just trying to find the best place that would satisfy the community, but also users, so they're, not so far out of the way that they're, really, you know discouraged to take the lesson, because the point is we want them to go to the lesson it's an hour. They get some amazing experience on how to ride and we really want people to take advantage of. It is totally free and available to the public, and we noticed that as soon as we had lessons available in Inwood like sign, ups were incredible and we want to continue to do lessons. What's the new location, give me one. Second I'll pull up the exact it's near 9Th, Avenue right it's on. Let's keep it moving, we're not going to get all legroos questions in three minutes, so I think they're just sort of right run through the drag racing. The gss motorcycle license sure on your driver's license for moving violations going wrong way. I got it allegra just to be clear. This is not an e- bike. Right, there's a there's a license plate. Everyone has a driver's license. So if there's any sort of moving violation, there can be traffic enforcement, a police officer can pull them over, give them a ticket just like they would do anybody else, driving any sort of other motor vehicle and also anyone that goes through a red light camera or things like that. We absolutely bill that person back. They pay that ticket. You know it's not like they're getting out of that ticket. So these are things we definitely do and it all goes back to having a license plate and we're able to track that sort of information. I think also because rebel has contacts at basically, every single police department in the city that we operate in police officers are basically trained. Now that we've been operating three years where, when they do pull someone over, they actually give us a call- and let us know so that we know so we do suspend users when those police officers call absolutely, but you do not pass on information about users going the wrong way to the police or D.O.T. No, we do not, but they would be suspended according to our suspension policy, so you know they're just not out on the platform anymore. Okay, I know I think you also had a comment around. Is there another trigger, for you know like riding recklessly or just like, going up and down a block. The answer is absolutely yes. There is, we call it the you know, sort of just the squiggly line, alert which is basically like when a GPS trail is just makes no sense, and it's just going back and forth around the street. That's also an alert on our back end and they're permanently suspended. So that's something we've implemented and has gone out with this relaunch, so all those folks that cause havoc. They think that's how you ride a vehicle anywhere in the city. Well, they're in for a rude awakening, because when they shut that vehicle off they never write again, and I think that's just helped behavior everywhere. Once you get those users off the platform, I think everything has been helped a lot. Can you just I'm and then I'm just going to ask if we could connect Allegro, perhaps with Carol, to pass the remainder of the questions, but just a quick on the other, not the GPS, the other thing electric. So what was your question around GPS sorry, ways to triangulate? Where you are, can you use? You said GPS and I said Dps? Why not Gsm2? Because inside of a dense city like New York, as you notice, GPS is not the best solution, I'll be honest with you allegra. I do not know what Gsm2 is so I'm just going to dsm. You do not know what second one we're going to get you connected outside of this, because we're like double the amount of time for that I'm going to take Ira Gershon Horn, and I see you Steve, you want you have something after Ira and the center's office, hello, okay, this is softball. I've heard commented, the color of the scooters makes them invisible to other vehicles, would a day glow, color be better and maybe they're too quiet. That's my only questions. Well, one of the things about them being quiet. You know they're pure electric, so I think that's great for the community right. I think everyone here in this call has experienced a motorcycle or just a loud car. I think there's nothing worse in your community. One thing that the rebel does do is it makes a tick- tock noise when you have the blinker on so as you're coming into an intersection, anyone that's written a rebel or seen in the neighborhood. You hear that tick- tock, so it just makes pedestrians aware at intersections that the vehicle is coming and then the other part of your question. Ira, I'm sorry, the the color of the scooters might be invisible to other vehicles, whether they glow or you limited by the city and having them black and blue. So that was feedback that we received actually last year from the Department of transportation. So we ended up. Doing was when we increased the fleet this year to 3000 vehicles. Every new vehicle is bright blue. So I do not know if you've seen the two different vehicles I wrote, one is bright: blue one is a little darker. I just seen black and blue okay you'll see one eventually because they're definitely out there, there's probably more of those than the other ones. Now. So that's the new color scheme now because of feedback. You know six twelve months ago. Thank you thanks and Dara from Senator Jackson's office. So hi everybody welcome frank to the community. Virtually my question is we heard feedback from constituents that some people are sharing their accounts? So I'm assuming, since you already did that half step of doing a selfie at the beginning of the ride, does it do photo matching to the license or is just the good will of the user. So one thing that we do and we've fixed a lot of this now because, frankly, as we've gone into new neighborhoods starting in March, you know account sharing and some fraud issues became an issue that we never experienced in 2018 or 2019.. So we took a couple of actions now, both right before we suspend our own service and now going into this relaunch a few of them are a dollar pre- authorization charge for every single ride, so some companies will do that. It really reduces fraud, and when you talk about payment fraud, you're talking about all sorts of other fraud, so just doing a dollar pre- authorization charge for every single ride. That has helped a lot two- factor. Authentication we rolled out in July before we suspended our service that helped tremendously two factor for those that do not know is you know you sign in with your username and password onto a phone and then, if you're signing in onto a different phone now we send you an sms message to your old phone that you originally signed in on. So if you are account sharing you're, giving someone your username and password you're also going to need to coordinate with that person now an sms message, but that reduced a lot and then something that we're using technology for on the back end, that's been pretty awesome. Recently. Sorry technology in the back end is essentially you can imagine okay, you know I'm Joe, I let you know Steve Hop, on the rebel and I you know hit start ride and he goes off and now his friend who he just let ride on his account, drives somewhere. You know he goes two miles goes to his house or something parks, the rebel he calls his friend and says: hey end the ride. His friend ends the ride. Guess what now? On our back end, we have a phone and a Revel that are two miles apart right. So now all those accounts are being flagged. We then check the helmet selfie with the you know, so we've gotten a lot of account sharing out that way, just in the last couple weeks. So I think you know it's been an iterative process, just everything with Revel. You know a fleet of 3000 vehicles in a major city. You've definitely had some learnings this year, but I think account sharing we've really gotten under control in a good way. So you do not think that people, let's say siblings, and that's one case- that I've heard about and they're two constituents did it and they got caught for different reasons by the police. Is that two siblings one had a suspended license? The other one did not so the one that had a suspended license said hey. You know what let me jump on the rebel I just I could. I can use your license and the phone and it's a stupid phone that use like a cheap one to just do that. The only reason it got caught is because the police department would stop one of them for a different reason, not for the rebel, so I'm just bringing it up to you so you're, aware of it yep. I do not know. I appreciate it, but some of the bad behavior comes from people that are not the legitimate user, but you know how people love sharing stuff yep and then, when those brothers they end their ride. You know a mile away from their phone they're he's going to be permanently suspended and that's a shame for both of them. I think one other thing it's a little more nuanced, but the safety training that we push everybody through now before we ever ride again, because I think there's an element here of not people trying to be bad people. It's not people. Trying to you know there is an element of just maybe culturally moped. So that's fine! You know you can use my account and they're not trying to be a bad person. They just needed some education so as part of the safety training. Now, there's like four questions around account, sharing making sure people understand when they go through this training. How serious this is, how much reliability they take on letting someone use their accounts and God forbid. Something happens. I think you know all of these are being attacked with technology things on the payment side, as well as just straight up education. Thank you for me. Thank you and just just to close us out. Steve did you have Simon? Did you have something you wanted to say yeah? If I might? First of all, I just want to say I'm I'm for the most part very impressed with the the attitude that Frank is showing in the seriousness he's taking and the real the recognition that that he understands that he has problems that he has to address in a second, I want to say that I'm glad to learn that the bikes have been moved from Park Terrace East to 9Th Avenue. I believe that's what I heard. I do not believe it was appropriate for them to be parked right outside Aisham park in the interest of full disclosure. I should let you know I work for the parks Department, so it's a problem, I think, to have a commercial outlet parked permanently or on a long- term basis, alongside on with tantamount to parks property. My question is how many employees do you have who are checking the selfies and checking the the other items that you've been talking about tonight? You know checking the distances where people are traveling, whether or not they're going on one- way streets or into parks. How many it seems to me, you need to have a ton of people doing that, so every single selfie is checked within 15 minutes. So the thinking there is when you take that ride within 15 minutes, we want to make sure you're not able to take a second ride until we review that we actually just reported all sorts of statistics to the DOT last week and we had a really good meeting with them about our relaunch and one of those was exactly around these statistics and right now to be specific. 99.7 of helmet selfies are checked within 15 minutes, so, basically 100. So I've been pretty proud of the team. Just making sure that we are on top of that at all hours of the day does not matter yeah. Well, you know you're not on top of it after midnight. Well after midnight, there's no more rides after midnight. No more rides right. So how many people do you have who are doing this type of work? Well, it's our it's! Our customer experience agents. So we have about 50. because you have to remember to see we operate in six markets, we're in San, Francisco, Oakland, Berkeley, Austin, Miami, Washington Dc and in New York City that customer experience center does all the cities and there's about 50, plus people and 50 is enough to do all of this checking yeah all right all right! Thank you, debbie all right, thanks, steve all right with that. I want to thank rebel for hanging in with us. I, oh sorry, Debra! Oh, no go ahead! Go ahead! Frank! Just to finish, you know, Steve. I appreciate your comment around taking this seriously because you know I understand the frustrations this community had from May through July, because as CEO I was out battery swapping some nights, because I do that. I work with the warehouse guys and gals and now I'm on the front lines with them, because if I'm going to leave this company, I got to know what's going on, and I saw some of the things that were happening in places like Inwood in July and everything that we did for this relaunch was to make sure that it is not like that ever again. So, hopefully, the last three weeks you've seen a significant difference from July as opposed to last week, because we're going to be here for the long term and we need to really make sure that we are a net positive for the community. We're not what are we doing. So. I appreciate that because the situation in the Inwood parks was absolutely not tenable and frankly, a lot of us were very happy when, when you suspended operations and were very concerned when you came back fairly quickly, so we are going to be keeping an eye out for how it works. But what was going on in the parks with these vehicles was absolutely not acceptable. Yep, I hear you Steve, so please give us feedback. Let us know how things are going and talk to you all soon, thanks again and Carol connect with you absolutely getting people's info all right. Many thanks all right. Okay, with Gerard's permission, I'm going to have to go on to something else. Thank you all thanks Steve! So let's just a few minutes on new business as much as late as it is we have so I do not know if everybody had a chance to review a letter that came, that was a letter written from Yeshiva University to Commissioner trottenberg at the D.O.T signatories to that letter included any number of businesses again on Amsterdam or near that corridor, as well as all the elected officials etc. I have that scheduled for an up for being on our agenda next month. However, I wanted to see if we wanted, if we feel like we do not need a lot of time to discuss it. Would we want to consider taking another 15 minutes discussing it and potentially moving towards to a resolution for that and again we can move it into into next month and if the committee would allow, I would invite, at this time, John Greenfield from Yeshiva University just to give us like the quick summary on what's in there for those of a chance, and then we can maybe make a decision about if we feel we can push through to a resolution or, if you'd like, to give it more due time next month. John, are you still available to talk to us a bit about this and chanel? If you're still available, can you promote him? I have unmuted you John. Thank you. Can everyone hear me we can great, and if you can, I can be on camera as well. Okay, there you go all right great again. I want to thank the committee for giving me the opportunity to speak. I just want to make one small point of clarification. Yes, Yeshiva University is one of the leaders on this initiative, but we have been working very closely with our neighbors at the wheels School on 182Nd Street. Interestingly enough, the students have been tremendous leaders in the community focusing on traffic and eco- friendly beautification, better measures on 180 seconds, planting beds and the like. So it was actually in conversation originally with wheels that we noticed that there was somewhat of a consensus to address the alarming traffic issues that we were seeing on Amsterdam and this we met with them in July and by early August or on August 6. There was a significant crash. We were told attributed to drag racing that occurs between 190th and roughly 185Th Street about three. In the morning, a vehicle spun out at 187 street on Amsterdam crashed into the scaffolding at our boys. High school, the car burst into flames, took out a significant portion of scaffolding, NYPD fdm. While they responded, we, we were alarmed by that. It's not only. Of course, our boys high school is there. We also have our late night bus shuttle that runs about 2 A.M to our Midtown campus right there on 187th on the opposite side of the street. So thankfully our students were not on site at that time, because, frankly, it could have been a much more significant accident. So after that incident we decided to we and wheels decided to work on this letter and we found a significant consensus among business leaders, non- profits, elected officials and the like that there needs to be efforts by the city to address this traffic issue. We have, of course, that accident I know w the beginning meeting. You had mentioned that there was a an accident on 181St street that appears to have at least have involved at least two cars in June of this year. There have also been accidents on 190Th street we've spoken to communities who emphasize that this is an ongoing issue and, frankly, we'd like to see the city address it before there are significant injuries and fatalities. So we've drafted up this letter. It's been shared, of course, with the committee. As I understand it, it basically has four key points: we'd like to see traffic calming measures at key intersections, 182nd 185Th 187th to 189th. Those of course correspond to the schools that are located at those intersections. We've also asked for enforcement of existing regulations on Amsterdam. There are signs posted on both north and southbound lanes and one at 183Rd, one at 186, and also on the 184th street. The right turn on to Amsterdam limiting traffic to bus and local deliveries between 8 A.M and 11 P.M. We've also asked for the inclusion of that stretch in the open streets program we speaking to the businesses on that block. Of course, we have a number of kosher establishments that are students frequent plus many non- kosher businesses. That, of course, are dealing with the coronavirus pandemic. They have communicated to us an interest in seeing more streetscape infrastructure to be able to accommodate outdoor dining for what's left of this particular season and potentially to anticipate what we could see in terms of Covid-19 in to the next spring and summer. And lastly, we are urging that the city allocate pedestrian Plaza dollars the existing pedestrian Plaza program through D.O.T to infrastructure along this corridor, including the Amsterdam Avenue pedestrian Plaza from 183 to 186, which I'll remind the committee was the subject of an April 2019 resolution calling on commissioner trottenberg to support that particular project. So we'd like to see this pro these program funds, the city may have available to improve infrastructure along this corridor. So those are the four key points. It's really at the end of the day, it's a question of traffic, it's traffic safety quality of life and ensuring that the many educational institutions along the corridor can be safe from these types of high- speed, crashes and traffic. So that's all I have to say about that. So thank you for giving me the time to speak to this issue. If I'm, given the opportunity to field questions, I'm happy to answer any thanks. John Richard, just unmute yourself, there you go! This issue has been out there for quite a while. I was involved in a couple years ago in another effort on that effort came from personnel at ps187 being seriously injured in a pedestrian accident if you've already done a lot more organizing than was done on the previous effort, and that's appreciated one thing to note the response that came back from D.O.T at that time. After a considerable period of not responding was we can't do anything because there's a bus route along there and most many of the conventional traffic calming measures can't be done under those circumstances, without going into it. I'd say I felt like walking through a cow pasture at that moment, and I would accordingly move a resolution of support for this letter. I second it. I think what we should do. Since you know, Jeff mentioned the four points we should just include them now. I think we should definitely ask for traffic calming now if, in fact, which is what DOT told you and it is their property and remember, I do not work for D.O.T, I mean it is their policy. They will not put speed humps bumps lumps whatever they are on any bus route, because it makes it very uncomfortable for the buses and it also makes it impossible for the buses when the roads are slippery. I believe so they, but there may be other traffic commons. So that's why we say speed bumps humble and other traffic economy, and you know, because, if we're adamant about that, unless they change their rules and there's generally logic by what they're doing you know, that's what we demand we're not going to get it probably but traffic calming in general. There may be other stuff they can do. Thank you thanks Jim, and you know I'm not. I do not feel like. We need to overly specify we can. You know I think we can. We can ask for this to be addressed. I mean how they get. There really is not the issue, but I mean these pictures. I've got, you know three saved they they're so dramatic and again, like you said, it's been an ongoing issue. Do we have anybody else from the committee who wanted to comment all right so who wants to make the motion I mean Richard was that kind of your motion was a motion made and bruce seconded okay and no further discussion? We can vote on it all right. How do you like that for speed? Josh? Well done. Sorry, I'm just going to have to help me out with the list, because now I'm in three different places, starting with Mary, okay, Jim Berlin, yes, Gerard, Sorry, Gerard Dingle! Oh, we might have lost him. Richard Almond, yes, Bruce Robertson, yes, Angel, yes, Mariella! Yes, I am voting. Yes, who am? I missing somebody from the committee all right, I'm going to go to give the opportunity for community board members, not on the committee to vote sally if you'd like to vote or you do not have to yes thank you is Maria still with Us Maria Luna. I think she might have called it a night and I know right he lies on yes Eli. Would you like to vote in this one? Then you should unmute. He might have stepped away. Okay, with that, it appears, emotion, does pass to do a resolution at this time. Jim do you want to take a first crack, or would you like somebody else to do so, James all right, we'll duke it out later on who's going to who's going to draft it? I can do it as well, but if somebody else could take a first crack, it would be much appreciated. Did I was away? Did you try and you tried yeah, it's frankly so easy to do, since all the material is in the letter that I think someone else might want to take a crack at it, because you know the writing res and you can look at all resolutions and the thing is it can be very brief. Also. Does anybody want to take a first crack at a draft, and then we will? You know with the. Let me just mention this technicality too, to review it as a committee. You will send your draft out and then we will only write back to you, because we can't send emails back and forth to everybody. Okay, all right, and if you do not want to do it, some either you or I will do it we'll yeah, okay, yeah you or I will do it. That's fine all right! So that's good. We had another new item, but I was sort of hoping edith could lead it. So I'm going to I'm going to, I think, defer that because she's not on the call right now, but she has raised issues just as we've gone just now that we've gone to front boarding of buses that just sort of how it's working out. If you are using the front of the bus, you know that because of the space created between the driver and where limited mobility people might be sitting, there have been some issues etc. But I'll have her take that up with us in October I I just this would be for the future, but so people know another thing that there's been a lot of community feedback about is that there is a group of people in the community who are really opposed and upset to have to lose the open street that we had in the Fort Triumph Park Drive, and that open street did come to an end on September 8th in part. I believe, because, with the reopening of the cloisters sort of, I think there I think it had something to do with that and with the and that being in the park that there was a focus on having it during the summer high usage month and but there are a fair amount of people that have given feedback, and so I may want to consider in the future. Probably not it's we're going to have another long meeting in October. So I do not know how much I can stack in there. But you know for pedestrians that were using that open space. You know they still have. Obviously, our big wonderful parks and it's many miles of pathways, however, and to some extent you know one could argue well for the bicyclists scooters etc. Well, okay, we do not have it. That's not the end well whatever, but it sort of seems to me that what people are saying by saying like do. We really want to do this again at a time when we're trying to give more space to alternate forms of getting around and all of that, but do we at a time- and I think this is a it's something to consider- is you know a prospect park? A central park no longer have cars within the park right, but I think then that's what that discussion. Is it's not really about open streets? It's about. We do have a park with cars in it and in other places, in our beautiful city, in our beautiful parks. We've stopped doing that. So it's just something that I want to say again. It is sort of immediate in the sense that this ended on September 8th, there's a there's, a petition that went around etc. It's not, you know, there's a lot of people who feel like no, let's keep that access. That was good access, but I think that it's more really again. We should, if we're going to take it up, that that's the frame that I'd like to put on that. So if anybody has thoughts about that as an item, you know maybe just share them with me by email, but that's sort of my current thought on that issue, and maybe some of you have seen seen that petition or seen on you know I've seen it online etc. There are a lot of people. Who've really been having great discussions on this pro and con, and all of that- and I think that that's something that we would really benefit by hearing in committee and then just in terms of priorities. I know that some committees sort of take this opportunity in September and we'll certainly do this to some extent in October with the with the capital with the budget rankings. But I want us, I just would say overall we you know there have been. There are several long term things that have sort of come up again and again in committee, whether they're sort of safety related, whether they're congestion related or could be other things, and there may be ways for us to think more broadly about what we put into the needs assessment. But I want people to really like think writ large of like what do you think is important that we get to this year and then more specifically, does any of that trigger items that we put into our budget ranking because we've had kind of the same list for a lot of years. So I am going to ask people to sort of like think a little bit more broadly, let's freshen up that list, and I guess what I'm talking about here. It's just things to ferment on over the coming. I think our next meeting is in like three weeks are things traffic studies at you know, we've talked about by the hospital or you know things have come up again from the public on you know around dyckman or what have you or you know what whatever it might be? I know I'm rambling at this late hour, but, let's not, I feel like we're going to. We often go into that budget moment and we do not have a lot of time and we're just ranking what's there, but let's just think about what are the things that we've been hearing from people that continue. You know that just keep coming up and again and again, and is there a way for us both to prioritize it in our work this year, but also translate translated into a statement within our budget ranking, because that is a statement of our values and I do not feel like we've done much with our ranking really over time. That's sort of gotten us anything so, and I say that in the worst budget environment of all time, so does anybody. I sally you have a hand up. I think I do too. Oh sorry, let's start with the committee, then Mary and then Richard and then Sally. I just think it would be helpful, especially for the new people on the committee. If you ask ebenezer to send out last year's capital expense budget listings of this committee, and they will be sending that out soon to get us ready but Mary, why do not I do something Steve Simon did for his committee, but why do not I commit to that to just at least get it like, maybe put all our stuff onto one page from our rankings from last year? Or do you want to see the whole the whole thing? No just the committee okay, because we're doing this committee by Committee yeah. I will try to get that out to you in the next two days and then that maybe we could see it on one sheet. I know that's how Steve did it and it was it's just easier to absorb. Thank you good suggestion, Richard support for what Mary and you were just saying, two issues potentially for us to consider in the future. One is a partial issue when we can, when we address MTA issues next month, I'd like to talk about drivers and masks it's what I'm seeing on the buses is too far short of a hundred percent mask on the buses and on the streets where there are dispatchers. It's just way too far short of a hundred percent, and I think we need to find a political way to say something about that. An additional issue that I would suggest we consider is congestion on the 207Th, Street Bridge and, while I know congestion is not our favorite topic, sometimes at least the thoughts I have about that bridge. Is that there's some very solvable problems? Perhaps they play into how we deal with the expense budget issues? I had the exact same point in my notes. Thank you, agree, okay, but we that I think we need to bring that in into the budget. Discussion. Do not let it not be in there. That's fine and the last quick thought if anyone knows why the mccombs Stan Mccombs, Damn, Bridge, 155Th, Street Bridge, was closed down today. I'd be interested in learning about it was broken. The mechanism that opens and closes it, thank you yeah! That's how projection of time. No, I just I saw a news alert a while ago and I have not seen anything saying that it's reopened, so total answer. Much appreciated sally two things one. Is I really like your idea of exploring further the issue with the street and Fort Trying Park. I think that we should be looking at streets not only there, but also streets adjacent to parks, but, from my standpoint, open streets. More is more. However, I also think that there have been issues with certain of the open streets in terms of things not being enforced. Some misunderstanding about what they're allowed to do and what they're not allowed to do when an open street becomes an open restaurant. Real issues in terms of indictment at some point sometimes looks like a super spreader event, because certain regulations are not being enforced. I think that it would be worthwhile if y' all have time on your agenda to actually have someone from D.O.T, and maybe the mayor's office of special enforcement here to address just overall concerns with the open streets, open restaurants, programs, because you know they've made decisions in terms of this- will carry on, and I just I'm not sure that they were properly managed, and I mean at the beginning they certainly were not, but I think that some changes need to be made. That program. That's just my humble opinion and you can take it for what it's worth as far as Masto Richard. You could actually be part of the MTA Mask force. I did it last time and it was really fun and there will be five signs in the future, but I know that Debbie wants to tell us about the opportunity next week to be part of the MTA mass force I want to just. Let me just say this much sally got what you're saying, but my concern is with MTA personnel and I'm not sure a volunteer group is the way the best way to deal with they'll find themselves at fifty dollars all right. Thank you sally, as always for your Engagement Mariella. I'm sorry, I did not realize you had a hand up now. I just wanted to add maybe new business for the next meeting, which is that there is a charter school that is supposed to come in to 215Th Street between Park Terrace, East and Park, Terrace West, which is very residential, and so just wanting to ask some questions and look into what that would mean for traffic and busing in that area, which is you know, full of one- way streets all right. We had somebody in the Q&A about that. So usually there's a traffic study. So, let's yes, probably not next month, but let's also figure out what trap there should have been a traffic study. But I'm not. I do not know if this I'll look into it. Will you, if you do not hear from me in the next seven days, will you please email me sure I mean I'm also happy to follow up with this traffic report. Maybe this is a way that I will learn how all of this works right all right, so we're going to go look into it together. Okay, thank you, Mariella, thank you, Mariella and the last thing before we adjourn. I just want to one the last thing: that's sort of running through my mind about something that we may want to do, but I have not talked to Curtis Young. Yet is that you know certainly there's been a series of issues that sort of have an enforcement aspect, but have a streets aspect and those sometimes are tricky right, because we can only talk about one. So that's another thing to just sort of ruminate on and maybe we can think about having some common effort or joint effort at some time. Arielle. Oh someone in the attendee says that they know more Dave. Tom says he knows more about traffic study that there was not a traffic study. Okay, so let's just follow up because I do not. We really can't take it on tonight, but let's figure out when we can put it on and then what kind of what we can yeah. Let me just catch up to the issue. I appreciate everybody's forbearance. I know I'm always like this at the September meeting and I warn you. I might be like this at the October meeting, but we will we will get it on and thank you to dave Tom for raising the issue. So let us do a little homework and get smart about what's happening with that. I'd like to Adjourn. Thank you so much all of you, you're amazing. I know I have a lot of follow- ups if it feels like I'm forgetting something I probably did so just ping me. Please all right take care all and I will get out the communication about the mass force, all right, bye. Thank you.",
            "summary": "A first draft plan was presented at the most recent meeting and while it does not get to what hours and days The bus way would be in operation or what hours of the day it did reflect, again, a pretty solid, first crack and also sort of it seemed mindful of the specific concerns raised through that community Advisory Board, specifically as it related to, And I, know for people that have said on this committee.\nThey'll know this specifically as it related to looking at the broader area, because the 181St street can't really be looked at in isolation, because so many people move to the surrounding blocks to get around.\nGenerally, one thing, that's sort of been talked about a little bit at this committee is Riverside drive when people are exiting the highway near henshaw.\nMembers were on that on that session, and a group has formed out of that meeting called which I know some of some people on the community board are also involved in about you know a neighborhood group sort of looking to get at this decibel level issue they reached out to this committee about speed, bumps and other tools to address some of the streets related aspects of that and as a reminder.\nI just want people to sort of start thinking about it, because we're going to have to leave all of that.\nSo if anybody maybe wants to tell me about it, later, as far as I know that happened- maybe D.O.T, can fill us in like two weeks ago or a week ago and remember that was an opportunity both to sort out the intersection at 165Th and St Nicholas, amongst other things, as well as 160,170, in that crazy spot, where saint Nicholas and Broadway Cross, but also add 20s parking spots, just south of 165Th on I, think I'm up to Riverside viaduct project.\nThat is an ongoing project, as people may know that I think in total a five- year project or has about four years left or some such there is a construction liaison who's in touch with the community.\nPeople have two minutes to speak, but one thing that sort of tripped me up by now is that when a committee member a board member, even a member public, commenting have a question.\nHow many people are like spend time understanding the issues providing feedback following up letting us know what's happening out there at the same time, sometimes or whatever.\nDot presented a project that addressed a few things in one around the area of like 158Th Street from Riverside, just about to broadway a lot of pedestrian safety kind of issues at intersections.\nBecause I know a few of you are newer to the committee and there may be people from the community that were not on the call in May. So just want to recap a few things: first, so This project as a whole.\nOur D.O.T street ambassadors team, as you can see in the photo on the bottom right, has done outreach at 158Th Street talking to people in the community about the intersections along this corridor.\nAnd then in may we presented to your committee to talk about the whole project and like what was said before the committee supported the improvements between 155Th Street and 158Th Street, but wanted us to look more at the design and function of the street conversion proposal that we had so just to visualize.\nWe have Riverside drive west and on the right we have Edward Morgan place and the 158Th Street intersection.\nThe area outlined in Blue is the area that was supported when we came to the transportation committee in May. This included the lane reduction to make it feel more like a residential neighborhood, as well as the concrete medians at 157Th Street and the enhanced crossings there.\nThey asked the question: Would you support making a two- way street one way if it could add parking and increase intersection safety and 69 of respondents?\nWe would like to add two no standing any time areas so that vehicles can load and unload or pick up and drop off people, and then that's highlighted in the pink along the West Curb and then along the East curb.\nKeeping the parking and kind of the northern and southern ends gives more room for the bus to travel through there, and it also we keep some of the parking, which is something that was voiced during the community outreach process, and we also still get to keep the concrete curve extension at the intersection of 158Th Street, and so we can revisit this.\nWe can add time to the signal for pedestrians crossing along that north curb because we're removing that northbound movement and then also adding about 26 parking spaces with that spot parking, and so knowing that with the conversion, comes a diversion, route.\nGuess all right, so I do not have anything from the else from the committee right now, but before we go to Natalie So, they sort of see two things here like there is a safety issue, Pedestrian safety issues related to the six- legged intersection that is what's is addressed in a here, but that also a big part of this was sort of to address parking concerns raised by the community when they lost 180 spots to the viaduct project.\nI believe Transportation Committee presentation that we gave this was supported, but we needed to look a little bit more into the conversion and diversion okay, but you're inferring support just from the discussion, but not because a resolution was issued, right, Deborah, correct, me.\nDrive adjacent to It might be really disruptive to the pedestrian and traffic flow, because the viaduct project is like it's like a war zone over there, So I, guess the question of the DOT is: Having second thoughts about how much tumult there would be with yet digging up.\nThis fall, we're still figuring out a few internal capacity things because of covered, but that we kind of wanted to this meeting happened and see what the discussion is like, but the plan would hopefully be to move forward in about October or so and bruce just to add to that I think that it's definitely a point well taken, but I think that the in the scheme of the length of the viaduct project- This is a very small implementation timeline relative to that, and Then I get committee members who want to talk.\nWe're, also proposing two no standing zones along the West Curb to allow for people like ups and fedex, or people picking up and dropping off to pull in and make those deliveries, but also allow a few sections where we can add some additional parking to alleviate the parking that was displaced by the viaduct work.\nThe way they made the term, and it took us a lot of time to get them to have a stop there to accommodate the people who come from the overdrive to take the bus number six there all right.\nNow you are going to block I'm sure some of the area where the people with the steps are to accommodate the fancy angular parking that you intend to do.\nI can also speak very fast, but with my accent, I want to make sure that people such as Mr Basket, that does not realize the impact that something like this is going to have in our community and his community.\nWe could maybe come back if she spoke, speaks again and wants to have some very clear questions that we can answer, I'd be happy to respond to them, but in general we hear the concerns about the diversion, but we do still feel that there is we're responding to community concerns here at that intersection and community requests for parking at this time.\nRiverside drive , so I think you know, in addition to the concrete Walkway area that you're adding there should be some sort of abutment or some sort of way of keeping people unfamiliar with this new traffic pattern to from driving right up and hitting pedestrians.\nYou look to the northern section of Riverside drive where there's parking on both sides of the street, I've observed this area with an Eagle eye view of the street for over 10 years, now, and just to be honest with you, people are going to stop where it's convenient.\nBut if they stop in the area, where there's only one lane of traffic between two parked cars to decide, that's going to be the fastest and easiest way, you will have a build build- up of several cars and a lot of noise pollution within moments of that occurring and people just won't move their car because they want to unpack their groceries where they want to unpack their groceries, Even.\nIf it's just a quick, uber, ride, pickup or drop off so anywhere, where you have double parking on this avenue, it's going to just cause that backup immediately as soon as somebody pulls up to where they want to pull up, regardless of loading, zones.\nAttracting more cars to the area, I think is counter intuitive to an idea of having a greener city down the road, especially if we're getting back the 100 and some odd parking spaces.\nConscious of anybody else's concerns, will literally just stop and go the road and take as much time as they want with no other way of cars getting around those double parked.\nAnd I just want to point out that I think Kim mentioned this before that we heard so many comments about how unsafe the intersection of 158Th Street felt from a pedestrian perspective, as well as a motor vehicle perspective when you're driving through there, So that's what made us look at converting this street from two- way to That would get us the benefit of the large concrete, curb extension, which gives so many pedestrian benefits and the reason we've been looking at the parking along the eastern curb Is, because we had also heard from a number of people in the area that they wanted additional parking, because the viaduct project is so long, and so we What we're trying to do is accommodate that with these spot parking, measures.\nI can look back at the survey to see if there was more comments about additional parking, but the one question we had asked was: Would you support making a two- way street one way if it could add parking and increase intersection, safety?\nThey want not necessarily the space that you're providing for them, and that's absolutely true, I mean, like I said, as a driver driving this area.\nDuring like rush hour, traffic, I can tell you, there's about three or four cars: Double parked on the westbound side of that street, every single morning, and they are not fedex and they are not.\nFour o'clock: five o'clock when that street backs up for three blocks because of people trying to go through a five car light at 165Th Street and that's an impossible route and the same thing will happen when we get through Covid-19 and traffic returns to normal on Riverside drive heading north in emergencies.\nSo I have real questions about you doing this as a permanent thing, and I suggest that Lee's suggestion to try it out as Southbound and see what happens, because I think it's going to cause lots of problems that you have not anticipated.\nWe still have a couple more items on the agenda, so I think I'm going to have to sort of cut us off for first for a second round of questions, but I still have Jim Berlin You said you asked people, you know what would they think of making a street one way if it increased more traffic?\nIt's, the only way these streets work, and, ironically, which I know totally infuriates your D.O.T mentality, the fact that people have to drive slowly and carefully actually limits accidents and with all these double parked cars cluttering things you can't go fast.\nI hear what you're saying I think that does not mean there is not room to kind of rethink, how this behavior happens and how the street can be designed to sort of get around that opposing entering the opposing lane, and also just to reiterate again that it's not the entire that most of the stretch that's proposed here does not have parking on both sides.\nWe then expanded to a considerable area in Brooklyn and Queens in 2019, with over a thousand vehicles, and earlier this year in March, we expanded throughout Manhattan and the south Bronx during sort of the height of Covid-19, where we worked with Corey Johnson, the speaker, the D.O.T, to basically offer free rides to health care.\nAs we worked with the mayor's office as we worked with NYPD, we had two issues: And I think one of the things that happened was you know coming out of Covid-19 call it from April.\nThink hundreds of thousands of people in a very short period of time were looking for a way to get around the city that was safe way to social distance while getting around and frankly just had a lot of fun, especially maybe after being cooped up in their apartment for 10- 12 weeks.\nWhat we did was over the last month, as we worked with the DOT and city hall, every single time you ride now, And you'll see it out in the street.\nThe other thing that we realized, and one of the reasons why I'm at this community board meeting today is certain neighborhoods like Inwood, for whatever reason from you know may through July there was an increase in rider.\nI mean tell me if I'm wrong, but I think it's decreased in a really good way, which is exactly what we needed to see with the relaunch some other safety initiatives that we built over the last month that we had shut ourselves down and worked with D.O.T with increased lessons.\nIf you think it's the right thing to do to ride down a one- way street the opposite way for three or four blocks, guess what now we know exactly what happened?\nWe, know where the one- way streets, are, and we've suspended a lot of users and If. You can't ride this vehicle, the right way.\nI'm glad Frank that you noted all summer the things that were happening, but it took debts for rebel to finally do something, but you knew all summer long that it was tormenting communities like Inward, Washington Heights, who were being chased down blocks and streets sidewalks by people on rebel.\nSo I think, in terms of being a Covid-19 spreader, I'm going to have to politely disagree a bit in terms of the helmet use every single time we battery swap vehicle, which in Manhattan is literally every single day, because the demand is so high.\nThat's just an example of like one suspension policy that we have for a violation- You know for things like riding up a one- way street for five or six blocks.\nSecond, in terms of things like riding the wrong wind, a one- way street going in parks going on acrosss, bridges, etc.\nSo we basically got a written letter signed by commissioner trottenberg, saying we approve of the safety enhancements you're, making we're looking forward to working together and you're approved to relaunch on the streets of New York.\nLet me put this as there's always politics here, but I'll, say the commissioner of the DOT is not going to sign a letter approving of our relaunch without approvals from certain people, but just to ask that we have been working closely with City Council members in all four boroughs who we consulted.\nWe got the feedback and within two hours we had shut down the lessons and moved the location and we actually reached out and tried to coordinate the a better location so that we have a new location for Inwood and Washington Heights people that it's really just like in a very quiet area,, there's really no residence on either side We were just trying to find the best place that would satisfy the community, but also They get some amazing experience on how to ride We really want people to take advantage.\nWe call it the you know, sort of just the squiggly line, alert, which is basically like when a GPS trail is just makes no sense, and it's just going back and forth around the street.\nYou do not know what second one we're going to get you connected outside of this, because we're like double the amount of time for that You have something after Ira and the center's office, hello, I've heard commented.\nYou know checking the distances where people are traveling, whether or not they're going on one- way streets or into parks.\nLet us know how things are going and talk to you all soon, thanks again and Carol connect with you absolutely getting people's info all right.\nSince all the material is in the letter that I think someone else might want to take a crack at it, because you know the writing res and you can look at all resolutions and the thing is, it can be very brief.\nI'll have her take that up with us in October I, just this would be for the future, but so people know another thing that there's been a lot of community feedback about is that there is a group of people in the community who are really opposed and upset to have to lose the open street that we had in the Fort Triumph Park Drive, and that open street did come to an end on September 8th in part.\nSo I am going to ask people to sort of like think a little bit more broadly, let's freshen up that list, and I.\nThink our next meeting is in , like three weeks are things traffic studies at you, know, we've talked about by the hospital You know things have come up again from the public on you know around dyckman or We often go into that budget moment, and we do not have a lot of time.\nIs I, really like your idea of exploring further the issue with the street and Fort Trying Park.\nHowever, I also think that there have been issues with certain of the open streets in terms of things not being enforced.\nI just wanted to add maybe new business for the next meeting, which is that there is a charter school that is supposed to come in to 215Th Street between Park Terrace, East and Park, Terrace West, which is very residential, and so just wanting to ask some questions and look into what that would mean for traffic and busing in that area, which is you know, full of one- way streets, all right.\nYet is that you know certainly there's been a series of issues that sort of have an enforcement aspect, but have a streets aspect and those sometimes are tricky right, because we can only talk about one."
        }
    }
}