{
    "YoutubeMetadata": {
        "author": "MCB8",
        "channelId": "https://www.youtube.com/channel/UC_-DD7pj1DnRCaO2fN-HDbw",
        "title": "CB8M September 2020 Parks and Waterfront Meeting",
        "publishDate": "2020-09-10",
        "shortDescription": ""
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "MCB8",
        "normalizedName": "Manhattan Community Board 8",
        "twitterName": "Community Board 8 M",
        "youtubeChannelName": "Community Board 8 Manhattan",
        "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
        "twitterHandle": "@CB8M",
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "Good evening will good evening, did I send you? The list I sent it with. You know, did trisha the four fight items. I did. You did good fine good. Okay. Now, if we don't hear from chris crowley of the parks department on saint katherine's park, we'll lay it over until we'll raise the issue that will be up by on october. Unless wes has an answer for us, yeah. Okay, I hadn't seen this the qr symbol. Uh-Huh we've started putting those on all of the flyers that we will eventually put on that post ourselves, but when we send them to applicants, and so we also send flyers to rebecca c wright's office- oh very good, and so she puts them up in the window of her office. Ah, and so anybody who's just walking by can scan the code and but we'll well, I'm sorry! Well we're not doing enough outreach. We need more outreach. We need to get postings, we gotta get to get. You know, you know who I'm we are. We are both live on youtube and facebook and being recorded. So I don't know anything you're talking about will. I was referring to elaine walsh, okay about five minutes. To start. Looks that way: yeah great, oh, for your information will and trisha I'm going to be spokes, a spokesman on the rebecca c wright, webinar or boom zoom meeting on tuesday she's having a discussion of community neighborhood associations. Oh fantastic, and I said as long as you don't need anybody else. She agreed yeah right anyway. Here we are, how are you doing trish? I haven't spoken to you in a few days. I know I know it's good, it's good to see you via zoomberry happy all. Yes, almost quiet, not quite yeah. We still got a few days. Yes, oh we have 12 people with us. Oh 13., you're, teddy. Yes, he's going to be taking his exit shortly here! That's right! Oh yes, I'm gonna, minimize this for a second thanks, phil, sorry about that. I was meeting myself for teddy fair enough, a good trick that that, if you think that you may need to mute a lot while not being muted is, if you call in through a phone, you can mute on your phone like using the mute button on your phone and not using star 6 or whatever. But if you call and sync it with the video through like what elita does actually does that make sense yeah then, admittedly, I may be a little too lazy to do that this time around, but I but I will but that's a very good suggestion. Okay, a couple of movies, I'm good at a few things these days and I think most of them are being on zoom meetings. So I'm here to help patricia it's probably a talent that will serve you later on. I imagine, after all this, oh, my god, a whole lack of people, no judy the crowd is in favor of hearing more of teddy by the way I'm getting chats. Let's say, please don't meet teddy yeah. I doubt that teddy's getting louder by the day, and I think I need to get my hearing checked after you- can take my appointment on the 12th okay, a couple a minute or two more, maybe barry. We can just take this opportunity really quick, while we're just waiting for a few more minutes sure to mention since it's so nice to see felice here and elizabeth rose and brian, and I think that's all the new members, but if any of you are interested in being in kind of being permanent official members of our committee, I know barry and I would really appreciate some new voices on the committee, some additional park users and open space lovers. We would really love it. So, just if you do have an interest after this meeting, we'd love to you just send us an email and happy to write over to elita to officially, you know bring you on board absolutely. Can we start yeah? I've got well one of my clocks. It says 6 30, let's go ahead, perfect! Welcome everybody to the september meeting of the parks committee. It's so nice to see you all it's. I hope you all had as peaceful of a august as possible so happy to see all of you on zoom. I miss you guys, and so it's nice, it's nice, to see you all nice to get back to work. I see teddy's buddy is here tonight: teddy's buddy, yeah, michael simpson, look at michael stinson and christopher. That's charlie! Welcome, oh we're so happy to have you. Maybe I don't know if mike can, if we can unmute mike or not yes, we certainly can welcome michael hi, everybody. I hope everyone had a great summer. How are you feeling michael bye and see everybody? It's been a while chris is going to be joined for a little bit because my wife is on a work call herself. So I'm on daddy duty right now welcome. Thank you, I'm so happy to have you and I hope, you're feeling better and christopher looks beautiful. I think that we're just going to jump right into the first. The first presentation is that right, barry absolutely go ahead. Please great! So let me I'm sorry. I just actually well so in over the summer time. I'm sure you might have heard we have a lot of articles about it right at 70, 74th street six. Thank you all right, 76th street we had a major collapse of the waterfront. It was we just. I just happened to be there with my son, teddy and dove barry had called me because the parks department had reached out to us. We ended up going over there and speaking to mark and seeing the damage ourselves. It was about the size of a king-sized bed of a hole is how I remember it extremely dangerous, we're very grateful to the parks department for acting quickly to rope it off, but the truth was is that at a time during the pandemic, when everybody is using their open space more than ever before, this was really the worst time that we could lose out on some of our most essential open space. Even as we were taping it up, and I was there with the parks department trying to tape rope it off. We had bikers and runners who were trying to push their way through and trying to run past and run through and clearly there was just no safe way to do so again. Many thanks to the parks department for their fast action on this and work has already restarted started on the repairs, but I think I'm sure our committee has a lot of questions about how the repairs are going. The inspections that are happening. We've spoken to our elected officials fairly frequently on this trying to get more information about what happened. So with that. I think we'll kick it off to terrance, who, I believe, is doing the presentation from the parks department today. That is correct and hello. Can you hear me? Yes, thank you perfect. So I'm not sure if the video was shared with you or if I can share my screen, what works best for you, I think sharing your screen will, can we you should be able to share your screen, turns okay, give me one. Second, there we go. Let me start my video all right and sorry. Okay, can you all see that no yes, perfect and I'm glad to see that someone else has a kid here? So if you hear any loud noises from my end, my wife is currently working on putting my 18 month old to bed, so hopefully he's a little quiet but glad to see that it is a family affair. So, as requested, we did want to provide a update on that sinkhole and the seawall collapse over at east 76th street. So here you can see. On that right hand, side is soon after that collapse happened. That was that it was occurred on july 20th. Prior to the collapse, we had blocked off a section here after we had been notified that there was some undermining at this location. But then, obviously the collapse was beyond what we had originally anticipated, as you can see with that fallen fence in there and then barricades were put up beyond that, and actually we've unfortunately had to close through passage to the north and south. Since that that time we were in the final stages of a procurement of a city-wide retaining wall contract. So actually, we were able to mobilize that contractor fairly quickly. He did mobilize on august 20th and the first activities that he performed were excavating, that area to get out the debris and things like that. So we could identify the actual field conditions, and this is what you're seeing on that left-hand side here on the right-hand side. I believe this is looking south on the left-hand side. This is looking north, and so we performed that field excavation and then also they put in security measures to stop any further loss of backfill, and that was important because if that erosion continued to the west, that would also have risk to the fdr, which is right. Besides the esplanade, this location and also we've been able to utilize our design consultants to perform underwater inspections during this time on the water side to identify some of the field conditions as related to the foundation there, and you can kind of see that a little bit on the left-hand picture you'll see that. Obviously this is something that goes straight through to the water. So we've had divers out there to identify a little bit of the foundation and the damage that that's experienced all right, so moving on this is kind of a brief sketch of a cross section of our sea wall. So, as you'll see, we were noting that damage to the sea wall itself on the erosion of that backfill. That's kind of that's basically flowed out into the water which then left that a span of esplanade undermined which led to the collapse. Additionally, you know, through that diving inspection we've been able to identify some underwater damage at this location. So, as I noted, we did mobilize a our retaining wall contract. Now, one of the things to note about the retaining wall contract- that's important here is simply. This is retainable that is on land. So most of these items are land-based contract items and not necessarily c-based, and so the reason I'm mentioning that and I'm gonna kind of move down to this is that, while we feel that we can open a 17-foot path before the end of the year as we priorly committed, we do not feel that we're going to be able to open that full 22-foot pathway and I'll scroll up for a second. So the current width at this location is 22 feet from the fdr over to that railing. So, basically, what we're going to be able to do is offset a sea wall and that's this portion in green and then put up a new fence and then basically pave over this area so and we can do this all from the land side. So this is the you know. The reason I have it in green is the good news is that we will be able to expedite that reopening and have that done before the end of the year. However, this it will be a 17-foot pathway. This will not be the full 22 feet and then, additionally, in order to use the items that we have we're, anticipating leaving this as asphalt currently, instead of those hex box pavers and obviously there will be no fascia stone because we're gonna offset on this wall and then our plan for the full restoration here is. We are in the final stages of design for east esplanade contracts, phase two and three and that's performing work up at 114 to 117th, I believe, 92nd and 94th and 62nd to 63rd. So we were going to now include this section in that contract and since that is a full estimate contract that is, we can perform that work on the water side, so we'll be able to mainly do this restoration without impact of the thoroughfare here. Obviously there will be some need to have some shutdowns if we're replacing the hex blocks pavers and things like that. However, we do hope to minimize any impact there so and actually we do have a rendering of what this is going to kind of look like so- and this is again looking south so you'll see here. This is that asphalt, and actually what we're also going to plan to do is pave all the way to the barrier against the fdr to really try to give pedestrians as much access as possible for that thoroughfare. And then, when we come back with the easter espinod contract, we can put this back to its original condition. On the left-hand side, you'll see that four-foot fence, and basically you can kind of see here in the middle. This is our current hole and now it's quite possible that you know through construction. This hole on north and south gets a little larger. However, any of the openings will be fenced off and then kind of right here is where that new seawall will be. That is solid and that we feel good installing it's just that. We can't put it out over here, because we have concerns about doing that. Waterside work that we're not able to do in this contract and making this stable so we're off, setting that about five feet, creating this pathway and there we are so that is all the slides I have here. So that's just the update that we wanted to bring to you folks and let you know trisha go ahead. Okay. So if you have a question which I see judy has one up her hand up. If you could just raise your hand- which is the blue, I'm sure everybody's a pro at zoom by now, but in case you don't know under the participants menu there's a blue hand raised. If you click on that you'll go into the queue to ask questions. I see everybody's starting to ask them, so I will reserve my questions for the end. I think and we'll go straight to judy so will, if you can unmute judy and then it'll be elizabeth rose, then police and I will remind everybody on the phone: it's star nine, to raise your hand and terence, if you don't mind, actually we had a couple people asking if you wouldn't mind making this a full screen of the pdf by going to view in full screen, so it's a little easier for people to see on their small devices. Judy! Yes, simple question! Terence, could you please send the presentation at the community for posting? That should not be a problem. I can send this over of course down. Fourth for the bottom, sorry little yeah in your original menu, fourth from the bottom, or hit ctrl l, ctrl, l that'll work for me too. Sorry about that. Oh there we go sorry, okay, it's just easier for people to see on small screens. Of course, did you have anything else? No! Thank you great elizabeth rose and police friend. So if I followed your description of the initial repair and then long-term repair, it sounds like one of the things that prevents this from being completed before 2022. Is that we sort of have to wait for different contracts or contractors to be able to do different pieces of work? Am I on? Am I understanding that correctly sure? So in order to explain so in order to mobilize a contractor here quickly, we are basically as the city. It always takes a bit of time for procurement, so we did have a contract towards the end of procurement that we use for the parks, retaining walls, city-wide and that's for any sort of retaining wall you'll see through a park, but also that we've utilized at other sites as well. So since we saw an efficiency there trying to mobilize this quickly and get something done here and try to reopen this, that's what we utilized after we went in and excavated, and we had hoped to really open up the full path utilizing that contract. Unfortunately, the s-bot is a bit older and we're not always fully aware of all the field conditions that we're gonna encounter in these situations. So once we excavated further and identified the existing field conditions, we kind of we realized that we weren't going to able to do everything that, on that land side, which is what that retaining wall contract supplies for and that we need to do more work on the water side. So we took a look and tried to figure out how best to proceed with this. So this is how we felt that we could quickly use this contract to open up a partial path and then basically make creating a site-specific contract in the future in order to more properly do the work. So that's a long way of me trying to say basically, since we're shoehorning it into a retaining wall contract and not a site-specific contract, we're limited in the items that we can utilize. So I was actually going to go sort of further in a different direction, which is why don't we have requirements, contracts for waterside repairs, because it does sound like you're going to have to go through a procurement for site specific. For this, I would imagine that there is work like this on waterside. That needs to be done throughout the city. Why don't? We simply have a standing requirements. Contract for this kind of work, then reduce the time, rather than make this a site specific. You know. I understand that we can't put that in place now in a way, that's going to impact this particular project, but for the long term, rather than have to bid everything is site-specific. That takes tremendous time. You know, isn't this the kind of work where we should just have a requirements contract so that we can very quickly address it rather than have to do. Site-Specific procurements understood- and I do agree with that- and that is a possible lesson learned through here now. It is easy for us to say in hindsight that we should always have various requirement style contracts for all the various issues that arise through parks for various reasons, such as age of structure. That is something that we're looking into as a possibility. Right now. You know we have been granted a certain amount of funding for the esplanade as a whole, and we felt that the best use of that was to try to make these larger site-specific contracts, because we do have those ongoing inspections in coordination with EDC, to try to identify these ahead of time, but as you're seeing there are failures that occur, and you know this. I am well aware that this is not the only location at the esplanade that has experienced a failure, so that is something that we're looking into in conjunction with those specific contracts to also put in a more flexible contract that we can then possibly use as needed. If one of these urgent issues arises, you know, I obviously would prefer that we had that in place now, but unfortunately we do not. But that is a fantastic point and it is something that we're trying to treat as a lesson learned great. Thank you. Of course. I think we have a felice, but then barbara, I think, with all due respect, I think lowell had was trying to raise his hand, and I saw it beforehand. I think it lowered, so I'm going to go to police and then lowell and then barbara hi. I have a couple of questions, so the current repair work, the immediate repair work is managed by the parks department. Is that and the retaining wall repair would that be managed by parks or by ddc or is EDC getting involved in for this location? Currently parks is anticipated, anticipating managing the partial path reopening, as well as the full restoration at this site through our phase two slash three contracts and do you have funding for the phase two phase, three contracts for the retaining wall so phase two slash: three: are not those city-wide retaining wall contracts, those are the site, specific easter egg contracts, and yes, that is utilizing that larger pot of funding for that was allocated for the easter egg restaurant, and so this would be a change order onto those existing contracts, and I understand that change order. Work is being highly scrutinized if not held up by omb. Is this with this project? Do you see that risk happening here of not having the funding to do change order, work for this site, specific repairs? So that is actually a fantastic and very pertinent point here. So you'll note that I did not talk about change orders on that retained, citywide retaining contract, and it's because we noted that risk about additional scrutiny to the possibility of change orders. So that's why we're really only able to do that partial path here so under east respond phase. Two three: while we are in the final stages of design, that design has not yet been finalized, so we are going to be able to include this in the final design documents that then get issued. So this will not be a change order and when do you think this might get bid? You know I'd have to talk to my procurement folks, because after we transmit for design there, it goes through a certain legal review and things like that. I would hope that this would be bid before the end of the year or around the end of the year. However, I would need to check back in with our procurement folks to finalize that. Okay, thank you, of course. Thank you will. Can you unmute lowell, please? Yes, yeah! I just have one question. I know that parks always had I used to have a sea wall repair contract trocom was a company that had it for years they did the dam in the Bronx river, several other repairs. I know that they went out of business after the owner passed away. I was just wondering we don't have a seawall repair contract anymore or what happened with that contract, so I would have to get look into the previous contracts a little bit more in order to get back to you on that. Currently we do not have a specific seawall citywide contract. We do issue a certain amount of various citywide contracts, as I noted one of them is the retaining wall contract. I would have to go look into a little bit of the history on why that was possibly stopped or if that was truly seen as a seawall contract I mean I know you mentioned dams. Sometimes those are some in our rivers and lakes and things like that. So I'm not sure. If that was utilized specifically for this sort of work, I would have to look into it a little bit more and have to get back to. I do not have that information readily available. Unfortunately, okay, oh, and also- who is the contractor doing this work now? Currently, this is delaney who retaining wall contract. Oh good, to hear we always like good reviews, barbara and then craig. I have a few questions and then a major comment. First of all, how I wanted to walk south on the esplanade and I wasn't sure how to do it. So if I go over the 81st street footbridge going south can I can I only go for a couple of steps and then walk back again. So in other words, we really don't have access to the espionage from 81st street down to what's the lower about 68th street, or something like that. That is correct. There is no through passage at the e 76th street esplanade due to this failure. Okay, that's it's that's very sad! So we really completely agree. Can I just clarify that so you can access? If you go down on 86th street, you can get off the esplanade at 70s at 76 at 76th street right next to john jay park. It's right before you will basically run into this project, but you can use that foot pedestrian footprint, footpath and then you can get back on at 71st street and go down so the area from 76 to 71st street is really blocked off, but those two pedestrian bridges at 76th street and 71st street are still being used. So barbara, if you were to walk down, you could walk down, you can you would go down to 86.76 higher up? The bridge is 76 on by john jay right by john jay, so you could use that pedestrian footpath go through john jay park, walk down, walk past the walk right past wild cornell, get back on at 71st street and then continue all the way down. So those pedestrian footprint footpaths are still there and still you know. A second question is d.o.t. There's how, when you say it's the land portion, how are the trucks and the equipment going to come over the empty or drive, so we are working with dlt in order to mobilize the trucks here. Obviously, the fdr is a is a bit of a limiting factor due to bridge heights, and things like that, so I don't, at my fingertips, have the exact plan, but we do have to get a d.o.t permit in order to bring in the trucks over here, so we have very quickly and immediately reached out to them in order to work with them to identify which trucks we can bring and when and if we needed it any shutdowns related to the fdr. So we are still working with them regarding that, but that will be coordinated down traffic. You would have to be careful with china traffic and all of that, of course, thankfully, for if there's any benefit here there is a slight pull off right at this location, so we are able to bring some trucks and station them there when we're doing the work without impacting the fdr too much, then I just have a third quick question and then a comment, I don't believe, am I right trish and barry that this was not next on the list that I know 104th street, I believe, is your next repair. This is called an emergency. Well, this is the second emergency in really just a few years that we've had. I really worry I mean so far. Thank goodness we have not had any human problems along the way. I think it's a miracle, quite truthfully that things haven't happened, you're welcome. I just wonder if we should be a little bit more proactive and say don't mean against the railings or whatever I have to tell you know how much I love and was involved with the espionage for so many years. I would not lean against the espionage, the railings at all, I'm wondering I still can't understand how this was such a shocker, that it was just about to fall in the same thing happened on 80 by gracie mentioned where one day it just fell in and without any was you know, we were told that it's a moderate. We needs moderate amount of repairs and the next thing you know the whole thing fell in. So I don't. I don't know if you have an answer or treasure wants to answer. If how could we not have understood that this was in such bad condition and that it should be higher on the list of repairs? So I I'm going to say something here and then I would love for the parks department to respond to this. I we knew that this area was in weak condition. We knew this. I if you remember barbara, we were all in person in the in the at the blood center I stood up and I told everybody, and they said this is in weak condition. It is not slated for funding, so barry had called me and told me about the hole I knew exactly where it was because we had already seen right. We knew that it was happening. I was not asking you about. I'm well aware that you knew it was the parks department, but your question is a good one and I want- and it was something that I was going to ask terence anyways, but maybe, since you are asking it I'll rephrase it to terrence, how do we we've had a step? We've had studies done before the most recent one done by EDC in 2018. If I recall correctly correct those- and so those studies had already outlined the weak areas of the esplanade now this one was weak and it was not funded, and so there are several others at least the other locations along the esplanade that have been deemed weak, and I'm curious that, if you guys are also looking at those structures along the esplanade, I'm not I'm truly am concerned about the fall coming in and bad weather coming in and what happens if these other areas collapse before we expected that we expected them to. Are you guys inspecting these other areas, to ensure the structural integrity of the of these spots? Sure so so, you're absolutely correct. So 2018 was the last EDC report and I believe 2012 was the one before that and we're trying to do these inspections about every five years or so, which is deemed you know typical best practice here. So I believe the 2018 report on identified this location is poor, so in the scale of things below poor is serious and below that is critical. So after oh actually, prior to that report, we were planning which sections to do and then also after that report, we've kind of reconfirmed and we've really focused on the funding. That's been allocated so far with serious and critical locations. I would obviously, as I'm sure many people would prefer to issue contracts in order to address any sort of item that has been identified. However, you know we are trying to utilize that funding for the most critical. That being said, obviously, this experienced a failure, whereas other sections have not. So that is a lesson to us that you know in between these five-year cycles. We are experiencing failures, so you know, as I identified if this section was I'd identified as poor, we would not anticipate a failure to happen so quickly. After that inspection, however, it has, and so we've identified certain things, such as some of the larger wakes that are experienced from the nearby ferries that have been more frequent here. So that's something that you know has been noted to us and something that we're gonna have to take a look at and so we're trying to figure out. As you say to be more proactive and identify these things, but also to utilize our funding as best as we can, so that is how we're trying to go and we're in talks with EDC, to try to figure out a best path for this. However, you know right now we are trying to do those five years in inspections in order to identify these critical areas ahead of time. However, in this case, unfortunately, a non-critical area, as identified in the EDC report, did fail. Can I just say one: this is the second area. I really don't mean to be difficult, but this is the second area that was non-critical. That literally fell in into the river. Just I mean shockingly, I wonder if it's we should change it either change the company, that's doing the inspection, because I think they're, maybe not doing it right or maybe change the grading and when it's four, even if you don't get to it, to mark it off and somehow know as much as I would hate to give up one inch of the espionage I'd rather give it up than have somebody fall in. I think this could have been really horrible and certainly the one by gracie mentioned if it was not 5 30 in the morning. If it was 9 30 in the morning, we would have had a very different story understood and I don't necessarily disagree. We are trying to review the best way to try to identify these areas ahead of time and implement a solution. You know, unfortunately, our capital process through the city. It does take a little bit of time for procurement, which is why I know some of the previous speakers did talk about. Maybe a requirement style contract in order to, hopefully maybe address some of these items before they become so critical. That is an option that we could possibly look into, but right now we are trying, with that site specific in order to utilize that funding as widely as possible in order to bring this up to, as much of this went on to a state of good repair as possible. Thank you, of course, we're all safe for many different reasons. Crazy well, craig, but wes has a his hand up. So maybe wes has something to add to this, so will do you mind on meeting wes too? I think I am I can you hear me now you are here. Yes, we can. Thank you. I just wanted to add in, and you know, safety is a top concern of ours and I just wanted to mention as well that our staff and supervision is also checking top side. Obviously we can't check, underneath we rely on the engineers to do that, but we're looking at top side throughout the entire espionage, we're checking it daily and our supervisors are checking even closer once a week. Looking for any kind of flaws, any kind of issues that could be- and I just also wanted to note that in both the collapses at both gracie and at this collapse, we you know we did, have it barricaded, we did know the structure was weak, so we take it as a very high concern of ours as well the public safety. So I just try to instill a little bit of confidence to know that we are going for that and anything that we is reported to us. We're going to check out anything that we see is suspicious we're going to we're going to caution off and we're going to reach out to the engineers to go and check the subsurface as soon as we identify it, great craig and then b goldenberg, I'm not sure who that is, but craig go ahead, hi everyone. So I appreciate that these sites were barricaded before the collapse took place. But, frankly, when I'm on the esplanade- and I see a little hole in the esplanade, I don't want to just see barriers. I want to see something: that's much more permanent in place to make sure that people don't perhaps move it at some point. Unknowingly or something happens, because this is frankly I apologize for my frustration, but I've really lost track at this point as to how often the esplanade within community district 8 has had to deal with closures over the past five plus years. At this point, both the emergency repairs and the and the capital improvements, but it's beyond frustrating it's one of our community's greatest assets and it's unable to function as it's supposed to and our community is really suffering. As a result of it- and I mean color me a skeptic, but I we all had to live with the 90th street gracie mansion, seawall, repair repairs that took much longer years longer than it was originally anticipated to support. So I'm I don't know that I have confidence just hearing about the different contracts that are in place and how we don't have the ability to do this in an expedited fashion, in a coordinated fashion that this is going to be successful, and I guess my top concern as they say to safety I want to. I want to know that the parts of the esplanade that remain open aren't going to be in danger of imminent collapse. Clearly, it seems like five years between assessments is not going. It's not really cutting it. We need to how do we reassure the community that the esplanade is safe? I guess that's really. The bottom line is what I'm trying to get at and how are we going to feel confident that we can address not only the 76th street situation now, but others that are that we can possibly anticipate and deal with it sooner rather than waiting for a full collapse to take place. So there were a few items there and I'm going to try to address each of them. So first you talked about the idea of more permanent fencing, because some of these barricades can be moved. That is something that we've noted and we're actually trying to proceed with a separate contract for more permanent fencing to avoid that exact situation. That is something that you know, we've noted and we're trying to quickly proceed with a contract in order to put that in place and be able to install more permanent fencing where we are not able to mobilize a contractor as quickly as we'd like. So that is something that you know, we've noted and we're trying to address separately. I believe you noted the just overall concern over at the esplanade, and I do understand that you know we are trying to be as proactive as possible within reason. So this did fail between those five-year inspection cycles, and it is additionally was not labeled as a critical or serious item. It was more labeled as poor. The possible need for increased inspections. Things like that is something we're reviewing and possibly trying to initiate through talks with ubc and things like that. However, we don't have a final answer yet on how that will need to proceed. You know there are additional failures that clearly have happened here and that we, you know, would prefer obviously to address prior to failure, so we're trying to figure out the best solution for it all right. Thank you, of course, thank you b, goldenberg hi there it's barbara goldenberg. I am have been concerned for a number of years about the condition of the esplanade really above 96th street, particularly in the area leading up to the footbridge at 103rd street, and you know if you've walked over there. You see that it's kind of half fenced off so that most people are now pretty much walking on the grass there and I wanted to find out what the timing is for that repair, because there's clearly a tremendous amount of weakness in that area. And yes, obviously 76th street was a major failure. But I would I would predict that that's also going to happen somewhere during that, along that stretch leading up to the 103rd street footbridge and terence. I wonder if you could fill us in on that timing. I'm sorry and I believe it was my connection- that kind of dropped a little bit you're asking for around the 100th to 103rd street yeah north of 96th street, which has been in pretty bad shape for quite a long time and now is kind of semi fenced off, so that most of us are now walking on the grass. So I believe I do have gabrielle chernik on the line as well whom, if you could unmute in case she's our project manager here, unfortunately over at 1023rd, that's another location that we do not have included in phase two slash three. We do have those specific areas fenced off that we have concerns about, although currently we do not anticipate that spreading, we are keeping an eye on and have asked our parks employees in the area to notify us if they notice any expansion of that, and so we can possibly include that into phase two three. However, due to funding you know, we do have to try to prioritize what we are currently identifying as the worst areas, so those sites right now are 114 through 117 92nd to 93rd and I believe, 60 2nd to 63rd. Sorry, when I have the presentation up, I don't have my notes right in front of me so areas above 96th street are not included in any of these plans. The area 114 through 117th, which is currently, I believe, fully closed, is included in phase two slash three and additionally, I believe ninety second, ninety third, is also included. I'm just a clarified, that's nine. Ninety six and 103. 96 to 103 is not currently included. I'm trying to bring up my notes because there's clearly a lot of problems that are developing there and there's kind of you should forgive me kind of half-baked fencing. That's you know, kind of blown over and now everybody's kind of trying to walk around it, etc. I mean it's just it's not acceptable. I completely agree, and I did see a video of a lot of that range. Fencing kind of blown over, as you just noted, so that is why I think I previously noted that we are trying to put into place a more substantial fencing contract. Obviously, that is not a solution that we prefer. We prefer to do actual repairs. However, we are trying to utilize what we do have available to us to make safe the areas that we can and trying to put more substantial fencing in kind of like the one you see here, so that they don't blow over or not as easily removed, and so it's so the fact that it's practical there are areas that are practically closed off is sort of doesn't kind of push it up the priority list. I would not say that I'd say it does push up the priority list. However, we do also have full closures that are also something that we're trying to address. So I would hate to say that you know I don't want to prioritize anything. However, we are trying to prioritize from the inspections as best we can those areas that are labeled as serious or critical that we have the largest concern about failure: okay, rita. It's a shame that the esplanade on the east side is like a patchwork quilt that keeps unraveling and it looks like a patchwork quilt. I'm gonna share I'm channeling terry slater, who always use the west side as an example as to. Why is it working over there, and why is it not working over here, and somebody told me that when real estate developers developed on the west side that they contributed money to the riverside drive whatever that is called? Do we have any plans or anything in place to do the same on this side so that we could get this done in a in a more expedient manner and in larger portions than in inches? So there are multiple stakeholders trying to pursue various projects on the esplanade. I know a hospital for special surgeries is trying to do some top work and I believe this area is covered. Edc is trying to do some work at various locations, so you know. Unfortunately, you know you noted that patchwork approach, so it's not that everybody's, putting into one big pot that is then kind of drawn down through a single contract method, but it's more that, depending on the location, there are various stakeholders that are trying to keep up with the deterioration of the espionage. You know I do find what you're kind of saying, they're interesting, I'm not as familiar with the history on you know how the west side addressed that need, but that is interesting. Currently, we are basically utilizing our own fund, the parts funding that we've been allocated in order to address as much of it as possible, but, like I said there are some special separate, I should say projects that are occurring throughout the esplanade as well. Thank you, of course. Thank you, marco. Oh thank you. First, I'm not going to refer what you are proposing today, but I'm trying to see in a big scale and I'm going to say the following: the way in the you approach, the preservation and maintenance of the esplanade is unacceptable. That is not proactive should be when body it looks like is a cyclical state. All the reports should be available when the community were eight, it should be in the web, so many people can be aware of that. Well, another way issue you should, if you know the weakest part of the retention world are input, condition or in critical condition. It should be a signs on the esplanade. So, in the event like barbara said, let me quote this: couldn't be horrible, if a human being, you have an any accident on there, but if you put at least a signs in the weakest part or in a problematic part, that would prevent any absolutely serious problem, and my first complaint is: why is no available this report on the community ward 8, because that allows us to create a plan of how to tackle this problem. We have an opportunity to participate in the budget and then we can say well. We need money for these repairs. Money will come from that part, so money we week, that's the biggest priority without no money. You cannot do much. So it's our obligation, all fellow community members to fight for money to repair the espana and without money cannot do much and the other point is, you are checking you claiming that you check and be trying to be proactive. We need to know this kind of information. Personally myself, I would like to have a full assessment of the condition of the retention wall. Once we have the condition, then we can recommend something otherwise, every time or every month or every year, constantly you repair and it's damaged. One of the sections are usually damaged is near to the marine transit transfer station, constantly you repair and then it's sagging, so you're wasting money. Why? Because you don't repair properly, and the first thing that you have to tackle is the retention wall. Once you have the solute the problem fixed, then you can repair whatever you want. So this is a serious complaint that I'm putting to you, and I would like to have all the reports, especially the critical reports where actually the same. What is the condition of our retention wall and that determined exactly how money would we have to figure out how to obtain in the budget in the yearly budget? So this is the biggest concern that they have, and this is the way they should be doing. You are the expert and we have to listen everything that you're saying and follow if it's the technical part or need money for study, well, tell us, because we have to support what is what are you means? Then we can have a safe and sound esplanade. Even that is not an experiment by the way you can call whatever you want, but no it's for that. This is a joke to say 18 or 20 feet, road or pad called espana. This is anything but no esplanade. The esplanade is the upper west side. That is this panel for me and that's what I think my vision in that direction that I would like to see in their community, something like that. So in that direction, not only it will be affected the path or esplanade, whatever you want to put in the name, but they'll also put the in jeopardy the road, the fdr, because the erosion can undergo all the waste to the road, so the damage can be serious. So if we have a real diagnosis of the of the retention wall, then we can see exactly what are our problems and I'm figuring out how to fix. Now you come in with a project. Well, personally, myself. I cannot comment anything because whatever you do, you do the right thing in the in the middle of this emergency, but we cannot wait, is capping the problem and then fix. We have to be, like you say, proactive means actually is tackled where we have the problems. So that is my comments. Marco. Thank you very much for your comment. I'd like to make an observation. The me, the obvious item on the table tonight is a 76er repair. The right, the greater concern about the yes blind in total, is beyond the scope of this one meeting. I think we can confine ourselves to discussion of the 76th street repair. However, let me point out, as you probably are well aware, about eight or ten years, maybe 10 or 12 years ago, the east river task force was formed by councilwoman maloney and, at that time our state, our city, council, member, yeah, jessica, levin, jessica and they've been on a regular and they meet quarterly, with the department of parks to address the esplanade in cba. Obviously, what is needed now is a greater body than just board eight or bought eleven awards six. It should be the entire stretch along the east river, but let that's for another time I'd like to confine ourselves to this issue. Let's we should. We did recall this to the attention of the task force. Patricia did we I see abby damski is on the call tonight. Let us take a look. Alita tricia myself see how we can go forward in addressing a lot of these very concerning issues that we have that have to be addressed, but they're much greater than 76th street collapse. This may be the trigger, but we have to move beyond this. I have a couple of questions and then I'll resume. Let me finish. Let me finish before you continue. I think you're finished. It's okay! Go ahead, marco! I thought you were finished. I'm sorry yeah, it's! Okay! It's okay! The point is you're. Absolutely right. We have to deal exactly with this application. No doubt- and I agree with you, but the point is if we don't open for future conversations to on to request the parks to come in with a plan. Well, so at this time, probably is out of order. I agree with that, but the point is: I have to set the points for the future because we cannot continue like that. Yes, let's go talk about just only the this failure and, from my point of view, yes, I would like to recommend the approval. Thank you. Thank you. Barry. You have comments. I have comments, but I see he hasn't spoken yet and she's a member of the public. So if you'd like to speak barry you certainly can or we don't know let the member of the public speak. Please, oh indy, you just have to confirm you're, good wendy last call for wendy. We can't hear you chat me a few. Can you hear me? Yes, yeah? Okay, great, I wanted to thank thank you for the opportunity to let me speak and I wanted to synthesize some of the opinions that I've been hearing here. Barry and marco. I think that there's both a local problem and that there's a larger problem of understanding how impacted the under pilings are and the structural integrity underneath the esplanade fixing this portion of the esplanade without understanding what's happening to the north and the south and in fact, on the fdr drive, is going to be a waste of repair money which, as a taxpayer, I incredibly resent and also as a person who walks and who loves my neighbors. I don't want anybody else to be harmed. It is a miracle that no one fell through and that no one has been killed. We really need to look very much at the environmental impact. We need to involve the city's environmental protection agency and the state's department of environmental protection conservation. The east side of Manhattan is impacted more by the currents of the atlantic ocean than the west side is that's just a fact of nature, and we saw the impact of that when we had super storm sandy having an a routine inspection. 2005 is lovely having another one in 2018 is lovely, but super storm sandy was in 2012 and there should have been something at that moment or shortly thereafter, to look at what was happening. It's kind of a stitch in time saves nine. There could have been some repairs, some evidence of what was going on. Obviously, there was water damage and we need to have a procedure in place because there will be future storms. There will be future tidal risings. There are incredible effects we see in the city in terms of pollution over development, climate change and we need to involve our environmental protection agencies and to have a broader view, all the while we are protecting ourselves locally. Thank you so much for letting me speak great thanks, wendy barbara. I know you have your hand raised, but I'd like barry to go and then I'd like to say a few comments and then we'll go back for any second round of questions. Anybody has so very good. Thank you very much, terence for your presentation. A couple of questions timeline. When do you? Can you give us indication of staging of this project and when it is protected, projected to be completed and number two? The budget for the item? That's it sorry. I had muted myself, my son was in the room so and I was not able to unmute myself. Sorry, can you repeat that yes, certainly time and cost so currently, we are committing to opening this up prior to the end of 2020, we're expediting design, and things like that, and obviously there are concerns about any other field conditions that we may encounter. So beyond specific on that, I would not feel comfortable giving you something I didn't feel confident. So that's why we're indicating, currently, by the end of 2020, in relation to cost, we originally anticipated a max of about 750 000 for this site due to again field conditions. We do and to speak on it over on that I'd have to see the latest estimate on that, but I would be I'm anticipating about less than a million in order to perform this work. Terence, thank you very much. Thank you. I have a couple questions and then we'll go to barbara terence. What is your I don't know if you've presented to us before on this? What is your title at parks? Sure I am the director of engineering, okay and question about the asphalt that you're putting down. Is it expected to put back the hexagonal pavers when you do the full work in phase two phase three, or is that just saying, as is so, we will be putting back x block papers, as I kind of previously touched on. I believe this area is covered under the top side work. That hss is doing, however, I'm not sure if we would want them to touch the asphalt and we'd probably leave that work for the phase two slash three, however we'd have to. We still have to coordinate that portion, but for the time being I would anticipate asphalt there, but we would replace the hex block papers under some future contract mechanism. Sorry say that so we I'm sorry so asphalt is gonna, stay there until phase two phase three, and then you guys most likely. There is the possibility that maybe we utilize the hss contract, which is doing some of the partial top side replacement here to replace some of these. This asphalt area, but we still have to coordinate that and honestly, I'm not sure if I would feel comfortable performing work in this location until we do our final repair. So basically, my indication is, at the very latest phase, two slash three, with the slight possibility that we coordinate with hospital for special surgery to get the hexbox pavers at this location, replace sooner than that. Okay, what are you filling in the esplanade with when you fill it back in so there is going to be kind of along this fence line is where we will have basically precast concrete blocks to creating our new seawall, and then we are basically backfilling beyond that, and this is kind of this cross section talks about a little bit about very it's, oh because I didn't took it off full screen again sorry. So it's a very basic color coded item, but basically that green portion is that new wall, the from the precast blocks and then backfilling beyond that now I do know wendy previously had talked about dec requirements. Things like that. Just so you know all our work along the as1 does have to be permitted with dec. So we are. We have notified them regarding this work and we do our acting within the general permit for the city, oh and I get a thumbs up even and what is- and what is the say, I see here that you have it up there. It says repair of possible underwater damage. What is what is the state of repair for that utter wonder for that underwater portion of the sea wall. So, as I indicated, we have done some diving there and we can schedule additional dives. That's basically, that's part of the reason why we don't feel as comfortable with this contract doing that full scale repair, so that would be done under the east espinat phase, two three contract. Basically everything that you're, seeing in blue on the right hand side of this picture, that's what we would be addressing under phase two slash. Three was: isn't there, some so without fully repairing that bottom portion? Are we not putting people at risk walking on the esplanade when it's not going to be an actual full repair? So I will say that this being a very basic drawing, looks more treacherous than it is that these kind of thunderbolt alcohol lines go a little bit deeper. This was really just a placeholder for identifying some of the damage there. The reason that we're offsetting the wall is that we do feel comfortable with the foundation there, so we do feel comfortable with that location, creating a safe esplanade with that partial path. If we, I did not feel comfortable with it, we would not proceed with it and ultimately, you determined that, through the your investigation, that the reason why this collapsed in the first place in the first place was because of that sea wall and because of because maybe because of extra wear and tear from the wakes from the east river and that sort of thing is that what you determined was the was the cause of this escalated repair or a breakdown, so you're talking about escalated deterioration for going from that poor section to obviously a failure, so it's impossible to say with complete certainty. You know what caused this so in this case, one of the things that was noted in the poor identification on the 2018 report was that it was missing the fascia stone, so it's quite possible that the facial stone was actually helping hold back some of that sea wall and then, additionally and you're not going to see this was a section view just north of this area. Oh actually, so you see this little manhole, there's an outfall right here, dep outfall, so it looks like the existing condition. The field condition here was a little atypical than what we'd expect in the sense of it looks kind of like a concrete plug that was not necessarily properly joined to the rest of the wall and that might have exacerbated the situation here, which is unfortunate, and I one of the field conditions that you know was not readily apparent for an inspection. So we do feel that the missing face stones in combination with the additional wakes and the fact that this basically the wall there was not properly joined, all contributed to the fact that wall, then that concrete plug came out. There was, then, that soil and backfill washed away creating a unsupported span at that concrete. Once that was noted, that's when we closed down that area and obviously, very soon after that, the failure occurred, and you said that the money that came that came to fix this project came out of an exhibit that a contract that was about seawall repair, that was that was just going through what other areas were that were being funded through this contract. So this is a citywide retaining wall contract. I do not have the list right in front of me, but it's basically, you know part of not just the s100. Obviously, but parks owns quite a bit of land. We have retaining walls throughout the city that we inspect in accordance with DOB regulations that we're trying to keep up with and then also are just noted to us as places in disrepair. When we note one of those things, we try to perform the repairs under a larger citywide contract that we try to keep flexible so that we can mobilize if there is an urgent need. So there are a number of sites developed under it. Unfortunately, again since I have this up, I don't have the list right in front of me, but it's throughout the city, Bronx Brooklyn, Queens, Manhattan, staten, island, okay, great and my concern is with the full repairs going interface to phase three of the esplanade. Repairs is just that already we were, we were seeing other sites being bumped off that phase because of lack of adequate funding. So I'm here I'm worried that I guess with the addition of this site, which obviously needs it that another site is going to be bumped off that list and into some phase four which hasn't even been funded. Yet so I don't know if it's you or if it's gabby or somebody else who can talk about whether or not this the edition of this project is going to either take away another site from repairs from phase two phase three or reduce the level and quality of repair from, say, a full, replace a full repair to a partial repair. Gabby can correct me if my information is mistaken, but we do not currently anticipate this repair impacting the number of sites or the level of repair that we're, and we were originally anticipating for phase two slash three. I guess I just don't understand how that's possible so funding. I believe total for this one is about 100 million. As I noted, we anticipate the repair here being about a million, so it is kind of within our budget to include this section as well as the rest and, additionally, as I noted, this is being performed under the retaining wall contract. We do have a separate pot of money in order to repair retaining walls citywide if needed. We can tap into that in order to make sure that we do not impact phase two slash three. Okay. I had a another question about other sites and just the overall structure and safety in immediately after this happened. We obviously spoke with our elected officials, including congresswoman carolyn maloney, who indicated that her conversations with hunt with commissioner silver and with the end with engineers at the site had indicated that they didn't know the structural integrity of the fdr in some of the areas along the along the that were right up against the esplanade. So I'm wondering about, if you can speak to it, all any sort of safety concerns any sort of weakening of the ground beneath the fdr and if there's, if you guys, are looking into that at all sure. So when we were when this failed, we immediately also talked to city and state d.o.t, for this location inform them of our repair plan. So we have been in contact with them regarding it and they are in favor of how we're approaching this. Currently, they have notified us that, if that undermine did continue, they would have concerns regarding the fdr. One of the reasons that we did mobilize so quickly was in order to limit any further undermining at this specific location. Furthermore, I am not able to speak specifically to state or city d.o.t inspections, and things like that. However, it is my understanding that city that state d.o.t on behalf of city of ot, which I believe the fdr is under, but don't quote me on that. One is performing an inspection along this section going north to about the triboro bridge there and take a look at that to make sure that they feel comfortable or if they want to try to identify any possible undermining there. But again, I cannot speak for state or city d.o.t. They would have to comment on that directly. I guess this is just a final comment and I mean I'm really heartbroken by this. This is obviously a very important piece of open space for my for our community, but it's personally our park. It's the park that we go to all the time in the open space that we visit to see the state that it's going to be in, for I'm guessing at least two years is really disheartening. It I have a million comments about how it looks and how it feels and how in safety have both perceived safety and actual safety of that area. I think it's incredibly frustrating because again we knew about this. We've known about this we've known and I and in my mind I haven't heard anything that parks or otherwise has convinced me, otherwise that the reason why we keep seeing this is just because we're not getting enough funding and it's not the work, isn't being done fast enough and it's and I'm always I'm always hopeful, and I'm always on the side of thinking that of trusting in the experts on this. But I just don't see how we're not going to see more instances like this along the esplanade. Have you looked at 71st street that underneath the underneath, the underneath the benches? There is a growing sinkhole right on 71st street, which isn't on your, which is in the on the EDC report, we're getting pictures from sent to our board office of 96th street and that area with major crevices in the in the esplanade. It's it is truly terrifying, and I know that you guys are working very fast, but the fact that you're going to be opening this area by the by christmas is fine, but that's also going to be past the time when everybody's using it right. Now we have thousands of people who are using the waterfront all the time, they're relying on it to as their only way of commuting, mostly because of this pandemic. We see them there all the time and so to know that they're not going to have this open until christmas. It doesn't really do them all good, because by that point most of us will be inside and wait trying to wait this out until the springtime. So I mean I don't I'm at a loss for words here, and I just wish that we can get this that I wish that. I personally think that we should be looking at if this area was weakened by the influx of wakes from fairy use and from the east river use. Then I personally think that we should be looking at the entire esplanade again to see if there are other weakened areas because of ferry use, we're seeing that increase. We just increased our very in increased traffic last week or two weeks ago on the east river. So if this is, if that's the case, then I personally think that we should be looking at the entire esplanade again, particularly as we go into our storm season of fall. So I don't know if there's anything that you guys can talk to us about in terms of how you're making sure these other areas we've we're sending you locations as we see them as we see them come up, but you know it's. It just feels like there's an accident waiting to happen here, and I don't know I my personal thought is that it comes down to lack of funds and lack of, and this prolonged process that just cannot take any longer. I mean you guys are all supposed to be also supposed to be cutting budgets right like this is we are like in facing a budgetary cut across the board, so I just I I'm truly terrified about what this. What this ultimately means for this piece of open space. There was a lot to address there, so we have not been notified of any budget cut regarding our existing funding for the east forever esplanade. So we are consider currently anticipating proceeding with the projects that we had noted already. So I can't speak to any possible future funding and things like that, but the existing funding that we have in place is my understanding that it has not been reduced or cut. So we are proceeding with that. I do understand your thoughts and concerns regarding the esplanade we are trying to address items you know. I know wesley talked a bit about trying to put up fencing whenever we notice issues we try to send out engineers as quickly as possible. This is a older structure. We are trying to keep up with it as best we can. Obviously, more funding would always be helpful and it would allow us to provide either a more comprehensive repair or a more expanded repair. We are working within the budget that you know has been allocated to us and trying to use it as efficiently as possible in order to maintain the s bond, but you know obviously with values like this. That's something that's not acceptable and we're trying our best to keep up with it, but obviously items like this are still occurring and we do have to take a look at either increased inspections or a modified way of addressing it. I do understand that wes have you taken. Have you have you guys noted that 71st street right at the bridge, right at the foot of the pedestrian bridge, there's a number of mixing hexagons missing hexagonal papers underneath one of the benches I lost for you there, but I do say: did we note the single underneath the benches passes at 71st street? We do have that noted. Okay, yeah you're gonna be good. Thank you, barbara you're good to go barbara. Oh no, you're, not anymore! I keep clicking we keep clicking together. I agree with every negative, including what I said. I do want to say one thing: it frustrates me a little bit to hear after 11 12 years that we've been working very hard on it. I will just tell you that I remember about 12 years ago I went to carol maloney's office and I met with the deputy chief of staff, who was this enthusiastic woman and went on a walk with me to see what I was talking about with it. Her name is trisha shimamura by the way, and it was from there from her enthusiasm that we got carolyn to give the money. This has been worked on, and you know we're not talking about having a cake sale to fund it. We're. Obviously a million dollars is nothing we're talking about hundreds of millions of dollars. We have made a lot of progress, frustratingly slow, but we, it seems like every time somebody says we need a master plan, we're not the west side. This is not the west side, we're not going to be the west side. It's different, just like cautious park is not central park. This is for those of us that love, it absolutely love it. But if you look of what and in terms of funding, when you look at rockefeller that rockefeller did hss some of the other hospitals, you see the repairs that went on when we finally opened up by cultures park. It's beautiful and it's well done when it finally opens up. I don't mean to believe me. I agree with everything that was said in terms of you know how scared I am that something major is going to happen, but I do hope- and I what I am going to ask- will you do the same, shrubbery and benches, and all of that when this is finally done or is it just doing the repairs and not above one of the things we as a community bought for fought for? Originally they said they'll only do the underneath repairs and not care above, and we said you have to do the above also it has to end up looking beautiful and I'm just wondering if that will be the case now that we will end up with something that looks as beautiful as the one I mean. I think that area by gracie mansion is really lovely, as well as the rockefeller and those areas down there. Do you agree trisha yeah, so we do work with. If I can just say one other thing, I would love to take a walk with some members of the parks committee that I don't think really understands it. I'd love to take a walk and show the different areas if they want, because we tend to hear the same remarks that don't seem reality with what's going on and that's some of my frustration yeah understand. So we do work with landscape architects. Actually parks is one of the largest employee landscape architects. In order to take a look at that top side, work inclusion of benches shrubbery things like that. As you know, over by grazing mansion, which is just finished, does include things like that. That is also something that we'd include in on the multiple sites that we're undertaking under eastward spot phase, two slash three, and so we would take a look at that here. I don't believe at this exact location. There was a bench, but we would take a look at that and we would not just be looking at that bottom side work. I know this rendering currently shows asphalt. The purpose of that was in order to try to open up this through passage as quickly as possible, but one of the reasons we do want to come back is because we do want to do it correctly and right and in a as comprehensive method as possible. So, yes, we will be coming back and trying to address those items, we'll all be a lot older and hopefully we'll be able to walk it without masks when it finally happens, but it's very sad that this did happen and hope we trust the reports. Thank you. Thank you. Barry. I don't know I will defer to you on this. I would love to get parks to come back and do a report on the sea wall again and just to report on the straight, the structural integrity of the seawall before we hit winter, but I don't know if that's best in some sort of resolution, given I think we just we put on the agenda and we and partners cooperative they'll come back. We may want to broaden it a little bit, but you and I can discuss that treasure- there's a lot of items I mentioned that go beyond just the sea wall, but let's, let's put our heads together and let's try to have a robust discussion on the east river esplanade, including our including all the elected officials. Yeah craig go ahead. Okay, I'm just going to ask whether it's really necessary to wait another month to do that or if we want to just go ahead and pass a preliminary resolution asking for an immediate inspection to take place in light of what's transpired at 76th street, I'm very comfortable with that doesn't do we have a second, or does anybody want to discuss I'll? Second, it, marco, oh marco, just seconded. I think okay, so craig can you just say it one more time just for the clarity of the record sure, in light of the recent collapse at 76th street and the knowledge that the recent collapses within our community district have taken place between inspection periods, community board, eight requests an immediate inspection of the of whatever it's going to be the entire, the entire esplanade or esplanade within community district 8 to ensure that any emergencies are avoided before they occur. Any safety deficiencies are identified. Things of that nature. I guess yeah elita has her hand up will. Can you unmute her? Please thanks trisha. I completely agree with that. It's really dangerous to leave it on unexamined and I'm wondering if we could extend it to cover all of the east side of Manhattan as far up as the esplanade goes. If we have the jurisdiction to do that, because as long as we're hearing this and having a resolution, it makes sense to just cover everything and not an artificial, because it's the district, designation or border so yeah if everyone's okay, I definitely accept that as a friendly amendment, I mean we've heard from we heard from one of the attendees about north 96th street. I've experienced that recently as well. It clearly transcends community districts and it's an esplanade wide issue. I agree with that. Thank you. Marco has his hand up. I don't know if you kind of said other friendly amendment. I would like to put also that all the reports in the past that they did should be part of the of to be presented to the community, or so we can have a previous assessment, and then we have the final assessment. Thank you. I thank you, marco. I was gonna. Ask that somehow too. So that's great okay. Do I so we had a second. I saw from rita's hand, so all those in favor please either raise your hand or how about if you're, not in favor, raise your hand, I'm just going to make sure I see everybody. So I see rita, I see judy, I see irma, I see lowell, I see jack, I see brian. I see craig billy elizabeth rose elita, marco felice, tacoco laurie. I think that's it brian. I got brian gotcha. Okay, that's it! Thank you guys! Oh got it very next item. Okay, we call now on. Oh, I got irma and barbara, I'm sorry, barbara okay, should I move on? Yes, please, okay, what's happening will now give us a parks, update wes is the district manager in west? It's all yours! Thank you very and also I'd like to thank terrence. That was a great presentation, and I really appreciate him coming on tonight and giving that presentation to the community. I'd like to thank everybody from the community for being here tonight. Obviously I'll. Try to be brief. Just a few updates one being honey, locust honey locus is the design is completed. It's ready for bid. However, a lot of a lot of our projects that are out to bid are being weighted on held up currently by omb, so we're waiting on omb to put that out to bid st catharines is in the final stage. It's almost done with the design it's expected to be completed around november and would be ready to go out to bid at that point in time if omb allows it. 24 sycamore is in progress. It's approximately about 32 percent completed, they are aiming for a may, June completion of 2021. and then just so. As you know, too, a lot of things have been changing post well still in the pandemic, but since our shutdown, I guess- but we have now just recently- opened up our youth sports and approving permits for youth sports. We are approving some permits, mostly small volunteer projects and small gatherings, such as birthday parties and maybe some weddings and first amendment type events. We're not currently doing any kind of entertaining events or anything that might draw in larger people, but we are doing new sports at this time, so you'll be seeing groups playing back on the multi-purpose play areas and things of that nature, so we're moving forward in that area. A couple of things just with the districts at stanley, isaac's shops department, recently repaired all the lights. I had a report that the lights were out of stanley isaacs and really like to thank our guys at shops. They got right on it as soon as I let them know about it and they repaired it. My understanding that all the lights are working tonight we've ordered new signs for rupert park, specifically stating no dogs on the lawn areas or and keep out of unauthorized areas that mysteriously keep getting removed from the site. So we've ordered some more sites, more signs for that location and hopefully address for that. Obviously, too, our parks usage is up and we're trying to accommodate the usage with the less staff that we have we're. Looking forward to two staff that was pulled for the we didn't receive our seasonal staff this summer, but they did decide at the last minute to open up a couple pools. So we lost two staff to perform those duties at the pools and we should be getting them back next week. So we look forward to that, so we've just been trying to carry along and accomplish what we would normally do as best we can under these circumstances, which is been challenging with more people in the parks and with less people to do what we normally do with. That being said, is there any questions? See lynn cashman has her hand to visually. Raise trisha great thanks. Go ahead, lynn, hiley hi! I have there's a big major problem in the park by the conservatory water, the sailboat pond. Those bathrooms are not open because pended quotient has closed and, as I understand it, they were managing those bathrooms. As a result, people are using the woods to relieve themselves. I've seen this a number of times between 76 and the where the sailboats used to be rented. I understand that panda quotient has sold the property, they've sold the business, and I contact tried to contact the company that bought them to find out because there seems to be a discrepancy: who's responsible sen, the conservancy, doesn't seem to be responsible and this business went out a bit whatever anyway, it's a major problem, because the closest bathroom is the delacorte theater, but people are just using it as their bathroom. It's terrible and there's no place for anybody to use the facilities any facilities, whether it's possible to open up that bathroom. Well, let me get back to a couple of details on it because I'm not familiar with the area. I don't believe it's in my jurisdiction. So what was this at central park? Where was the location yeah? I couldn't hear you guys where the where the sailboats are rented and there's the restaurant. Was there the pandy right, quotidian and that's closed because they just sold that business right. So it sounds. It's a concession, I'm not familiar with it. It's not central park is actually a separate district. It does touch base on my area, but I don't do a small park, but I reminded me that two months ago, community board age street life committee and the full board approved the liquor license for that location. So, while the owner of the earlier, the previous owner, has departed, there's a new owner in place and we ought to be able to get in touch with that owner and have him reopen the the bathroom facilities we'll definitely look into it and we'll get back to you. Thank you, wes west, for the other bathrooms in central park that aren't attached to a concession. Do, does the parks department over like take care of them or does the conservancy take care of them? I I'll be honest. I don't I don't work inside of that area. I would typically say: if it's a you know, the parks department would open them, but in with the conservancy, I really don't want to give you a misinform you. So I can look into it and get back to but central park is a whole other area. That's managed by a you know. A different group. Well parks is involved. Don't get me wrong, but it's not me, so I don't have the right answers for you, okay, but I can find out and we'll get back to you. Okay, lynn, you had something else to say: yes, also the bathroom where the boathouse restaurant one for the public. That is not open either, so I don't know who's responsible for that. I do want to add a positive note, that of all the bathrooms that I visited in the park, they're all being very well taken care of and very clean, and you know so. I appreciate that because, as you said, central park is like I mean that's like our mountains, you know, and we need all that. So thank you very much for taking care. You got it we'll look into it and, like I say, central park is a unique park that is parks department. It's operated and managed by parks, department by central park department and in many cases as we what we call a concession as you guys are familiar with our concession operations, so it could be any one of those three and because I'm not familiar with that operation, I just don't want to give you misinformation. I do have a contact for there and I'll. I will send that information in and we'll get back to the board. Thank you. Thank you. I have just one more question for you. Wes the muslim volunteers of new york have had a really difficult time getting supplies for their park cleanup last month. They somebody from the parks department, was very kind and got them like little hoes and gloves, but what they really needed was rakes and larger tools to do the cleanup that stuff. As I understand it, is actually in the storage shed in ripper park, but they don't have a key to that storage shed. So is there a way that we can actually give muslim volunteers for new york and a key to that storage shed so that they can access those tools? They have another cleanup coming up in the fall, and I want to make sure that they don't have the same run into the same issues. We're working on some of those issues. I gotta, I gotta, take a look in there and make sure there's that there's only volunteer tools and there's actually quite a bit most of the projects that we've been doing with the groups are supposed to be small projects which shouldn't be requiring tools, but we are working, we're working on that and I'm also working with a partnership for parks to try to come up with some accommodations for the muslims volunteers for new yorkers at rupert. So we are working on that. Yes, okay, great! Thank you. I mean it's. You know the area I was one of the volunteers who were there. Rakes would have been super helpful, given the tree branches and everything else that were there, it was difficult to like make a real as big of an impact as we wanted to without those like. You know, rakes. Basically, I understand it and, as I say too, I mean we've kind of changed the whole operation and how we're doing this and everything that we're doing we're, trying to basically relearn what we're doing, because we're very short of staff and we're trying to do the volunteer events. But we don't we're not able to really commit our staff to delivering tools on any given day. I may only have at district 8, I may only have one or two drivers and that's the cougar, the entire district, so sites that are mobile sites. You know it's, it's very challenging to commit them to something that to be at a certain place at a certain time, because then we know we can't clean a certain area at a certain place at a certain time. No yeah. I understand that we are working on trying to overcome these issues and, as I say, we're kind of learning the problems as we go and we are addressing those problems and we'll get it we'll get it better and we'll get it smooth, worked out and smoothed out. We, I think rupert, does have the ability to it has tools there. It's just it's just working out the arrangements for that elizabeth rose has a question. Thank you, wes. Just following up on your comment a second ago about we typically don't have volunteers, do pro projects that require tools, given our fiscal constraints that I expect are going to last for a very long time. Why wouldn't we want to take advantage of using volunteer labor on larger projects and things that might require tools? I got to believe that those kinds of things can be organized. Yes, no, we definitely want to take advantage of volunteers and we need the volunteers. What I'm stating is the tools when we do like it's my park day and several large scale projects when we're talking. You know we're trying to do smaller scale projects and I'm not saying we don't use any tools, but that they shouldn't need as much tools and what we're trying to do is prevent. Typically, when we do large projects within my park day at several different locations, and it really ties up most of my staff collecting the tools from a storehouse, delivering the tools and picking the tools back up. So with that being said, if we were to do large volunteer projects, as I mentioned before, it will exhaust my drivers and our other locations that are not, that must be cleaned by mobile crews would not be serviced at all. So what and again it sounds like it's. The volume of locations that is a problem so making it more focused locations should help alleviate that. It does help that and that's why I say we are that these are things that we're learning as we're moving into this new process and we're trying to keep the project small, because, obviously we don't want large groups really for anything just for safety reasons, so we're trying to keep the minimize the projects where they don't require a lot of tools, but we are working some of these out we're trying to do it at locations where we can maybe put the tools there at our convenience and they could be on the ready stuff of that nature, but we're working through these things it's a little kind of a different way that we normally do it. So we're kind of relearning if you will, but we definitely do need and appreciate all the volunteers, work and all the projects and we've already done some projects that made a huge so we'll work these matters out as we move forward. Thank you. You're welcome brian hey, thanks wesley. I live on roosevelt island, so I was just curious. The parks here are, they ran by parks, department and riyak, or is it just reactors and just parks departments? It's a good! It's an interesting question. Now I'm not familiar with all the parks on roads about island because I'm sure there's several different types of parks. I mean, but I believe, if I'm not mistaken, I believe there are some new york city parks there and it's my understanding that it is operate, that those parks are maintained by Queens. I believe the same as the same process with the police department. So even though you're a part of Manhattan from an operational standpoint with sanitation parks, department, fire and police, you are serviced by Queens. So if there are new york city parks, that's the borough that would be taken care of and brian just so you know, and I hope that you would consider joining permanently our committee. We generally hold parks issues on roosevelt island as a joint issue between our committee and roosevelt and roosevelt island committee. So anything that comes up like seawall repairs or things like that they're normally held jointly between our two committees. Yeah I got, I got some questions, some things that comments about parks here, trisha that I'm gonna email you later yeah. Let's definitely talk. That sounds great. I would love that one more comment and then barry, I'm gonna pass this back to you. I just wanted to thank wes. So a lot of you probably. I hope you didn't hear about this, because we tried to act very quickly on it. But last sunday, during labor day, I was emailed a bunch of pictures of graffiti on carl schertz park around carl shirts park. All saying trump 2020. make America great again this spray painted everywhere and including on the cap bird playground repair signs on the bathrooms over there near the black lives matter. Memorial. It was, I don't know who did it, but it was probably around eight o'clock in the morning, and so I reached out to wes as long as wells, our elected officials, but asked told him that, basically, we needed to have this repaired immediately and by 10 o'clock they had taken down all the signs painted over it and nobody kind of brought anything further to us. I went over in the meantime and had put up brown paper over the area and had talked to a couple residents who were extremely disturbed by it, but I just really want to thank wes you and your team. You guys did an amazing job. It was so fast not only that, but they emailed us pictures of the work to make sure that it was done. It was just incredibly fast for a labor day weekend early sunday morning, frantic call from me, so I really do appreciate it, and I think I just really and truly we, if anything, I the neighbors, who had brought this to my attention, were shocked at how quickly the parks department responded to it and if for what it's worth, you kind of put in new trust in the parks department for a couple of neighbors living near 86th street. My second every commentation made. She called me and told me how, remarkably, the your reaction was so quickly and satisfactory. So thank you very much for all that effort. Thank you guys. I thank the crews and the staff I actually was out of town, so I kind of got a little late. I wish we could have got it sooner, but unfortunately, that this type of vandalism is some of the stuff that we're kind of more used to and experienced too especially, we've seen a definitely an uptick in it this year and I'm definitely specifically at carl schertz so, but our crews have done. These are some of the challenges that I say that we have to overcome as well as cleaning our parks and trying to get tools of volunteers and as well as fixing vandalism so with the higher usage and during an election year as well as many protests and other issues going on throughout this country. We see an uptick as well and some of the vandalism and our parks. So it's unfortunate and we have to utilize our resources to take care of this. But that's what we're here for and we're happy to do it, and that's why I say we really appreciate people reaching out to us, because the more information that I get the quicker I can dispatch crews and get them to address the issues. So the more eyes are out there. The better thank you great matt, and I suggest, rather than burden wes with all these phone calls call the community board office and relate it to will and will then get it off to a lesson in a timely fashion. Thank you shall I move on? Yes, please, okay, very quickly, some updates on past projects, as you know, with the tramway plaza the park at the tram, the tram the building has been gone to us because they're going to install new elevators, that's been going on for some time. Here's a report I got today from the folks at the roosevelt island operating corp, the other tram elevator project, was deemed an essential construction project during the new york pause. Since our last update the piling work, foundation, work, steel, erection and concrete deck pours are complete, we're currently working on welding clips. For the elevator mechanism, that's what I thought they were doing now and working on the electric and plumbing runs. Our next large move from visual perspective will be wrapping. The structure for fire barrier paint will begin installing the first elevator later in the fall. As of now, the project is expected to complete in spring 2021. Another update I spoke with will fisher of the economic development corp of the east, midtown greenway and andrew haswell green park. Phase. 2B is currently has good news for us on that. The project has restarted construction, they're working on a new schedule and update us as soon as they can. It's really great news. These are his words. Quite a few other projects are still on hold and trisha. I think you have so many regarding the cleanup and yep so muslim volunteers, as we said before, did a cleanup of rupert park in the summer. It was extremely a small group of volunteers just because of safety concerns, so there was 10 of us. We did the best we could to clean up the park, but we could have, I think, been more efficient. Had we had some rakes and rooms to actually pick up the material, but we filled about, I don't know 10 bags of garbage and general trees and shrubbery, and that sort of thing they're going to do another cleanup this fall and I think that they're going to be able to increase their number of volunteers. So I just wanted to encourage everybody to consider spending, and you know an hour of your time. Cleaning up ripper park- that's gonna happen, but we should also advocate for them just to have a key there. This they're the official stewards of ripper park, so they should have a key to the storage shed there. That has what they need to clean up the park. The other issue that very I'm sorry, I forgot what the other, what the other update was. No, I think we covered. We would have this park, which was covered by wes great. So that's really! Oh. The last thing is just that we, if you recall in july, I think that we had said that that we were going to talk about equity in our parks and making sure that we are doing everything we can to be to moving through our committee towards a more just and equitable city for all, and that includes open space and clean air, and so that is going to be a topic that barry and I given just how many updates we had tonight. We said that we're going to put it on for our october agenda. So look for looking forward to that conversation there I'm looking forward to seeing you all in october. Oh irma, I'm sorry, you had something a comment. Go ahead. Remember you just have to confirm. You want to be unmuted at the bottom of your screen. Muted irma should be bottom left hand corner there. You go. You got it irma, okay, all right now. I just wanted to find out when that's going to be held the muslim volunteers be fall. Is there an exact date or will they give us information? Oh, I should have had that date. I'm sorry, I don't have it in front of me and I'm pretty sure that they said it so I'll, just I'll just send it out to the committee members and we'll put it on the calendar. The community board calendar and email. Okay. Great thanks is that the final word trisha final for me: okay, good night, everyone stay well stay safe and we'll see you in october, good night, good night.",
        "summary": "I think that we're just going to jump right into the first The first presentation is that right, barry absolutely go ahead, I just actually well so in over the summer time, I'm sure you might have heard we have a lot of articles about it right at 70, 74th street six Thank, you all right, 76th street we had a major collapse of the waterfront It was about the size of a king-sized bed of a hole, we're very grateful to the parks department for acting quickly to rope it off.\nIf you hear any loud noises from my end, my wife is currently working on putting my 18 month old to bed, so hopefully he's a little quiet but glad to see that it is a family affair We did want to provide a update on that sinkhole and the seawall collapse over at east 76th street That was that it was occurred on july 20th Obviously, the collapse was beyond what we had originally anticipated, as you can see with that fallen fence in there and then barricades were put up beyond that, and actually we've, unfortunately had to close through passage to the north and south He did mobilize on august 20th and the first activities that he performed were excavating, that area to get out the debris and things like that.\nThis is looking north, and so we performed that field excavation and then also they put in security measures to stop any further loss of backfill, and that was important because, if that erosion continued to the west, that would also have risk to the fdr, which is right, Besides, the esplanade, this location and also we've been able to utilize our design consultants to perform underwater inspections during this time on the water side to identify some of the field conditions as related to the foundation there, and you can kind of see that a little bit on the left-hand picture.\nYou'll see that that's important here is simply is that, while we feel that we can open a 17-foot path before the end of the year as we priorly committed, we do not feel that we're going to be able to open that full 22-foot pathway and I'll scroll up for a second and that's this portion in green and then put up a new fence and then basically pave over this area.\nWe are in the final stages of design for east esplanade contracts, phase two and three and that's performing work up at 114 to 117th, I, believe 92nd and 94th and 62nd to 63rd We were going to now include this section in that contract and since that is a full estimate contract that is, we can perform that work on the water side, so we'll be able to mainly do this restoration without impact of the thoroughfare here We do hope to minimize any impact there.\nYou know we have been granted a certain amount of funding for the esplanade as a whole, and we felt that the best use of that was to try to make these larger site-specific contracts, because we do have those ongoing inspections in coordination with EDC, to try to identify these ahead of time.\nSo we are able to bring some trucks and station them there when we're doing the work without impacting the fdr too much, then I just have a third quick question and then a comment, I, don't believe, am I right, trish and barry that this was not next on the list that I know 104th street This is the second emergency in really just a few years that we've had I would not lean against the espionage.\nYou know right now we are trying to do those five years in inspections in order to identify these critical areas ahead of time.\nAll right, I am have been concerned for a number of years about the condition of the esplanade really above 96th street, particularly in the area leading up to the footbridge at 103rd street, and you know if you've walked over there.\nThat's also going to happen somewhere during that, along that stretch, leading up to the 103rd street footbridge and terence, that kind of dropped a little bit you're asking for around the 100th to 103rd street north of 96th street, which has been in pretty bad shape for quite a long time and now is kind of semi fenced off, so that most of us are now walking on the grass So I believe I do have gabrielle chernik on the line as well, whom, if you could unmute in case she's, our project manager here, unfortunately over at 1023rd We, do have those specific areas fenced off that we have concerns about.\nWe are trying to prioritize from the inspections as best we can those areas that are labeled as serious or critical that we have the largest concern about failure, okay, and why is it not working over here, and somebody told me that when real estate developers developed on the west side that they contributed money to the riverside drive, whatever that is called?\nWe are basically utilizing our own fund, the parts funding that we've been allocated in order to address as much of it as possible, but, That is not proactive should be when body it looks like is a cyclical state All. The reports should be available when the community were eight.\nThis may be the trigger, but we have to move beyond this We have to deal exactly with this application But the point is if we don't open for future conversations to on, to request the parks to come in with a plan Yes, let's go talk about just only the this failure and, from my point of view and she's, a member of the public So. If you'd like to speak barry, you certainly can, or we don't know let the member of the public speak.\nI think that there's both a local problem and that there's a larger problem of understanding how impacted the under pilings are and the structural integrity underneath the esplanade fixing this portion of the esplanade without understanding what's happening to the north and the south and in fact, on the fdr drive, is going to be a waste of repair money which, as a taxpayer, I incredibly resent and also as a person who walks and who loves my neighbors We, really need to look very much at the environmental impact.\nCan you repeat that yes, certainly time and cost so currently, we are committing to opening this up prior to the end of 2020, we're expediting design, and things like that, and obviously there are concerns about any other field conditions that we may encounter So. That's why we're indicating, currently by the end of 2020, in relation to cost.\nSo, in this case, one of the things that was noted in the poor identification on the 2018 report was that it was missing the fascia stone, so it's quite possible that the facial stone was actually helping hold back some of that sea wall and then, additionally and you're not going to see this was a section view just north of this area.\nThat's when we closed down that area and obviously, very soon after that, the failure occurred, and you said that the money that came that came to fix this project came out of an exhibit that a contract that was about seawall repair, that was that was just going through.\nI don't have the list right in front of me, but it's throughout the city, Bronx Brooklyn, Queens, Manhattan, staten, island, okay, great and my concern is with the full repairs going interface to phase three of the esplanade.\nWe obviously spoke with our elected officials, including congresswoman carolyn maloney, who indicated that her conversations with hunt with commissioner silver and with the end with engineers at the site had indicated that they didn't know the structural integrity of the fdr in some of the areas along the along the that were right up against the esplanade If you can speak to it, all any sort of safety concerns any sort of weakening of the ground beneath the fdr When we were when this failed, we immediately also talked to city and state dot, for this location inform them of our repair plan We have been in contact with them regarding it.\nOne is performing an inspection along this section going north to about the triboro bridge there and take a look at that to make sure that they feel comfortable or if they want to try to identify any possible undermining there.\nThis is obviously a very important piece of open space for my for our community, but it's personally our park It's the park that we go to all the time in the open space that we visit to see the state that it's going to be in for I'm guessing I have a million comments about how it looks and how it feels and how in safety have both perceived safety and actual safety of that area.\nWe're getting pictures from sent to our board office of 96th street and that area with major crevices in the in the esplanade and I know that you guys are working very fast, but the fact that you're going to be opening this area by the by christmas is fine, but that's also going to be past the time when everybody's using it right Now, we have thousands of people who are using the waterfront all the time, they're relying on it to as their only way of commuting, mostly because of this pandemic."
    }
}