{
    "YoutubeMetadata": {
        "author": "MCB12",
        "channelId": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
        "title": "Executive Committee Virtual June 2020 meeting",
        "publishDate": "2020-06-15",
        "shortDescription": ""
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "MCB12",
        "normalizedName": "Manhattan Community Board 12",
        "twitterName": "Manhattan CB12",
        "youtubeChannelName": "CB12M NYC",
        "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
        "twitterHandle": "@MANCB12",
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "Oh three two go ahead: okay, it may just a few seconds. We are about life 653, okay, we're now like good life 653 when I call the meeting to order, welcome each and every one of you guys who made it their business and the ultimate sacrifices to be here with us. I like to begin our made in said, trying to take a moment of silence on behalf of the current events, death of Floyd and tailoring Elena us to show our commitment to be solid, I already the reference to what we all agree, that we need with form and changes. So I'd like to take a moment of silence. I would add the two black men who just found home in California yeah, oh yeah, so let's just take a moment of silence: Thank You Wayne for updating us in not in such a jazz, dramatic piece of information. It's just! It's really mind-blowing the kind of stuff that's going on in my country in my report, I like to again in the same wavelength, continue to commend and congratulate those of us who have been directly participating in the march, and the protest is that I've personally, my health has allowed me to and I'm not gonna mention any names, but you guys know who they are I'll continue on, or you can't stop. We need to continue on until things get to a point in which there's some sort of equality and evenness police brutality manifests itself in different ways as you've. Seen in the news. That's one way, but they can also be used in a way in which it's subtle I could be used as an arm. It could be used as a force and it can be used against even people or by people who use their power to keep underserved communities as this one has been three years. So that's pretty much. My report is just basically to try and motivate us to continue on and just try and get the police department throughout the United States of America I just said, the need daily knows that the chief agreed to remove six hundred plainclothes officers from that force he's going to reallocate them to a different unit. That's not a significant reform, but is just a step in that direction. So that's pretty much my report so I've been easier. We're gonna follow with yours, Thank You mr. chair, always a pleasure reporting as the district manager. The first thing I'm very happy to inform is that once again in June, all the committee met real tually. So once again we did it all the committee's met virtually this month. Thank you. Everybody who participate in these efforts I need to also report that, as an announcer last month, I purchased new laptops for the office staff and for sewing from kid board members to support the ritual work. The telev working is the work of this new way to work from home, so we have new equipment to facilitate the transmission. You know all these coordination of these meetings, because the equipment that we have what is the little obsolete for these work, they have cameras, etc. So the staff and key board members are equipped with new laptops. I have received several complaints from all over the district regarding noise complaints is people hanging out late at night in key areas in the district, all over north is northwest. Southeast Southwest in the district people are calling the office like crazy, especially Monday morning I couldn't sleep last night people were hanging there, so what the weather is good is no restaurant open a place where people can go to hang out, they go to any corner and they blast music and they drink and they smoke and they smoke, hookah, settle, etc. The problem going on I've reported to the to the precincts I will follow up at the district service cavity meeting. Let's see what we can come to address this matter, because it's unprecedented, you know we have it in the summer, but this year is going out ahead and people are very upset. Finally, I am preparing for the end-of-the-year purchases. I already placed a few orders and I would like to ask to any committee chair if you have any need- or you have anything that you will like that I purchase for your operation- please let me know no later than tomorrow morning, because I need to be placing these orders this week in order to have all the transaction complete and paid before June 30th. This is the end of my report. Very I know you have questions regarding the IRT budget, but I deferred that with the Treasury report, we're gonna do that later. Thank you. God bless you all I have a question. Yes, what is the question and this might be more appropriate for an offline conversation with you and the treasurer, but I'm just curious, given that we have like a pretty substantial budget surplus, would it be appropriate for the community board to buy like a bunch of first of all it? We can get them gloves and masks for distributing in general to the public and also would it be appropriate to get sort of heavier Duty gloves, like you use when you're doing gardening or garbage pickups, some heavy-duty garbage bags and some of those trash grabbers. Since a number of people through my committee have expressed some interest in picking up garbage in the parks. I don't know. If we have a lot of leftover money, those are pretty inexpensive items. Does it make sense to spend money on that? Well, it's something that I will have to research, because we tried a few weeks ago. Try to do something, spend expenditure to give it away to the community and the advice was no. Let me let me look again because this seems to be like a different type of purpose and it's safety here. So let me preview. If it's okay, we'll let you know Liz, yes, the mayor's office actually gives a lot of PPE. If you submit a letter to them, I believe one of the partners I'm working with 40,000 Matt's for the mayor's office, so I believe, if you put together a proposal there, they're giving I know that they have a star called a stockpile of PPE. Okay, but I'm, also interested in like trash grab her garbage bags, but we'll talk okay, so she can give us a couple of no proposals and quotes from organization or places. We can probably have any intricate he'll take care of the aquatic part and they will so we can move forward, as you just said. Is there any questions? I'm posing? Is there any way that he'd come please because I'm using my phone that you can help us by taking the sack stacks I'm happy to take stacks? Yes, I've also been responding to a couple of light questions. Well, you'll do the Q&A and let also handle the sex Gerrard. Yes, oh good evening to thank companies, our first sending information last Friday. According to the crystal report, there's an estimated projected surplus and personal service of 44,000 569, 33 thousand for 37 and a otps. So, there's a there's a projected surplus of approximately seventy eight thousand dollars. So again, that's as Liz. No that's an awful lot of money to have there and I would just say, as I said at the beginning of the year fiscal year. This is something like starting in July. We should start to talk about. You know what would be a good use for projected surpluses even before we have them, but right now, it's seventy eight thousand dollars. Is there any way anything else that I'd like to share with us and I would nothing anything that do you feel sticks out on the Chrissa report that you guys prepared anything that you feel that can really be addressed differently or if they are your wife's opinion on I mean well I mean you know as a footnote again. This is I think earlier. Getting that report earlier is better in the new fiscal year to have some time to talk about it, but you know certainly on the budget Lebanese I would I would look at actual versus forecasted and I would refine the budget to more accurately represent the spend from fiscal year twenty, but those are only suggestions. This is a budget you will develop and should submit formally to this board. Okay, Lisa. Do you see any questions in the back of the Q&A hello, Liz yeah, but I can answer it type. It's a very specific question, all right great! So thank you Jared. This is a report. I do not have a report. Don't have a report so we're going to move forward with the reviewing of meeting items the review and approve actually just review of July in August September. Twenty two million calendars is there anything that you guys like to propose I believe that Fay was asking her committee whether she wanted to have or and meeting in July and fair. You wanna want to discuss that, or is there any other community committee chair that would like to have a meeting during July, except maybe for the licensing committee. I got a question. This is Domingo hey. My question is more around because I'm trying to work with there was a great email that Francisco one of our one of my committee members spoke on. Do we have to have formal? Do we like well, what would be the process because I want to work with he's, even I'm, being able to formalize a way of being able to identify and bring trainings to a lot of those small businesses here to start developing some sort of plan to be able to address racism in anti-blackness yeah? We are, let's assume when I had discussed yeah with the office of demanding Williams I think it is a great idea. Is your idea, of course, so there's something that I guess you see injuring yourself and I can probably in whoever else can please join us and you guys can lead the way as to you know. What can? How can we define it and input 13x of which I? Don't think that we need attendance per se because you're lying others are off you of months, it's more like planning yeah, unless you had a comment. I am so sorry because I'm doing it from my phone, so I think that summer is a particularly good time to have these kinds of meetings where we're doing informational sessions and we're not passing resolutions or conducting official business, but we're doing that thing that actually community boards do best, which is networking and brainstorming and getting in for pushing information out to the public. So I think that's a great idea. Attendance is not mandatory. Okay, this can't be required because by city charter we're not required to meet. Therefore we can't require our members to meet so any of your committee members who is not able to attend it's all good. It's always a good idea to have the weeks notice that our bylaws require not so much as a bylaws requirement, but who are we kidding if you don't? Let people know that you're having a thing it's hard for them to show up? You said you said a week Snowden the weeks notice list yeah. Typically, we, okay, you do seven to ten days, but you know you're gonna have a hard time getting people to show up. If you say, hey we're having a meeting tomorrow right, you know. That's just good planning, but I think that you don't need to be bound by it's the summer, it's the summer and we're not required to meet. That doesn't mean that we can't meet so okay doing that kind of stuff and working with Ysidro and our businesses. That's fantastic. Okay, I would encourage you to also reach out to darryl cochran who's, not on the call, but he works for the human, the New York City, Human, Rights Commission, so he's I'm, gonna guess he's gonna have a lot of information about. You, know, tools and information on sensitivity, training, diversity, training, he's probably got a lot of stuff. That would be helpful. All right thanks, that's great place, but I don't see him now. Okay and Holly Fisher has her hand raised and Mariella Graham who's. Also a board member would like to be involved in that initiative with you Domingo. So if somebody can bump Sal away, if somebody can America, we've got married, Sally, Fisher and Marielle Ellie I can't promote them to I, can't toggle them on to enable them to speak. Oh you could all right offline. Yes, so the main gay justjust just give out your number for those new members so that you become a person. So my phone number is nine one. Seven, eight, two, six zero, two: four, that's nine one! Seven, eight, two, six zero! Two four just feel free contact me and I'll, get back, see. Okay, then we'll talk later and Sally. Can she can't? Because you haven't extremely just bad difficulties, she could qqa her question. I'm, sorry - not being able to do much more, but I love her import. So it's important that she's yeah, but in addition generally, the executive committee is only participated in by the members of the executive committee, but you know we can accept additional stuff, but and Domingo I just want to let you know that what's happening in the chat is Mariela Graham in terms of a question now they just want to be a part of this initiative. So if you can also reach out to them, I said my number phone goes both ways all say: you texted me I, think you have a question regarding the calendar saying if you will yeah. Thank you good evening. Everyone- and thank you yes, but allow me to ask a question: yes, the pushing is about the calendar. I'd send an email to the to all my colleagues asking them whether or not they want us to have a meeting in July, which we have never done in the past, but considering also that this is not something that is mandated so here from then or heard from them. So I guess that I wanted to exclude the idea that we are going to have a meeting or if this is something that we can perhaps decided by tomorrow, or have to be decided today. No, you can decide by tomorrow and just light evidence or not, but they would just make sure that everyone gets updated in the information. Okay, thanks I just want to say the Asian Committee will be meeting in July and August. We made that decision on our last community. Okay, great news: are you just what which dates you having a specific time? Yeah are going to be the same. The same days of the month, some same time. First Tuesday 30 right and I sent an email, maybe an hour before the meeting began. So land use has no plans at this juncture to meet in July and certainly not August. However, what's not on the calendar is the new member orientation and from the emails that I've seen from you, Pepa knees, it looks like July night is shaping up to be the date of the new member orientation, so there should be no July committee meetings scheduled for the 9th and, moreover, every committee chair or assistant chair table should advise. You know their availability to represent the committee at that new member orientation. We need either the chair or the assistant chair, but we it's important to Ebenezer to put that on the calendar and all the officers well yeah, but I mean the point. Is it should be on the calendar and, as we are talking about scheduling meetings that typically do not occur in July they? Those meetings should not be scheduled to conflict with the new member orientation. Okay well noted, so that pretty much takes care of our next item on the agenda, which is the new board member orientation. So, as you said, it's tipping towards your line to ninth, so we're in formalized, hello, my backyard or a second doing it from my phone is incredibly difficult, but we're trying to get formalized July to ninth as the orientation date and time, we'll figure out the time, seven 6:30 or whatever, so that we can. All those who can assist are more than happy to more than welcome to come and join us. Is there anything else that we would like to add to the items on the agenda item number six. There are just sticking with the new member orientation for a minute. I also sent an email a few days ago concerning a document, but I am pretty certain we created in the past for a new member orientation that lists all of the committees and provides a synopsis. What each one does that document should exist and we should just be able to maybe clean it up a bit and have that available for this year's new member orientation, so I mean I boniva. Do you have that document? The sort to interject I would like for it? Oh it I saw it and it's part of the binder I know that the previous year had made some updates to it. I don't know if there's on a specific file, an electronic file to send you what I'll have a business or send you what we have and you can just work off of it and then we can kind of like customize it to person day in age, sounds good. Alright, yes, Sally I can't ask a question. The QA I just wanted to note the health and environment. It's also meeting in July, okay, great I, think that we're planning on meeting on July 9th though so well they shouldn't do that right. He had originally said July 2nd and then he changed it to July night. So, Evan easer. Can you please circle back with Steve to figure something out? Yes, I gotta I gotta chain anything mail to him now. Thank you, because I will replace him for this for this second and he sent an email that he want to be on day nine. So let me talk to him again. He responded to that by email. Yes, now, but now, Jesus date is conflicting with the new board member orientation way to find out. He need to find a new date for his meeting and he needs to be available for the new member orientation. Well, clearly he's available, not if he's conflicting with his own beat yes, okay, so we're gonna, move on guys to the committee chair reports, pay from what I see you're the first one. If you please it was a graduate sort of listening to your report. Thank you again. Well, yes, well. I'm gonna be very brief and turn of my report I wanted you to share with you, as many of you already had witness, or so you know in our meeting, our committee decided to have an informative discussion to learn about the experiences that many students, parents and community in general had or have been impacted with the you know, Kobe night in so we call up for a meeting in collaboration with the Department of Youth and Community Development, specifically with a committee which they called the neighborhood Advisory Committee. Well, I am also part of a committee. So what we wanted to intern and in collaboration, bring the conversation to inform the community. What has been the experience of folks in our district and, as you have probably noticed, we have parents, we have students providing their testimonies and we also were able to have the assistant commissioner Denise Smith, the superintendent for the school districts, Blanca Martinez with a retired principal. We also have Yvonne standing with the executive director for community League of the heights, and also we have Sharon Keane, who is a social worker at the Uptown, hop division of community and population at the previous student hospital. So all this fold came to enlighten us with that information and share what they are. The population that they serve has been their experiences, but also you know the situation within the in respect to the superintendent. What is the experience that many principal are experiencing with this pandemic? There will be more further elaboration of this discussion and the minutes that I'm going to present I also am preparing some kind of report for the Ebola. Besides the minutes, just in which I'm going to provide some reaction, that I had have personally throughout all this conversation that I have held so far with different. You know school leaders, my principals teachers and even parents as well, so you will have that report as well before you know, June ended and that respect this is this is my report and again you will see more of this. One thing that I wanted yes to also bring to your attention, is that I really wanted to I want to insist in expanding our relationship throughout the community and with other city agency, because I really consider very important for the kind of work that we do, that we continue are trying to engage in and building our relationship with many now besides, like oh I, hope I'm, not speaking to too loud, was I. Naturally, I speak to I pitch anyway. In addition, today, I wanted yes to briefly share with you. That is an urgent matter that I think it needs our attention, and this has to do with a proposal. Cut the internet and Wi-Fi to the students up will be taking summer classes and I personally feel very worried about that and I. Don't know if in this very moment, it's okay for me to call for a motion so I. Can we go into the debate and I can explain to you, or this is something that we can. You will allow me to bring at the end of this meeting so I. This is this is my report. This is my request as we're speaking Thank, You, Faye and offline, so that we can keep the flow of the meeting that conversation going. I am in the process of getting the contact person so that we can try and advocate and get that extension of that program throughout the summer, so I'm not just giving you may not be there knows that we want to hear, but at least we're getting navigating to the burocracy of our spectrum and how they have they operate. But again is really your initiative, so unless I get to that door that we need to open I'll get back to you so that we can. Thank you for question please before you leave, so you are saying tonight we're not going to consider any resolution for that matter. Right. We don't need a resolution, because the chair is pursuing the matter. What time no I want to meet. I wanted to be clear as to what he sustained it also I think you know, refrained from I mean continue the conversation. Thank you. Thank you for Wayne. If you will good evening so land use had you know two agenda items for June, one of which was consideration of the BSA application for the win community music charter school and the other was an update on the proposed West 158 Street row house district, historic district on the agenda item. As you know, the applicants initially met with land-use. In February we had a in-depth discussion of not only the land-use related matters, but also your the environmental impact statement, the traffic studies and referred the applicants to meet with the Health and Environment traffic and transportation and youth education committee, so that those committees could discuss in more detail. You know aspects that are directly related to their committee, but also at the time in February, the environmental and traffic reports were not yet finished, so we had some time the applicants met with those three committees in May and at the June land use committee meeting we got a you know, a update on those conversations actually the day before the Land Use Committee, meeting Department of Environmental Protection approved the their plan for acoustical attenuation and the environmental remediation plan is under review. Now the traffic portion of the environmental society has to be signed off by New York City do T. So after you know further discussion, the committee voted to approve the application, which is basically just an application to use the building for a school, but that resolution was subject to DEP s, approval of the remediation plan and do T's sign-off on the traffic component of that, we also recommended that the applicants continue to provide updates to Committees of the board as the project progresses and as operations are. You know slated to begin that they coordinate with you, know: local community-based organizations and schools and business organizations. You know just to I mean just to coordinate them as a new. You know community facility coming to the area at this juncture, occupancy of the building is slated for September 2022 concerning the West 158 street row house district and we've talked about that. A bit and landmarks has not been all that supportive of the issue with not great reasons, some of the new research that is interesting as we've looked at or the parties who are doing the research which include Vivienne Dukat, was on the committee and Matthew Spady, who was a neighborhood resident they've. You know looked at the architectural and you know historical importance from the perspective of New York City. What they have discovered in doing some more research is that row of you know row houses is you know an early example of you know black home ownership in Washington Heights, and what is more interesting is. It was happening at a time when redlining was still very much the order of the day, and so you know you had a few black homeowners who bought in that area and then it expanded to a point where a majority of the owners in that area were, in fact you know African Americans and that part of you know the row house. History really was not focused on, and it also adds another dimension to the argument. For you know, designation. There isn't one piece of information that was discussed before that's still hard to document, but a property owner prior to the development had a sugar refinery on the Hudson. He was an abolitionist and it's long been suspected that the refinery may have been used as part of the Underground Railroad. That is not something that has been able to be substantiated, but I would also point out that in Brooklyn there was one of the warehouses where it the interested parties were able to substantiate that warehouse was used as part of the Underground Railroad and landmark still was not interested. So the point is there: could there our continued efforts to promote this area for designation, and it's an area that is literally should have been included in the Audubon Park District, but was not and we'll see if the added information about the links to early you know, african-american homeownership in the area causes landmarks to be any further interested than they were before, but it was just an interesting additional bit of information about the area. To learn about information is a door, is raising his hand, see they don't so Wayne I wanted to ask you about this study made to ask for the building to be used as a school. Do you have any report as to well the main concerns about the traffic around the area and information on that yeah, the environmental impact statement included the traffic component and they met with traffic and transportation to review that part. Specifically, okay, you'll find tell us what the micro sensor should are weight off of traffic and densification to tell us our findings. Well, the interesting thing is the building is, and Deborah can probably go into more detail on the traffic transportation, because land use was really talking more about the land use and the building design aspects. But one of the things that is interesting is the building is currently used as a garage, so changing its use from a garage to a school actually reduces the number of trips generated at the site, so it lessens it doesn't increase the traffic impact. So I'm going to be some more question comments when they become single base. Yeah I'd be happy to address. Thank you any other questions to Wayne's presentation. No, not a questions all right, Steve Simon around not yet not yet. So then we'll move on Mary, Anderson, Miss Mary things! We've been talking about how to what we can do for the residents of Isabella they're, asking for magazines and spiritual reading books for the residents, both in English and Spanish. So I want to put that word out. If anybody has any of those kinds of books or magazines or come, you know and list your neighbors and friends to make a collection. If you can get them to this Bella or call me and I'll figure out how to get them up there, just when you take them to security, let security know that they're for Jessica Garcia. She is the director of the Recreation Department and let them know that they're from the community board. Okay, so that we can get credit where credit's to lose I, see your hand raised. You have a question yeah, that's a statement you might want to reach out to the new director of the mother, Cabrini shrine. She actually came to our parks and Cultural Affairs Committee meeting earlier in the month. They've got a new director and I know that they're doing some stuff with their gift shop seems to me that if you're looking particularly for Catholic spiritual materials, they probably have it in a bunch of languages, they might have some extra stuff I'll, send you and her an email of introduction. But you know we have a major Catholic shrine in our community and if they have extra reading materials, I'm sure she's happy to share. Yes, thank you for that. The Mary. Do you have a contact number for Jessica Garcia, the person that you just mentioned when I call her ahead of time? No, they can be taken just given to security or whatever and security will get them to her okay, because we can't take them directly to Jessica. Anyway, we have to leave them with security. It's crazy. The way, thank you are still concerned about. Not you know not having the ability to have the seniors in the community join our meetings, because the their lack of equipment and technical skills to be able to join the Xoom meetings, but it's not a whole lot. That I think we can do about that. Right now had discussion about things going on in the community for seniors talking about the cooling centers to be open, but then I understand subsequent to our meeting that there's a possibility that they're not going to open the schools and flux at the moment, they're providing air conditioners for low-income families or communities for those that do not have a working air, conditioner, functional air conditioner, starting with nights of buildings and they'll, be moving out from their concerns about long lines. At the stores and banks and post office and that sort of thing and seniors having difficulty waiting in lines, there are some stores and some stores I. Don't know that I, don't think post offices know, but there are some stores that have ours for seniors, but they're very early in the morning, which is really not terribly convenient for people that have difficulty getting up and getting dressed. You know ambulating them whatever I, don't know. If we can do you know much about this to try and coordinate efforts among these, the stores, Anna Sidra I was actually going to consult you on that to see if you had any thoughts or ideas. So I can contact you later on about this. You should also contact Domingo yeah. You know ideal to have a first line of communication with both of those guys and we can in our aid managers tree with it, so that even you know take it to the extent of maybe using some local social media guys to in the question to highest chamber of commerce also distributed so that they can get the message out that he can just be from nine to ten, which I think is usually the norm in a 9:00 a.m. to 10:00 a.m. they should do. One afternoon drive as well right, I already shoot me an email, some controller will shoot and up connect, yeah and then, after me will call on this. My only comment is it's true that you know you can't. If you don't know the equipment, you can't do zoom, except that, and this might be difficult for some seniors. Also they could do the thing the telephone way I mean they would have to enter a passcode or something like that, but at least they'd be able to talk and listen. So it's you know, they're not totally excluded, but again they maybe just because even that may be difficult for some individuals, but I thought I would offer that. Thank you, I think Jonathan can. If you have a list of those phone numbers that you have usually a lot of indications with. You can set it up, so he can do an email, not an email text, last kudos, a specific numbers and they can get distributed from that point forward. That's something that Jonathan can help you with I just want to say, there's a general impression that the elderly are up really early in the morning. So a lot of times, you'll have stores, with special senior hours at like 8 a.m. 9 a.m. and may be true for some elderly, but mostly elderly. That I know have a very hard time sort of regulating their sleep and they actually tend to have difficulty sleeping wake up. Late and senior hours need to be, as you say, a little later, possibly even in the afternoon. So that feels like a word that needs to get out to Domingo, who is decidedly not elderly to Ysidro. Who is also not elderly I'm? Getting there, though Liz I'm getting there and to Eliezer God willing, we'll all get there and Eliezer in his capacity as a contact on the chamber of commerce to just let business people know that the special senior hours should be at like 3 o'clock in the afternoon. We're sad I'm, not elderly, either, but I agree. Ok, so thank you for you, great iam, put Mary's or something else that you'd like to add or the ability to do so and the front end we still have drivers. I have been yet another experience of a driver, absolutely refusing to open the front door for me to get in the bus and I brought it up traffic and transportation meeting and also making the report because they have all the information about that driver. I even said to her. If you don't open the door, I will report you- and she said oh I had very you know thank seniors because city for disabled, mostly seniors really too, because some of the city bike classes that they're putting in are going to be on sidewalks and limit that limits. The path narrowing the path for seniors than for the disabled, with walkers and wheelchairs to be able to get by so it's places. Last but not least, we talked about our budget capital expense pension and with our expense budget, we decided we had a unanimous decision to put in to expand mental health services for seniors and light of this pandemic and all of the issues that are going on with it with losing people and people being very sick and all that kind of stuff. We decided to put that number one on our expense budget and keep the other items as they are, and also for the communities. That's the capital budget and the system-wide upgrading the area senior centers. We decided to just reverse that and make that number one on the priority list for the capital budget. Anybody have any other question. No one is raising our hand. So I guess not thank you. People that are not logged on to the meetings. I, don't know. If I have we haven't heard from them, I don't know how to list them. You know sometimes the sessions not being able to log on to the zoom. Sometimes yes, it would be listed as you'd start with listing them absent, and then anybody who wasn't at your meeting you should reach out to them and ask them you know what's going on and if the reason why they weren't there is because they were doing something else and it wasn't an excused reason than their absent. But if the reason is they were having technical difficulties and they couldn't get on that feels like excuse like. If you try and you couldn't get there I, don't think you should be it's not in our bylaws, but I just can't see penalizing people for having technical difficulties, so that would be okay. I have a couple of questions in the chat one member yeah, Siana Kistner wants to know. If it's possible to mail the books to Isabella I mean you could but it'd be expensive, but if I assume that if they were mailing them, they should mail them to Jessica Garcia at Ella's address, which is 505 Audubon Avenue one zero, four zero great yeah this. Just if you have any questions on that, let's just like keep them there and one of the staff can just send them to me meri or anyone else call me. You know also I'm sorry, but Mary did you reach out to Veronica Lu at word up seems no tirely possible that she might have some surplus reading material. Yep I will. Thank you, okay! Thank you! Housing and Human Services Arielle Miranda your report, please! Yes, hi! How are you doing good? Thank you great. So, first off I'll just run over a few of the items we discussed really went in a little bit more def in regards to creating a an actual resolution. This past month, focusing on the excluded worker, Relief Fund. More so now known as the billionaire mark-to-market Tax Act. It was essentially a bill that was introduced both in the assembly and also the Senate by both our Assemblymember Carmen de la Rosa. In addition to state senator jessica ramos, we were viewed a bit of different formation that was coming from different organizations in regards to how this is particularly I want to say this: the pandemic is affecting immigrants. We want to make sure that you know this resolution was specifically crafted, so is to acknowledge really the hardship that's being had right now in our community afterwards, we then reviewed the refugee safety net fund resolution. We spoke a bit more with our chair afterwards. We're moving this now forward, so as to make sure that we're also presenting you know a common stance with one of the formal organizations, the sanctuary coalition, that came forward a while back to try and really advocate to make sure that we're allocating part of our budgets that really protect immigrants more so now than we have prior so again, just want to thank everyone that had been helpful in trying to make sure that we got this moving forward and, lastly, I'll just say that we did discuss what has been two bills that was put forward by the City Council one has been passed. The other is really I, think a point of contention for a lot of individuals focusing on how it will impact the city- and you know, I'll, just leave it. There I think you should refer to the minutes coming soon enough and yeah. Thank you so very much again. Everyone have a great rest of your day and thank you, Aria for your through pinpointed, took point and your brevity really appreciate that Liz Ritter all your report. Yes, we have an extremely long but really productive. Meeting. I won't recap it for you here, because it was three and a half hours. Long I encourage you to read the minutes. When we have them, we learned we had a really wonderful roundtable of a lot of arts and cultural organizations and different things that people are still doing. We have a very vibrant arts community and it's really helping keep people alive. During this period we learned about a new art installation that will be going in a temporary public art installation that will be going into Fort Tryon Park on the Linden Terrace. It's a it's a nod to the sarcophagi, the that are in the cloisters, but it's of Margaret Corbin and the iconography instead of having like lions and shields such as you would see in a medieval sarcophagus. It has a tri-cornered hat and an eagle. So it really marries the rich American history of the Revolutionary War, with the sculpture that we're used to seeing in the cloisters it's just fantastic I'm, so excited we're not exactly sure when it'll be installed, because you know everything's kind of up in the air with COBIT, but it should be at some point we think over the summer or possibly fall. So that's really great look forward to that. We also had a very long conversation about barbecuing in our uptown parks. There was a long. There was a lot of concern that we were looking to expand barbecuing in Inwood Hill Park, specifically on the Indian Road lon. So if anybody heard that rumor I just want to be really that was never you know, the community board never had a secret plan to do that. We just wanted to have a public conversation about recognizing that many people like to have grilling. We want to be able to allow people to do it safely and we want to balance it with the other many parks uses, and particularly in these times, we want to make sure like how do we keep moving forward with a conversation about how different people who view what is or isn't, an appropriate use of parks figure out how to use those spaces together without weaponizing or criminalizing what is otherwise reasonable, behavior just because you maybe belong to different socio cultural demographic, ethnic groups. You know we can't be calling people for just having a picnic, for example, we've seen way too much of that. So it was a really lively conversation. We did wind up having a passing a resolution, I'm having a complete menopause moment and I forget what it's about I'm, so embarrassed right now, whatever it was, it was passed unanimously. Oh my god. What is wrong with me and we will be meeting again as I said next month, so that we can continue to have this conversation about parks usage, and there are a lot of enforcement issues that are all fairly obvious. I won't get into those. There are two upcoming events drums along the Hudson, which is usually one of our just best. Most wonderful events in Inwood Hill Park on the Gaelic fields is going virtual. I think it's going to be a great event. It's going to be Saturday, June 20th! That's this Saturday have an Easter. I will be sending you a flyer so that you could eat blast, that out, there's also on Sunday a children's BLM, Father's Day, March gathering and 172nd and amsterdam in front of Highbridge Park and then walking across 100 72nd Street and up Fort, Washington Avenue to J hood right, Park and then continuing up to 183rd and fort wash at Bennett Park and concluding at Margaret Corbin circle outside of Fort Tryon, Park I. Think it's really great that so many people have figured out constructive and forward-moving ways to integrate civil unrest. Civil protest in a way that is really civil and that really leverages our incredible wealth of parks. So we're really fortunate for that and yeah other than looking up. Very briefly what my resolution is: I'll come back to that and I think today. Thank you extremely happy to see that Highbridge Park was mentioned in the same sentence as other parks and that there are activities happening, that least near Highbridge Park. You know that I have a very strong advocate for every single one of our part had to draw had to say all of that, and it's all gonna bad parts and bein a mindful of one of our different social cultural differences in public safety. Mr. Carosi on your next now is it or have his hand up? You should know how to Z naught. Yep, sorry didn't see it ozzie just work. You know what you said: I commend you a list for bringing that up. I'm. Also happy that are you mention about criminalizing certain cultural issues that we my community and to me. We do hear these things from you, so I think the movie in the right way really appreciative. Thank you. I actually do want to tell a very short story. At our meeting we had several people who, while the meeting was going on we're complaining about particularly loud events on Indian Road lawn, and there was somebody from pet who was on the call. So there was some discussion around noise. There had also been some discussion around signage and whether there was it wasn't signage. So, at the conclusion of the meeting was about eleven o'clock. I walked up to Inwood Hill Park checked out. The signage took pictures of it, sent it to the parks department was able to respond to the people in the meeting to confirm that the signage was there while I was there, I did witness what was a fairly loud party on the lawn, which was finally concluding a little bit after midnight and I was balint trying to balance whether or not to say anything and I thought. You know what the last thing anybody needs is a white lady, rolling up to a group of people saying hey, you're, being a little too loud, so I was just gonna, let it go and then I saw that they had driven a vehicle up onto the Park Lawn. At this point, I thought alright, I really have to say something, and then I heard the clinking of glass and I realized that the reason why they had driven the vehicle onto the lawn was it was quarter after twelve and they wanted to make sure that they cleaned up properly and they needed light to do that. I watched them clean up the entire area and afterwards I went up to them and I said: hey man, you know happy birthday to whoever is the birthday person and thank you so much for doing a phenomenal job of cleaning up and he said to me well yeah. Nobody wants to see our garbage. Of course we cleaned up. This is everybody's Park and we have to all use it together and clean up after ourselves. So I mentioned this only as a way of saying that when we think we see what, when we see what we think we're seeing, we are often wrong and if we take the time to reach out to people to approach people in a non-threatening and friendly way, we can surprise ourselves with delightful conversations with new neighbors who can become friends. That's what I got. Thank you and I. Think one thing that's important to note. Liz is, and thank you it's the fact that a lot of people alias L in that meeting also spoke about there not being such big differences, but the lack of resources needed to be able to maintain cleanliness, because a lot of people are cleaning up. It's just that, there's not enough garbage space. The raccoons are go going into the garbage bags that are left in to the side and are spreading the garbage all over the park. So as we might assume that the mess was left there by- let's say somebody who was having a barbecue, it might have been that they left a bag and the animals the rodents, the raccoons just spread it all out because they open to the bag because of the lack of garbage cans. I remembered what my reso is: it's very uncontroversial, it's a reso in support of urban gardening and we had a fantastic presentation by the Washington Heights Inwood food council, and so we unanimously passed a resolution in support of trying to find more spaces that are appropriate for more of that activity. Thank You Liz such an interesting topic, Kurdish I'm, sure you've been sitting in the sidelines waiting for your time. I, don't think he is on good, is in their own, so Debbie thanks. So we have some big stuff going on in the travel and transportation world I'm gonna start with our meeting on June 1st. We received a presentation on the expansion in 2c b12 from citibike, see b12 is part of what they consider the Phase three expansion of the network, they've been at it for a few number of years already. Obviously so what we were presented was you know, brief presentation about city bike and the growth of the network and help and how the program works. You know daily subscriptions, yearly, subscriptions, etc, and then we were presented Matt. This presentation relates to the rollout in C b12 from 155th to 184th. The balance of our district will be presented, call it late winter next year, like so and then first spring 2021 implementation. So again this only went to west 184th street, and so I want to say a few things: one, the maps and what everything is publicly available. We distributed everything to the board. We will distribute it to the public. The maps seem to sort of indicate a recognition that it's hard to have Street stations versus sidewalk stations, because Street stations take parking spots, it's certainly more sidewalk stations than street stations. This is sort of a pre final plan and so from a process standpoint. What happens next is that well, one D-O-T is coming to the general meeting as well. - we've already been collecting feedback, both at the meeting and since the meeting from board members, which will be consolidated and I will forward to do tea at the end of the month. Members of the public. This we didn't have clarity on but I've since gotten clarity on so members of the public, don't have to go through CB 12. They can just go directly to do tea. I just need to clarify whether they have a general informational email available or if we're gonna be providing while Blackwood's and then so I will give that information to Ebenezer, because I think this is one that it's important to get the information out well before the meeting, because they will give the presentation as we received it in committee. However, they won't have time to go through the maps on a detailed basis, so they're up there available to the public, but they're not going to go through one by one by one in the way they did at the committee and I will also forward them minutes from our meeting as part of our response. So far, most of the discussion at the meeting and most of the diss comments since the meeting are first and foremost about a station that was proposed on West 157th off at the corner off the corner of Edward Morgan, it's a very hot spot. That's been the subject of a lot of conversation, so it just it's not feeling like that's one we can get behind. There's also been a decent amount of conversation about one on Cabrini. So, though, so far, those are the two that are getting a lot of comments and we'll certainly comprise you know. I could see already the more serious parts of our feedback other than that people felt like it was. You know we had some people say: oh, it should be more dense, I. Think a lot of us feel like let's see how the utilization goes etc. So again they will be at the general meeting making the presentation, because that so everybody can have the benefit of it. I think we had a question on the Q&A about when this is being implemented. This is for this summer's implementation. People should know that these stations are not like bolted in they're, not in a sort of very permanent way. If there was a significant problem with a particular station they're done in a way, that's not a big, it's not too dramatic to pull it out. If that's what needed to happen and again so we can also recirculate the information, the board and once again anybody that has any input board. Members should get it to me and I'll be doing the consolidation. So that's citibike. Next big thing is the 181st Street Bus way. So probably most people have seen the mayor's announcement that you know what had been a very long list subsequent to the 14th Street bus way of suggested bus ways in New, York City, all of a sudden became a very short list with 181st Street on it. So again, this was sort of out there from last November, but I think it was a little just with everything, with kovat and needing to it's just sort of the emphasis on buses and getting people moving, etc. We popped up in part because 181st Street is one of the more congested and high like the number of bus passengers. It's on all those bus lines like it's an enormous amount and way more than 14th Street. So but 181st Street, as we all know, is also really complicated, and this is something that D-O-T understands like it's. Not it's not as straight. None of these are straightforward. Ours is particularly not straightforward, so the plan now is one ours isn't going to happen over the summer. It is more of a fall thing, most likely, but the main what they are going to do and what they feel needs to happen is rather than come to TNT, come to the general etc. It's gonna be a community like elected officials, CB 12, the public small business owners, which are a big piece of this. You know again, if you think about Broadway between 180, first between Broadway and Amsterdam, so there's not a date for that. My sense is that it will maybe it would be over the summer, but you know that kind of like workshops, so that again all stakeholders, but they're kind of planning to do it in one like with all the different constituencies. So we had originally when this came out. We thought about all right: let's get them on the TNT agenda. We have the special meeting in July, but I think it best I mean there's nothing. That's just not the way it's going to go, although we may have. If we have more information about what this process and next process step is, then I'll have Lyle come and just speak to what the process that we can expect is going to be so I have you know, there's a series of and I know, Abin easier and you I have also spoken to do tea, but you know again of the many issues that are at play here. They are small business. They are the fact that this stretch sort of relates to two major highways and access to two major highways in the world's busiest bridge, and it also links to you know it's hard to sort of just take that strip without considering all the activity of bus turnarounds on 178 and 179, and that this board approved a resolution that related 278, but we, but that did not include 179 and maybe needs to it centrist. So this is a very big one and there is going to be and need to be a lot of public process around this, because there's not there's not a lot of easy answers on this one. So stay tuned on that and then just coming back to a cedras question about the traffic study that was part of this, the wind charter, school proposal and anybody. So this was two meetings ago for us so that the reason you haven't it feels probably a seizure and everybody you haven't heard that much about this is that there's sort of I guess there were there requirements in this application and the level of analysis that you do relates to the projected incremental volume and because the projected incremental volume of vehicular traffic related to this school was below 50. It was 40 six. They had only had to do what was called a level one analysis, and so the only thing that they had to do the level two analysis was pedestrian arrivals, because this school is a district six school in large part and because the school exists already. So they have this census from a number of grades. They know how many kids they can be a little more precise about the proposal so which is not to say the 46. We, you know I'm, not saying that's exactly what it's gonna be, but their projection has to be a little better than the average projection, because the school already exists so and because, as Wayne referred to, they did make this side point because it is replacing a parking garage that had a considerable amount of vehicular traffic. It kind of, even though that wasn't sort of a formal part of their analysis, he's like it's one thing to sort of again sort of feel like alright. This is gonna be somewhat manageable. In all cases, vehicles will not drop off on 181st because that's obviously not going to work, so they they'll drop off on the vehicles is okay. So we have questions about Ysidro, followed by domine. Go all right. Take those questions because I like to keep it as brief as possible, because let me get a second. Let me just put her into a frame. This is a very layered and complex issue that an answer, a simple answer is not just gonna satisfy the complexity that it requires this de story and the way that they're trying to you know roll that out. So if we can do an offline conversation, because this is it affects me, so I like to have a conversation about this, so he says I'm, sorry that I brought you up. Let's see what the questions are. First, yeah comment on city bike, one of the concerns that have brought when they would do the presentation that he was that it's all good we to have the environment awareness of premium new bikes to the heights. That is extremely porn. Critical, though, that they are not putting the equipment necessary for people who don't have credit cards to use semi flags, and that is something that for us, the community is critical, because not all of us have credit cards or debit cards. For that matter. That's something that you know. We should always push, because everyone needs to have access to the city bikes because I think are critical. Now when it comes to school, the wind school I really want to see some type of environmental assessment study me on. What's going to happen when it first goes to the combinational things here right further, you have a brawny hotel is going to open up on Amsterdam office tower retail space. There is going to be a value on the same premise. You have the firefighters right. Next to it, you have two new supermarkets that are going to come between 181st and 180th, another one to new supermarket right. You also have a brand new small shopping. Mall is going to come to. Broadway target is coming to one of the first and say: Nicholas gee-pole is going to come to one area and Broadway. So now we need to see because this community has been affected by one of the largest freight in asthma and diabetes rate that can be ultimately linked related to this traffic that is going on underneath our soil, which is 95 5 route. If this traffic is going to be out, we'll be out there first to all the areas that can create more traffic opposition to our neighborhood, that is something that we have to fight big time, because it's affecting our the health of our community. So when they come along, we really have to find out what's going on by creating the most way or one of you. First, we got to find out what's going to happen, because it might be good to some extent, but when we move our parking spot, our small businesses suffer, but that could be conversation that should have or should have been made with to a larger stage, because this cannot be a welcomed media assignment. This is going to influence our community, our community big time, and we need to have an upper forum to address all these issues. Domain goes degree. My issue is more around the bus, passageway or one thing to consider is the mess that the OT dated Dyckman with the bike lanes. So we have to be real, Kozik, cautious and really take into account the mess that was done on Dyckman so that they could that they so that we don't make the same mistake in 181st. Can you please lower your hands when you're done talking? Thank you. Anyone else that no one else but I would like to ask everyone to please use the raise hand function. Yes, thank you. Yes, it does I can see. It is on the lower right section of the participants. Okay, thank you. So I have there are a couple of clarifying questions from the public which I know we don't have a lot of public questions, but they're reasonable, clarifying questions that frankly, I had to so in no particular part main. Is there an estimated timeline for the installation of city bike, docks being added to the area? Was west 160 second street ever considered for city bike and how our D-O-T going to reach out to constituents about the bus lane on 181st Street before you answer that Debbie I meet, let me say something to you at least: let's just try and keep an order. This is the Executive Committee. This is not the general mirror which I'm sure you know, probably better than I do so if we can just move the process that for lack of transparency, so that way, I can get all the reports in on time. So, if you will, if you can answer that Debbie, yeah and I think most of these I've answered so again when I started. This is for summer, this summers, installation they're, not giving a specific date so I'm just saying this summer and knowing that we're not submitting our date to submit our stuff in is the end of the month. So does that mean they get started the next week after that? I don't know, but that's it - as I described. The busway process is not, it is gonna, be everybody all electeds see be twelve small businesses, general public workshops, etc. They don't have much information, but in a broad level. That's how I understand it. It's not because again, they're rolling out, you know, there's a list of five we're, not the first ones, and ours is more complicated, I dare say than the other ones. So and then, in terms of specific stations, I'll just refer people to will make the you know you can go to New York City gov to the D-O-T site on the bike share section and take a look about where stuff is exactly, and this was sort of a long process. But this is what you're seeing right now is just the pre-final plan. I did throw that link up into the chat, so people Hank you thank you. I have one tiny comment, I'm relative to what Domingo said. I think the effect of the bus way is going to be enormous as compared to whatever mess and I'm not saying they going to make a mess on 181st Street, but they don't. The effect is going to be 19 times worse than it would have was on indictment, so they really have to get it right and off the top of my head. I wish them luck. I cannot imagine how they're gonna do it, but they're very smart, so I wish them the best. Yes, no more questions from on mind Debbie for such an informative report Domingo. This is developing committee, chair yeah and thank you all for first for the report Debbie. So basically, we had a great meeting where we were. What I was trying to accomplish this past month was making sure that the committee understood the importance of CBA's, which are community benefits agreements we had Angela Fernandez esq, just basically give us a brief, understandably, a brief on what a CBA is understanding that you have all these different franchises and corporations coming into our community, such as chop target Chipotle. All these supermarkets cuz a community benefit agreement. What it does is it really helps lay out a foundation and legal foundation for us to be able to hold them accountable as to what are they're bringing to the community? Not that not just so they can make money, but also be able to say a document, a legal document that also has them sort of what I see there does in the licensing committee when he does stipulations and part of an example of a CBA. A CBA agreement is something as simple as hire local X percent of the money. Our profit is gonna, be donated to the community for this or we are committed to the community, so we will help develop community infrastructure by maintaining parks by cleaning up the streets, etc. So those were some simple CBA agreements that are moving forward as we are, as these folks are coming into our community. We have to be very cautious and we have to keep an eye open, but we also have to know elected officials are negotiating on behalf of the community so that we can know how to hold how to maintain accountability and transparency. After that we just engaged in a great dialogue. My assistant chair is Tonya Bonner. They came up with a great resolution that I'll be sending out to the office staff on Wednesday or when it comes to accountability and just the time so I'll be sharing that on Wednesday with everybody and just make sure that when it sent out just in case there are some final edits just make sure you paid the lookout for that. But, besides that, that's my report, I feel that understanding the importance of safeguarding our small businesses. We also have to inform ourselves on what type of resources with type of kids, but we could develop within our community to make sure that we safeguard it and that we use all the tools available to be able to just make sure that folks are not just pimping, our community and coming in here and taking advantage of it. Thank you. I have one technical comment relative to what Domingo said me I'm, just if I might yeah okay way back when in the old days and I do mean all days, community boards could actually negotiate CB eights themselves. They no longer can this whole involved process, which you've already indicated involves the electives, but we should certainly, you know, make our voices heard. That is my understanding. Yes correct! That's why I referenced the electives, but I feel like back to your point, or we should be able to maintain conversations. That's why I try to incorporate them into the meetings, and one of the suggestions that I'm going to be asking of them in September is for them to be able to provide CBA's, for instance, the target in 225th Falls it within this district. So we could start being aware of what is it that they're promising us and make sure that we have an understanding of that? Obviously, do we have any anyone raise hands? No and I would like to ask again please guys, even if you just have it Wayne has his hand up Wayne, yeah and just very quickly concerning the CPAs. What's really important is when there are, you know, developments that are getting public dollars, because in many cases that is the leverage, that's the means by which we could say that you're, not on your think, we're about to lose Wayne getting low course, and in exchange for that we, you know what kind of public assistance is being provided to you know. Various developments or Utah's coming in well lost the first half of what you said: I'm, sorry, the all I cannot that collision, please. Basically, what I said is we need to pay attention to when there are public dollars coming into projects, because that really becomes the leverage, the rationale toward the community board through elected officials, to provide and asked if I am building a building with my own money and with you know, a loan from Citibank and I'm, not getting any. You know tax, abatements or anything. You know that's a different situation that, if I'm getting a low-interest loan through the state- and you know other benefits through the city, though there are a lot of developments to get a fair amount of public assistance in their financing and are not really asked to give anything back. So I think need to be mindful of the financing of the public benefits, because that we can, then you know legitimately tie some kind of a community benefit. Ask too yeah and the reason use me I'm, responding to his question. This is my time all right, so could I speak yeah. Thank you. Go ahead, so I just wanted to make it back to the question around the CBA and thank you raised. You raised that Wayne. The reason behind it was that I was invited to a meeting that the congressman was holding with the tower hotel and I found a very Paulo mattock, a lot of the verbage that was being used in that meaning from the owners of this new development and I was interested in figuring out. What was it that they were promising, because when people start coming into spaces to communities talking about, we want to transform this the same way we did in the Meatpacking District I find that to be extremely problematic, and it's an extremely alarmed me. So that's the reason why I started looking into the CBA, because it seems that we have to save guard our communities from individuals we're just coming in here to be vultures. Steve Simon is next question. Well, it's more like a comment. I want to expand upon what Wayne said. The leverage we have to negotiate community benefits agreements is largely based on whether or not the developer needs a discretionary action from the community board. With respect with respect to the radio tower project on 181st and Amsterdam, when it came through the Land Use Committee, we did negotiate for some concessions. You know maybe not as many as we should have, but we did negotiate to some extent. We were able to negotiate for some concessions on the on the Baker field project when Columbia had to seek a discretionary action for the Campbell Sports Center. We negotiated for concessions on the Autobahn for projects from Columbia University, which has yet to be built and, of course, Adonis presumably are negotiated to get a series of concessions for in rezoning, so yeah I, don't know that you can just do it unless a target wants to voluntarily submit to it. But if target is just building something as of right, is they don't need to come to the community board? You really have no leverage to deal with them, but to extract anything from them, but so it's really largely contingent upon the and you and the restaurants and bars can enter in to enter into stipulations because they want to get the approval of our licensing committee and the board itself. So what there's leverage in that situation, but you can't just apply it's every single business coming into our community, but I think there's ways of being able to think about it. Strategically, though Steve, for instance I would say if there's a standard created where the Community Board does take position on business, it might not necessarily impact them at all. But if we say hey, this is a business that actually believes in its community and is willing to come in and be a good neighbor right. I think that speaks a lot for yourself as well, and yes, I understand that there are. There might not necessarily be any tax, abatements or any form of governmental subsidies, but this was not the case on 181st. They did receive no on the radio tower project. They received a discretionary zoning or Latino and there and therefore there was an opportunity for us to try to extract things from them. But if you want to appeal to the goodwill and of a business to say that they should work with the community and provide some benefits when they move in then great, we should try to do that. But understand that they could there's no particular leverage if they're doing stuff as of right, and it's not a question just of government subsidies, it's a question of land use approvals of Zoning bonuses or variances. That's what we've largely used! Okay! Thank you, sticker. Okay, next question is from Lee's, followed by Ysidro, okay and then ideal procedure. I'll wrap it up after the last question time, so easy choice. Next, okay, I'm going to post a question to our custom clarity or some comments or recommendations from the floor on licensing, and this is relevant to the main goose's our report. Is it legal okay to ask for stipulation, perhaps if we are to ask new clients or new merchants to hire local or would that be just a recommendation as a good neighbor to you know it's a good way of doing business Wayne? Perhaps you can answer a question ah well, that is that is not a land-use matter, but I will tell you from the 20 years that I was doing Community and Economic Development. We would often ask you, know businesses, you know what are their plans for hiring and to stress the need for local residents to get jobs and in many cases, to offer to connect them with. You know, you know eligible 12 for employment opportunities. So that's something where we're saying we can be a benefit to you. You're gonna need employees if your employees live nearby. That may be a benefit for you for a number of reasons, so it depends on how you approach it. If you approach it from, we have something of value to offer you as opposed to well you're a business you're coming in, and we don't like you because you're a business if we're gonna slap you over the head. So how do you build a relationship? I we think it's the question. Okay, thank you. All right, I think you know sorry. This is time go ahead, but I also think that remember, a part of part of evolution is always to understand that the process is forever evolving. So that means that it might have not necessarily been the norm before, but the times also dictate what type of new norm we could put forth and I felt like as far as the societal awakening that we're seeing now I think it's about creating processes that are transformative and actually engaged our community and make sure that we safeguard our community because I'm assuming as communities community board members, we were looking to be able to make sure that we're at the at the interest of our community and not at those of those elected officials who get voted into office and have their own interest. So I think it's important for us to note that we have to be able to set up new standards if those were in the standards before please have a question yeah. Just very briefly: I have a clarifying question for a seed row that I texted you if you could just take a look at your phone. Thank you. Okay. So before we move on to Janet Sid Rowse and his last report, I think it is important as Domingo, and he should report that said that we are instead of gatekeepers. We should be safeguards of our community I like to just point that out in Ysidro a question for you Eli concerning the new licenses that are going to come in July and August. What are going to do us as a board? What do you think we should do to entertain those licenses if we're going to entertain them? There's a session that would have to pretty much be made by the executive committee as far as signing off on any potential July business license committee and I think or we can, as he's been historically done, which is to wait until September and have two meetings and that's pretty much something. That will be your call if you want to continue down with the same path but as far as I'm concerned. I would do that meeting in July and pass those March resolutions that were not able to pass and I think the as being new applications that have been coming up down the pipeline for the past couple of weeks after you had your meeting. So by the time we get to September, the problem would be a good 40 applications. So that's something that way you can see that we should consider it, and thank you see there for bringing that up. I think I, wish you consider sometime in the summer, because to leave 40 something applications for September, that's going to take seven hours and it's something that we would not be manageable, particularly important to have meetings virtually, because that's going to add up a green number of questions that should be asked and would take a long time so I'm looking forward to see if we can address this question in the summer time because I think is critical and because this is our time, this time restrictive, we have to go random opinion to that cell, a sometimes within 30 days. So I hope that you know that be the case. The second question that I have is concerning the minutes and there were solutions that were passed by the resident committee March. Are we going to paint them now or later meaning like for this? You know for meaning to be ported on or for later on. Is that a question for me or is it okay? For me? I would say we need to have at least just like all the committee's a July and a special July meeting to look at those licenses, at least just to make sure that they pass something that we can do virtually it's not going to take a lot of time of appointing other times so I think that's something that we that we should do and I strongly suggest that we can just do an especial meeting just to pass those resolutions. Okay, I have a question: Eli I, in my view, I mean I. Don't think it's fair for the applicants to wait for March if it isn't on that. Yet I think that the community board should vote on that in this month in June and not wait until July, because by the time they'd be able being put on the agenda for the SLA. That may take a little bit of time, so we are looking for sidewalk cafe and they need the license and so forth. I think we should process those in June. That's my view. If that's the committee, then I will I finish it up right in with resolutions now, I have to work already in the madniks, so I see if I can get them before Friday, even instant ones, then by Friday. So let me see if I can work on the resolutions and the minutes for March and also the resolutions which I'm. Having said that, going to my report, this past Wednesday June 10th, we had a licenses, two of which, when you one was for restaurant wine was which are always trying to account to 187 and FeliCa license coming to 10th Avenue. Then we have some corporate change, applications well withdrawn and the reservoir we knew was. There were no major issue 34 pieces of the return. I would be sure to have the resolutions ready when we come for general board meeting whooping up for any questions. Now please have a question. Yeah just I want to echo what OC had said. You know it's unfortunate that for a variety of reasons we weren't able to get to your March resolutions in March, so we should clearly address them at our earliest convenience. We've had meetings where we've had was 35 licensing rezo's. So if you've got you know eight or something from last week, and then it was really only what like a half a dozen or eight that you're talking about from March. That doesn't feel like a whole lot of business. So I think that we kind of owe it to these businesses to move sooner rather than later, all righty Thank You Liz any oszi. Do we have any other questions? They don't want any other raise hands. Yeah, it's eat, roll or the. Are you saying that the SLA has not acted on any of those applications that your committee considered in March? Not because we have not submitted a resolution yeah, but they don't know they don't always wait for our resolution, so they go ahead and act on them anyway, and that's why I agree with our list and because recommendations they're going to act right, the car lives of our opinion and it's good to have I. You know pinion in the matter that way, we can always have some leverage on yeah I'm just concerned whether or not these resolutions in our mood so I just want to add and I raised my hand for the that the SLA will sometimes call the office and ask for resolutions if they don't have it. If they office did not send the resolutions, so there is a great chance that those applicants who probably did not submit yet I did not ask to be entertained by the SLA. Therefore, the SLA did not ask the office for resolutions so that that's a possibility yeah, but maybe we should check to find out true and ysidro. If I could comment on the discussion about the about the employees, would there be room on your reform - when you're requesting how many employees are in a particular establishment how many of them might be a local residence? Maybe that's one way to start sending the message that we would encourage them to hire local residents, so you say Steve perhaps to do like what percentage of the workforce might be local well in numbers, because I think you asked for the actual number of employees if they have 16 employees. You know how many of the sixteen or local residents I think that's one way, I think we could start to say in it that that's what we're interested in I cannot have the staff and but I going to consult with that committee first and have the staff I change the questionnaire to address that matter. Thank you, okay. Jenny. Can you hear me? Yes, we can hear you lie or you could hear me you could end it perfectly. Yes, all right! So let me switch from my big. Can I still give my committee report, we can hear you hold on. Can you hear me? Oh no yeah, yes, okay, good Steve would like to go back to you or a report. Since we missed you when he was your chance will right. Why can't I lower my hand? It's okay, you! It's fine! What a freaking head! Okay as of today, according to the City Department of Health 870, a residents of Washington Heights NN, would have perished in the cove in nineteen and emic. That's of a that's of a total of twenty-two thousand 124 citywide. That includes both the confirmed and probable deaths as I've been reporting in the last few meetings. The zip code, with the highest rate of cases, is a zip code 40, which is gone up a few notches on the overall list. It is now the 79th, the worst a zip code in New, York, City and of 177, so I mean our zip codes are somewhere in the middle of the lot, we're not in the well. By no means are we the worst, but we're also not the best and the code again with the highest number of cases, and the highest number of deaths is actually a zip code. 32, which is at the 81, which is the 81 81st worst zip code 33, is a 90 worst and there's a code. 34 is the hundred 27th, the worst out of 177 zip codes. I said well last committee meeting: we also had a presentation from Metro Plus. This is the first time we've heard from them. This is a health plan that provides Medicaid, Medicare, child health plus other insurance plans to fill eiated with Health and Hospitals the city hospital system so also affiliated with Mount Sinai, and why you it does not have a has not been able to negotiate a contract with a New York Presbyterian, so it does not have a relationship with our major local hospital. Your presbyterian did report to us at a number of kovat to patients is continuing to decline dramatically, although they still have not provided us with any specific numbers. I I'm working on a getting those numbers so through a alternative means, let's say the Baker field. Hospital is no longer in use, but it is not being dismantled in the event of a second waved that may occur in the fall and the hospital is offering you two were businesses and others in the community the floor. Details that indicate social distancing. You can pace them on the floor in any store or agency to keep people 6 feet apart. Our next meeting I understand now: I have to change the date of the meeting. I had lined up a presentation from Columbia University Medical Center on its new outpatient disc plans for a new outpatient mental health initiative. So we'll do that. Maybe we'll do that July 16th or some other date in July. Thank you. I have a question Steve. Yes, I heard from my neighbor that worked at the psychiatric unit at Allen that they are not coming back to Allen. Well, I tell you this is this is driving me nuts because they moved the psych unit out of allen without really bothering to tell us or I, don't know who they may have told, and you know you know, I'd appointed in the Cobra 19 crisis, where they were desperate for beds. They moved out not just the psych unit, also maternity beds and some other beds, and but the psych unit was completely moved out to her the gray square and every time I asked the hospital to commit to the fact that they're gonna return the psych unit once the Covid-19 19 crisis is over I get mumbo jumbo I, don't get a clear answer and I don't know how they can circumvent the State Health Department of Mental Health Department process to just eliminate the beds and do it through this. You know I, don't see how they can get away with doing this I think they have to bring the beds back, but they're, not they're, not publicly committing to doing so. I've tried to suggest to the elected officials that they need to. They need to pursue this issue and I. Don't know that anyone's taking me up on it all right. Ysidro have a question followed by Sally quick comment: Aarthi, we received all those social business thing because, and they have done wonders for some urgent a bit really grateful to the hospital. I still have some here, I put on the social media here this Mary and some I just have come by to pick out to pick them up so really great for the hospital just to come. Okay, good, that's good to hear but I. My understanding is, they may have a they may still have more to give out. So don't be shy about asking for more of them if you can, if you can get them distributed. Okay, thank you all right, Natalie! You have a question. I, don't know how can I allow Sally has a question so Jonathan can you can just toggle her mute button off where's a host the Natalie can use? Can we start with Natalie and then give me a second, please Sally has a question I'd like to wrap it up with Sally and then have Natalie give her a report. Okay, I have a question. Sally has I'm, not sure know the other thing we discuss with you Sally. If you hear us you're breaking up, we can hear you I didn't hear anything after my name all right. Well, we're not going anywhere at least for the next couple of minutes, so not only okay. The other thing that we discussed is using some of the not unspent community board enhancement initiative sponsons, depending on which report you look at it's either 17 or 23 thousand dollars left in that account to pilot mass distribution in certain locations in community board district 12, and so that was one of the things we're going to discuss tonight. I assumed you know, III came in late to this meeting. I assumed that it had already been discussed under the treasurer's report has not been discussed. It wasn't discussed so we can get around to that and we have a question from Lees, followed by Katherine yeah. If you could just repeat that phone number Steve, do you have a question I'm sorry, I did I give out a phone number which phone number wait. Somebody had a question about a phone number and the question is now gone, never mind, okay, so anyone else has the questions before I move on Natalie. Did someone want Julio cick phone number? Maybe to get those details I can I can give up that from novices I think they were talking about Steve the number 412, how many people passed away from CB twelve? That was the number they were. Oh, the end of 870 h7 Oh. So are we gonna address the use of those funds? Yes, we're gonna get we're gonna address those Gerrard, just a quick question: Eleazar yeah we discussed earlier in the meeting. I didn't Domingo specifically say in response to a related question that the city has or the city is distributing a fair amount of PPE and unity board spends money on it. Shouldn't we tap into what's available through the city. I. Think that's one of the things that the lingo mission in the beginners correct. The difference would be having dispensers in certain locations like yeah. But the point is we should find out what is available any tributed before we spend money I, just yeah I. Believe the mayor has said that he has two million masks to distribute to businesses and others in the city. That's what I said. All you have to do is send a letter to City Hall I got previously stated and as for the amount and what your distribution is gonna be, and somebody from the mayor's office will contact you and that you know how much you could get right and the question is having dispensing machines so that we don't have to have people dispensing them should be asked: okay, hey Sally! Thank you! I'm! Sorry, Ysidro has a question - yeah just quickly on businesses, we mean in a bid, and anyone say this and license not forget you guys confused, but I said bed. We were signed to be the Student Center for face covering. So if you have any business that we mas, please send them over to the bed. We have over 30,000 masks that we can dispute to businesses. So please, your friends and about thank you, sorry and my point Ysidro is this- is for the street distributing them to residents because, as everybody knows, from Scotts English report, we have the fourth highest number of essential workers in Community Board district 12. But this is for businesses I know. So the ask is for residents, which is a different ask: Thank You, Sally Jonathan, you have in report or no basically I just want I. Just have one recommendation for you guys. Please encourage your committee members to subscribe to the channel, because I haven't still same people asking for some links of previous meetings to do by you know, to write or to listen again, basically, just encourage and to subscribe to the to the channel, which is NYC, em, semi, 12m, NYC and if its own, on Facebook page is my C cynical family yeah. They all have it because this information is tight on all bottom of emails in the in the photos of each email. They can see this information right. So my point is: if someone were to send an email to everyone and point out that if they scroll down- and they see those links- that's you know that's available to them to do exactly right, though the good remind them right. It's a great point. So don't like direct people to the bottom of the page. They look down. Yeah, look just look down, I guess an IRA mr. Ulman Richard reach our Oldman omit yourself, yeah I. Will it took 15 seconds? A lot of report should report to different categories. A number of board members have asked me just for general community information and what's happening Pride season in our community, and the answer this year really is very little. Some of that scan, Demick driven some of that's organizational budget driven and with pride, I'd say it's also because an awful lot of our folks are working on the other issues that are emerging at this moment in calling around the usual so calling and emailing to the usual sources of events. Finding one electeds aren't planning anything at this point. They often do some of the better parties this time of year. In the neighborhood, one is still talking about it, but hasn't been done. Anything specific, the neighborhood institutions and the Medical Center and individuals that play leadership roles really aren't doing that much this year. The one the two events that I did want to call people's attention to in what artworks is including some films and their quarantine, Film Festival, and we will have a flyer later this week from an event that our new board colleague angel Vasquez, is putting together with friends a virtual as own virtual brunch. This Sunday focusing on issues, particularly in the Lenox LGBTQ community, on our panel, followed by a zoom DJ event from 1:00 to 5:00. There will be a flyer out later this week and either angel or I will try to get it into the community board networks task force itself. I've been talking with some of the individuals who either have been part of it or want to be in looking at what we can do in a summer like this for an end-of-summer event, whether this of it is we've got through this summer in spring or whether it takes another tone. But those discussions are going on at this point and while I don't see a July, Executive Committee meeting, your report to I will stay in touch with LA, consistent discussions we had earlier this year. Thank you, Richard Hosey is there. Anyone has any questions. Eve followed by Sally, yeah Richard I want to know why you're not jumping up and down celebrating the two shocking decisions today by the US Supreme Court. We discussed that are the best answer. I can come up with. Steve is because I knew you would other than that. It's not true. I actually just stayed the trick. Those are just incredibly important decisions and how and what Evers name it came through Neil Gorsuch, don't know. Lizard mentioned done. Some mention of that earlier and I just stayed focused on community board stuff a little bit because I there haven't been a lot of those reports. Incredibly important Steve and thanks for the exclamation point. Okay, thank you. I thought. I was gonna. Ask him about all those posters. He has hanging in the back. I guess does his decks or something that I would have to explain. The office at home situation looks salient, we'll skip that it looks pretty good to me. Actually I think you've explained it further explanation needed Sally. Yes, my question was follow-up to Jonathan. Have we made any progress on combining the two Facebook accounts, because the one that's been existing for a while, as we talked about last month, has a lot more members, and second I noticed that some of the videos are not on the YouTube channel, like our last Health and Environment meeting, it is on the Facebook channel, but is there a way to load it, so our YouTube channel has all the videos. Well. If there is any video that I upload on Facebook or YouTube, we are going to figure that out, I mean I. Can ask every nice her to send it to me. So I can upload it so because we have backup of all videos and all meetings on the cloud so who can anytime gallery and upload it to any of our social networks regarding the unification or marriage between legal education, the new one we haven't worked there right because there are different ways of do this to achieve this, and I have to have to talk a meet with Alicia to address this marriage. You know: if we have this information on hands, we will share with you guys pretty much Natalie been waiting. Hello and I wanted to respond real quickly to Steve. Simon Gail will be writing a letter regarding the site beds at Allen. I will consult with you in the next day or two with the draft, so that you can. Let me know if you have any suggestions of what should be added there, but this is very important and whatever our state electives are doing behind this one for sure is great, but sometimes you've got to publicly shame folks to get them to respond. If people, if you all, have been following Gale Brewer and lost- maybe oh so you saw that she spent the weekend traveling around the borough, handing out masks to these large public gatherings and speaking to them. So in case anybody forgot that code bit thing is still a thing and warm weather didn't make it go away, as some people may have said, and we also want to make sure that as far as the public gatherings, there are two different things operating. So we're disgusting in this state of New York about some places during this thing called phase two about expanding liquor, consumption and you know food consumption outside of the premises. But this city is not yet in Phase. Two. This city is still in the very first week of phase one, and so we wanted to make sure that local businesses understand that there's a difference between the allowances for to go liquor and the allowances that may be made in Phase two for slightly off premises, outdoor consumption. So remember that we have the State Liquor Authority, but we still have meaningful open container laws and what I would hate to see happen is for some future licensing committee meeting people to roll up and point fingers and say well, there were people on the sidewalk in front of your place consuming because you know merchants was doing what they thought they were allowed to do by handing out a to-go cup. So, let's make sure folks are educated about that and to that end, Community Board twelve is one of our co-hosts for a reopening Town Hall taking place next Monday. The 22nd at 6:00 p.m. this had started out of an idea that we had to have a Town Hall about disparities in the enforcement of submission, distancing and regulations in Uptown communities of color. But we have expanded it also to include some conversation about disparities in healthcare and then the concerns about businesses and a surge in addictions. So we will be having this on Monday. The four uptown boards, 9 10, 11 and 12- are all co-hosts with Manhattan borough president. Well, the flyer should be out tomorrow and eleazar has been in the planning meetings for that email just went out today to Ilyas our, as we were at this meeting, to collect questions from the board to submit to the panelists for that which the final list of panelists is still information, but we want to make sure that we have folks from Consumer Affairs and the health department, small business services, possibly the nightlife office. We're working on that. So please, you know, submit to Ilyas are submitted to my office questions that you might have and stay tuned for that. I also wanted to say that tomorrow, at 2 p.m. the Manhattan borough historian, Rob Schneider will be hosting a webinar on oral histories of the pandemic. People are, were, you know, are wondering how they're going to document these experiences and public history from the ground up is certainly the way that they should be memorialized, so please tune in all of the links to register, for these events are in gales, update and I will just I celebrate with all human beings. The great human rights victories today at the Supreme Court, as always contact me. If you have questions. Thank you. Domingo have a question. I want to say thank thanks to Gil Brewer for the letter that you send the Commissioner of Parks. My biggest concern at the moment is this. Is this regard that we have for our youth? At this particular moment, the basketball rims have been removed from parks, making it further more difficult for them to engage in activities that keep them out of harm's way and I'm really starting to get concerned, seeing them just roaming the streets without much to do which, in the current police state that we're in we know that could potentially lead to something potentially happening. So I'm just concerned Natalie and want to figure out what's the status on the commissioner's response, because we need to figure something out for parts and we do need to engage our kids outdoors, so I know, camps are opening up. June 29th the governor was real clear about that. So what is parks and the city doing to be able to step up and figure out how we're going to engage our youth ISM know that that's a great question I am not aware of our response from the commissioner, yet I would I will send it to you if I see it on my way and I'll follow up with Jessica our chief of staff tomorrow about that. But please do if you cannot attend this Town Hall on Monday, send you know the questions that we should be asking, because that definitely is a major part of the issue. So we all know that, in the absence of a basketball hoop in a park, you know, kids are gonna, get together on a crowded, sidewalk and shoot hoops through the fire escape ladder, because where else they're gonna go right and so in a sense removing that hoop didn't actually protect them from that. So we. So we have to think in these really practical terms. I think and again. The over policing concern is a major one for us all. So I hope that we can touch on that in this town hall. But you know this is gonna. Take a lot of ongoing conversations, but I will look to close the loop on that letter. For you, le's have a question: yeah - one is among the things that we spoke about at Great Lengths at our committee meeting. Was you know the need to get some additional guidance from the commissioner on just that matter, so we are working that conversation through the committee as well. Our minutes will reflect that. I didn't want you to think that we were asleep at the watch and didn't discuss that and weigh in heavily on the importance for all of the reasons you described dinner with dog runs and Natalie. Can you just tell me what time is that is that thing tomorrow with Gail and Rob 2 p.m. 2 p.m. fantastic thanks, so much very good Eli. We have no more questions. I. Think we've completed an excellent bra bingo. Can you lower your hand, I, think with computer and the neck silat right of information, I think that we've all be now better informed and educated on issues that, because of a lot of reasons, we cannot assist all of our virtual meetings, but I think that we all have a lot of work ahead of us in each one of the responsibilities that we have I'm Leah. Sorry I had one more thing: it's really important if I may, if I mean I, just wanted to say that I did notice at one meeting that I was at that there was an attempted zoom bombing. There was somebody pretending to be working on behalf of zoom and asking for permission to be promoted to a host to be able to have access to the participants, and it looks all very official like many of these phishing things do so, please anybody who is working as a host in these meetings be aware of those just ignore them, don't respond to them and certainly don't give anybody a host status. Who you don't know, the minutes will not reflect how incredibly well attended our meeting was and what I'm hearing from my other chairs, but no one has actually mentioned and I think it's important to say. I had like I, don't know: 65 70 people at my meeting. There are a lot of things about zoom that are kind of difficult and I, don't love, but the fact that people can come very easily attend, listen to a meeting, throw up a question in the chat, raise their hand and speak I was really concerned and skeptical when we first started this like virtual thing, maybe it's just because I'm old, but it's been pretty remarkable in the best possible way how this has really enhanced participation. So when we get back to a time of being able to meet in person, I really want to be able to preserve some elements of this, so that people who can't easily attend a meeting can still participate in a meeting and can still consume the information in real time, because I think it's been a huge benefit. Thank you for your comments. I think there's a letter that just from Miguel's office to the governor's office in reference to when open meeting law resume that there's some sort of hybrid, as far as the mean is will go, will continue to take place in the future in which there will be a combination of whoever can assist will be able to vote online. So there's conversations as to how democratic disagreed the process really is in which we all continue to be. Our voices are unheard and encountered for so would much further to say. I would like to adjourn this meeting and thank you all for being here. Okay, we have a second right, an excellent night. Thank you and ebenezer I'm gonna send those Flyers. So if you can, please you or Paulo. Send them out would be great thanks. So much good night, everybody.",
        "summary": "I would add the two black men who just found home in California In my report, I like to again in the same wavelength, continue to commend and congratulate those of us who have been directly participating in the march, and the protest is that I've personally, my health has allowed me to We need to continue on until things get to a point in which there's some sort of equality and evenness police brutality manifests itself in different ways as you've.\nVery I know you have questions regarding the IRT budget, but I deferred that with the Treasury report, we're gonna do that later What is the question, and this might be more appropriate for an offline conversation with you and the treasurer, but I'm just curious, given that we have like a pretty substantial budget surplus, would it be appropriate for the community board to buy like a bunch of first of all, it?\nI believe one of the partners I'm working with 40,000 Matt's for the mayor's office, so I believe, if you put together a proposal there, they're giving I know that they have a star called a stockpile of PPE Okay, but I'm also interested in like trash grab her garbage bags, but we'll talk okay, so she can give us a couple of no proposals and quotes from organization or places Yes, oh good evening, to thank companies, our first sending information last Friday According to the crystal report.\nMy question is more around because I'm trying to work with there was a great email that Francisco one of our one of my committee members spoke on even I'm, being able to formalize a way of being able to identify and bring trainings to a lot of those small businesses here to start developing some sort of plan to be able to address racism in anti-blackness with the office of demanding Williams , so I think that summer is a particularly good time to have these kinds of meetings where we're doing informational sessions and we're not passing resolutions or conducting official business.\nTwo four just feel free contact me It's important that she's yeah, but in addition generally, the executive committee is only participated in by the members of the executive committee, but you know we can accept additional stuff, but and Domingo I just want to let you know that what's happening in the chat is Mariela Graham in terms of a question now We made that decision on our last community However.\nI'm gonna be very brief and turn of my report I wanted you to share with you, as many of you already had witness, or so you know in our meeting, our committee decided to have an informative discussion to learn about the experiences that many students, parents and community in general had or have been impacted with the you know, Kobe night in so we call up for a meeting in collaboration with the Department of Youth and Community Development, specifically with a committee which they called the neighborhood Advisory Committee Well I am also part of a committee What we wanted to intern and in collaboration, bring the conversation to inform the community.\nReally wanted to I want to insist in expanding our relationship throughout the community and with other city agency, because I really consider very important for the kind of work that we do, that we continue are trying to engage in and building our relationship with many now besides, like Cut the internet and Wi-Fi to the students up will be taking summer classes so I Can, we go into the debate This is my report.\nYou know aspects that are directly related to their committee, but also at the time in February, the environmental and traffic reports were not yet finished, so we had some time the applicants met with those three committees in May and at the June land use committee meeting we got a Now. The traffic portion of the environmental society has to be signed off by New York City do T The committee voted to approve the application, which is basically just an application to use the building for a school, but that resolution was subject to DEP s, approval of the remediation plan and do T's sign-off on the traffic component of that.\nWe also recommended that the applicants continue to provide updates to Committees of the board as the project progresses and as operations are know: local, community-based organizations and schools and business organizations.\nRight now had discussion about things going on in the community for seniors talking about the cooling centers to be open, but then I understand subsequent to our meeting that there's a possibility that they're not going to open the schools and flux at the moment, they're providing air conditioners for low-income families or communities for those that do not have a working air, conditioner, functional air conditioner, starting with nights of buildings, At the stores and banks and post office, and that sort of thing and seniors having difficulty waiting in lines.\nWe did wind up having a passing a resolution What is wrong with me and we will be meeting again as I said next month, so that we can continue to have this conversation about parks usage, and there are a lot of enforcement issues that are all fairly obvious: It's really great that so many people have figured out constructive and forward-moving ways to integrate civil unrest.\nIt is more of a fall thing, most likely, but It's gonna be a community like elected officials, CB 12, the public small business owners, which are a big piece of this You , know again, if you think about Broadway between 180, first between Broadway and Amsterdam, so there's not a date for that.\nMaybe it would be over the summer, but you know that kind of like workshops, so that again all stakeholders, but they're kind of planning to do it in one like with all the different constituencies , We thought about all right:: let's get them on the TNT agenda, That's, just not the way it's going to go, although we may have They are small business They are the fact that this stretch sort of relates to two major highways and access to two major highways in the world's busiest bridge, and it also links to you know it's hard to sort of just take that strip without considering all the activity of bus turnarounds on 178 and 179, and that this board approved a resolution that related 278 but So. This is a very big one and there is going to be and need to be a lot of public process around this, because there's not and then just coming back to a cedras question about the traffic study that was part of this, the wind charter, school proposal and anybody sort of I.\nThe wind school I really want to see some type of environmental assessment study me on What's going to happen when it first goes to the combinational things here right further , you have a brawny hotel is going to open up on Amsterdam office tower retail space Broadway target is coming to one of the first and say: Nicholas gee-pole is going to come to one area and Broadway Now we need to see because this community has been affected by one of the largest freight in asthma and diabetes rate that can be ultimately linked related to this traffic that is going on underneath our soil, which is 95 5 route If. This traffic is going to be out, we'll be out there first to all the areas that can create more traffic opposition to our neighborhood.\nThey came up with a great resolution that I'll be sending out to the office staff on Wednesday or when it comes to accountability and just the time so I'll be sharing that on Wednesday with everybody and just make sure that when it sent out just in case there are some final edits just make sure you paid the lookout for that Besides that, that's my report, I feel that understanding the importance of safeguarding our small businesses We also have to inform ourselves on what type of resources with type of kids, but we could develop within our community to make sure that we safeguard it and that we use all the tools available to be able to just make sure that folks are not just pimping our community and coming in here and taking advantage of it What's really important is when there are.\nWhat I said is we need to pay attention to when there are public dollars coming into projects, because that really becomes the leverage, the rationale toward the community board through elected officials, to provide and asked if I am building a building with my own money and with you know, a loan from Citibank You know, that's a different situation that, if I'm getting a low-interest loan through the state-- and you know other benefits through the city, though there are a lot of developments to get a fair amount of public assistance in their financing and are not really asked to give anything back.\nThe reason behind it was that I was invited to a meeting that the congressman was holding with the tower hotel What was it that they were promising, because when people start coming into spaces to communities talking about, we want to transform this.\nWell, you're a business you're coming in and we don't like you because you're a business if we're gonna slap you over the head , I think it's about creating processes that are transformative and actually engaged our community and make sure that we safeguard our community because I'm assuming as communities community board members, we were looking to be able to make sure that we're at the at the interest of our community and not at those of those elected officials who get voted into office and have their own interest.\nWe should be safeguards of our community I like to just point that out in Ysidro a question for you Eli concerning the new licenses that are going to come in July and August There's a session that would have to pretty much be made by the executive committee as far as signing off on any potential July business license.\nWe had a licenses, two of which, when you one was for restaurant wine was which are always trying to account to 187 and FeliCa license coming to 10th Avenue You know it's unfortunate that, for a variety of reasons we weren't able to get to your March resolutions in March That doesn't feel like a whole lot of business Are. You saying that the SLA has not acted on any of those applications that your committee considered in March?\nAll you have to do is send a letter to City Hall I got previously stated and as for the amount and what your distribution is gonna be, and somebody from the mayor's office will contact you and that you know how much you could get right and the question is having dispensing machines so that we don't have to have people dispensing them.\nSorry and my point Ysidro is this-- is for the street distributing them to residents because, as everybody knows, from Scotts English report, we have the fourth highest number of essential workers in Community Board district 12 You have in report Please encourage your committee members to subscribe to the channel, because I haven't still same people asking for some links of previous meetings to do by you know to write or to listen again.\nI've been talking with some of the individuals who either have been part of it or want to be in looking at what we can do in a summer like this for an end-of-summer event, whether this of it is we've got through this summer in spring or whether it takes another tone Those discussions are going on at this point and while I don't see a July, Executive Committee meeting, your report to I will stay in touch with LA, consistent discussions."
    }
}