{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB6",
            "channelId": "https://www.youtube.com/channel/UCEXyH78eAd9JcCWmmI8GLzg",
            "title": "Manhattan Community Board Six - 197-a Working Group Meeting - 09/03/20",
            "publishDate": "2020-09-03",
            "shortDescription": "",
            "lengthSeconds": "0:43:22"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB6",
            "normalizedName": "Manhattan Community Board 6",
            "twitterName": "Manhattan Community Board Six",
            "youtubeChannelName": "Manhattan Community Board Six",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVn0y_oPVdX0vvRFl70YAig",
            "twitterHandle": "@cbsix",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "x8GvjitY-5k",
            "fillerWordCount": {
                "uh": 64,
                "um": 59
            },
            "readTimeFullTranscript": "26 min read",
            "readTimeSummary": "3 min read",
            "wordCountFullTranscript": {
                "property": 15,
                "sale": 14,
                "estate": 13,
                "kind": 13,
                "project": 12,
                "cody": 10,
                "website": 10,
                "street": 10,
                "information": 9,
                "working": 8
            },
            "wordCountSummary": {
                "project": 5,
                "construction": 4,
                "timeline": 4,
                "working": 3,
                "property": 3,
                "hold": 3,
                "kind": 3,
                "street": 2,
                "years": 2,
                "pandemic": 2
            },
            "fullTranscript": "I'm fine yeah. I do not think it will be a long meeting but good, I'm sure, I'm sure I'll be there to the end, but just in case okay, let me go mute myself, I'm going to behave. The youtube live stream is up, so you can begin whenever you would like. Okay, everybody welcome to the September 3rd 2020 meeting of the Cv 197A working group meeting. My name is Kavitha Matthew, I'm the chair of the working group. This meeting is called to order at 701 pm and tonight we're joined by assistant district manager, Cody Ostermann. Do we have members of the public on it looks like there is one member of the public members of the public. You can raise any questions or comments that you have through the Q&And a feature of zoom. Could you speak a little louder? Please, oh yeah sure. If there's time following the working groups discussion, we will feel questions from the public and tonight. Thank you, Jim Collins, who will be taking minutes for tonight's meeting. We will now take attendance by roll call and cody will conduct the roll call. Okay, working group members I'll call on you can unmute yourself and say present if you're here, Kavitha Matthew, here, Jim Collins, here Sandy Mckee here Wells Magaly Wells has not joined us yet richmonds Lou here Sandro Sherrod, Sandra House and joined Weddi Simon here, Corinne Vanderdonk said she could not make it and claude L winfield yeah all right. That's seven! Members! Out of ten! That's a quorum! Okay, thanks cody! So the agenda for tonight's meeting was distributed ahead of time by the board office and appears on the screen before you. If there's no objection we'll adopt the agenda, as stated members of the working group, if you object to adopting the agenda, you may raise your hand through zoom, okay, seeing no objections. The agenda for tonight's meeting is adopted. The minutes from April from the April 2nd meeting and the June 29th meeting were distributed ahead of time by the board office. If there's no objection we'll adopt these minutes so working group members, if you object to adopting either set of minutes, you may raise your hand through zoom, okay, I do not see any hands. I did not get a chance to go over them, but I'll go ahead with them. I'll read them over the weekend and let you know if I have objection. I do not think I do okay, so seeing no objections. The minutes from April, 2nd and June 29th meeting are adopted. They will soon be available on the CB6 website as well, and now I'm going to go over the usual rules, I'll go over them really quickly. I think we'll have a quick meeting, but no one may speak until granted the floor working group members. If you have a question about working group business or wish to make a motion, please raise your hand through zoom. If you guys all know how to do that, I do not think I need to say that anymore. The chat function should not be used for working group, business or questions about agenda topics. All such remarks should be made on the record by raising your hand through zoom chat should only be used to alert us to any technical difficulties you're having or to state and writing information like an email address that was already stated aloud on the on the record during the meeting and when the working group member is given the floor to speak I'll, identify you and you can unmute yourself so that you can speak, we are required by executive order to create a verbatim transcript of the meeting. So please keep your questions and comments, succinct and Jermaine to the discussion, and, let's see, I think, we're going to go right into the agenda items. If do we know if Brad is here, he's joined by phone, okay, yeah hang on I'm going to try to hook. Give me one minute, because I I'm going to try one more time. Okay, great! If you give me one minute, I'm going to try one last time. I appreciate it. I you know technology some, my technology works. Sometimes it does not so yeah same for all of us. I think so, just as Brad is trying that out. Our first agenda item is an update from Mount Sinai Beth Israel on the sale of the campus in community district. Six, so Brad corn has graciously joined us this evening to give us any updates on that sale. We'll give him a minute to see if he can join by video as webinar registration. It's still nice. Well, I can start talking if you want. While we do this all right, so obviously pre- pandemic, we were moving ahead with plans to you know right- size down the building. You know build a new structure on 13th street and eventually transfer stuff over a little bit. Please is that low yeah. Can you hear me now much better? Thank you, okay. So, at the point before the pandemic hit, you know we were moving ahead with the approvals on the property on 13th street to get that going and we were going to start building on 13th street we're still years down the road away from you know, finalizing what you know, everything as we move forward and we had not yet come to a concrete plan of what we were going to do with the property, so the pandemic hits and obviously everything gets put on hold and we continue to still be on hold because right now we have to be prepared for a possible second wave and we're required by the governor to have plans to go to a 50 percent up to a hundred percent surge, and some of that's been done by using you know, space at the Petri division. So at this point we have really not moved forward with a plan for disposing of the property. We've not put anything up for sale, we've not marketed anything. We have not had even had a real estate people meeting to discuss it. The only thing I will say in the only project that has moved forward and it just started within the past couple of weeks is we are moving ahead with the Rivington Street project and we have started to do some interior demolition and construction for that project, which will eventually lead to the emptying of the Bernstein building at 910 Nathan D Perlman place, but even that we've made no disposition, no thought of what we're doing with that property. At this point either, can you remind us about what the Rivington Street facility will have in terms of in terms of services? It's I do not have the list with me now. It's basically an enhanced version of what we have now, which is inpatient outpatient, both alcohol and substance, abuse Rehab, but included with that. In addition to it is we're going to have primary care for the people who use those types of services and some more enhanced services that we could not fit into the Bernstein building. I can get you the full list sent to you, but the only property right now that remains on target to sooner or later be emptied out was was, is the Bernstein building? In fact, they will tell you that you know. We've been approached by the 14th street Y we've been approached by other groups that we're looking potentially for property to maybe use for classrooms and everything and we're not we're not doing anything with anything right now, just in case the second wave turns out to be really bad. So I know it's probably not what you guys wanted to hear, because it does not help you with your planning. But at this point we've made no steps forward. I'm sorry brad! Could you just clarify for the notes you said Bernstein building is or is not in the process of being emptied out. Oh, it's not in the process of being emptied out, but the services that are in the Bernstein building the construction for the new facility have very preliminarily, started, we're still years away from that finishing as well, but that's the only project of our what we originally talked about for what was going on the super block and that campus there that's the only project. That's actually been picked up, nothing's being done on 13th street, as we speak. Okay, but Bernstein building is what status are you are you constructing in there or no? The Bernstein building at 910, Nathan, D Perlman place is still fully occupied, fully operational and everything else. The services in there are still event are being planned to be moved to Rivington Street, but that's the only construction at this moment. That's still going on at Rivington, Street, okay, we're doing some interior work. So that's the only project we've actually moved forward with and on the Lincoln property. Do you have a timeline for construction and completion of that project? You know they're just getting that together, because they have to reassess what the delay has been and there's other issues involving street traffic and some closings. We have a restaurant that is taking some street traffic, so we changed our timeline a little to allow him to continue his through October 31st to have his on- street seating because we do not want to. We want to make sure that you know a neighbor is able to do business and such so I'll get that for you shortly, but we're still looking no earlier, I believe than the end of you know: middle of 2022, probably more likely end of 2022, could even be into early 2023, because what happened was even though we were technically exempt. When this all happened, we made the conscious decision that we did not want to endanger any workers by having them out working, especially at the height of pandemic, so we basically shut everything down and literally only started up doing some interior work a couple of weeks ago. Okay, so you're I mean it sounds like you're, essentially in kind of a holding pattern until we know what's happening with the pandemic, anything else so timeline possibly is pushed out based on all of that. Well, the timeline is clearly pushed out. If you think about the fact, the timeline at the earliest is push back more than six months, because we're talking six months right now, you know by time we get to September 13th. We I think we shut everything down on March 13th, pretty much so by time we get to September. 13Th will have been six months done, we're not even close to moving forward on any of the stuff on 13th street. Yet so I would say that this is put with a minimum of six months to a year. It's probably put the project delayed. Okay, thank you for that. That's that's very helpful. To know I mean, based on all of that, I think we're we actually are putting together some ideas in communication, but we want to make sure that we're at least giving the most. You know current information. I know you do not have a lot of new things to tell us, but any idea when you would be meeting on all of that again or are you just waiting for the word from the governor in terms of when I would say right now, given the fact that we are, we are surge planning for the potential for the fall, that I can't imagine that the real estate committee and the real estate group are sitting there anytime before you know middle to end of October. When we see what's going on okay and what I expect two things to happen, one is. I know that the borough president's working group, which you guys are parts of you are associated with that. I expect we're going to have a meeting sometime. You know in and around the jewish holidays, in September, I'm assuming and we may be able to give you at least a little more update of what our thinking is and where we're at that point. Okay, so I may be able to tell you, sometime later this month, at least what we're thinking about, but right now, clearly, everything is on hold with the timeline of everything of the construction being pushed back a minimum of six months, because obviously this is New York, nothing ever gets moot, nothing ever gets moved up quickly. It only gets moved back, not moved up. So that's why I'm saying that it's not like anything's going to happen. That's going to speed up our thing to make up for the lost time right, okay! Well, that's very helpful and in addition to the pushed out timeline that we can completely understand at this point, do you feel like there's going to be some rethinking behind the sale itself and what gets sold? And you know how you proceed with. I mean I guess. Well, you know. Obviously I have not had complete conversations, but you know the timing of the sale or potential sale or marketing may change too because, as we all know, the real estate market has changed in New York with this. So you know it may put that in a further hold how we are repositioning for what we're going to do. All this may come into play, so you know I all I can say is you know they're, obviously rethinking a lot of different things, but clearly nothing is moving forward with the sale of that property. At this point. Okay, do we have any? I mean those were my main questions and thank you so much Brad for that. I know we discussed a lot of this when we talked a few weeks back no and I'm happy to come back every time you have a meeting. Whatever little updates, I have we're happy to meet with you. We want you to be aware of, what's going on we're happy to keep you in the loop totally with us. Okay, great. I wanted to see if there's questions from any of the other working group members for Brad you've got a hand from Sandy and Jim. Okay, okay, I guess we'll start with Sandy I and I was just wondering if the project does move ahead more quickly. Does that mean you might have two separate sales for the? Would you consider phasing the sales? Are you still thinking that they probably will be sold all together at one time? You know I am not the maven or the expert on real estate. The one thing I've always thought personally is Bernstein in and of itself, because there's a little bit of a separation between everything off the property, I think Bernstein itself always could have potentially been sold on its own or used for other purposes, but I think that they're going to you know we have real estate people on our board. We have a real estate committee, that's going to assess what's the best way to meet needs of the community while also maximizing the profit we want to get so I again, the only thing I will say is that the only construction that's going on is Bernstein, whether that hastens the sale of that property, possibly but no decisions have been made, and I know we did have some question about. You know the block between Nathan promoted place and First Avenue, 16th and 17th. If that whole block was being considered as being up for sale when everything gets completed again, that's you know we have people who were just starting. You know, I think, what I reported, or we reported the last time, is the real estate committee was kind of sitting down and trying to figure all this out and then all hell broke loose and during the time of all hell, breaking loose, there's been no meetings deciding on the future of that, so we have not gotten to that next stage. Yet, and obviously, as I said, I I'm not a real estate expert, but the real estate market in New, York City, has clearly changed due to this pandemic. So how that affects pricing and how that affects how you market it may be changed as well, but I think that, sometime later in the month or as we get more into October, we may have a better idea of being able to update you on that and we're also we've had people ask us because of the adjacency to landmark property. If that's something that maybe your real estate, people are considering as well as some kind of a trade with the landmark no idea, because first of all, is anything actually landmark right. There I mean. I know the park has certain landmark values, but I do not know about the property I mean. Obviously, whatever restrictions or covenants are placed will take into effect is where you know we have to take into effect as we look to move forward. Yes, there are, there is an adjacent property that is landmarked, so okay may be a good thing, maybe bad things. Thank you. Okay, you're welcome. So we have a question also from Jim Collins go ahead: Jim Brad, hi yeah, I'm just curious. You said that this is on hold in nx in anticipation of a second wave, and I'm wondering how long that second wave would be when the time frame for that. For that ending any indication you have either from the governor or from your own people. No, because if nothing develops say in December, are you going to move on from there? Oh, I would, I would say if I again much to the chagrin of my parents. I am not a doctor. I do not play one on TV, but in reality I would say that the expectation of the second wave is before December of this year that I think that would be the anticipation that they're looking for that. If, by December time it has not hit, I think they're, probably thinking that either the disease is starting to abate a little bit or whatever I think, they're anticipating it. Unfortunately, their fear is, I believe, coinciding with the flu season. So it's the two together that they're worried about, so that that's the bigger fear, because you know so. I can't answer that if I knew that I try to probably pick lottery numbers too yeah. No, I hear you, but so one thing we've learned about this. So one thing we've learned about this virus, it's very unpredictable right and Sandra. I'm curious. What is the landmark property that you're discussing the high school for health professionals? Oh okay, all right, oh old Stuyvesant is landmark, the high school is landmarked and it looks like there are three properties on 15th street technically that are adjacent to the Bernstein parcel that would fall under the historic district. Well, okay, guys it's funny, because it's just it's funny that I never realized that the high school was landmarked in all these years. It never came up really as an issue. So that's good. I learned something we're talking about the high school at the corner of 15th and second, the high school for advanced studies, high school of 15Th and second, not old, Stuyvesant, then no you're, referring to this style, former Stuyvesant performance. Thank you, okay, all right! Okay, I do not know what this is there anything else, I'm happy to stay on a little longer. If you want, is there anything else you need from me or any other questions from committee members or anyone else? I think we're okay, so brad after this, we are going to look at some of our ideas about communication around this site. We're kind of working as you are in this time warp of not knowing exactly. What's happening so we will make updates, as we hear them from you guys and anybody else sure for now and whenever you need us, whenever you need look either at a meeting or like reach out whatever you need to know and I'll reach out as soon as I as soon as I know, more we'll let you know that sounds good and we'll keep you posted on everything, and you know if you see anything in our communication, that's off that you know is different. Please let us know, and we will definitely work for future meetings to give us updates. Everybody have a safe and healthy labor Day weekend. Okay, you as well! Thank you. So much all right take care. We have your contact information, correct, yeah, absolutely all right, yeah, very good, okay, so that yeah that's basically. I just want to reiterate. That's what Brad told me a few weeks back when we talked directly and given all that we've still proceeded with putting together the website and some information. You know using the assumptions that we had before the pandemic hit with some kind of clauses in there about. We do not know exactly what's going to happen at this point, given all that I know we have not met formally as a full working group over the summer, but some of a few of us have been meeting and reviewing and kind of working on a website, and we can show the whole committee if you guys, are interested in seeing what, where we are with that wells had been working on it. Corrine and Sandy and Letty were all very instrumental in putting it together. So I think I'd for you guys to see where we are with it. I do not know cody if you have it handy that we can just take a quick walk through it's. Basically, I'm pulling it up in our CB6 website, which is also a wordpress site. It's like a sub domain is that right. I do not know if I'm saying that right cody, but yes, so it's hosted on with our hosting plan and it exists as a subdomain of the our current site, but corrine also purchased some standalone domain names that will redirect to this. That did currently do actually redirect to the site that you see, so the idea is to kind of fill in the information. We've got some very kind of basic messaging in here about you know what it is and what we know, and then we wanted to have right in the in that landing page, any upcoming meetings and things like that, and we also at some point we want to use this as our outreach tool. Yeah Sandy's office worked on this map that kind of cleaned up information. Again, we do not know exactly what's happening with all of those properties. We just want to highlight what we think is on the chopping block or for sale at this point. What's the domain name perlman? If you go to pearlman.cb6.org okay, and you can that'll, take you to the page that I'm scrolling through now and it's still kind of under construction. We met a coup about two weeks ago, a week and a half ago and had some changes we wanted to make and some updates that Wells was working on. She, I think, can jump back on it soon and, if not we'll definitely enlist Jim, we may enlist you or someone else. I know there was someone else who was helping with this two person Sandy's. I do not know sandy if your mentee was still interested in that or had more knowledge about working in wordpress, but she's still, I'm sorry she's still available. If we would like some help, okay, one of the domains that corrine bought, just so you know, is pearlmanplace.com redirects to this as well right, the idea being to have a kind of catchy easy name to communicate with the neighborhood, especially so when we reach out to them instead of thinking. Oh, this is a CB6 project. Oh, this is an Msbi thing. It's really about that location and the importance of it, and you know, what's going to happen there in the future so and we have a couple of things embedded in the website, including what we have a survey. That's going to be in there just asking for community input on what type of services and things they'd like to see happen there. So and then we have a kind of contact list and I do not know if any of that, if we can see any of these pages cody, can we get into those the links. Look like they're broken, but let me log in to the back end and then I can show you one. Second, it's not live yet. Is it? Oh, it's not it's not published. That's why nothing yeah! That's why nothing's showing up right and we'll probably tweak the graphics to just be in line with the graphics of the CB6 main website as well, but I did want to share that with you. I had a had. I found a good graphic of I guess it was put out by this was in conjunction with setting up the twitter account, which God knows what twitter is. Thinking of. I have no idea, but in any event, I found a good graphic that shows the what this, what the buildings that are being moved or being sold, have it's up it's up in the website or I'm sorry up in the Kanban board that I submitted to you, there's a there's a photo of. I think it's number 10 perlman place and then the building is superimposed over the back of it. Okay, I have not looked at that yet Jim but I'll say: maybe it's something that we can. If you think it's something that we should incorporate, we can look at it. We took some photos of the area we have on the site where people can kind of orient themselves and we'll probably add a few more letty. Did the text here and we're probably going to update that as well. I mean not really updated, but just make sure we're on target with where we are right now, since everything's sort of on hold at this point, but I think it's a good stepping off point to do some outreach to community groups and then the next step being that we do want to see if we can maybe engage a meeting of some sort with the larger community and different input, so we're okay to go ahead and reach out to those to friends school and what have you or I mean I think once this is done, it's probably better, which is probably like a maybe at least a week off Lettie. I see you have your hand raised. Did you have a question yeah? I just I had a question cody when you showed us the pearlman.cbc. It was pearlman without an n at the end and that's confusing yeah. That was the typo on my end, oh thank you. That's all. I want beautiful and thanks so much for all your help. Appreciate it. Okay, that's great! Okay! So, let's see I can go through the pages if you'd like, let's just go through the pages for everybody and I'd love any feedback, it's hard for me to see them. On my mind, I'm on my cell phone. That's why so I'm just good whatever okay! This is the this would be the who we are page linked from the Top Nav Navigation, Bar and Letty drew a lot of the copy, I think from kind of the about CB6 page on her current site, and then you know, there's some copy down here about again why this is happening on the what's up page. It talks about the fourth coming sale, listing that it's going to happen in 2023 what they need to potentially get out of it, and then it talks a little bit about the relocation to Rivington Street, and on that page I think we're going to kind of maybe tweak the language that says it's the largest real estate sale. I think that's something that the borough president said in one of the interviews, but it may not actually be the case right and then get involved. It asks you know just lists what we are hoping to achieve in terms of connecting with community partners and other local organizations, and this page you know we'll- have information about the upcoming meetings and things, and it's going to have what Kavitha was mentioning before a a dedicated separate from this CB6 mailing list sign up mailing list sign up through mailchimp just for this, and that also kind of draw asks people to when they sign up for a little bit of information about who they are where they live. Many, maybe an organization that they're linked with and kind of what interests them about this project and potentially like what could be on the site. You know in a kind of dream scenario for them, and we have. We have some like pre- populated options right and then another yeah. They can add in something. If we then the why we care, you know talks about the goals that you all have laid out for this project and also you know more broadly, that the board is laid out through resolutions through its district needs statement. For you know the past, however, long about the need for community facilities and open spaces and a mixture of affordable senior, supportive housing things like that, and then the latest news would just be a place for kind of. I assume- and you can tell me if I'm wrong could be the like blog style, updates right on what meetings happening you know and or like recently. We heard this and like just a running kind of timeline, yeah exactly, I believe, that's all of the kind of structure that's been built out so far right and I think that's you know to me. That seems like a good bit of structure if anyone has any thoughts or things that we've missed in this, I'm happy to hear some feedback, but the idea is really just to use it as an outreach tool and also an update tool like so everybody can. We can, you know hopefully get people on this mailing list and they'll be copied on the site, whether they're, a community group or local officials or whoever we want to have kind of in the loop on this. I also think, given the pandemic as much as I hate to say it, I think we're in a different position right now than we were earlier and what Brad said is right. It's not it's not necessarily the best case scenario for msbi to go off and get a luxury real estate developer sale. They may not get that there may not be the same market for it, maybe there's opportunities. Maybe the city will make other demands. I do not know. I just think that the playing field has changed quite a lot. So hopefully there are opportunities, and I think if we can get the community engagement behind what we think we need there we'll be in a better place for having some influence on the site. Hopefully so at that point, thank you cody for walking us through. All of that, I want to see if anybody has any questions, thoughts on the website itself, we're going to kind of try to see if we can get this up and running in the next week or two. Certainly before we meet again. Are we I'm sorry go ahead? Is that is that him yeah? I just are we collecting the press releases and email or whatever, I guess press releases from msbi, because they sometimes mention this stuff. They mention what they're doing in their downtown plan periodically we have a google search for that or a google I'm sorry. I can't hear I did not hear the look. I s like a Google alert set up for Msbi Perlman place or they're calling this Beth Israel yeah. I do not know. I do not think so. It'd probably be wise to get one because they talk to the press and they also have they have their own press releases right. So that would be good, maybe to include in the latest news and any kind of updates that we get from directly from them. Yeah. Okay, any other thoughts. If you're going to do that, you should look at town and village right. Okay, I think that's good. I do not know if town and village picks up on a google on a google alert no, but they usually have most articles on yeah and I think, if yeah and if people see things that come up that are significant to this, you just kind of add them right. We can alert them and and include those in there as well, but it would be good to be notified whenever there's some kind of update like that yeah cody, you want to be the channel for that, or is that something? You know how to mean? We have some Google alerts. I mean we just have like community board six another one set up, so we can certainly set that up, and I think that we can ask wells who set up the structure on this site, but should be pretty easy to do. Maybe like a resources edition and that compiles the any press releases that come out or interviews or other. I have one other question: has the survey has the survey been done? I think if well we have. The survey that we have embedded in here that we were talking about is that what you mean? Yes, no, I mean it's going to be done as part of this when we release it to everyone, they fill it out in the website itself and we'd collect the information it's going through mailchimp right cody. This is up and running. I will make sure that we notify you all and then we can start filing the we have kind of the preliminary list. But again we want to kind of get it out officially, and I think, if you all agree, I think it's best to have this in hand first, so we can, we can link it. You know they've got to be meeting, certainly even the upcoming 197a meetings. If we're going to have mspi kind of attempt, those periodically would be helpful cody. Our mailchimp is that we have a corporate on an unlimited mailchimp account. I mean we're there, it's a t. There are tiers of how many subscribers yeah and this this is just linked with our main mailchimp account and right now we're in you know one of the tiers, and you know our our subscriber base on our main newsletter grows. You know daily weekly, but we will at the same time, do you just update yeah, routine purges of people who have not read it in 10:12, and so we can do the same thing here so that we're not going crazy with them costs. If that's the case so beyond, I do not know I mean I did go through. We did have the updated report from Bennett Midland and we have been kind of looking at the suggested, outreach and next steps on that and we're going to kind of follow through on some of those ideas, and I have not gotten much further on any of the other points on there, but we will continue to follow through with community engagement and see if we get any progress on that. Okay. So really that's all. I wanted to update you guys on today and get the feedback from Brad, knowing that things are kind of swirling and up in the air. I do not know. I think we kind of put this out there put it to. The community gives us a little bit of a reprieve on time, so people have longer, hopefully to give input before the sale and everything goes through. I do think they're still going to sell the property. I do think that's going to happen. We just do not know exactly how and you know in what, in what way, like Sandy said, maybe he'll be phased. Who knows any other questions? I think the website looks good, congratulations to who whomever or individual or individuals that actually got it up and situated. Looks good yeah, including you, lady. Thank you for all the work. Mine was just the content, but I'm just starting with the actual face of it is really good, and I know that also takes a lot of time and effort so kudos to whomever was it was it sandy or Sandy's office and wells? It was well for me. I think right both it just it just it look, it looks good and it's wonderful, because we can it can be updated and changed and whatever yeah and we'll add some we'll add the images and everything else and it'll it'll be up and running soon. Okay, so really, let's that's all I have for this time. I do not have anything I'm going to waive my shares report today, and does anybody have any old or new business? No, I do not see any hands raised. Okay, all right, then I will make the I'll ask for a motion to adjourn the meeting. Okay and thank you and happy healthy new year to those who observe and to everybody else as well, because we could all use good health and good luck exactly so. Thank you. Everyone for the business, the meetings adjourned at 7:43 pm. Thank you all brilliant. Thank you.",
            "summary": "By raising your hand, through zoom chat should only be used to alert us to any technical difficulties you're having or to state and writing information like an email address that was already stated aloud on the on the record during the meeting and when the working group member is given the floor to speak, I'll, identify you and you can unmute yourself so that you can speak.\nYou know we were moving ahead with the approvals on the property on 13th street to get that going and we were going to start building on 13th street We're still years down the road away from you, know, finalizing what you know, everything as we move forward We had not yet come to a concrete plan of what we were going to do with the property, so the pandemic hits and obviously everything gets put on hold We continue to still be on hold because right now we have to be prepared for a possible second wave And, we're required by the governor to have plans to go to a 50 percent up to a hundred percent surge, and some of that's been done by using you know, space at the Petri division.\nThe only thing I will say in the only project that has moved forward Is. We are moving ahead with the Rivington Street project and we have started to do some interior demolition and construction for that project, which will eventually lead to the emptying of the Bernstein building.\nOh, it's not in the process of being emptied out, but the services that are in the Bernstein building the construction for the new facility have very preliminarily, started, we're still years away from that finishing as well, but that's the only project of our what we originally talked about for what was going on the super block and That campus.\nI mean it sounds like you're, essentially in kind of a holding pattern until we know what's happening with the pandemic, anything else , So timeline possibly is pushed out based on all of that.\nI know you do not have a lot of new things to tell us, but any idea when you would be meeting on all of that again or are you just waiting for the word from the governor in terms of when I would say right, now, given the fact that we are, we are surge planning for the potential for the fall?\nSo I may be able to tell you, sometime later this month, at least what we're thinking about, but right, now, clearly, everything is on hold with the timeline of everything of the construction being pushed back a minimum of six months, because obviously this is New. In addition to the pushed out timeline that we can completely understand at this point.\nIf there's questions from any of the other working group, members for Brad you've got a hand from Sandy and Jim. And I was just wondering if the project does move ahead.\nThe only thing I will say is that the only construction that's going on is Bernstein, whether that hastens the sale of that property, possibly, but no decisions have been made, and I know.\nYou, know, I think, what I reported, or we reported the last time, is the real estate committee was kind of sitting down and trying to figure all this out.\nI, think we're okay, so brad after this, we are going to look at some of our ideas about communication around this site.\nGiven all that I know, we have not met formally as a full working group over the summer, but some of a few of us have been meeting and reviewing and kind of working on a website, and we can show the whole committee You guys, are interested in seeing what, where we are with that wells had been working on it.\nI do not know sandy if your mentee was still interested in that or had more knowledge about working in wordpress, but she's still,, the idea being to have a kind of catchy easy name to communicate with the neighborhood, especially so when we reach out to them instead of thinking.\nWe heard this and like just a running kind of timeline, We can, you know hopefully get people on this mailing list and they'll be copied on the site, whether they're, a community group or local officials or whoever we want to have kind of in the loop on this."
        }
    }
}