{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCESA129fi17yddOjOdPigag",
            "title": "CB8M Preparedness Zoom Meeting",
            "publishDate": "2020-08-24",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 195,
            "um": 304
        },
        "wordCountFullTranscript": {
            "people": 90,
            "time": 47,
            "emergency": 46,
            "thing": 38,
            "things": 38,
            "question": 35,
            "care": 32,
            "lot": 32,
            "hospital": 32,
            "department": 28
        },
        "wordCountSummary": {
            "people": 19,
            "testing": 7,
            "number": 7,
            "home": 7,
            "hospital": 7,
            "time": 6,
            "things": 6,
            "health": 6,
            "contact": 4,
            "thing": 4
        },
        "fullTranscript": "Sorry, I was muted there for a second. I won't take that as a hint welcome to cba's program on preparedness for a potential second surge. My name is elita camp and as well mentioned, I'm the chair of cb8 we've been hearing about the potential, but the virus will come back in the fall, possibly stronger. This is scary. We went through a terrible time in the spring when note which no one absolutely no one wants to repeat. Since then, we've been good about wearing, masks, social, distancing, washing our hands getting tested and answering the contact tracing calls, but is that enough? We have more PPES doctors understand the virus, better treatments are being tested and there is new, more advanced knowledge that has been incorporated in potential treatments. Even with all of this, though, it is reasonable to want to know how prepared the city is and the hospitals and how prepared are we if there is a surge I'd like to introduce our experts for the evening? Who can take us through what we need to know to avoid the tragic circumstances that inundated us in the spring? I'm excited to introduce dr ted long from new york, city's health and hospitals. You may remember him from our program in July on the importance of contact tracing and why we should answer the tracer's calls. Dr long is vice president of ambulatory care at health and hospitals, which provides essential services to more than one million new yorkers. He is creating a primary care network to treat all new yorkers. He is also head of new york's testing and contact tracing program. I'm equally excited to introduce dr robert tanaway, the associate director of new york presbyterian's, lower Manhattan department of emergency medicine. He is assistant director of leadership programs at weill, cornell department of emergency medicine and is an assistant professor of emergency medicine at weill cornell medical college. I'm also excited it's a lot of excitement for one evening. I agree to introduce council member ben kaylos who needs no introduction to those in cb8 and other areas of Manhattan. I'm happy to have worked with the co-chairs of cba's health seniors and social services committee, barbara rudder and rebecca dangor, both of whom are here as well to help to present this program as well mentioned, everyone will be muted until you're called on. You can ask questions in the chat or by raising your virtual hands. I'd also ask because we have a time limitation, at least for dr long. If you would limit your questions to about 30 seconds council member caleb's, would you give us your thoughts? Thank you and welcome. I want to start with a huge thank you to the chair of cba toledo camp and the co-chairs of the health seniors and social services committee laurie, boris and barbara rudder, and as well as the distinguished panelists for tonight, coming into the pandemic. The key thing was making sure we had enough beds to handle a surge. We actually still have the 350 beds available on roosevelt island in the event of us, going back into a surge and shutting down the elective services. We would still have the hss 200 beds that were able to secure for a total of 550, which is actually about half as many as we got in the usns comfort, and we probably cert served probably infinitely more people, and so that's just here in our district. Another key thing from the city is making sure we have enough PPE for the next wave and for me, I've been very focused on making sure that we can reopen safely. So we can do everything in our power to avoid a second wave, especially a second spike. I think all eyes have been on the opening of our schools. We worked with ps290 in the neighborhood and may have read about on the new york post, and we said we need a nurse in every school, a full-time nurse because of pediatric multi-implant multi-system, inflammatory syndrome pmis, and the mayor did finally agree to do those 400 nurses we've also been pushing for remote learning, using everything from libraries, senior centers and even empty storefronts, and the mayor's agreed to make a hundred thousand slots of voya available. So, if you're watching, if you have an idea for a slot, let us know you may have read today's new york, post and editorial in support of, if we're doing all remote learning for 400 000 students that we could actually integrate those classrooms and get gnt to any student who wanted it and another key piece that we've been hearing from. Everyone is about trying to move classrooms outdoors, whether it's in park space, which we really don't have in this neighborhood or even our city streets. Where I know cb8, will have a huge role. So I think for me, it's been all about. How do we prevent a second wave and then also? I think the key thing is since the beginning, working with these experts and others to get testing for everyone trying to get beyond the painful swab testing, but to even saliva testing and rapid testing, so you're not even having to wait 10 days, but actually waiting a couple of minutes instead of hours, and so I think the thing I am hoping for and if we can't get a vaccine anytime soon- and we are not russia- we are not going to administer vaccines to people without a phase one or a phase. Two and the experts can explain the difference between what happened in russia and what's gonna happen here and I think as we're getting there. I would like to get and we are working with public health experts where somebody could literally walk into a holding area. Do a saliva sample have that saliva sample carried into a different room, have it tested and whether it's minutes or hours, but have the access control related to people, whether or not they are testing positive, and I think the key thing there is the sensitivity of the test and what the count will have to be in the saliva or other dna samples that we take or rna samples that we take to do so. But I'm looking forward to hearing from the experts- and I want to thank everyone and I'm councilmember at ben kales in between then and now. If you need access to masks or hand sanitizer, we are literally giving it away by the gallon, particularly if you live in a building with other people. We'd love you to be our building captain and if you have a building with building service workers, we'd love for you to have we'd love to give you masks and hand sanitizer that you can have your building service workers distribute to any resident who wants them and we'll give it to you as much as you need. Thank you. Thank you. So much council member for the format of the program. I've asked dr long from h to speak first and do a presentation and then we'll have dr tanaway and then questions and answers for either or both of them. So, if you're asking a question and it's for both that's great, if it's for either one please specify to whom you're asking your question, thank you so much dr long from new york's h and contact racing yeah. I just make sure. Can you hear me? Okay now? Yes, thank you. Okay, great! Thank you, everybody for giving me a couple minutes of your time tonight. What I want to do is talk to you about our current state of what we're doing in new york city now to suppress the coronavirus and then talk a little bit about in preparation, for if there is a surge, what things will look like then, and everything we're doing to keep you safe and protected during that time as well, so, starting with the beginning, new yorkers is something to be proud of. Now we have the lowest rates of coronavirus, hospitalizations, new cases, emergency department, visits and deaths. Since the epidemic began back in March April and that's something that everybody listening now deserves credit for, every time you go and wear a mask outside and every time you pick up the phone if you've had a positive test for one of our contact tracers to call you that's what it takes for us to work together to keep the virus suppressed and it really is working we're a national model across the country for how to do this right and all of us working together. New yorkers really do protect new yorkers. What we're doing in test and trace course. Three things number one testing number two contact tracing and number three helping people to get through this for them and their families, either at home or in one of our hotels. I'm going to talk a little bit about those three components now and how we're going to keep the virus suppressed and then I'll talk about the a potential surge terms of testing. We again are a national leader in this we're doing more than 30 000 tests of new yorkers every single day across more than 200 testing locations in new york city tests are always free, and our mantra is that we want everybody in community board, eight or any community in new york city to feel that there's no barrier to getting the tests, people vote with their feet and the fact that 30 000 people a day are coming out to get tested, speaks volumes right there, but we actually want to do more tests. We want to do forty thousand fifty thousand tests, because testing is the way that we enable contact tracing. If somebody that tests positive, we wanna know who they could have exposed to the virus, track them down and suppress the virus in them. So they don't infect other people. That's the premise of contact tracing with contact tracing. We also have become a national leader in this as well. So one of our initial goals in contact tracing is: we have to be able to reach everybody. Now I remember back in June when we were starting this program which wasn't too far before I came and talked to you all last time we didn't even have a phone number for 15 percent of people that were the new cases of coronavirus in new york city. Now our goal has always been to reach 90 plus nine out of ten. That's an a on a test we're reaching over ninety percent every single week, which is way better than it was when it's when we started the program back in June, so we're proud of that we're hitting metric one metric two is in terms of contact tracing. We want to be able to complete our intake with people so that we know that they're being able to stay safe at home and we've had the opportunity to ask them who they may have exposed to the coronavirus, which is a sensitive conversation. When our, when we started the program back in June, we were only completing our intake process for about 50 of people, one in every two, our goal, which all of the experts say is you have to complete intake in 75 or more to really suppress the virus. This past week we hit 70 on the mark. Two weeks ago, we were as high as 78, so we're hitting that key metric, which is really important to our program. The other thing that people then ask is well if you're completing your intake and finding contacts of which we found 30 000 contacts in new york city- that's great. But how do you know that people are actually isolating at home if you're diagnosed with the coronavirus? How do we know that you're actually staying at home and not potentially leaving your home or potentially risking infecting others? So what we do is we have an intensive monitoring period. We call you every single day, sometimes multiple times a day. If we don't get through to you, the first try we just released data on this. The new yorkers truly are taking they're, putting the effort forth to protect other new yorkers 95 of the time people are telling us they're staying home between when we last called them and we're currently calling them, which is an incredible statistic and just shows that's, not a sacrifice. It's not easy to stay home, but what we want to do. The third part of our program is: do everything in our power I'm a primary care doctor? That's the way, I think I've diagnosed many of my patients with the coronavirus and every time I ask them. What do you need? How can I help you most of the time people to my patients. Tell me food delivery would be super helpful because otherwise, how am I going to get? How am I going to have my family eat? Others tell me different things like medication delivery, or can they reach me or somebody else by phone if they're having a problem, we've built that all into a part of our program, that's special to new york city built for new york city? That's the third part! We call take care right now, more than seven 000 times we pair people up with resource navigators to give them what they need in order to stay at home, but that's how we're enabling 95 of new yorkers to be successful, staying at home and to keep staying at home everything I've told you is current state the result of all that current state, along with everything else that everybody on this call is doing wearing a mask outside proper hand. Hygiene has made us the national leader in the country and the whole country for having the lowest percent positive rate, the lowest number of new cases. We have a lot to be proud of. I really hope that if we all keep working together and keep keeping new yorkers safe, we will not have a second search. There is no reason to believe that this is an inevitability, I'll, be very clear. On that point, the number one thing we can do to prevent it is keep doing exactly what we're doing now. Don't let our guard down don't take off the mask, keep picking up the phone if we call, if we all do that together, we can avoid a second surge. However, if it does happen because some things are out of our control, even if we're doing everything that we can our contact tracing operation is built to be able to sustain and take in thousands more people than we currently are every single day. So we're ready- and we have now seasoned contact tracers that are ready to make the calls. We hope we don't need to have everybody make all these calls. But if we do, you should know that we're there for you and we're ready same thing with testing. We have the capacity to do 50 000 tests a day, we're ready there. If more people start getting diagnosed, we will increase our amount of testing that we're doing I'll. Give you an example of that across new york city we've been very successful. As I've said in some communities, though, we've seen a lower number of people tested and higher number of people- testing positive. For example, the one I'll give you is sunset park in sunset park: we've actually planted ourselves there ingrained in the community there to bring the community out to knock on doors, to get people to come out and get tested, we're going to be releasing our new numbers on that soon, which are very encouraging. We really are by having a considered effort with our communities. We can make the difference we need to make community by community and, if community board 8, if we are seeing the same thing there I'd love to come back to you all and say how can we work together? How can we squash the virus but we're doing a good job across the board? I think that I think the most important thing I communicate to you is there's so much we have to be proud of, and it has not been easy for anybody, I'm looking at the screen now it hasn't been easy for any person on this call to get through this. But what we're doing in new york city is working and if things start to get worse, we are there. We have the next five steps planned out already from testing to tracing, to getting more people in hotels, we're ready for what can happen next, but please keep doing what you're doing. I know it's not easy, but it really is working. Thank you and I'm happy to answer any questions. Thank you. If we could wait until after dr tanaway's presentation, then we'll have plenty of questions for you. Thank you, dr tanaway hi. Can you hear me? Yes, thank you. I you will do you mind allowing me to share my screen. Please of course go for it, elita, alita, barbara and well. Thanks for having me, let me just share my screen. It's our pleasure to have you and dr long. This is so vitally important. Thank you. Can you see that without my notes in it and ted thanks for the that overview, I mean I, you know. What I hope to do is talk a little bit about what we can do as individuals and I'm an emergency doctor, I'm robbie tanner, I'm one of the wow cornell medicine emergency doctors. I work in new york presbyterian at two locations at well cornell on the upper east side by most everyone on the hollywood squares here, as well as lower Manhattan hospital, which is down at the southern tip of Manhattan. Give you just a brief overview of our experience as a group in the emergency departments at new york, presbyterian and then talk specifically about emergency departments in general. We're getting a lot of questions from the public about you know. When can I? When should I go to the emergency department? Are they even safe or hospital safe? You know. Are there other options for me to get medical care other than going to the emergency department and waiting x number of hours? So I hope to address some of those things all right and you can see. Can you see the slides, advancing? Okay, I'm getting the head nod great all right, so we all were here right in March April and may we know that we had not only the comfort come in to expand our capacity. We had field hospitals in central park, we're expanding capacity right. My I'm gonna give you just a brief view of just my personal and our groups experience. So you know the platform that we're talking from, and you know that may spur questions so, just very broadly we're a big group of emergency providers about a hundred doctors, hundreds faculty, a large residency that covers columbia's washington heights campus. We have about 45 nurse practitioners and pas. We saw almost 400 000 patients a year in multiple sites. We have our affiliates in Brooklyn and in flushing in Queens in new york, presbyterian Queens, here's just a picture of some of those locations, multiple boroughs and just to talk about the response. This is new york presbyterian, while cornell medicine is that for those of you who are viewing this, that's that NYPD wcm we are highlighted in one of the magazines and basically just the summary here is that we have young and old, with the gentleman on the left is a year out of residency and the gentleman on the right is our most senior doctor. The woman in the middle is one of our nurses who works in the icu, as well as the emergency departments. Just to talk about the variety of people that we had on the front lines you know serving our community again, I won't belabor the timeline, but we can recall what december looked like when china reported. You know a case of pneumonia to who and how we quickly ramped up in March with the first case in new york city, then that second case, which was our first case at new york presbyterian and by mid March, and certainly mid-april we were in you- know a true pandemic here in new york city, we're the epicenter of the epicenter right. Here's some pictures of how we address that, at least in our institution. The picture in the left is a place where we hopefully do not want to be that's not a picture from Covid-19 time, but that's a picture before of what new york city, hospi, emergency departments used to look like right, and certainly at capacity not wearing masks. We often would see patients right at the bedside in the hallways, maybe with the curtain. The picture on the right is just one of the many examples. Each of our hospitals had disaster tents that were used in various ways, sometimes to see very low risk patients with Covid-19, sometimes to see patients who didn't have Covid-19 symptoms at all to physically separate them from the hospital and where our Covid-19 patients were. This is basically a slide talking about the collaboration that we had new york presbyterian. One way to address Covid-19 at you know, certainly at the pandemic. Numbers was not just to create more space but to create bigger teams, and so that meant folks who used to practice dermatology and see a patient every 15 minutes very quickly, weren't seeing the patient in every 15 minutes. There were no, you know, kind of elective rashes to be seen, for example, and so some of those some of our colleagues from dermatology and all of these specialties here, you see represented actually we're folded into the emergency response system and we work side by side, other attendees attending physicians, nurses, nurse practitioners, physician assistants, all in the emergency department, all seen, Covid-19 patients and they were deployed together. In addition, we were able to fly in multiple emergency medicine, doctors from other states at the times when we didn't have any other states with pandemics, but this is just an idea of how we combated that at that time and probably what we would do in a potential second wave. I think this slide. I'm embarrassed to even be on this call with dr long. So I won't go through this in detail, but I think this basically shows this is sorry. This is as a week ago, but we had about 425. I think I looked today. 430 000 cases positive feel free to chime in ted. If you see anything funny on here suspicious, but you know basically you're seeing that we had a lot of cases mostly focused in the southern part of the state and as you zoom in on the right of the screen, you can see where the hospitals that our group works at is located and the darker portions represent the density of cases right per capita. That's per a thousand people who are covering a virus positive. So that's an overview that I think most of you probably are familiar with, but we wanted to refresh you know your memory and talk about how we address that in the emergency department. This is, I think, the question that we get most from you know our friends or family. When do I present? When do I come to the emergency department and is the emergency department even safe? Even if I kind of know I don't need to be admitted to the hospital. What are you guys doing right? Is the e.d safe right, and so let's talk about that first question: when do you want to come to the emergency department? I think this is pretty simple, but I think it bears a lot of discussion and we can have it back and forth later is, as you see on these kind of shapes, if you have signs of a heart attack, stroke, incredible abdominal pain. Certainly, if there's a major injury, we want to see you in the emergency department. You not only deserve to be in the emergency department. 10 out of 10 doctors are going to say come even if you call them, even if you call your doctor family member on the phone they're going to say, go to the emergency department, if you're having chest pain, shortness of breath, the signs of a stroke, you probably know perhaps slurred speech focal, numbness or you know, focal weakness on one arm or one leg on one side of the face, or the other like we said, really bad abdominal pain or vomiting, and certainly examples of a bad injury would be any sort of major head injury, a large laceration that needs to be repaired or is bleeding. This might seem obvious, but you would not imagine the number of folks who we have seen that have been three days four days a week, two weeks out from these exact symptoms, who said you know doctor, I really would have come earlier. I just wasn't sure if the edu was safe or if I would get coronavirus from coming in and being seen. I spoke to the chief of the icu today, who asked me to remind you that often not life-threatening, but certainly if you have one swollen leg, which might be a sign of a dvt or a blood clot in your leg, that would might be another reason you may need to come to a hospital to an emergency department. So the second question that people has not just when should I come, but what are you guys doing to keep me safe right and just a few pictures here, and this is pictures of our of our wild cornell emergency department there on the left, you can see all of our doctors, our nurses pped up right. Not only are we trying to protect each other and ourselves we're trying to protect the visitors, we're trying to take the patients and we're going in between? We have PPE and we're going to use it the picture on the right. You know. Certainly we have chairs and that are fixed- that we're going to need for a potential second wave or you know where the emergency department we're preparing for everything. So we're not going to just throw the you know chainsaw off the middle chair, but we've really adhered to not putting patients next to each other, and I would say this is the waiting room and we typically will have at least two to three chairs that are blocked off between patients. In addition, we currently at the lower levels of the amount of emergency department, patients that are in our eds. We don't need to put anybody in the hallways or in chairs right now. Knowing that you know, we have plans for expansion when, if and when the second wave comes so again, social distancing PPE. I should also talk as every hospital does, there's visitor limitations to reduce the number of people in hospitals, as well as in the emergency departments and other things you would experience. If you came are touchless temperatures, you may see that every employee, regardless, if you're, patient, based or not needs to do it a daily attestation. The point for the for the people listening are there is that there's systems in place that are extremely rigorous to protect patients and the visitors and is of course, ourselves right. We're almost together- and this is just more pictures, kind of talking about what we're saying- I think you know it- I'm sure there are going to be testing questions that come up. We should say that you know most folks who most patients- I should say they get tested in our emergency department. You know if we, they don't wait for their results. You know we have a nurse practitioner follow up with a phone call on every patient, positive or negative. Luckily, the vast majority have been negative recently. I'd like I love to just spend a minute or two on the virtual care with you know: health healthcare options. It's kind of this may this may be something that you have experienced before on the consumer side on the patient side, but something that you know I hadn't really been exposed to before coronavirus before Covid-19. This goes into this whole idea. To back up of, when do I go to a to an emergency department? There are many options now not to come to an emergency department, but still be seen by an emergency physician or a physician or provider who's used to providing frontline care right, and so telemedicine is one of those modalities. That's one way to see a physician, you'd see it in person. You guys have you're we're doing this right now, right, we're doing telemedicine, a form of telecommunicating now, and it would be pretty reasonable if dr long or I were just doing a one-on-one conversation with you- and you asked us what you know what's this right here, I kind of had this thing or you know it's kind of been hurting here, but we could go through a physical exam over the phone, I'm sorry over the video and speaking through the audio of the phone, and you know this is a telemedicine visit and a lot of our physicians, not just emergency physicians, but all specialties have really converted and had to become facile with this. This is virtual, urgent care, I'll talk about this on the next slide, but just like all systems, new york presbyterian has a an app a way to see. One of our doctors, you basically just download it in your app store, we'll put a link up on the chat board and I have it at the end of the slides, but you should and whether it's us or not, you really want to know that you can see a doctor via video, and you should also know that for a lot of medical conditions, it can be just as good medically and in addition, much better for you from a pub from a health standpoint, meaning you didn't have to take the bus or the subway in or walk past. All the folks in your building with your mask on you didn't have to wait in the lobby. Even if it's for two minutes you didn't have to be in the clinic the office, the emergency department for 30 minutes an hour two hours, whatever. That is right, you're, avoiding all of that exposure, and you should be very confident that we feel confident in this way of seeing patients now we're very we're. Certainly very seasoned at this is an example of what of pathologies or reasons that you might use virtual urgent care. You might use telemedicine instead of walking into your doctor's office, and you may already have done this with your primary care doctor or one of our hospitals. Rashes. If you have some allergies right, you have the sniffles, maybe you strained or sprained something. Maybe you have a minor injury right. You didn't fly off your bike. You know at 20 miles per hour, but maybe your bike just kind of tipped over at a stoplight right. Maybe you might think you have a uti or urinary tract infection. Maybe you have a mild respiratory infection right, so not all just simple fevers necessarily need to come into the emergency department and if you have just you know, if you thought maybe I should just check with someone we will be on the other side of the video telling you know what you should go to an emergency department and we can help you get the ambulance or talk you through how to get there and so you'll see one of the same type of doctors who does this in person, but you'll, you know hopefully get that faster. So that's an example of a way to seek medical care, but not have to do it in person. I think I've taken you know enough time talking, but just takeaways here from the hospital perspective, we're certainly actively planning for the second wave. We just showed you what we did with the first wave expanding square footage. We didn't show you pictures of expanded icus, but certainly those types of measures have been being planned for very thoroughly. Second, the emergency department is safe. If you have a true emergency or if you think you might have a true emergency and that's the way that you're gonna get care, it is a safe place. I guarantee you that and then certain low acuity health issues, like we kind of, went through, consider using video, consider using telemedicine and with that you know thanks for your time guys and we'll open it up to everyone for questions. I don't know. If will you or maybe I can put this on the link in the chat, but I will stop sharing my screen and turn it back over to you guys thanks. Thank you so much dr tanaway and dr long. I see we have hands raised from the chairs of the hss committee and then we'll go to the public. I have some questions from the chat and in case anyone wants to raise their hands so barbara you're muted will would you on me, barbara or okay? You did now. I think. Thank you. So much both of you and you've answered some questions again. As co-chairs of the health seniors, we will be having a series of zoom on health. I do have more specific questions. I am one of these that are addicted to listening to Cuomo and de Blasio, and everybody else that talks about it. One thing I've heard a couple of things that I found very intriguing one is north will is talk. There was an article about home care, somebody who was very sick and instead of going to the hospital, had somebody come in if she needed oxygen and so on, and she did, they thought she did much better with home care than she would have in the hospital. That's number one I'd be interested as a new way of thinking. Another thing that I heard Cuomo in early days talk about was the idea of a more sharing of resources, rather than mount sinai in new york, nyu in new york hospital, each being separate entities of more of a dialogue or a between to share equipment, ppe's, possibly even staff and beds, and I'm wondering if that's something that is a reality and can really work. And I think, dr long I'm going to ask you this specifically because I think you've done a great job with pr for tracing, and I am a true believer that will certainly help us to do it. Can you make more prs about? Do, wear your mask and if we do open up restaurants and go into public buildings and to observe the rule and so on, and I'm wondering if even more pr as time goes on, because it worries me that the more normal we seem the more relaxed I see it in restaurants, people don't wear masks in restaurants, and you know we want to feel normal in a restaurant and whatever normal means. So those are my questions at this point. All right, I can get started and then turn to dr tanui. So oh barbara, I just wanna first off start off with the answer to your second to last and last question is yes a million times over. I would love to do as much pr as humanly possible about math wearing is so important and it is it's. You know the reason we've gotten to where we are now a big piece of that is where how we all whenever we go outside- and I have no doubt that you do this barbara wear our masks wherever we go, I feel naked without I had a nightmare that I went to a place without a mask. It's like your nightmares that you're naked when you go somewhere. That's how I equate it with me exactly, but your point is well taken that we, I think the important message here is that we can't let our guard down. You know: we've gone, we've done great as new yorkers to get us where we are now. But this is not the time to get lacks. It's not the time to you know, wear it. Sometimes, if anything, this is the time to really celebrate all we've accomplished together and double our efforts that we're already putting into we're always remembering our mask and wearing it wherever we go, we're passing out free masks, you know all over the place and I think we wanted to do more of that too. But I just completely agree with you. If there's anything in my power, I can do with your guidance to get more people to wear masks. Sign me up barbara, so happy to follow up with that. After this, the other question which I'll start on now I'll turn to dr tanui is: can we do testing in different venues like even the home setting? The answer to that is, I think, that's a great testing care, not testing but clear. This woman actually was sick and was taken care of in her home, with oxygen, tent and so on. It was an interesting article, I read sure well I'll, say one thing and I'll still turn to dr tenui to talk about sort of the care aspect in the in the home. Setting one thing I will say in terms of this related to the issue of oxygen, as you were saying, we've become the first major city as far as I know in the country to every single new case of coronavirus. So if you or anybody is diagnosed today with coronavirus, we're mailing a hundred percent of people that are now being diagnosed oximeters, that's the thing that you can use at home to keep an eye on your blood oxygen level, we're mailing it to everybody. Nobody else has done this, but I think it's a great idea and now you know- and you can sign up for even a text-based system where you can text us your results and, if they're out of the range where they should be, you could talk to a clinician right away. So that's something that we've built out to help people to be at home safely, but that's a component of a larger piece of home care and I'll turn to doctors. We have talked too much, no, never yeah! That's I mean it's a that's a great segue, I'm just going to share my screen one more time. Can you see that I mean, I think we know what we've seen a lot of the thing on the left, which is the pulse oximeter dr long's? Talking about you know, and we may not have seen things like on the right, which is the oxygen concentrator. I think this is speaking to your question. Barbara is during the pandemic, in you know, March April may, in new york city we certainly were at the borderline of the of bed capacities in new york city hospitals, yeah or over borderline. We certainly don't want to get back there again and are taking a lot of measures from a facility and a physical plant standpoint to expand those. However, we do have the experience unfortunate as it was that patients who we would have a hundred out of a hundred times admitted in March and April and the start of may who had low oxygen if it was kind of low. You might just go home with the thing on the left of the screen with you know, just with the pulse ox, and if, for those of you know the numbers down to about 92, you would just get a pulse ox if you're between 90 and 92, at least in our system from our 10, you know emergency departments, you would also get an oxygen concentrator, so we invested the hospital invested in this. Is this has no tank on it? This is just a huge. I shouldn't say huge. It is the size of like a really big toaster, oven, or maybe like a small microwave on wheels, no oxygen tank and essentially concentrating just the air into oxygen and able to give that to you at home. Why do we do this? Originally, we wanted to make sure, of course, that we had enough beds for the people who had oxygen levels that were 40 or 70 right, but what we quickly realized is when we followed those patients up, at least in our system. Most of those people who went home with oxygen concentrators didn't actually need to come back to the hospital they actually did. Okay and somewhat happier on their own couch. You know drinking their own beverages and eating their own food and not being around a bunch of doctors and nurses that were panicking, or, I shouldn't say panicking, but we're running around dealing with folks that had 40s and 70s on their oxygen monitors. So this is a long-winded way of saying that, yes, we did that and yes, we would be prepared to do that again, but again, this isn't for the sickest of the sick. This is kind of moderately ill, and certainly if you had a cough and a fever but otherwise have normal, what we call normal, vital signs. Your oxygen sign, your blood pressure is fine, your heart rate's fine, but were covered 19 positive, coronavirus, positive. Then you wouldn't get any of these things. Nor would you have needed them. I guess now that we have more pulse oxes. It sounds like we're getting these to everyone on the left, which is great. That's that's just great to hear so. Hopefully that addresses that sharing information that Cuomo talked about in early days or not so early like in may. Do you know what I'm talking about? He talked about the hospitals not being individual silos, but working together to try to address the information yeah. I can say a couple words about that. I mean that I remember back then very well, as dr newey does too, and we at that point. We were concerned about things like running out of beds and and also like the pragmatic situation of in our 11 hospitals. If somebody if it was, if somebody could be discharged to open up a bed for somebody else with coronavirus, need to be monitored. Where could they go? There was us comfort. There was a javits center, there was rimsey and roosevelt island, so there was a bunch of different options and it really came down to how can we as a city not as an individual hospital work together to get people where they need to go to unlock capacity for other people to come in, and I think yeah? I don't know if anybody on the phone has been to the javits center. I've visited their multiple times myself and actually was a great, a really good example of how we can work together. We people coming with like a pod with people from every hospital system getting their patients into the javits center, regardless of where they came from. They all ended up in the same place and that's what it took to really sort of have a city-wide effort. I thought that worked well. Thank you. Thank you. I just have a quick question and then rebecca and then we'll get to some of the questions that the public has sent just based on the oximeter. Could you just say when, at what oxygen level reading, should people go to the emergency room? Ah, I don't think there's a magic answer to that and it would be nice to have that every so all vital signs, including oxygen, are relative right. Just like heights relative, like what's tall, I don't know five, ten, six five, it depends. Are you playing the nba? Certainly there's too low right. I think, if you're in probably the mid 80s to lower, we can all agree that you should be going to the hospital. There are some people who live at 90 and that's their baseline. So if you're, so, if I were to say to that person hey if you're nine, if you're 91 or below, go well, they would say I live at 90.. I think if you live in a hundred most folks with no lung disease live somewhere between, you know, 98 and 100, 97 and 100. I would say, certainly if you're below 92, if you're below 94, but the real nuanced answer is anytime. You feel like something's wrong subjectively. I want to see you in the emergency department and you know, there's not a real number and I know that's couched in a lot of you know: side comments there, but there's not a real number, but certainly I think if you live 97 to 100 and have no lung disease, certainly below 92, if you could maybe argue even below 95. wow. Thank you rebecca and then we'll go to the public hi. Thank you both so much for coming and speaking to us. I just wanted to make sure we got to some of the questions that were submitted ahead of time, so I'll ask one of them over the past several months. Many of us have missed family events because of kovid and now the holidays with the holidays. Coming up in november and december, it presents kind of a conundrum for people, especially those who are at higher risk and who don't want to bear without seeing their family any longer. How can they plan and you expect that there might be a lot of traveling to very highly infected states during the holidays and how will that affect new york in the future? This is said. I gotta get started on that. So, if you're going to visit family members that are potentially people that would be susceptible or higher risk, if they did contract the coronavirus couple, things number one get tested before you see them, you can come to one of our sites get tested. If you're positive, you definitely shouldn't go, but if you're negative, then that's helpful to and reassuring for you and your family to know, but regardless of negative negative results or not, you should always still practice social distancing, proper hand, hygiene and mask querying. So that's that should be our mantra in any scenario or visiting anybody. So I hope that helps. I think one of the things that we want to encourage people to do more of is, if you are going to visit your family again, come in for a test ahead of time, we're happy to do it. The other part of your question was what, if you are going to go and visit family in one of the places that has a higher risk for coronavirus now you know that we're encouraging people for vacations to try to stay locally or places where they can drive to that are not places that have a lot more coronavirus, visiting families, obviously a special case-by-case scenario, but for people, if it's just a matter of a vacation like it could be Florida or it could be the beach here. Beach here is going to be lower risk, so we are encouraging people to stay more local if they can. Thank you. There are. We all know that testing makes a huge difference, as you've pointed out, and dr tanoy has pointed out in stemming the spread of the virus. But there are some issues with respect to testing and a number of questions from the chat have to do with that, such as how long it takes to get test results. If it takes 9 days or 12 days to get results there, they potentially have infected a lot of people by then, so the contact tracing may not be as effective, and one gentleman who chatted said that his question said that he gets tested every two weeks, but would you have a recommendation for how often and he's been negative? How often people should continue to get tested and is there any change in the way in the time frame for getting test results or potential time frame? Thank you and you may have a better a sense that I can talk about our experience, but why don't you go ahead? I'm happy to start then, to talk about perfect, so we need to get test results back to people as quickly as we can. What we're doing as a city now is we're promoting the use of things like pooling, which in a nutshell, is if you have four people. Each of them has a test if you put them together and run them once and that overall sample is negative, you don't need to run each one individually, you'd say if you save four times as much time. You can only do that if you're, in a situation where you have a low enough percent positive, which we in new york city have earned. So we have the ability to now do things like that and get people's test results back faster. Because of that said, this is not a is a problem we're still solving now we need to get our testing turnaround times lower than we currently have them at new york, city, health and hospitals. We have a variety of arrangements with several different reference laboratories, so one actionable thing that you can do and then I'll turn to doctor for his review on this, too is our sites, do have some of the lowest turnarounds in new york city. So you can tell your friends and colleagues to come to one of our new york city, health and hospital sites, and we do. We will get you your results faster than some other places and we're proud of being able to do that. So that's something actionable to do, but I I do want to acknowledge. We need to get our turnaround times as low as we can so that we can power our tracing operation to know who is positive, get their contacts and help them to quarantine as quickly as possible. Dr yeah, I can give you know as a more micro view, I think at the new york presbyterian hospitals. You know we have several kind of more rapid testing, but we're certainly trying to make sure that the communication loop is tight and what I mean by that is you know if you came today versus a week from now, the turnaround times might be different depending on what's happening. You know with reagents and the number of people and the number of kind of tests. You know that we're able to do so. You know we don't want to commit to. Oh it's two hours. You know the rapid tests are two hours or 20 minutes or whatever, because I think then that sets a unfair expectation, but what we want to be able to do is commit to telling the patients who come in how long they're going to take. So I can tell you if you came today right now, we can turn if you need it to be admitted. We turn around a test within an hour to two hours depending you know how the labs working and what they're stretched at now, but notice. I said if you're being admitted so this is not you know, hey. I want to fly to so and so to you know to this place, and I want to get a test we're doing that at our hospitals, but that's a longer test and I will share. I know this is being recorded, but I will give the caveat that this is just a slice of time right now. I will share that. You know the slower tester, probably coming back in a day and a half, however, and then we call those patients back, you know, so that's a median time that might be the next morning. If you came in the afternoon, it came on friday evening that might be you know sunday. It could be monday, you know, but depending how many weeks back or how many weeks forward you look, that number could change pretty drastically that could go down to under a day or that median time could go to above a week and again you know, I'm not speaking for anyone other than our own, our own institution and experience right now today. Thank you. Thank you. Someone asked how accurate are the daily reported infection rates for the people and who are interested in those numbers either. One oh ted, I think you're on you're on view. Sorry, okay, here we go elita. Do you mean the daily percent positive across new york city in the number of new cases across new york city? I I'm not sure if the person specified, so you could answer for both sure yeah they're definitely very accurate. It's what we base a lot of our actions on. So when you look at the percent positive, that's a good one. If you're going to look at one to focus on, for example, the world health organization sets a threshold to be considered at five percent for things like reopening schools, we have a more conservative, a percent positive across new york city that we have implemented in order to consider reopening our schools. That's three percent. Almost half of what the world health organization has said, you'll get other places in our country right now we're at one to two percent, we're actually even less than one percent of all new yorkers that got a test for testing positive. Last week that's the best of any major city in our country, so you know we're in the position where that that's one of the leading indicators that we really look to and we're that indicator is definitely accurate and looks really good for us now. Unfortunately, you look at Florida even California. The percent of people that are being tested that come back positive is significantly higher right and then someone else had asked and then we'll get to some of the board members. How much risk is there being in a closed space such as a subway with people who are not wearing masks if you're wearing your mask and a lot of people are wearing theirs, but not everybody also, sorry I'll, say we have not seen a lot of transmission that as far as we can trace back to subways. That said, though, and you have to remember what I'm about to say, is the most important thing- everybody should wear a mask that that's the key take home here, if you're in any scenario where you're wearing one or somebody's, not or vice versa. That's not an ideal scenario. The correct answer to that question has to be regardless of the greater or lower risk. Even if it's a marginal difference, everybody wearing a mask is the solution to that question for sure. So we need to remind ourselves if you see, I actually I hand out masks to people that aren't wearing them. Hopefully that's not obnoxious, but that's the thing as barbara was saying earlier. That's one of the single most important things we can do so. You'd suggest that people get off the train and wait for the next one if they're wearing a mask- and there are people who are not I'd, suggest the people that aren't wearing a mask there should be, they should wear a mask. I know we all agree that people should do different things than they might otherwise do. Let's get to some board members, and then there are some other questions from the public as well rita. Well, would you want me rita? Thank you very much. You two duck is fabulous two questions. One is that I live in a building with a very high popular, very large population of seniors and around september or October. I start my spiel of how everybody should get a flu shot. Some people have a reaction to the flu shot. Just normally will that make lower their resistance to getting covered. I know I I'm already hearing pushback and yet the flu is very dangerous, especially to older people. What do you have any reassurance that I can have tell them to get their flu shot? No, I share your. I share your advocacy people do. Have you know some people do have reactions to flu shots. Sometimes that is you know a trend by the person. I've certainly had that before that you know just because you react to one year's flu vaccine doesn't mean you're going to react to the next year. Some people have you know those reactions, but it should not lower your resistance in any meaningful way to being able to fight the coronavirus, and I would say everything in life, as we all know, is a risk-reward combination right and the risk of not getting the flu vaccine seems like a big one to take, so I would always recommend that you should get it. I completely agree and rita. I could tell that you're a fierce advocate for the flu shot, so if you're ever looking for another job, we really need to get the word out. So let me know the fierce advocate for everything she believes in last, but not least today in the times, and I get the times digitally so I don't know if it was in the printed paper that somebody in china who had contracted the virus and overcame it actually, you know we hear about antibodies, actually has been rein infected. Do we know anything about that? Are we is that going to be a red flag? Do we have to now? Besides? In this, you know secondary testing or are people to be more aware of people who already had the virus and who are better than me. I haven't had it and I'm not getting it so. Well, I tell you what I will. I have to hop off and unfortunately now but I'll say a couple words and I will leave you in the better, more capable hands of dr tanui for the rest of the time, I'm here so the sobering thing about what we're seeing there is that the if you, your antibody test, does not necessarily mean immunity that that's the key takeaway there, so we're still learning about what the antibodies mean is it partial immunity now remember, in that case the person when they were likely reinfected, it was a much more mild course, so it was not the same as the first time. So maybe that's what antibodies mean. Maybe antibodies mean immunity for some period of time. That's what we're still trying to figure out in the scientific world, but everybody has a laser focus on. This is the right question to ask, but I think I would say you know to go back to one of the to our original point here: there's no panacea that we have now so, regardless of factors like that, wear your mask and get your flu shot thanks. Everybody. Thank you. So much for joining us. As dr long had mentioned, dr tanaway is still available. Dr long, thank you. Thank you. Thank you. Okay, brian, you have a question and then we'll get back to the public. Thanks will yeah thanks will and elita so yeah. I guess for dr tanaway. Where are we because I know dr long was about to talk about it? Where are we as far as the at-home test, and I just I asked that because I work for a health insurer and we're actually, you know debating whether we're going to send you know an at-home test, all our policyholders, our medical policyholders, so I just want to see where we were as a city as far as you know, doing more at-home tests yeah. This is where I wish dr long were still on. But the short answer is, I don't know you know from the emergency department perspective. I think, from a hospital perspective. We support you know even moderately okay testing, that's be it being able to be pushed out. Unfortunately, I'm just not that it's not kind of my area of expertise. You know- and I wish you'd offer more than that. I know at you know a hospital level we're certainly trying to ramp up the amount of rapid testing and, again that's still, the nasal swabs there's been talk of doing buckle or mucosal kind of tests from the inside of your cheek, but in terms of at home stuff. I don't know, I'm sorry, okay, no all right. I appreciate it yeah. I know that's probably a doctor long question, because yeah we could have done the epidemiology ones up front. I'm sorry! Okay, I see that someone from the public alicia has raised her hand. Alicia. You may have to confirm on muting at the bottom of your screen. There you go yeah, okay, yes, I place already a question and they think. But regarding the comment about this, the second time the person got the case. I also listened on the radio. It was either bloomberg or 1010. They said that was the case of hong kong in hong kong, and that was the alarming part, but also when they test. When you have it, they say that not everybody has the antibodies right. That's my understanding, that's what they do. The test of the antibodies. When they were testing the people that they could help some of the people contaminated so but it happened today in hong kong or yesterday, probably now my question was: if we continue going on these visits medical visits through the internet, when I'm going to have a blood test or all my oxygen level and blood pressure taken, you know, that's a question. I have I'm a senior and- and I have low oxygen level in general. That's what I have not been volunteering. That's I mean that's a great story. I'm sorry go ahead! Yeah! No! You see that's my question because I am taking notes that I live on 97 now 95 97, but there was a moment in my life January of last year when I just couldn't walk and I have to sit down in the middle of the street and I didn't know it was the oxygen level you see, but so, but I'm not. I am not asthmatic or things like that. So now, because of my own initiative and a friend told me be careful because the first indication that you are getting the virus, this virus is low oxygen level. Even more important than the temperature, so that's what I take it frequently yeah. You bring up a lot of good questions and comments there and I'll try to pick that apart. I think for the first piece of getting reinfected. Of course we don't want to get infected in the first place right, the reinfections in a single person. I think we shouldn't focus on that as much. I certainly know physicians, like one of my colleagues probably had it twice and that's just a real anecdotal. You know piece of you know story, and it certainly has happened. You know, I think it's less important to focus on that other than to say like what dr long was saying. If you've had it the first time don't get cocky and if your family members had it a first time, don't let them get cocky that you know. I think that's the that's one message there. The second thing you had brought up was about. You know I'm at home. How am I gonna? Get my blood tested, my oxygen checks. You know these important things that we're all used to getting, but at buildings that aren't our home right. This is where I think, just overall american innovation does very well. You know in american health care and science and I think, within the matter of a couple months, we had turned at least in new york city when we were hit very hard. We had innovated very quickly and strongly, and you know a few examples are what dr long and I were talking about. Is we never thought we'd be treating pneumonia on someone's couch with a portable oxygen concentrator that showed you and a little pulse ox? Now that doesn't answer the question of how do you get that information to a hospital or a doctor? But I think many of us probably are aware that there are companies out there and hospital systems and there's the public sector out there. That's working with remote, patient monitoring- and there are you- know private companies, there's other. You know, there's other companies that are affordable solutions that can get that pulse ox a similar type of finger. You know monitor to send signals out every few hours minutes the lower tech thing that we have done, but it's still a good solution is for you alicia. I can send you that pulse ox device and then we can have a nurse call you every day and say what what's your oxygen now? What's your oxygen now, we actually don't need to monitor it. Every second, we connect. You know as long as you're feeling, okay, we can monitor it once a day, if you're trying to say something you're unmute, I don't know if there's a follow-up there. Well yeah. I have the thing for the finger. You know and I take it now, almost like every other day. You know, but I'm careful. I try not to go out. That's mainly the thing, but it's for all the other things. You know right, that's yeah, but they do a lot of things on. Oh that's good to know you know, that's thank you very much yeah and then I'll just address. The other thing that you had said is there's a lot of systems that are now retooling. The setup sending blood draws to you. So somebody who's, purelled and masked up and has a gown on, comes to your house and then can stick your vein right in the comfort of your own living room rather than you having to go into a place, and this is decentralized healthcare. You know I was talking to the president and the ceo of our physician group last month and you know we're retooling patient experiences across new york presbyterian, while cornell to make it more efficient on every visit right. So formerly, if you needed a x-ray and then a blood draw and then an ultrasound and then a doctor's visit that would be four visits. Now we're trying to make it one right. So if you have to come in we're gonna make it efficient for you and what we're trying to do is if you never needed to come in, if you just needed someone who draws blood for a living to come out to your living room and draw blood, it's not just us. I think other health care systems are going to do the same and I think we're going to adapt to this new reality and we may be looking back in 2022 or even next year. Thinking god, why did I used to go to the hospital to get my blood drawn? That's so antiquated. Why did I used to you know need to be admitted just for them to watch my oxygen. It was 95 and I felt okay, you know so I'm just per I'm just posing maybe a new way of doing health care of delivering health care. That might make more sense for all of us. Thank you very much, but I was born in a country, peru when I was a child yeah. The doctor came to my house. Actually he was my godfather, but that was the usual thing you know, and they came to my house to put me an injection, because that was the thing to have. Ah, but thank you very much now. I know how to talk to my geriatric doctor. Can I just say one more comment that you? What on something you brought up from a doctor's perspective? What you're talking about? I think it was your grand grandfather you said had come over, and so somebody who you kind of knew a physician came to your house. What telemedicine is allowing us to do is re, regain that doctor-patient experience, that many of us went into medicine for and having a one-on-one, essentially a facetime or zoom or skype. Whatever you know, you're using being able to talk to a patient one-on-one on video, you realize that almost a much more intimate experience, even if it lasts for three minutes, then you might have in our er with you know, 20 other people and again in different rooms. But you know I'm going to be caring for 20 or 30 other people when I, when I'm on a telemedicine visit, I'm just caring for you, and so that is a difference that I think we're gonna evolve into as a country is how we deliver healthcare, not bringing the patients to us but bringing health care to patients. Thank you. We have someone else from the public will suzanne b and you may need to click the button at the bottom of your screen. I know I could figure it out for a while, because that's zoom thank you for taking my questions. I took a picture of the screen because I sent will a lot of questions. So I'm just going to look at the picture of what I sent him so I don't become redundant. One of my questions was answered already about that wearing mask, and I was really glad to hear dr tang was it say that he wants to do a real incentive of people wearing masks because people in our neighborhoods, as far as I'm concerned, are now wearing them under their chin or not wearing them at all or if they're running they're, not wearing them and so on and so forth, and I'm in the I'm 71, so I'm in a vulnerable population and live with somebody that has cancer and ulcerative colitis, so I'm very concerned about taking the virus into our home. So I'm glad to hear that about the visiting relatives. Dr tenuay. Yes, you know in my experience, I just had a colonoscopy and it took four days to get my test back and I tried to connect with lenox hill hospital, who said they had rapid testing, but nobody picked up the phone at that location. So I think we, if we're thinking of visiting relatives, we have to keep in mind that when that test come back four or five days later, you may have contracted the virus in the meantime. So it's not a concurrent situation and to be very careful and to practice the social distancing that I think was talked about in wearing masks anyway, because otherwise we're taking the virus into people that are more vulnerable. Is that something that you can agree with? Absolutely okay? Go ahead! Yeah! Absolutely! I think you know there's a couple pieces of- and I have done this myself. You know my wife and my eight and a half month old daughter had to fly to minnesota for a family, a family event or, and so I've been through this personally and you when you have when you take a test, you have to know that the test isn't perfect right, and so you put that together with how you're feeling you know your exposure and so like you're saying suzanne. If you have a test and it takes four days or a week, you have to consider all that time that went by between when you got the q-tip in your nose till when you got the result. Also, you have to factor in that. Not every test is perfect and there are some false negatives, meaning it says you don't have cova 19, but you do or you at least have virus. So you have to factor that in that's still a very small percentage, but that is you know, that's a possibility. I'd say those are the two major things you have to remember: there are false negatives and that unless you're doing a 20 minute or two hour test or something there's going to be days in between, so you really have to be careful of what you're doing in between overly careful. Thank you, dr tenuay. I have one more question and it's for you because you're the doctor here, as far as I know, I'm trying my best she's, the only one wearing the white coat yeah. I when I, when the virus first arrived here and we all were realizing that we all of us had the potential of getting it. I tried to get a single shingles vaccine in March. I'd been trying to get it since last year, but there were problems with my medical records, weren't updated, and so I didn't. I couldn't prove that I had it before and what type they said you have to have a different type. So I talked to my pharmacist when I got the go-ahead and she said, are you sure you want to do that? And I said why and she said, because vaccines lower your immunity temporarily- and this was at the height of when the screens that you showed there before- which I forgot one and what is it one and one person was dying every 14 minutes or something like that I mean so I never got the shingles vaccine the second time. Because of this, can you tell me a little bit more about I'm concerned about the flu vaccine too. I want to take it. I get it every year, but now I'm wondering. Is it a good idea because of what- and I trust my pharmacist- she often knows a lot more than the doctor that prescribed the medication. I'm sorry today, but can you please elaborate on what you said earlier sure? Thank you. That's my final question. By the way. No, I appreciate that the so the I guess, there's just a couple things to you know a couple basics to take away. Is you certainly can get two viruses at once and so you know you could have adenovirus and rhinovirus. They both caused the common cold, but we we've known that when we swap people every winter. Sometimes two viruses come back, so you have two for the price of one type of thing. You still have a cold. You just had two things that caused you cold symptoms and so it you certainly could have in this case shingles or the flu as well as coronavirus, and if I, if I had to pick for myself, I'd only want one of those at one time. That's to say that sure you could get two things at once, but I still think we have to con contextualize risk and benefit, and this all comes back to. I agree with your pharmacist, saying that in you know, April 15th, when I'd say somewhere on the order of 97 of the patients that I saw in the emergency department were Covid-19 positive. I have an exp from a management standpoint. I have an excel spreadsheet that gets fed to me every day on literally the Covid-19 swabs that were done from the emergency department and the whole thing was positive. That was normal in March and April. There's the all. Every rose, positive pause where it actually says detective detected. Oh really, now it's very odd. You have maybe one or two a day, sometimes zero that say detected so you're living in a place where you're unlikely, you're less likely to get. You know: Covid-19 19, while you get the shingles vaccine or the flu vaccine. If you get that reaction to vaccines in general, I think most people still don't have a reaction to either. I hope that answers some of your questions. I guess my blunt recommendation is now that we're not in a pandemic. Luckily in new york city now, might be a great time to get the shingles vaccine right. Thank you. I was thinking that doctor, but you said in the latter part of when you were finishing up. The concern at that point was not whether I would get two at the same time, but whether getting the shingles vaccine would expose me more and make me more vulnerable to the coronavirus. So that is still my question. How do you feel about that? I mean I don't have reactions to flu shots. It's like nothing. I never get a sniffle or anything, and I wouldn't react to the shingles either. I'm usually not reactive to those things, but I'm concerned about lowering my lowering my immunity to pick up the corona virus and the flu shot isn't ready. Yet so, who knows? What's going to happen in like a couple months? You'll never get a good doctor to commit 100 to any answer because we've, you know, we've lived the experience of weirdness. So all what I would say is that it is certainly well worth the very small risk that it would lower your immune system enough, where you would contract the coronavirus. Because of that. If that happened, and you got vaccine on day one. If you got the shingles vaccine on day one and then dave you know seven or something you start getting a cold and have in fact have kovac 19. I would argue that you probably would have been. You probably would have gotten that anyway, because something happened during that time period to expose you and it was not the shingles vaccine and I think it's well worth that incremental risk of getting it for the benefit of you know of the vaccine of getting the shingles vaccine. Thank you, dr tenewei. You did a very good job in answering. I appreciate it. Let the next person ask okay we'll go to the board right now, cause we'll, because when you're ready just push the button in the bottom of your screen yeah, I guess my question is not so much to the doctor, but what about enforcement I mean until you enforce mass, squaring social distancing gathering. This will never stop. I mean the medical profession is doing a great job. Contact tracing is great, but what can the medical profession do about enforcement of masks? I mean walking around you see police department, five, six, seven policemen gathered in a group, no masks. You watch the videos the police only put on the masks when they're on video. So you know until enforcement is really done. Can anything be done? The other thing with quarantine from states with high contagion, I mean what enforcement is there for the people coming in there's no checkup yeah, I'm coming from Florida yeah. You will self quarantine for 14 days, there's no checkup. So really, how can you stop it when there's no enforcement, then what about these quick? Hampton the hamptons testing 15 minute tests, hundreds of dollars to get into a a mass function? What you know what goes on there? Are they really accurate? That's all I think I can. I can respond to some of those. You know I think. Yes, resources exist where they exist. I and I think, if in small pockets, where there's the ability to do rapid testing, they do rapid testing. You know: national basketball association has a bubble that they're playing in down in Florida. There's rapid testing there every day for everyone, not just the players, we can't make a bubble over 330 million people, and so we you know we have to do that in pockets. That exists, and you know I it is frustrating. I kind of share your frustration that you know there's not tons of stick. You know that the medical profession can use, there's, not a lot of enforcement. There is carrot, though, right you can model good behavior. You can do things like you know. I hope I'm doing now, which is talk to you, know community leaders and talk through some of the concerns ends. You know talk through some of the problems from a health care perspective, there's a lot of great advertising and kind of modeling by either famous people powerful people, you know mostly, who are not health care leaders. I'd say, and I think we all do our part in our sphere of influence. I don't think we're ever gonna be in a America or a new york city that handcuffs you to you know the baggage claim when you get out of laguardia or jfk and says you need a you know, a full exam and a swab before you get your bags. I just don't frankly think that's going to happen, but that's okay right. We work within our constraints and you know. I think that when we're responsible for us and the folks around us, as we've seen in the most crowded city in America, you can kind of achieve something that works for everyone that doesn't that doesn't answer any of your questions. Probably, but hopefully that's a response. Thank you. I know you have to leave in a few minutes, so we have two more questions, one from a board member sharon and then from julia, and then I have a quick question for you. If you still have time so will would you have mute sharon, please sharon, whenever you're ready there, you go all right. Thank you, alita and thank you, dr tenuay, and also barbara rutter and rebecca dan gore really appreciate this very much. Thank you for organizing this, dr tenuay. We have heard over the last several months that the Covid-19 virus has impacted certain groups of people more than others and in particular, for example, poor people or people of color, and the conversation has really been focused on the lack of pre, lack of access to health care previously and other reasons. But we know for sure that there can be certain instances where they'll show up at the hospital and not receive adequate care or unequal care. And my question to you is: I really looked at the presentation that you made and you know what I know that columbia. I know that presbyterian hospital is going to do a fantastic job at protecting people and you've outlined that. You know with the spacing of the chairs, for example telehealth and telemedicine, but at the level when you're interacting when the when the individual is interacting with their health care provider at the hospital and they're and they're from those groups that have been marginalized from the health care system who, in certain respects have historically not received equal treatment. Have there and I do apologize for not getting directly to the question. But I'd like to know. Have there been conversations that look at addressing some of these inequalities overall? And I just want to wrap up by saying. Thank you so much for the work that you do. I think that emergency room doctors or the unsung heroes in all of this- and I really appreciate your efforts to be here tonight and overall, yes, sharon. Thank you for the question and thank you I mean thank you for bringing up just you know, health inequalities that have existed for yeah, clearly much longer than just 20 20.. You know, I think you know it's a it's a big. You know how do you address that right as a as an organization, certainly from an individual physician level? I agree with you. I think we know it exists now and I think we probably always knew it existed. The question is how to turn that around you know and there's not one answer, and I'm of course not going to be able to outline an answer in a few minutes, but I can share with you some things that new york, presbyterian and while cornell medicine have done, and I think it's worth noting that to the group that maybe you know those two organizations might not be thought of just as peop as organizations that would, you know, want to highlight this inequality, but I think we've done such a great job of doing that down to every employee level. I guess I can share a few. You know just things personal experience, I think certainly basic employee training right, and that goes to doctors that goes to nurses, doctors in training residents. You know, staff that are not clinical of unconscious bias. There's, certainly not only- and you know, people learn in different ways right, so there are zoom community kind of meetings amongst the hospital folks and among the medical college. Folks, who kind of discuss this often led by you, know, leaders who know what they're talking about often have personal experience with that? The second thing is not just these programs to help our learning and like peace in you know, maybe hold a mirror to our experience and say you know, have you seen this before in the ed you probably have, and you should just recognize that it's there, because maybe you saw then you just didn't recognize and I think that unconscious bias training has been helpful, even though I probably get to see that every day, but also you know appointing people who have those experiences and putting them as leaders of the group, and I think both institutions have done that and making sure our healthcare providers not only understand but look like the people who are serving right and I think that's been a big push before 2020 and kova 19, but I think this really amplified it and gave it a lot of credence. So you know I again. I there's no way I can answer that, but I hope that just sheds a light into yes, it does the commitment to that. You know diversity and everything have been have certainly also been established at both the hospital and the medical college so anyway, thank you, jared yeah. Thank you, yeah. Thank you very much. Thank you. Thank you. Sharon and we have do you have time for two more questions. Doctor yeah, absolutely thank you ellen. Would you unmute ellen paul of the will yeah ellen? You just have to confirm it there you go okay! Thank you, hi. This question has to do with how the hospital staff protects them, how the hospital staff protects themselves from transmission and has anything changed in what you're doing to protect yourself from transmission now that the transmission rate is lower and what and the second part of that question is what are the takeaways for the lay person? You know the regular person on the street to do the same thing as that you're doing. I think, if you got to spend a day with me walking around what you'd see is I'm always wearing a mask in public and that's a surgical mask. I have it right here, because I can't leave my office without it. So if I go to the bathroom, it's a surgical mask not an n95 necessarily but a surgical mask now you can. You know you can say why not at n95 and that's a very kind of nuanced discussion there. I think if you have, you know the ability to always have n95s on well, certainly that's the best right for that individual person, but right now what we've decided as an organization as surgical masks on at all times, you don't need to wear gloves when you're going in between doing normal work. So if you spent time with me at the computer typing, I'm not wearing gloves once I go, you know into a patient's face. I'm doing the same thing I was before Covid-19, which is you know, hand sanitizer before hello, there's no handshake anymore. It's a lot of this, so it's in keeping the spacing so the six feet thing is real. You know it's a nice catchy way to think, but I don't go next to the patient that much until the actual exam happens, because I'm reducing my own. You know time when I'm next to a person. Just like we sit, you know the doctors, nurses we sit far apart, so we're not spreading it to each other we've, but we're also doing the same thing with patients and visitors right: we're not putting patients and visitors in chairs anymore. That's right on the other side of a half wall. So it comes. You know it has the potential the virus would have the potential to kind of come up and over the wall. So there's no secret. I guess it's. You know, but I hope that kind of outlines some of the do's and don'ts it's surgical mask when we're just seeing the average patient. It's not gloves unless I need to or I'm examining a patient, so I'm not wearing gloves at the computer, I'm not wearing gloves to go in and out of the hospital, I'm not wearing the full. You know bunny suit or any of these things like hazmat suit in and out of the hospital, but certainly when I get home the first thing I'm doing are scrubs or you know, shirt and tie go in the laundry or right in the washer dryer and you take a shower and you just kind of decon what you can. So it's spacing. It's a it's. Definitely a surgical mask n95. If you can or wants certainly more that's more protection and to make sure you're, you know we're doing everything that you're that we said you should do with spacing. Thank you. Thank you. I have a question. Are you expecting? Is the hospital expecting a second surge and what happens in the winter, because I've read that the virus is more virulent in the winter? So what happens when we're all back inside again yeah, that's interesting! We're definitely preparing for a second wave and we've been preparing. Since the first wave ended, you know what are we gonna do if this comes back, so you know I'm on. You know enterprise-wide committees for things, and you know from the emergency management, standpoint icus and then certainly vertically across you know clinical departments I shared with you, expand like physical expansion plans. Those are clearly at the hospital level, so we're vigorously preparing for a second wave and at minimum it's a great planning exercise right. I heard this quote. I think it was eisenhower's quote. Don't quote me on that, but you know plans are nothing, but planning is everything you know the act. The exercise of planning is a very useful one. We know that the plans aren't going to go exactly as we planned them, but that's okay, so we're we know that it might not hit exactly like. We think- and that might be to your point. It might not happen in the winter. Maybe it happens next June. You know and surprises us so timing and in terms of numbers we know that we we're not going to know but we're preparing for the worst. I'm sorry. I was just going to ask what would cause a second surge? Well, I'm not even sure if I'm qualified to answer that question then never mind, but can I can I talk about the virulence? Yes, please, whatever I'm, not a virologist and certainly don't claim to be a virologist, but I think from the layman physician point of view, what we kind of have heard from virologists who study this. Is that and you guys maybe have heard the same things as overall viruses want to become. You know to transmit more and kill less over time, so they themselves as viruses. Can you know populate? You know it's tough to know what's going to happen in the winter, but that might be a trend you see is slightly more contagious, slightly less sick again. This is not me speaking as a virologist. This is just kind of a thought that has been drummed up from that scientific community. So that's a way to think about it. But again, I think when it comes down to these types of questions and believe me, I get asked a lot of these same questions at the bedside. Is we have to remember what we can control and then what's interesting is on the side, there's things that are interesting, that we can't control and then there are things that we certainly can control. I think we spent a lot of time. I'm glad talking about those today and I think those are the things we should be focused on, and you know we can't frankly control the virulence of a second wave and we can't control the timing of it or where it happens, but we can prepare and we can kind of promote and ourselves be responsible. So hopefully that you know is something where we can end on a upbeat note, but I'm happy. You know I'm happy to talk more on that, but that that'd be what I'd say. Well, maybe you'll come back in a month or so and we'll see what things look like, but it sounds from what you were saying and dr long was saying that the the landscape will look very different if there is another surge because of the knowledge and the preparation and the public awareness and behavior. The last thing I said, thank you for saying that is I was talking like I said I was talking to our chief of the icu today partially in preparation for this. I just wanted to know what I didn't know. You know what he said was you know: we've gotten a lot better at treating really sick people right, because, of course we saw a lot of sick people, a scary amount you know, but because of all that experience we're able to really understand how to treat the virus from a supportive care standpoint, which really means, like they've, learned how to use. You know fluids and ventilators and just really be a positioning of people, and I certainly don't want this to branch off into a whole. You know: what's the science, what's the evidence on treatments, but it I bring this up specifically to say that you know he and his team at the hospital certainly learned a lot and he'd say you know I could. I can take care of not just one but 40 icu patients who are intubated much better now than I could in March, and we know you know the human triggers the lab abnormalities to act on. We know what to do. What not to do, and a lot of that is based on you know, icu patients again so hopefully none of us on this call will ever you know be in that situation. But you know if you are, if your family members are know, that we've learned a lot that has nothing to do with these. Like you know, small clinical trials that are out there has everything to do with how we do bread and butter medicine. You know in our hospitals. Thank you for sharing that and all of the information that you brought tonight on behalf of community board a we are so very grateful for your time and your expertise and you're willing to provide this information to people from across the city. Thank you. I think it's reassuring and it's really good to know where things stand, so I think maybe we'll be in touch about other programs if it's okay with you, but in the meantime, thank you. Dr tanaway. You've just been terrific and very informative. Thank you for having me guys it's a great closer. Thank you so much, and I just want to let everyone know based on sharon's question. We are going to be exp. Our committee is exploring health and equities in september and October we're planning on having three zooms. So I hope to see you all there count me in. Thank you. Thank you so much dr tanaway, and to the public and to the board for participating in this good night. Everyone.",
        "summary": "Since then, we've been good about wearing, masks, social, distancing, washing our hands getting tested and answering the contact tracing calls, but is that enough?\nWe worked with ps290 in the neighborhood and may have read about on the new york post, and we said we need a nurse in every school, a full-time nurse because of pediatric multi-implant multi-system, inflammatory syndrome pmis, and the mayor did finally agree to do those 400 nurses, we've also been pushing for remote learning, using everything from libraries, senior centers and even empty storefronts, and the mayor's agreed to make a hundred thousand slots of voya available.\nIf you have an idea for a slot, let us know you may have read today's new york, post and editorial in support of, if we're doing all remote learning for 400 000 students that we could actually integrate those classrooms and get gnt to any student who wanted it and another key piece that we've been hearing.\nI think the key thing is since the beginning, working with these experts and others to get testing for everyone trying to get beyond the painful swab testing, but to even saliva testing and rapid testing, so you're not even having to wait 10 days, but actually waiting a couple of minutes instead of hours, and so I think the thing I am hoping for and if we can't get a vaccine anytime, We are not going to administer vaccines to people without a phase one or a phase.\nDr long from new york's h and contact racing What I want to do is talk to you about our current state of what we're doing in new york city now to suppress the coronavirus and then talk a little bit about in preparation, for if there is a surge, what things will look like then, and everything we're doing to keep you safe and protected during that time, as well, so, starting with the beginning, new yorkers, is something to be proud.\nThree things number one testing number two contact tracing and number three helping people to get through this for them and their families, either at home or in one of our hotels.\nThe other thing that people then ask is well if you're completing your intake and finding contacts of which we found 30 000 contacts in new york, city- How do you know that people are actually isolating at home if you're diagnosed with the coronavirus?\nWe, call take care right now, more than seven 000 times we pair people up with resource navigators to give them what they need in order to stay at home.\nFor example, the one I'll give you is sunset park in sunset: Park : we've actually planted ourselves there ingrained in the community there to bring the community out to knock on doors, to get people to come out and get tested, we're going to be releasing our new numbers on that soon, which are very encouraging.\nBut that's a picture before of what new york, city, hospi, emergency departments used to look like right, and certainly at capacity not wearing masks.\nIs, the e.d, safe right, and so let's talk about that first question: When do you want to come to the emergency department?\nThe second question that people has not just when should I come, but what are you guys doing to keep me safe right and just a few pictures here, and this is pictures of our of our wild cornell emergency department there on the left.\nI should also talk as every hospital does, there's visitor limitations to reduce the number of people in hospitals, as well as in the emergency departments and other things you would experience.\nThe point for the for the people listening are there is that there's systems in place that are extremely rigorous to protect patients and the visitors and is of course, ourselves I'm sure there are going to be testing questions that come up.\nYou know enough time, talking, but just takeaways here from the hospital perspective, we're certainly actively planning for the second wave.\nI guarantee you that and then certain low acuity health issues, like we kind of, went through, consider using video, consider using telemedicine, and with that you know thanks for your time, guys And, we'll open it up to everyone for questions.\nThere was an article about home care, somebody who was very sick and instead of going to the hospital, had somebody come in if she needed oxygen and so on, and she did.\nDo, wear your mask and if we do open up restaurants and go into public buildings and to observe the rule and so on, and I'm wondering if even more pr as time goes on, because it worries me that the more normal we seem, the more relaxed I see it in restaurants, people We want to feel normal in a restaurant and whatever normal means.\nOne thing I will say in terms of this related to the issue of oxygen, as you were, saying, we've become the first major city as far as I know in the country to every single new case of coronavirus.\nTalking about you, know, and we may not have seen things like on the right, which is the oxygen concentrator.\nWe wanted to make sure, of course, that we had enough beds for the people who had oxygen levels that were 40 or 70 right, but what we quickly realized is when we followed those patients up, at least in our system.\nIf you're going to visit family members that are potentially people that would be susceptible or higher risk, if they did contract the coronavirus, couple, things number one get tested before you see them, you can come to one of our sites, get tested.\nThey potentially have infected a lot of people by then, so the contact tracing may not be as effective, and one gentleman who chatted said that his question said that he gets tested every two weeks.\nWe need to get our testing turnaround times lower than we currently have them at new york, city, health and hospitals.\nYou can tell your friends and colleagues to come to one of our new york, city, health and hospital sites, and we do.\nWe need to get our turnaround times as low as we can so that we can power our tracing operation to know who is positive, get their contacts and help them to quarantine as quickly as possible.\nWe have several kind of more rapid testing, but we're certainly trying to make sure that the communication loop is tight and what I mean by that You know with reagents and the number of people and the number of kind of tests.\nThe percent of people that are being tested that come back positive is significantly higher right.\nJust I asked that because I work for a health insurer and we're actually, you know debating whether we're going to send you know an at-home test, all our policyholders, our medical policyholders, so I just want to see where we were as a city.\nAs far as you know, doing more at-home tests, I think, from a hospital perspective.\nYou know these important things that we're all used to getting, but at buildings that aren't our home right.\nYou know in american health care and science Within the matter of a couple months, we had turned at least in new york city.\nYou know I'm going to be caring for 20 or 30 other people when I, when I'm on a telemedicine, visit, I'm, just caring for you, and so that is a difference that I think we're gonna evolve into as a country Is how we deliver healthcare, not bringing the patients to us, but bringing health care to patients.\nIt's not a concurrent situation and to be very careful and to practice the social distancing that I think was talked about in wearing masks, anyway, because otherwise we're taking the virus into people that are more vulnerable.\nLuckily in new york city now, might be a great time to get the shingles vaccine right.\nI know that presbyterian hospital is going to do a fantastic job at protecting people and you've outlined that.\nAnd you know, people learn in different ways: Right, So there are zoom community kind of meetings amongst the hospital folks and among the medical college."
    }
}