{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "title": "MCB4 May 2020 Waterfront",
            "publishDate": "2020-05-22",
            "shortDescription": "Thursday, May 14th 2020\\n\\nAGENDA\\nWATERFRONT, PARKS \\u0026 ENVIRONMENT COMMITTEE\\n 1. Presentation: Hudson River Park Trust to Present\\n• Progress on Pier 97\\n• Scope of Work for Planned Restoration of “Private Passage” Sculpture in Clinton Cove\\n2. Presentation: NYC Parks to Present Temporary Public Art Exhibition Coming to Bella Abzug Park Summer 2020\\n3. Presentation: DSNY re Composting Collection Program Suspension\\n4. Committee Discussion: Pier 76 Tow Pound Relocation\\n5. Committee Discussion/Vote: Access to Pier 86/The\\nIntrepid\\n6. Committee Discussion/Vote: Response to Mayor’s Revised Fiscal Year 2021 Budget due to the Impact of COVID-19\\n7. Old/New Business",
            "lengthSeconds": "3:08:56"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "xcNdS9kmDKg",
            "fillerWordCount": {
                "uh": 1,
                "um": 1
            },
            "readTimeFullTranscript": "135 min read",
            "readTimeSummary": "13 min read",
            "wordCountFullTranscript": {
                "HRPT": 151,
                "building": 115,
                "slide": 85,
                "park": 71,
                "pier": 52,
                "project": 43,
                "design": 34,
                "bit": 34,
                "program": 32,
                "Chair": 32
            },
            "wordCountSummary": {
                "park": 22,
                "pier": 18,
                "building": 10,
                "HRPT": 8,
                "design": 8,
                "maintenance": 8,
                "peer": 7,
                "project": 7,
                "water": 7,
                "service": 5
            },
            "fullTranscript": "Janine- MCB4: Hello. Noreen Doyle, HRPT: Hi, there. Janine- MCB4: Hi,. How are you Noreen, Doyle,, HRPT:, Man Thanks. How are you, I'm, Janine-, MCB4:, Good,, thanks., Hi., Noreen, Doyle,, HRPT: Janine. You must be an expert during this. Are you Janine-, MCB4: I'm, not entirely.. I still have a few things that I'm, like so got to work through Noreen Doyle,, HRPT: We were very stressed when we did our first board meeting. Noreen Doyle,, HRPT:, Yeah., Janine-, MCB4:, No,, yeah,, full board meeting was pretty.. We had a lot of participants and it was very stressful.. Janine- MCB4: Yeah, we're getting the hang of it. Yeah. Noreen Doyle, HRPT:, Good. Maybe. It will call you before the next one to get some tips. Janine- MCB4: Okay. Janine- MCB4: So. Do you want to run through Noreen Doyle, HRPT: One of the icy most of our team, here. Noreen Doyle, HRPT: So,, Evan. Do. You want Evans connecting Noreen Doyle,, HRPT:, Janine. I, think you've met Kevin, Janine-, MCB4: Yes,, that's not coming Noreen Doyle,, HRPT:, Out, all Kevin and Evan are doing 97, principally and Rashid can talk about the historic vessel side of it and to Noreen Doyle, HRPT: Me and David Sharpe Noreen Doyle, HRPT: Ratio bear Noreen Doyle, HRPT: Okay. Noreen Doyle, HRPT: Dinner, you Noreen Doyle, HRPT: Are from the architecture side of your 97, so we've tried to script. This Noreen Doyle,, HRPT: Kevin,. You want to search Kevin, Quinn,, HRPT:, For. Let me just get the lighting just right. Noreen Doyle,, HRPT:, Marvelous., Kevin, Quinn,, HRPT: I'm, so pleased to be back here received before to give an update on our peer 97 project. I'm. Assuming you can hear me: okay, Janine- MCB4:, Yeah,, I, can., David, Jaubert:, Yeah., Yes., Kevin, Quinn,, HRPT:, Welcome to my home office, bedroom. When. We last work together on this project. In November we presented a schematic level, design. Kevin, Quinn,, HRPT:, Sense., Since then,, we've been to the public design Commission, who received positively give some minor, comments., So I think actually made the project better. Kevin Quinn, HRPT: We've added to shoot for Maureen architect to the team to help develop the building. And. We also have some new information regarding the historic ship. Kevin Quinn, HRPT: Location. So. What we're going to do is begin by having melt per design prime go over the changes that we've made to the landscape and response to the PTC comments so that even for milk taken away., Yep., Ian, Hampson,!, melk: Do, you want to do a dry run. Now. I was just planning on telling Janine to next. Janine- MCB4: And I see ready to see the presentation. Ian Hampson,! melk: Yeah, I've reviewed it already. I'm comfortable with the pace of it. So I'll just indicate next Janine- MCB4: Okay,. Let me just put it up to see,, make sure it works. Kevin, Quinn, HRPT: You, do not want to work out some elaborate hand. Signal., Ian, Hampson,!, melk:, No, I. Think it's easier. Just Janine- MCB4: Everyone can see if I'm Yes., Janine- MCB4: And, then you say you want to run through the first couple of slides, quickly., Ian, Hampson,!, melk:, We're, probably going to run through the whole design recap. Rather quickly. So, Ian, Hampson,!, melk: You, know 10 minutes or less. Okay., Janine-, MCB4: Okay,, so not work, so we're good with that. Janine- MCB4: There's. Someone on that says that has my name. Janine- MCB4: On the screen. If you could just rename yourself. Kevin Quinn, HRPT: So I'm, going to do the segway between the afternoon. Kevin Quinn, HRPT: Talk about the entry mount and then it will say conference station and then I'll give my few words about the building. Before I introduce the architect, which Kevin Quinn, HRPT: toshiko. Are you presenting and is it David Jaubert: The plan for now? Is that to she goes going to have a few opening remarks on the first slide and then we'll transition to me and I will present the rest of the bulk of the comfort station. Okay. Kevin Quinn, HRPT: Just, since we have a little bit of time, I'll. Tell you what I'm going to say. First, real quick, reminder,, the program, aggressors, walk up, concession, etc. Want you to be sure that we analyze every square foot to make sure the building as small as it could be. Kevin Quinn, HRPT: Once. You know the challenges with this piece of the project. Number 100 floodplain. We want to have as much flow for pedestrians in front of the building on the Esplanade Kevin Quinn, HRPT: And, the uses like a bathroom utility space. They are not very transparent, so all this could add up to, you know,. We were concerned about the building. Kevin Quinn, HRPT:, ending up being very heavy, very opaque. In. This example, are not. We wanted a building that has a presence,, but it's light something noticeable,, but does not dominate. Kevin Quinn, HRPT: Something that recognizes the industrial context, but kind of rises. Above it not an easy task. So we reached out to Social mores office, who decided to take this project on with us and she's, going to walk you through how she answers the challenge. Kevin Quinn,, HRPT: And, that's what she could say: Kevin Quinn,, HRPT: Here it is., David, Jaubert:, Yeah,, so,, so to speak, or, like I, mentioned that our plan at that point is for you to give a brief introduction. David, Jaubert:, Yes, I think what we Toshiko Mori:, Introduction and David is going to carry. So all the details. Okay. Kevin Quinn, HRPT: I'm, upon the end of the building renderings, that we switch to historic, vessel., Kevin Quinn,, HRPT: See,, which I'm basically going to say, you know, one. Last you saw this in the schematically schematic level,. We had to building located on the northwest corner at the pier. Kevin Quinn, HRPT: We've, since found out that because of the Con Edison barges that frequently go in there and the view is not very nice at all. We feel that the historic ship location is much better located, kind of on the South East corner of the plan which people will be looking at when I say: this, Kevin, Quinn,, HRPT:, And, then, I do not know, I guess, flashy,, you can Kevin Quinn, HRPT: Talk. I do not know. I would just end it like that and say,. Do you have any questions about that., Noreen, Doyle,, HRPT:, I? Think Kevin? Maybe your intro is,, you know,. So your side of it is the architectural and design side. Noreen Doyle, HRPT: And. We have rushy Puri here from our office who has been running. The RFP is for the historic muscles and she can update you on that. Hey, Jeff. Jeffrey LeFrancois- WPE Co- Chair: Hi everybody. How. Are you guys doing, how Ian Hampson,! melk: Are you Noreen Doyle, HRPT: Hello here. Jeffrey, LeFrancois-, WPE, Co- Chair: I, see if Jeffrey LeFrancois-, WPE Co- Chair: I made me chuckle. When I came on., That was great. Rashi Puri, HRPT: Right. And, then I was just going to give an overview of the RFP process and where we are in it. Noreen, Doyle,, HRPT: And. That's brief and then. Yeah. Yes. Rashi Puri,, HRPT:, Mm, hmm., Jeffrey, LeFrancois-, WPE, Co-, Chair:, I biked down to me packing this morning. This is not my apartment. This is my very large I moved to my office to the conference room, today., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Yeah,, right. It was really nice. Um, and we launched open streets here and the district today. Jeffrey LeFrancois- WPE Co- Chair: Um,. We did three streets. We did 17th STREET, FROM, eighth to 10Th Avenue. Jeffrey, LeFrancois-, WPE, Co-, Chair: Okay, then little West, 12 from nine to Washington and 13th night to Washington. So, small blocks., Jeffrey LeFrancois- WPE, Co- Chair: But, it's kind of a pilot to see what else will work. Noreen Doyle, HRPT:, That's great, and to 12 seven years us right, Jeffrey, LeFrancois-, WPE, Co-, Chair: So. We wanted to see what connections we could make. The part that was the whole thing and then come acrosss can support Street and really. So. That's what the city knows. My goal is around it. Jeffrey LeFrancois- WPE Co- Chair: And people were sort of like even Jeffrey LeFrancois- WPE Co- Chair: construction crews were like,. Oh, is this for the thing. And I was like, yeah. Jeffrey LeFrancois- WPE Co- Chair: I'm like, wow. Jeffrey LeFrancois- WPE Co- Chair: So, I'm, going,, it'll be,, you know, every day, we'll see what happens. So, yeah. Maarten deKadt, WPE Co- Chair: Technology. Wonderful. Maarten deKadt, WPE Co- Chair: Hi everybody. Evan William, HRPT: Janine. This is Evan William from Hudson River Park. How are you, I'm, Janine- MCB4: Good,. How are you Evan, William, HRPT:, All, right. Um,? Do you have the video clip that I sent you. Janine- MCB4: Yes,? Let me Evan William, HRPT: Um,. Did you try opening and I just want to make sure that it works. Janine- MCB4: Yeah,? It's a it's a video of like a square Janine- MCB4: Yeah yeah Evan, William,, HRPT:, Great., Thank, you., Noreen, Doyle,, HRPT: That's, intended to intrigue you all the video of the square. Evan William, HRPT: Data, when you're giving when you're presenting you can just say, you know,. Whenever you're ready, showed a video clip. That sounds good. Ian Hampson,!, melk:, Hello., Ian, Hampson,!, Melk: Check, your email. Jeffrey LeFrancois- WPE Co-, Chair:, Hi,, Judy., Hi,, Leslie., Jeffrey, LeFrancois-, WPE, Co-, Chair: Nice to see you guys. If I'm. If you would not mind if you have the ability, Jeffrey, LeFrancois-, WPE, Co-, Chair: If, you take your mouse over your name. Jeffrey LeFrancois- WPE Co- Chair: Other little dots up there and just keep your name, but then add, maybe dash MC before or Jeffrey LeFrancois- WPE Co- Chair: CV for member,. So that way people know who we are.. Kevin Quinn, HRPT:, Usually I wear a suit to a community board: presentation. Jeffrey LeFrancois- WPE Co- Chair:, Always, Kevin, you're forgiven. They do not work. Jeffrey LeFrancois- WPE Co- Chair: I see multiple new CP for members. Hi, everybody. Jeffrey, LeFrancois-, WPE, Co-, Chair: If. You could just talk to your mouse over your picture and you'll see the little dots at the top just rename yourself with your name and then perhaps Phoebe Foreman number Jeffrey LeFrancois- WPE, Co-, Chair: MC, before Jeffrey LeFrancois-, WPE, Co-, Chair: That. We folks know who we are. Allen Oster: Welcome Jenny, pretend Jeffrey LeFrancois-, WPE Co- Chair: Everybody's., Come on, as Janine this evening. She's very popular. Kevin Quinn, HRPT:, Like, Hollywood, Squares, But,, huh., Noreen, Doyle,, HRPT: How, many people right your full board meeting last week or the Noreen Doyle, HRPT: Week, before Hundreds. Jeffrey LeFrancois- WPE Co- Chair: We had a session. Jeffrey LeFrancois- WPE Co- Chair: The public session had Noreen Doyle, HRPT: 26 speakers. Well, Um, Jeffrey, LeFrancois-, WPE, Co-, Chair: And. Then we had, we had Jeffrey LeFrancois- WPE Co-, Chair:, A, photo. Almost, almost call attendance. But we, it was,. It was a popular one., Leslie Boghosian Murphy, MCB4: No. One has anywhere else to go. Jeffrey LeFrancois- WPE, Co-, Chair:, Environment, Committee meeting. My name is Jeffrey, look friend, Spa. I'm, the Co Chair Proud co, chair of this committee, and it's our first meeting of this committee in two months. Jeffrey LeFrancois- WPE Co- Chair: Will be taking the agenda item by item as its laid out, and I'm going to open the meeting with some guidelines that we as a board, have taken up based on the governor's executive order and also based on the practices, we've undertaken since we've gone virtual Jeffrey LeFrancois- WPE Co- Chair: As per the governor's executive order,. We are running this community board meeting remotely and it's being recorded and transcribed. Jeffrey LeFrancois- WPE, Co-, Chair:, A. Recording of this meeting is being posted on our boards. Youtube page, as we present will run this meeting generally as follows. Jeffrey LeFrancois- WPE, Co-, Chair: Everybody, besides the speaker or presenter, should and will stay muted throughout the meeting, members of the public who have joined through the online link will be asked.. Jeffrey LeFrancois- WPE, Co- Chair: Will be able to ask questions and or make a brief statement on an item after the presentation and after the committee has had an opportunity to ask clarifying questions, much like we run our regular practice when we're all next to each other. In person. Jeffrey LeFrancois- WPE, Co-, Chair: After. The presentation is over., I'll inquire. If the committee has any clarifying questions, I'm committee members will signify,, they have a good question by pressing the raised hand, key. Jeffrey, LeFrancois-, WPE Co-, Chair: Which. You can find when you click on the participants tab next to your Jeffrey LeFrancois- WPE, Co-, Chair: Section. Next to your name. Jeffrey LeFrancois- WPE Co- Chair: See here., Jeffrey, LeFrancois-, WPE Co-, Chair: We could also you can request to speak through the chat button as well. That actually no correction only use the raise hand. Feature. We're on zoom not go to meeting. Janine- MCB4: Section Jeffrey LeFrancois-, WPE, Co-, Chair:, It's okay, thank you. Um,. After all, committee questions have been answered,, I will take. Questions is taken from the public. Jeffrey LeFrancois- WPE Co- Chair: As. A member of the committee will report on any testimony or correspondence that MC before meeting has received. Beforehand. I will note that stuff this evening. Jeffrey LeFrancois- WPE Co- Chair: If, a member of the public, wants to ask a question or make a brief statement on an agenda. Item. They will also need to press the raise hand button on Zoom 1212****414: Or requests, or is it star nine for those of us who do not have it video, Jeffrey, LeFrancois-, WPE, Co-, Chair:, Exactly. That would be star nine on the phone when correct. Thank you. Right. Jeffrey LeFrancois- WPE Co- Chair: Will allow each Member to speak of each member of the public to speak, unmuted and put them back on mute. I'm Jeffrey LeFrancois- WPE, Co-, Chair: Following. The public comment portion. That committee will begin their discussion and we'll conclude the discussion with the votes. Jeffrey LeFrancois- WPE Co- Chair: On, the recommendation. My goal for this to simplify the boat will be to ask if there's any objections or if there's any abstentions or President eligible and hearing likely expecting us to be few it'll make the boat,, hopefully more efficient. Jeffrey LeFrancois- WPE Co- Chair: When. The agenda is finished,. We will adjourn, and we'll close out this Jeffrey LeFrancois- WPE Co- Chair: Meeting accordingly. Jeffrey, LeFrancois-, WPE, Co-, Chair:, Janine, level., Did I miss anything on the overall there. Lowell Kern-, Chair, MCB4: I do not think so. Jeffrey LeFrancois- WPE Co-, Chair:, Nothing., Jeffrey, LeFrancois-, WPE, Co-, Chair: So, with that, I'm, going to Jeffrey LeFrancois- WPE Co- Chair: Introduce, the committee first to my co, chair. I'm, who I can't find in my Hollywood Squares right: now., Um,, but,, Marty to cats. Jeffrey LeFrancois-, WPE, Co-, Chair:, Thank, you,, Marty. Um,. If the committee wants to unmute- so you can say, hello, is I'm going to go down our list: now. Maarten deKadt, WPE, Co-, Chair:, Waving., That's, good., Jeffrey, LeFrancois-, WPE, Co-, Chair:, That's, fine., I'm, Leslie, Murphy., Leslie, Boghosian, Murphy, MCB4:, Hi, guys., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Thank, you,, Gwen, billick, Here., 1212****414: Marty,. We've got you. Jeffrey LeFrancois- WPE Co- Chair:, I'm, Tina, DC, Lowell, Kern-, Chair,, MCB4: Not, that hard differently, San Antonio. Jeffrey LeFrancois- WPE Co- Chair:, It stopped. As. Soon, as I said, it. I'm, Brett. Jeffrey LeFrancois- WPE Co- Chair: Yeah. Brett Firfer- MCB4: It's, Jeffrey, LeFrancois-, WPE, Co-, Chair:, 45, 32nd, Sally, Greenspan, Brett, Firfer-, MCB4:, Hi, everyone., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Hi, Sally., David., Hello., David, Holowka:, Hi, everyone., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Thank, you., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Crystal., Janine, Pretente:, Crystal brought us here., Hi, I'm, just correcting. My name is that we ever see me again. Jeffrey, LeFrancois-, WPE, Co-, Chair:, Thank, you., I, AM, HERE,, JOHN, Danielle., JD—, MCB4:, Hello, everybody., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Thank, you,, Alan., Allen, Oster:, Really nice to see everyone, Jeffrey LeFrancois-, WPE, Co-, Chair:, Thank, you,, Brad. Are, you here., Brad, Pascarella-, CB4:, Good, evening,, present., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Oh,, good., Um, and that is Rhonda is not here.. Jeffrey LeFrancois- WPE Co- Chair: So with that,. Thank you. Everybody will move to the first item on our agenda with a presentation from the Hudson River Park trust regarding the progress of peer 97, Kevin, Quinn,, HRPT:, Right., Kevin, Quinn, HRPT: Okay, pleased to be back here with see before to give an update on our pure 97 project.. Welcome to my home office, bedroom. Kevin Quinn,, HRPT: When. We were last together on this project. In November, we presented a schematic level, design. Since then,, we've been to the public design Commission received it positively,, but to give us some minor comments that I think made the project, a little better. Kevin Quinn, HRPT: And, we've added Toshiko morning, architects to the team to develop the building component. And we've also have some new information regarding the historic ship, location. Kevin Quinn,, HRPT: So. What we're going to do is we'll begin by having Melt card design prime go over the changes that we've made to the landscape area in response to the public design, Commission comments. And. So with that, Ian. If, you could turn your bit Ian Hampson,! melk:, Right., Hello, everyone. Nice, to see you all again hope everyone is well. Last time we met with, you was back in November and today we're going to just do a brief recap for the benefit of some of you for the project. Next slide: please. Ian, Hampson,! melk: Just, to give you some context, again, of where this project is. This is more for the benefit of the Republic tuning and now this project is in the northern most extent of the Hudson River Park. Ian Hampson,! melk: nestled between Clinton Cove and the southern side of Riverside Park South, pretty much in alignment with West 57Th Street. Next, slide., Ian, Hampson,!, melk: It's, also proximate to Central Park of 15 minutes, walk uphill. And, it's also near other community amenities, such as with Clinton Park, Gertrude, elderly recreation center and thinking center., Next slide., Ian, Hampson,!, melk:, Next, slide., Ian, Hampson,!, melk: So. This is the running tally of the public engagement that we've done with the community. To date, May 14 is today.. So we've had a good amount of Ian Hampson,! melk: Time spent with the community, and we Ian Hampson,! melk: Feel. We know all of you, well. And, so far, everybody's received this project with open arms. And, we're thrilled about that., Excellent., Ian, Hampson,!, melk: So. Just to give you a recap of the schematic, design. Ian Hampson,! melk: That, you saw last time we were together in November., Next slide., Ian Hampson,! melk: This was the instill, is the most recent design? Scheme. You can see here, 97 highlighted at the bottom. Ian Hampson,! melk: Peers 9899 to the north. Just wanted to point out that the actual project boundary includes the frontage is in front of pure 98 and 99 here, 98 being Con Edison and pure 99 being DS, and why the Department of sanitation and we're doing improvements alone, Matzoh Ian Hampson,!, melk: A quarter as well. Excellent. Ian Hampson,!, melk:, Some components,, just to zoom in here. Ian, Hampson,!, melk: Going from east to West,, which means on this picture going from right to left,. We have an entry Plaza, a place scape for children. Ian, Hampson,!, melk:, And activity field size for you, seven activities, flexible gathering area salon, sunset deck Belvedere, and an overlook programmatically. The park is designed to have all of the Ian Hampson,! melk: Sports and activity, a program justified to the east,. With more of the park and immersive program to the west. Next slide. Ian Hampson,! melk: This is a bird's eye view. Looking towards the Northeast from the Hudson River. You can see all the, you know, topographic manipulation that we've introduced in the design. Next slide. Ian Hampson,!, melk: And. This is showing the entry to the children's play escape from the upland. So if you're walking, you know down south work from here 98 and you Ian Hampson,! melk: You know,, coming towards the entrance of pure 97,. This will be one of the possible addresses that you could take, you know,. If you have children, for instance. Next slide., Ian, Hampson,!, melk: This is a bird's eye view of that place, scape showing in the foreground. A splash pad and water feature for children, young children, toddlers and older children. Next slide., Ian, Hampson,! melk: This is another bird's eye view. As we start to walk, west. This is showing the activity field size for you., Seven., Next, slide., Lowell, Kern-, Chair,, MCB4: In can interrupt you for one. Second, on that color scheme, which you're going to be using as you're going to be a Bluefield Ian, Hampson,! melk: Bluefield, yes, Lowell Kern-, Chair,, MCB4:, Thank, you., Ian, Hampson,!, melk: Okay, and this may be some of you remember. This is what we presented last time as being that the choice that we offer the public, Ian Hampson,!, melk:, Whether or not. You can decide to go directly west, towards the end of the pier or go right and find yourself in a more immersive botanical zone that shady lots of visual interest places to sit and read, and quiet. Next slide. Ian Hampson,!, melk: So. If you move into that more secluded, zone. We call this the flexible gathering, space, you'll, see the canopy structures that we introduced to you last time., Ian, Hampson,!, melk:, You're, able to you know either continue your journey,, you know, to the left,. You could go walk up the stairs to the Belvedere. Next slide., Ian, Hampson,!, melk: This is showing you know. One way to get up to the Belvedere.. This is a seating area. That's about seven feet higher than the base of the stairs. Excellent. Ian Hampson,!. Melk: You're also able to get up to that Belvedere through a slope to walkway that goes around the backside of the flexible gathering, space. Next slide. Ian, Hampson,!, melk: And. That takes you to the exact same location. So. We have an intentional convergence of circulation at the top of the stair and at the top of the slope Walkway to get you the exact location., Ian Hampson,!, melk: And, then what you have is either a sunlight choose from to lay in through relaxin or you could sit and read and Sunday, you know, via Ian Hampson,!, Melk:, lounge chairs, that we have designed along the, the northern edge there a suitable for tandem seating and you know, groups and children and whatnot. Ian Hampson,! melk: And. Then, if you continue walking down towards the west. Next slide, please. Ian, Hampson,!, melk: We have the Overlook and the Overlook is another elevated area. That's about 11 feet higher than the than the surface down below. And. This gives you a beautiful panoramic view of the Hudson River to the North West and south. Ian Hampson,! melk: Next slide. Ian Hampson,!, melk: And. Then here we have another bird's eye view looking towards the northeast of the project. Again,. You can see the Midtown skyline in the background and tip of the belt and typically overlooked in the foreground. Next Ian Hampson,! melk: And. If you recall, we designed that adult slide, which is we imagine, is going to be quite popular for children and grownups like. Next slide., Ian, Hampson,!, melk: Showing, you how,, you know,. You could get down quickly from that. 11 foot overlook down to the lower portion of the park inside this wooded zone and you're able to, you know, come back up to the top of the stairs here. Excellent. Ian Hampson,! melk: Some, more of us looking towards the Northwest. Next slide. Ian Hampson,! melk: Next slide. Ian Hampson,!, melk: And. Then this is the sunset deck,, which has movable tables and chairs. It's, also elevated about two feet above the surrounding landscape. It has a rack to get to it,, which is Ada, accessible and also seating, edges integrated into our planters. Next slide. Ian, Hampson,!, melk:, Canopy, designs. So. Part of the reason why we're back with you today is because we've had to make an adjustment to our canopies. As we mentioned before,, we were still under PTC review. Last time, we've since been to PTC they've, given us some of their comments for the canopies. Next slide. Ian Hampson,! melk: And. As you recall, Ian Hampson,! melk: We were showing last time. Next slide. Ian, Hampson,!, melk: Can. It be designed that was basically a undulating Ian Hampson,! melk: Undulating faceted form. Next slide. Ian Hampson,! melk: Next, slide., Ian, Hampson,!, melk:, Excellent., Ian, Hampson,!, melk:, Okay,., Ian, Hampson,!, melk: And. Essentially, what PVC. PVC came back to us with comments was really about the structure and about maintenance. So. We took those considerations to our. Ian Hampson,! melk: And. We developed a new structural system based on a tetrapod. This tetrapod is much more efficient. Next slide. What it allows us to do is depending on what's necessary for the particular condition,, whether that be Christian of heights. Ian, Hampson,!, melk: Manipulation of shade were able to manipulate these tetrapods, in order to efficiently create that desired. Effect. Next, slide., Ian, Hampson,!, melk: And. Then here you can see on the top of the structural support the tetrapods, and on the bottom. The same with the canopy on top of the skin. The perforated, a perforated roof. If you'd like to think of it like that. Ian, Hampson,!, melk:, Next, slide., Ian, Hampson,!, melk: In. Here you see the results. So it's different than you saw last time, but similar in vain. Where,. It still keeps the same, the same notion of angularity and articulation,, perhaps even more articulated now. Ian Hampson,! melk: And we're pleased with it. So. We hope the community also likes it as well. Excellent., Ian, Hampson,!, melk: This is a view in the flex gathering space, looking back towards the stair. Next slide. Ian, Hampson,!, melk: This is a view. If you're sitting beneath it and effective, you know, the dappled light that would be created by the perforated canopy overhead. Next line. Ian Hampson,! melk: This is at the top of the stairs looking towards the this integrated seating, with half of it covered by Shane by these objects. Excellent. Ian Hampson,! melk: And. If you again, looking towards the Northeast, showing the effects of the canopy over the seating, area. Next slide., Ian, Hampson,! melk: Looking towards the south. Ian Hampson,!, Melk:, Another reason why we're showing this to you today is an update to the country. Mountain. Excellent. Ian, Hampson,!, melk: If, you recall,. We had an idea for a sculptural entry mount that was planted colloquially BE CALLED IT, THE, TREE, base., Next, slide., Ian, Hampson,!, melk: And. You can see why we called it. The tree base. Ian, Hampson,!, melk:, Next, slide., Ian, Hampson,!, melk: This was intended to anchor and be an identifiable marker. As. You enter the project. This also went under PVC review. They had some comments to us. And we've made some revisions. Next slide. Ian Hampson,! Melk:, primarily related to maintenance. Ian Hampson,! melk: So, we went back spoke with a Sharpie and we now have another option. That's still serves as a as an anchor,, but in a different way. Next slide. Please. Ian Hampson,! melk: You can see here. This is the new configuration. It's, an almost exactly the same location. Next, slide., Ian Hampson,! melk: The difference now is that, rather than having a an arc, mound, we,, you know, took the Ian Hampson,! Melk: Vocabulary of boulders that are found throughout the place scape and we brought them out, you know, into this elements into the entry mount feature that creates a bit of a continuity between these, these two areas, which works quite well., Next slide., Ian, Hampson,!, melk: And. In terms of components. We have the sculptural boulders that sit on the inside, right,, surrounded by planting low shrubs and also over story trees, and now we even have a seat. Wall. So. It's a place, also for people to sit upon entry to the park. Next line. Ian, Hampson,!, melk: And. You can see here that it's still has, you know, the same the same, you know presence at the entry,, although a bit different. Right. But, nevertheless, it,, it fits within the vocabulary of the park and still suitably serves as a as an entrance to peer 97., Next, slide., Ian, Hampson,!, melk: And. Here you can see a little preview of the comfort station that you'll see next. Next, slide. Ian Hampson,! melk: This is looking towards, towards the Northwest,. That's the route, nine A. In the background and via 57. Next slide. Ian Hampson,! melk: And. They have it. Okay., Kevin, Quinn,, HRPT:, It's, Kevin,, again, I just want to say a few words about the building. Before. We introduce Toshiko morning, who's, the architect for the building. First,. Just a quick reminder of what the program is program is a public restrooms, a lock up concession, meaning no interior seating, area., Kevin, Quinn,, HRPT:, Maintenance and office maintenance office in yard and a utility room for the various pumps meters and things that we need to drive the pier and the buildings. Kevin Quinn, HRPT: So,. One important thing: I wanted the community board to be aware of is that we analyze every square foot of this building to make sure that it was really needed. For us. The open space in the park comes first. So. We really struggled to make this Kevin Quinn, HRPT: As efficient to plan as possible. So I wanted. To be sure. You knew that we did. Kevin Quinn, HRPT: And I also wanted to let you know that. There's real challenges with this piece of the project. It's, not an easy task to put a building: here. Number one,, it's in a floodplain. Kevin Quinn,, HRPT:, And number two,. We want to have as much flow pedestrian flow in front of the building on the Esplanade, so we have a pretty narrow, long building, Kevin Quinn, HRPT: And, the uses of the building, building like the bathroom, and they told the space. They- do not lend themselves to a lot of windows. Kevin Quinn,, HRPT: It's, a pretty. It could be a pretty opaque, building. So. We were concerned about ending up with a heavy opaque building between all the windows rooms and the flood proofing. Kevin Quinn, HRPT: So. This is not what we want. What we want is a building that has a presence,, but it's pretty light something noticeable,, but it does not dominate the park. Kevin Quinn, HRPT: And, something that recognizes the kind of industrial context, but kind of rises above it. Kevin, Quinn,, HRPT: So. This is not an easy task. So. What we did was we reached out to Social mores office, who is pretty well known for making really elegant buildings out of challenging circumstances. Kevin Quinn, HRPT: And. She agreed to take on the task so Toshiko mores, offices,, a new member to the team for you guys but she's been on board. Kevin, Quinn,, HRPT:, Since, Kevin, Quinn,, HRPT: January, and she will walk you through her solution to our building problem. Toshiko Mori:, Thank, you. Thank, you very much, and I. Thank you very much for meeting us tonight. In this difficult circumstances. I have everybody's staying healthy and safe. Toshiko Mori: So, when we receive this assignment and to be invited to be part of a team. We were actually I. Delighted. Toshiko Mori: To see that the other conference station, which is probably in one of the most prominent location in the world or waterfront on 57th Street sandwich Bi Triangle, is amazing, vs 57 West and then also the conference station. The conference station next to a Con Ed. Toshiko Mori: Institutions, going to conduct facilities and also next to the West Side Highway. So. It's very challenging site. And also,. This is where had some Park starts. So: it has to Toshiko Mori: Be, a marker. Toshiko Mori: But. At the same time, it needs to have a transition quality between all these elements,. It has to have a presence, but also be a background to amazing activities that milk has produced for the park. S please Toshiko, Mori: This is okay, so it really shows us location as it is now. A white Toshiko, Mori:, Rectangle and I think we can go through with you in detail how we arrived at the scheme, but just to show you. Our aspiration for this site is to come up with Toshiko Mori: An, elegant building, which in our mind, conceptually exists between sky, a water, and it will have a mutable quality,, which means that, instead of having something solid, Toshiko Mori: And something a heavy on the site to have a light. Quality materiality is important in so that we choose the material in design in which reacts with different condition of light different climate,. It will have a different Toshiko, Mori: Profile, meaning features, expressions on cloudy day. It will look very different on sunny day and Toshiko. Mori: I wish is that the building,, which might look a little bit like a mirage in sometimes Toshiko Mori: On, Hudson River. In a foggy day, you have a little bit of mirage.. It looks like a presence, but disappears. It comes up. So. We were really helping to achieve some more phenomenal, like building Toshiko Mori: To come so it will actually command attention,, but in a sense it's background and expression of features is more fleeting and then you will experience and see it fresh,, as it goes through different time or day in different seasons. Next slide please. Toshiko, Mori: So, the building programs. We have a public restrooms walk up. Cafe climbing room for Park infrastructure conference station maintenance, Shop and service backyard and field office. So. It is a utilitarian building. Toshiko, Mori:, And I think our challenge is to how to make it arrogant and attractive,, but it's incredibly functional and robust ability in a floodplain. Toshiko Mori: And, David you're barred from our office associate now offices project architect,. He will take you through the building in detail, to show you how we plan to achieve this. Effect. Toshiko Mori: Next slide please. David, Jaubert:, Hi, everyone., I'm David with to she goes office actually mentioned, and after the overview from Chico. I can take us through the details of the conference station for the David Jaubert: The next group of slides, here. So. What we're looking at here is a brief plan and elevation view of the project on the east, facade of the building. David Jaubert: And, to speak to, to Chicos point little bit. The concept for the building was to allow each of the different program. Areas of the building. Tap be reflected in their own volumes for the project, rather than having one large box. David Jaubert: This allows the building to be broken down to a smaller scale that relates to humans, a little bit more, and also allows the building to reflect the quality of the skyline, and the city. David Jaubert: So. You can see looking from left to right on the building elevation, moving from the cafe bathroom plumbing Broomfield office, maintenance, shop and service yard that there's a change in heights here, so David, Jaubert:, The function of the building is reflected in the way that it's organized,, which allows it to have a very individual quality and the facade of the building will be David Jaubert: wrapped with aluminum panels, which have a very macro reflective, quality., David Jaubert: Which allows it to pick up different lighting. Qualities. So like to shoot, was mentioning on a cloudy day. It might be a little bit more subtle and on a sunny day,, it can pick up different lighting qualities, David Jaubert:, The reflectivity,, as Matt. So. We do not anticipate any overly right reflections or anything of the like. David Jaubert: And. In addition to the building envelope itself,, there is liver system that wraps around all four facades of the building. David Jaubert: Which ties those individual volumes together into a cohesive, whole. And. These louvers are rotated in a way that change their angles. David Jaubert: Which allow a bit of visibility through some of the volumes that are lowered and some arrays. So. It's a bit of a scrim David Jaubert: That provides some capacity and some transparency and these movers will be surface with a very interesting color.. David Jaubert: That is iridescent so from certain angles, they will appear slightly more grayish and from certain angles, they will appear more bluish and we'll be able to show you some of that and images, a little bit further into the presentation. So. If we can go to the. Lowell Kern- Chair,, MCB4: Now we're all staring at you. Janine. Janine-, MCB4:, Little, bit., Janine-, MCB4: Give me one moment., Janine- MCB4:, Okay., David, Jaubert: Great,, that's perfect., So to change gears a little bit from the design over the project and to jump straight into the details. One of the more unique David Jaubert: Aspects of the project is the fact that it is in a flood zone very close to the edge of Manhattan on the edge of fact. So as a result,. The building does not need to be dry flood, proofs., David, Jaubert: And. That's a flood proofing strategy. That means we keep all the water out of the building. David Jaubert: Next slide please. David, Jaubert: And. The way we're achieving that are these individual flood barriers shown in green here on the slide that are installed in front of each of the openings of the building. Those are doors and windows. David Jaubert: And in order to David Jaubert: Get out of the building and the event of a flood. There's, also a temporary stare, that is stored in the building. That is installed that you can use to essentially walk over and down one of the David Jaubert: Flood barriers there fairly high to account for the flood elevation,, which is six feet. So. That is a unique aspect of the project and they're intended to be employed in a fairly quick time when a flood is anticipated or comes on., David, Jaubert:, Next, slide please. David, Jaubert: One of the other aspects of the project that we're very happy about is the inclusion of solar panels that are installed in a net metering. Configuration. David Jaubert: The panel's themselves are configured in a way to power lighting and are skeptical loads for approximately a 707,600 square foot office. Space. David Jaubert: And the event that the panels provide more power than is used due to the net metering. That power as then funneled back to economy., David, Jaubert: And back into the grid and no batteries or additional equipment are needed for this. So. In that case, HR PT is only built by content for the power used or the net power. So essentially,, that is, net power, is building usage, minus PV power, production. Next slide please. David Jaubert: This is just a brief overview of the elevations of the building. The South elevation on the top left, looking at a cafe, and I will be on the south side of the building. David Jaubert: The North elevation, and just to the right of that, looking at the edge of the service yard and then the primary East elevation,, which is what most people will see from the city and the prominent and the drive their. Next slide. Please. David Jaubert: And. Here's a little bit more detail about the configuration of the louvers on the North East and South facades. The louvers start at 12 feet above grade. David, Jaubert:, The, louvers start at the very bottom in a flat configuration. And as you move up through the louvers. They each rotate incrementally to an angle of about 60 degrees., David Jaubert: This provides a really nice balance of transparency and opacity, and it does allow you to see through the louvers beyond to the envelope of the building. David Jaubert: As well as through the building and the locations where the roof is lowered. Through that skyline effect that we've talked about David Jaubert: On, the west facade of the building, because it's not accessible to the public. We've decided to carry the louvers all the way down to the base of the building,, which we think provides a very David Jaubert: Nice view. Looking back from the pier onto the building and really accentuates to the effect of the rotational louvers and that iridescent finish up supplied to them. Next slide please. David Jaubert: Here's a little detail about the facade panels: themselves. It's, aluminum cloud, material., It's, essentially aluminum composite that has aluminum on two sides and a composite insulating material on the inside. It's. A very durable and security material. David Jaubert: The panelists are flexible, so we're able to design those in a way that are able to wrap in a very consistent manner. Acrosss the different volumes of the project. Next slide. Please. David Jaubert: These are a couple of different angles. Looking at the materials for the aluminum composite material., David Jaubert: Similar, to what she could was speaking about with the building changing its appearance,, depending on your point of view and the time of day. David Jaubert: The angle that you're looking at the aluminum just due to the very Matt reflective quality, allows the building to take on some of the color of the environment as well as your point of view. Next slide: please. David, Jaubert: And. This is a rough mock up from the Louvre manufacturer, David Jaubert: Just, showing a typical configuration of how they are applied to the building envelope and their rotational effects. And. These are all unfinished,, but just looking for the David Jaubert: basic geometric qualities and on the left. We also have a brief swatch of the hairdresser color,, which I think we can look at a little bit more detail. Next, please., David, Jaubert: And here are a couple of photographs of the iridescent material. So, again,. Depending on your point of view,, the material can look a little bit gray. David Jaubert: When, you rotate the material,, which also happens just inherently due to the rotation of the louvers and their curved surfaces,. You get a very different color. David Jaubert:, depending on your point of view. And I, think we also have a video that we can pull up to show the changing effect of this year. Lesson: material. Janine-, MCB4: Yeah,, maybe one second., Toshiko, Mori:, So I- think the idea is to have it has a blue tint to it,, but it also has a gray is in has a little bit of both. So some. It really works with the coloration of a Skype. Janine- MCB4: For, some reason, Toshiko Mori: Maybe. We have to verbally explain it. So one reason. The. Second louvers is more front door. Open. You can see into the building it closes download it, but which actually allows you to see through into the sky. Toshiko Mori: So that the color of a louvers and kind of a sky can be blended in that point. So. It's. How it turns is that it actually creates the illusion that you're really looking at Toshiko Mori: And, not frankly,, but when you're looking up- and we hope that the Louvre is somehow is going to blend into the sky. Toshiko Mori: And somewhat disappear and gives a very soft horizontal edge on top of the building. Kevin Quinn, HRPT: Maybe I can help explain what this poker is. Kevin Quinn,, HRPT: What. This is magic, paint. Basically,. It changes color depending on how you look at David, Jaubert:, That's, great. I, think that goes a great overview of the changing color of the lower panels. Thanks for loading that video. Kevin Quinn, HRPT: And wanted to be sure that Community board saw that before we see the renderings, because the still renderings will seem a little silver to, but actually it's a very dynamic kind of subtle, color, so sorry. Toshi, David, Jaubert:, Yeah, I. Think if we can get the presentation back,, we can proceed. So. You can move on to the,, which sits in full screen. David Jaubert: So, to hear today we're going to speak a little bit briefly about the signage as a standard with the other Hudson River Park projects. David Jaubert: We identified a building. What the standard typographic and language has seen throughout the rest of the park. David Jaubert: On, the south facade. We identify the specific pure, pure 97 and on the north side of the building. We have the overall Hudson River Park signage. David Jaubert: That can be seen from the prominent as well as driving south along the highway, and this building really acts as a beacon, and a way to introduce not only this project, but the overall park system., David Jaubert: Due to the Louvre configuration on this project and the way that it wraps around the facade,. We had the opportunity to basically create some unique signage., David Jaubert: Rather than applying, you know, standard sign over the louvers we've integrated the signage directly into the louvers David Jaubert: With, a basically a colored material that slips around the geometry of them. So. It's a very integrated approach that blends in with the specific building, rather than just something that's applied to the facade. Next slide please. David Jaubert: And. Here we also have signage for the cafe itself,. This will be something that will be determined by the tenant who ultimately comes on board to upgrade the cafe. David Jaubert: There'll be signage on the glass on both the South and east facade of the building at the corner of the cafe. Next slide please. David Jaubert: And. Here we also have a couple of amenities that the building provides. One is a standard drinking fountain that also has a bottle filler for all the cyclist and joggers along the path there. David, Jaubert:, In addition to that,. We also have a bicycle service station, which is comprised of a rack for bicycles,, as well as a filling station and various tools for people to provide basic maintenance on their bicycles as needed. David, Jaubert: Next slide please. David, Jaubert: So. The next group of slides will be looking at her a few different images of the project from several different vantage points., David, Jaubert: Are, starting here from the south. Looking north,, and you can see the sign of we were discussing earlier here, 97 located on the top corner of the louvers. So we have here 97 to the left and the highway to the right, and this image. Next slide: please. David, Jaubert: And, here we're from the path jogging path, looking west towards building. So, we're seeing that East facade. Again,. You have the aluminum candles on the base of the building. David Jaubert: Of, the very Matt reflection, and we have the angled louvers above that kind of create creating some transparency and opacity for the top half of the building and some views looking through and the areas where the building is has a lower. The roof. Next slide please. David Jaubert: And here we're next to the building looking south. So you can see some of the material qualities of the building,, as well as the entrance to the restroom and the bicycle maintenance station and water from there with the jogging path and bicycle path to the left. David Jaubert: Next slide please. David, Jaubert: And. This is a view from the highway as we drive South sinker 97 for the first time with the signage of Hudson River Park. Again,, acting as a deacon. David Jaubert: Not only for our building and the pier,, but also for the overall park system. So. This is what viewers would see as they're driving along down the highway. Next slide, please. David, Jaubert: And. This view shows a view. The south side of the building, as you were at the very head of the pure 97 park, itself. David, Jaubert: Next slide please. David Jaubert: And. Our last slide is just showing a selection of lighting products that we're looking at. So. We have various flood and point lights that are going to be applied to David Jaubert:, The underside of the building and along the very top edge of the river running continuously around all four facades. David Jaubert: We have down lights that are situated just behind the liver,, which will cast light down in a backlit fashion and create a really nice luminous effect. That also creates a halo at the base of the building. David Jaubert: So with that,. That's the last slide for the conference. Station. And I think we can proceed with the historic vessel section of the presentation. Kevin Quinn, HRPT: Okay. Um,. So when last we presented in November,, we had the idea that the historic festival would be located in on the North West Corner of the pier. You can open up the please. Kevin Quinn, HRPT: As time has gone on and, as we've looked at, things. Kevin Quinn,, HRPT: We actually think a better location is on a south side to the east and because the view is, is much better.. Number one. And number two,, the activity of the economy, barges going in and out. Kevin Quinn, HRPT: Create some water disturbance with awakes, but also puts our historic muscle on a pretty vulnerable spot. It's, not a good parking spot for your historic vessel. So, we're thinking you could to the please. Kevin Quinn, HRPT: Locating. It basically acrosss from synthetic turf field about 115 feet away from the bulkhead. Kevin Quinn, HRPT: We do not know what ship is going. Here. So I'm going to turn it over to Rushy, who is managing the RFP process for finding a historic ship for this location. Rashi Puri, HRPT: Good, evening,, everyone. So. Here's an update on the RFP, I trust had issued a request for expressions of interest for historic vessels in late 2019, Rashi, Puri,, HRPT: Offering, a total of four boats for long term historic lesson docking do at their 20,526 and one actor 97 Rashi Puri,, HRPT: So, the pure 25 birds have already been awarded,, but we are still in the open procurement process for years. 26 and 97 Rashi Puri, HRPT: The users proposed in the RFP responses generally range from museum excursions, environmental and educational programs,. Depending on your location. Rashi Puri, HRPT: Additionally,, a food and beverage concession is permitted at your 97, so the selected vessel is required to also do free, educational and cultural programming,. It's likely that the vessel that comes in at 97 has a concession, which is similar to Grand Banks at 25 in the park. Rashi Puri, HRPT: But, given the shallow water depth and DC permit standards,. Finding the right vessel has been challenging for the 97. So where we are now is that we have one vessel that might be able to come in,, but we are still in the due diligence process with them. Rashi Puri, HRPT: Thanks. Rashi Puri, HRPT: Back to Kevin Quinn, HRPT: Well. That concludes our presentation. So. Now, if you happy to answer any questions., Jeffrey LeFrancois- WPE, Co-, Chair:, Thank, you,, Kevin. Thank, you everybody from all teams on board for that presentation. Jeffrey, LeFrancois-, WPE, Co-, Chair:, Across, multiple topics., Jeffrey, LeFrancois-, WPE, Co-, Chair: Alan,. You were the first person I saw on the committee with their hand, up. I'm, going to reserve some of my comments. Do. You want to kick us off this evening. Allen Oster:, Thank, you., Jeffrey, Allen, Oster:, Absolutely, beautiful project, really in every sense, 21st, century., Allen, Oster: Project,. You hit all the all the points that I would have thought of in what I think was discussed in our previous meeting. So really,, really great. Looking project, and I'm sure it's going to be a big hit. Once. It opens up awfully so Allen Oster:, Quick, question. Why. Does the material on the Allen Oster: Slide Allen Oster: It's, a Ian Hampson,! Melk: polished, stone., Allen Oster:, He wise., Allen, Oster:, There's a,, there's a whole day to reflect, you know, how,? How hard can you get it out there and listen. Ian Hampson,! melk: That's, a good question. We've taken that into account. There's, a decent amount of shape and that location. Ian Hampson,! melk: Where when we do material mockups we're going to be doing a final test of the material. Ian Hampson,! melk: But. Our anticipation right now is that it does not get too hot as a surface similar to other types of stone surfaces that are found around the city. Ian Hampson,! melk: This will have a very,, very Ian, Hampson,! melk: Very high polish to it. So it'll allow people to slide quite quickly down at the bottom. Kevin Quinn, HRPT: So, it's a pretty good sized chunk of material to, and we take a lot of Kevin Quinn, HRPT: A lot of heat to heat that up. Allen Oster: Okay., Cool. Well. Thank you again. Marvelous job really was. Thank you., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Thank, you,, Alan, JD—, MCB4:, Yes, I, echo Allen's comments very thoughtful, well thought out. Design. I have one or two questions in a comment or two,, and please forgive me if JD— MCB4: I'm not happy with everything. It's, probably just me. JD— MCB4: My. First question, everything is open to view. It looks like,, which is very important.. So no activity can go on without being viewed sort of a safety measure. Jd— MCB4: It looks like you've taken that into consideration, Kevin. Kevin Quinn, HRPT: Yes,. Yes, we have we've Kevin Quinn, HRPT: Effects right what this thermostat in our operations, people to make sure it's all visible and then we'll also be cameras. JD—, MCB4:, That's, wonderful. The other thing that toddlers little area. Sometimes the parents like to have that sort of enclose, so the kids can't run out is that to be considered or not. Kevin Quinn, HRPT:, Um, I'll, give you the general, and maybe you can give you the specific in particularly the spray shower area. We worked it so that the little kids are kind of in an enclosed, area., Kevin Quinn, HRPT: And. We are our Kevin Quinn, HRPT: Kids are more likely to play more in the periphery of it. And. There's a cut through for the larger kids who want to run around more Kevin Quinn, HRPT: But. The spray shower. It does need to be one spot for both age, groups., Kevin, Quinn,, HRPT: Working, then on the children's play area, which is on the North West end of the playground,. You kind of is not a separate little area. It's kind of zoned, but it's not walled off. Okay., JD—, MCB4:, Thanks,, Kevin., I guess. My next question is for norene that signage. How big is that sign that says: Hudson River, Park. Is it going to be flashing lights or what is that all about I? It looks. I, mean,, JD—, MCB4: Is. This I do not see this and other peers. Yesterday, Noreen, Doyle,, HRPT:, So, I, think Madeline's on the phone or on here as well. But I can give you the starting point,, which is that the park was designed with the concept of kind of vegans at major entrances and pure 97 being the northernmost kind of public pier in the park. Noreen Doyle, HRPT: One of the things that we are trying to do is let people know where they are. And, so the Noreen Doyle, HRPT: The, the logo, that is, there, went through the Public, Design, commission,, etc. Along with the peers and the orange that you saw on the other side of the building. Noreen Doyle, HRPT: That, that is the official kind of look of the park and the intent was to try as Noreen Doyle, HRPT: We described it to have it match the building instead of overwhelming the building, but just sticking on the regular sign, panel., I'm, Kevin or an island you,. What do you want to say anything further about considerations. JD—, MCB4: But? What's nice is it,? How big is it David, Jaubert:, Is I, can speak to the dimensions. Just very quickly,, so for the pure 97 sign, the height is about three foot: nine David Jaubert: To 13 feet wide for the Hudson River Park sign. It's a little bit larger due to the logo. That's four foot nine tall and it's 26 feet: wide. JD—, MCB4:, Well, I, I, do not like it. I, do not want to in Central Park big sign, Central, Park. We know it's there. But anyway, I'll leave that JD— MCB4: I'll leave that and no disrespect to the architect and the wonderful, a thoughtful design of that building, but it,, it just seems so corporate and so on, like convince me that it's not that it's really not a corporate building. That's just all JD— MCB4:, Linear, JD—, MCB4: It's, going to be softened with some plantings are Toshiko. Mori: A guy can speak to that,, which is JD— MCB4: Respect. It's, beautiful design up just Toshiko Mori: As, it's actually very tough building, because footprint is there., It's, very minimum. So in a way, Yo., Toshiko, Mori: Opinion, just absolutely right., And I. Think that's our concern. Also. And I think what we did is to not to make it a big box. Corporate box., Toshiko Mori: It has different heights, so that they actually break down into smaller boxes and then also it has a slight SIP back in and out. So. You will never be one straight: thing. Toshiko, Mori: And. Also the material itself has a matte finish. So. It's always reflecting activities on my site and also reflects back the trees in front of it. Toshiko Mori: Because of materials,. It has a really softening effect. If, you think of other mega materials,, which is just very static and cold. This particular material. We chose Toshiko Mori:, Has soft, diffusing reflective thing, so you never see the material,. But what you see what's in front of it. So, you see the people's figures,. You can actually see there's trees and even cause. It has this much more softer effect,, although it's a very tough with area and JD—, MCB4: We're, very good Kevin, Quinn,, HRPT: Okay, I, just one thing. Not in these renderings, but we are looking at, at different material where the service yard is Kevin. Quinn, HRPT: To make that more porous. So there will be a change in texture.. It won't be Kevin, Quinn,, HRPT: It's,, it's basically the last northern 25 feet, or so the building will be porous instead of solid. And I think that change in texture will stop and Kevin Quinn, HRPT: I know what you're talking about. And I think that texture will help a lot., JD— MCB4: Thank you very much. I appreciate that. Jeffrey, LeFrancois- WPE Co- Chair: Let's, see,, Sally., Sally, Greenspan:, Hi., Thank, you. That was a beautiful presentation. Sally Greenspan:, Um, I, just wanted to ask, I might have missed it in the presentation. Question about the canopies I. Remember that one of the Sally Greenspan: Questions was about the height, where they too tall to protect us from the sun. You might have mentioned it,, but I did not catch it., Sally, Greenspan: And. Another question that had been raised was the density of the trees and the ability to see children from various parts of the park are while they were playing. The parents had concerns about that and Sally Greenspan: The slide about that showed the raised elevated area,, which looks beautiful. Is there, any seating up there,, even for a couple of people or it's all standing room. Kevin, Quinn,, HRPT:, Did I, think even Kevin Quinn, HRPT: Get into those Ian Hampson,! melk: Sure., Ian Hampson,! melk: I can begin with Ian Hampson,! melk: The canopy,. The canopy was designed, in fact, with a solar analysis, shaped study, Ian Hampson,!, melk: That's, something that was calibrated based on optimizing, the prevalence of shade on sites throughout the year. Ian Hampson,! melk:, Also height,, the lowest. It comes to any point if you were to stand on top of the bleacher stand on top of the upper level,. The lowest. It comes, as is nine feet in any one point, but on average it's a bit a bit higher than that. Ian Hampson,! Melk: With regard to trees. Yes,. We kept in mind a visibility. So we're avoiding dense, conifers and plants that obscure Ian, Hampson,! melk: Your line of sight from around three feet to about five feet,, which is where most people can, you know, perceive a you know a person in the distance, so that you're able to, you know,, Ian Hampson,! melk: Survey your room as you as you travel, acrosss, the pier and for the area that you're, referring to with regard to seating. The Belvedere. We do have integrated Ian, Hampson,! Melk: Built in benches of various configurations at various angles, up in that location at the far end,. What we're calling the Overlook, which was that area that gives you the view over Ian Hampson,!, melk:, The, far west side of the pier and under the Hudson River in the distance there currently are no seats there at the moment. Ian Hampson,! melk: Does not mean that we could not put a movable table and chair the feature PT decided,, but at the moment there's it tended to be an open area with free circulation,. Considering the fact that we have the slide also connecting to that to that location. Kevin Quinn, HRPT: It's, not a bad idea,, though. Sally, Greenspan:, Yeah. Well, when I looked at it., I mean,, it's very lovely,, but it's also narrow, so having some chairs at that point might be difficult because it will slow down traffic for people that want to come. Sally Greenspan: Down to the end of it. Sally, Greenspan: But, it's just such a lovely spot that people will also want to linger. Um,. So it is the good and the bad about having seating right over there,, but I'm Kevin Quinn, HRPT: A place for the weary parents sit while the kid goes up and down a slide for Jeffrey LeFrancois- WPE Co- Chair: Or, as the parent wants to join them, because Noreen Doyle, HRPT:, Thank you. You're right that we do need to look at the narrowness and also I mean it's such a prime spot.. It's. Very easy for me to imagine someone taking that spot and wanting to stay all day: long. Noreen Doyle,, HRPT:, Which people, Sally Greenspan:, Think of that right: Sally, Greenspan:, Good., Sally, Greenspan:, Thank, you., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Thank, you,, Sally., I'm, David,, you're, next., And, Alan and Sally and folks do not forget to put your hand, down, please. So. It moves us up on the list, David. David Holowka:, Okay. Could. We go to the image right at the end of the pier next to the,, I. Think it's an 11 or 12 foot, rise., Jeffrey, LeFrancois-, WPE, Co-, Chair:, David. This is an 80 slide. Presentation. Do. We know how far back that was: Ian Hampson,! melk: Probably in the 20th Okay. Jeffrey LeFrancois-, WPE, Co-, Chair:, Thanks, again., Janine-, MCB4: Let, me know. If David Holowka: You know the number one, I see it. Okay. Ian Hampson,!, melk: Yeah,. It's probably slide 20, actually on it. Ian, Hampson,!, melk:, Yeah. Is this. What you mean: 1819 David, Holowka:, Yes., David, Holowka:, The part under the deck. David Holowka: Can. You tell us about the material. There. It feels a little bit David Holowka: Like a blank space that might be an opportunity. What. Can you say about it at this point. Ian Hampson,! melk: Sure. It's a cancel, Weaver, of course, beneath the deck that volume. That's a black stucco in our design. Faceted black stucco is a storage closet for HRP. So you can't see in this particular view, is a door that allows O and M staff to access that for rakes and rooms and Ian Hampson,! melk: Carts, Noreen, Doyle,, HRPT: Oh, also, I'm by mental programming staff would dearly love the spot where they do not have to carry their fishing rods and pop up tents and everything else that they use for education programs up and down the park. Kevin Quinn, HRPT: Right. Kevin Quinn, HRPT: And. This furniture is a movable. So, it's in some ways, nice to have a kind of a wall behind you. So. If we were to have a class event. We can rearrange the furniture and have that be the backdrop Okay. David Holowka: If. We switch over to the building. David Holowka: You know, I, hear JD his comment that it feels corporate, but I think this is actually a very subtle design and David Holowka: Full disclosure, David Holowka: I'm, a big toshiko Maury fan ever David Holowka: Since visiting her David Holowka: Hello again to an elegant is the word for it. Visitor Center at Frank, like rights, Darwin Martin house in Buffalo., David, Holowka: Just, because a very accomplished architect and educator at nature, design, schools in this country and the wife of Jamie carpenter, who is another architect, who's very well known for David, Holowka:, Inventive use of materials that really exploit light in inventive, ways., So I think we're getting a little bit of two for one David Holowka: In, this design. David, Holowka:, And I, think it's very hard to judge it without seeing maybe better samples or even like a night, rendering David Holowka: But. It's very much about things that I think are hard to convey in two dimensional rendering qualities of light. Like that. I think the building will tend to dematerialize. It will look different in different lights. David Holowka: And, you know,! Could be quite fantastic,, I would have one question for norene, which has to do with maintenance and things like cleaning. You know,. It almost looks like the dilemma of how are you going to clean those Venetian blinds. David Holowka: You, know,, David, Holowka: Do? You feel that you're going to be able to maintain this on a regular basis. Next to the highway,, where there's a lot of sewage without it's starting to look grimy. Noreen, Doyle,, HRPT:, Yeah. Well,, that is the maintenance. Noreen Doyle, HRPT: Aspect of our team, looks at any design before the community obviously sees anything or before we send anything out because of things like you're all asking Noreen Doyle, HRPT: The surface, and we have asked that question. That seems fine,. I would say that we are still looking at the Noreen Doyle,, HRPT:, Western side of the building and the louvers on that to make sure that our team can get access to the louvers from the water side. Noreen, Doyle,, HRPT: I think that thus far has been the area that we've we're still trying to figure out exactly how we would do that and Kevin,. You may have a more detailed update from as well. Kevin Quinn, HRPT: Well,. The one main thing helping us here is that the roof is accessible to staff. So. The louvers are pretty reachable actually from the stuff. The. Only one area that we do have some concern is Kevin Quinn,, HRPT:, Like Maureen, said on the western side towards the bottom of the building and it'll be tricky to clean that unless we can reach it from the water on the Kevin Quinn, HRPT: On, the happy side of it, though. That's the area of the building, least likely to get dirty. I'm really mostly concerned about the road grid. As you as you, as you brought up. So working with operations in the plan, is to basically wash it from the, from the roof and it's accessible from David Holowka: I was also a little concerned about wear and tear. There's one view that showed the panels. David Holowka: Panels, coming right down to the sidewalk level and I'm kind of concerned about maintenance vehicles bumping into them, and you know: David Holowka:, Sure., Hi., Madelyn, Wils,, HRPT:, Um,, so you're not seeing a final absolute design. We will protect those panels with rocks plantings and other types of landscape. We're, very cognizant that we do not want the vehicles to bang into Madelyn, Wils, HRPT: So,, you know, you're, really not seeing a full picture of how it will be finished. But we are, it's a it's a great concern to us and we'll be watching that very carefully and making sure that we take care of that. Madelyn Wils,, HRPT: I also just want to say, because I have not had a chance to speak,, but Madelyn Wils, HRPT: No toshiko has said what a complicated site. This is and in terms of the building. We. Wanted a building that would be elegant but would not fight with a very strong architecture that was acrosss in the via building, nor the strong landscape architecture on pure 97 and Madelyn. Wils, HRPT: I think that what she has achieved. She and her team is just a really great balance, because Madelyn Wils, HRPT: It is a building and I, I'm sorry. We could not do this in person. But. If you actually saw the materials you would see this Madelyn Wils, HRPT: very intricate way that the light changes and the reflection changes on these materials and the loo the louvers, because they are slanted Madelyn, Wils,, HRPT: That at any time of the day. I know she said this, but I have to say it myself,, because the subtlety of this elegance is going to create such different types of Madelyn, Wils,, HRPT: It's, going to look so different at every moment of the day and every type of weather. Madelyn Wils, HRPT: That. It's going to give you a very subtle, but beautiful experience and you're, going to think that you're looking at a different landscape, all the time. So I think what this building has achieved for us is Madelyn Wils,, HRPT:, A, beautiful,, elegant, look that will almost feel like it's part of the sky and yet be able to have its own identity.. And I think it's going to be Madelyn Wils,, HRPT: A, just a great addition to our park. David Holowka: Or to finish, I, just say, I! Think it's a fantastic building and I as a cyclist.. I really appreciate the like minded station. Thank you., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Thank, you,, David. And thank you,, Madeline. Um,, let's see, Leslie. Leslie Boghosian, Murphy, MCB4:, Hi, guys,, um, I have to admit,. Whenever milk is presenting., I know it's going to be awesome. Leslie Boghosian, Murphy, MCB4:, And, aesthetically, pleasing., So I was really looking forward to you guys just it's just wonderful. Um, one little minor point before I get to. My major point is just to echo JD that toddler space has to be lined off from the rest of the playground. Leslie Boghosian Murphy, MCB4:, And I know you guys said you were going to talk about that later. But. My point was David,. Thank you for your presentation. To. It was wonderful., I missed the part or the solar panel part Leslie, Boghosian, Murphy, MCB4: Where. Obviously, the Environment Committee as well. And I, was wondering how much of this park is going to be energy self, sufficient., Leslie, Boghosian, Murphy, MCB4: Um,, and how can we get to 100% or if that's virtually impossible. How close? Can we get and the solar panels, you mentioned, what were they powering and what's the percentage David Jaubert: Yeah, I can. I can speak briefly to the solar panels on our building. So they're, covering up approximately you know, 75% of our roof. We have to leave some space for FDNY access and things like that nature for us,. You know, we're early in the design phase,, but our studies show David Jaubert:, Like, I, mentioned, the,. The power can accommodate. You, know lighting and receptacle loads for what would be equivalent of a 7600 square foot office. Space. David Jaubert: Our office spaces, much smaller than that,. It's obviously won't power. The whole building,, but it will provide David, Jaubert: A nice supplement to what's coming from the grid. And. Then the event where some of those lows are not being used and the TVs are generating more power., David, Jaubert:, Than, Than, what's being used, like I mentioned that supplemental power as then fed back to the grid. And, it's actually deducted from HRP to power bill. That's the case. So it only monitors., David Jaubert: Are, basically only accounts for net metering. So they're. Basically, only charged for what they're used minus what the PV panels produce. David Jaubert: Will be setting that in more detail in terms of the specific percentages and everything,, but that's specifically for the conference. Station. Kevin, Quinn, HRPT: This is the same system that I worked on in Washington. Washington Square Park has a net metering arrangement and push working with park in Brooklyn has the same thing. And. It's really satisfying to go on a sunny, day. You can watch the meter, go the other way. Leslie Boghosian Murphy MCB4: So Kevin,. Then what is because I see there are lights that are going up and down the whole length of the pier, um,. Those I'm guessing are not going to be energy self, sufficient., Leslie, Boghosian, Murphy, MCB4: Since. We do have, I mean,. It's pretty much a clear, a blank slate here. I mean, we're, you know, you're, building from nothing up, Leslie Boghosian Murphy, MCB4: How. Can we get it that we do incorporate a totally 100% green space., Kevin Quinn, HRPT: You have to do the math,. Those lights are fed out of the building and the building solar panels feed the building. So, you know, the power on a sunny, day. Kevin, Quinn, HRPT: Would be enough to power those lights, except the lights, by definition, or on at night. So. That's the beauty of the net metering is that we Kevin Quinn, HRPT: Put excess energy into the grid during the day, and we draw from it at night,. So I can't say that the light poles are powered directly by the solar panels,, because we have no energy storage in this building. Kevin Quinn, HRPT: But we'd have to do the math. In fact,. You should do the math to see what the total energy load is with this project and see how much the solar panels put. Out. I actually have not done. That. That's, a good Kevin, Quinn,, HRPT: That's, a good, good thing to do. I will do that. All the lights are led there they're, fairly low draw. So I'll, look into that. Leslie Boghosian Murphy MCB4: All, right., Thank you. I'd be interested. Thank, you so much, guys, that was great. Jeffrey LeFrancois- WPE Co- Chair: Thank you. Leveling up Mr. Chair, low Lowell, Kern- Chair, MCB4: Thanks, Jeffrey. Um, I've got a bunch. Um,, let's stay with the roof for a second. Since we're talking about that. Lowell Kern-, Chair,, MCB4: I've, now heard two things that the roof is going to be used toward they're, going to be solar panels up there,, but the maintenance staff needs access to clean the building. Lowell Kern- Chair, MCB4: So it,, you know,, Kevin. I, think you mentioned FDNY access to the roof, but the maintenance needs been taken into account as well for the Kevin Quinn, HRPT: Solar, panel. It's. Basically, the same path: FDNY and Lowell Kern- Chair,, MCB4: That just occurred to me as Lowell Kern- Chair, MCB4: You were explaining answering Leslie's question. Um,. Let's go back to the I agree that the playground for at least the toddler part needs to be fenced in Lowell Kern-, Chair, MCB4:, specifically talking about the kids playground. Um,. How high is the slide? How quick is the slide. And? Where does the slide lead off,? How much space is there at the bottom of the slide to Norman and Madeline that'll sound like another park to them. But? That's where the question is: Noreen Doyle,, HRPT:, From, Kevin, Noreen, Doyle,, HRPT: Please read those battles. Yeah. Lowell Kern- Chair, MCB4: Yeah. Kevin Quinn, HRPT: For, the record, I wrote that slide. Today, I went to Chelsea Waterside to check on our maintenance for it. There night I took that slide for right and it was fine. I'm Lowell, Kern-, Chair,, MCB4: Fine. No,. It's fine,, but Lowell Kern- Chair, MCB4: I'm worried about the complaints. We're going to get. If there's not enough room at the bottom of the slide. So, how much room is there and how high is it now fast? Is it Kevin Quinn,, HRPT:, A height and in the zone at the bottom. And I, think you can answer that. Ian, Hampson,!, melk: We're, talking about the adult slider, the slide. Ian Hampson,! Melk: Is within the Lowell Kern- Chair, MCB4: Hell, with the adults that they break their neck. That's Ian, Hampson,! melk: Janine,. Could you go to the site? Plan,? Maybe click back a few. A few please Kevin, Quinn, HRPT: Well, they're, pulling that up law. And one thing I will tell you is that this slide only accommodates one Kevin Quinn, HRPT: Person being a kid or an adult. So the one of the issues that I have a Chelsea Waterside. Is it's really wide, so multiple kids were going down at the same time that creates humbling and stuff. This is a one A one kid,. She said. Lowell Kern- Chair, MCB4: Right,, because this one looks pretty high court. He's going to love it. Kevin Quinn, HRPT: It is pretty high. Madelyn Wils,, HRPT:, Score., Lowell, Kern-, Chair,, MCB4: But I'm, really looking at is the complete flip of this in where the slide, not the back of the slide,. But where you get off this slide. Ian Hampson,! melk: If, you go to fly a Lowell Kern- Chair, MCB4: Zone., Yeah., Lowell, Kern-, Chair,, MCB4:, Thank, you,, Nora. That's, the phrase, I'm, looking for Noreen Doyle, HRPT: And. If a bunch of kids like going to quickly and how,, how will they will my backup on each other., Ian Hampson,! melk: Yeah,? So we designed this with the default zone criteria and also with the manufacturers criteria. It's a little hard to see in the screen here, but Ian Hampson,!, melk:, And, I'm, also unable to point to it,. But we have the slide positioned to the path of least resistance right, now. So. It's aiming at the most open portion in the southern part of this of this place. Gate. Lowell Kern-, Chair, MCB4: I would just ask that you look into that and make sure Lowell Kern- Chair, MCB4: To, the manufacturers Specs is great.. It gives an answer. When, the parents start complaining. But. If we can exceed the manufacturers specs, so much. The better. Lowell Kern- Chair, MCB4: related issue. Madelyn Wils, HRPT: Yes,. Well, we exceed the this, I agree with you. Madelyn Wils, HRPT: When. This is not another Chelsea Waterside park where it seems like it's close to a wall,. There's plenty of room at the bottom of this slide its position so that there's plenty of room and Chelsea Waterside made us very conscious about this. In planning this piece of equipment., Lowell, Kern-, Chair,, MCB4: Your, know Madeline. That's where my question came from as well. Madelyn Wils, HRPT:, Yes,, yeah., Kevin, Quinn,, HRPT:, Can I, just one other point. Just little for you., Kevin, Quinn,, HRPT: Guys is also an off the rack. It's, an off the rack system.. It's, not a custom. Creation. Okay,, which is important. It, meets all the manufacturers. Standards. Lowell Kern- Chair,, MCB4:, Okay. Similarly,, with the boulder design and the entry Plaza,, and it looked like you added some of those boulders to the kids, player. Lowell Kern- Chair, MCB4: That was also a concern at Chelsea waterside. In fact,. It was the first thing. I ever pointed out. The Madeline was some stonework,. There is fabulous. Lowell Kern-, Chair,, MCB4: But, for right, kids running around. It's also becomes a hazard. So. Can you did you,? You said it looked to me when you were discussing the boulder and in the entry that they were. There were some in the place: scape areas. Well,, Lowell, Kern-, Chair,, MCB4:, Are those,, you know, for the kids to play on. Are. They a border of the player. Ian Hampson,! melk: And, more of a border of the play. Area, they've been in the design for quite a bit now and we're, again,. If you look at the place, scape here, you'll notice that the North, we, we actually use them at the threshold for with a toddler play area, so that could be an opportunity to Ian Hampson,! melk: Create, a fence anchor point. If the intention is to now further close off the toddler, area. We also use them,, but we also use them as an anchor point at the main entrance to the place escape from the upland and then also they're used as a seating for adults in the South Bay. Right. Lowell Kern- Chair, MCB4: Like I get the anchoring argument. And I'm just worried that you get kids,, you know,, climbing on them a jumping off them and getting their heads and whatever I become very sensitive.. This is, as Madalyn, Murray and Kevin know went through this and other pork, so Lowell Kern-, Chair,, MCB4:, Now,, Noreen, Doyle,, HRPT: I. Think this specific boulders right, I mean like jumping off of the right. Folder might be okay. If there's the right landing zone again around it. If, you can climb up too high, and it's toddlers, or whatever,. Then we have to look at that., So,, Kevin Quinn,, HRPT: Understand,. Can you can use zoom into the place gate that might help. Right. Kevin Quinn, HRPT: I also wanted to just I'm Kevin Quinn, HRPT: Interested. The toddler area is basically the top left piece of this playground. So. It's an app called the sack. That's, where the sand is in that situation,. It's worked really well for us. It's, Kevin, Quinn,, HRPT: Done in other parts, but also pure 25, has kind of areas for different ages and they're, not fenced off from one another,, but the kids fall into little compartments kind of by themselves., Kevin Quinn,, HRPT: And, that's what we were shooting for here when we have fences between the age groups,, it ends up cutting the park up into too many pieces. And I can tell you my own daughter,. They only injury,. She got in a playground, so far as crashing into a fence: gate. So I'm a little hesitant to Lowell Kern- Chair, MCB4: Be, given the fact that it's the furthest area from the road gives me some level of comfort,. There's also that row of trees between the walking the boardwalk, and the bike, path. Right. So, there's not an attractive nuisance of running out into the highway. Kevin Quinn, HRPT:, Right., Kevin, Quinn,, HRPT:, And and maybe I missed your point,. But the playground itself is entirely fenced. In you., There are gates to get into the playground. Lowell Kern- Chair, MCB4: Okay, okay,, that probably solves my problem. Okay, I'm. On the overlook. It looks like the Overlook there's just one way in or out, are we worried about a bottleneck up there,, since it is such an attractive, site., Ian, Hampson,!, melk: Can? You encourage him., Lowell, Kern- Chair,, MCB4: Just scroll left and he should be able to see it. Yeah., Lowell Kern- Chair,, MCB4: So. It looks to me like there's only one way in a route: that's through the Belvedere. Is there another way out of the Overlook that's going to help alleviate traffic. Kevin Quinn,, HRPT:, There and Lowell Kern- Chair, MCB4: Well,, the slide. Yeah,, but I'm worried about people who get up there. And, you know, realize the slides. The only way: out. Kevin Quinn, HRPT: There's, a fair, also nice, yeah. Lowell Kern- Chair, MCB4: Okay, um, Lowell Kern- Chair, MCB4: Let's go back to the building. I'm. The concept is great.. I love it. I'm concerned about the louvers, either being an attractive nuisance to birds. If Lowell, Kern-, Chair, MCB4: They can't tell that it's a building. If, because of the iridescence I'm worried about it, retaining heat and creating,, you know, an uncomfortable feeling in the restrooms and in the cafe and delivers themselves. Who's controlling them. And where's that controlled for them., Toshiko, Mori: I'm. A loser are fixed and Lowell Kern- Chair, MCB4: So. They do not move up and down. Toshiko Mori: No,. It's fixed, Toshiko, Mori:, So numbers themselves. Has this kind of earphones, sheep. Toshiko, Mori: And? It would not have insulation in it. So. It's actually not going to produce heat Toshiko Mori: We also dealt with a project in Cambridge, with the louvers in the birds. And. What we discovered is that bros hate, Toshiko Mori: And, go to rivers. Toshiko Mori: In slight angle, because they are a little feet if they do not like to poach in an angle.. This was with a pharmaceutical company.. We did a lot of studies. And, so I think it's even a quarter inch. They hated. So, that's actually something we have. We have worked with and Toshiko Mori: Yes. And also,. At the same time, boys are attracted to something which emits lights are transparent,, but this is Toshiko. Mori: Still has a slight iridescent, but it's not reflective Toshiko Mori: Okay, they,. They would know not to go in there.. Lowell, Kern-, Chair,, MCB4:, Sorry, I was worried so much about them purchasing to shake up, but on the western side on the water as we're in the flying into the back of the building. Lowell Kern- Chair, MCB4:, Yeah. Um,, but you're a distance is not going to take that and on. While we're on the building. The cafe signage. I was trying to see it, but you're, going through the slides to quickly. There's a limit on the size of the cafe signage. Lowell Kern- Chair, MCB4: Right,, right., Kevin, Quinn,, HRPT: That's. What we're showing you is the limit, Lowell Kern-, Chair,, MCB4: Okay, I did not get a chance to read it because we ran through the slides to quickly I'm fine with the Hudson River Park and the pier 97 sides signs I disagree with JD on that I'm worried about the,. You know, commercial signage,, not so much the park, signage. Noreen, Doyle,, HRPT: So. What we're trying to do by showing the words cafe signage, exactly aware, is kind of like design, Commission approval up front for the exact place. Noreen Doyle,, HRPT:, Okay and scale. So. What you saw is kind of true to the sizing standard that we would have Lowell Kern- Chair, MCB4:, Okay,, um,, Lowell, Kern-, Chair,, MCB4: Well, now I'm heading out of the park on the bike,, the bike path, itself, um,, Lowell, Kern-, Chair,, MCB4:, There's, a nice. It looks like there's a nice separation between the boardwalk area and the bike path,. But how narrow is the bike path because you're going to have the jogger versus bike conflict that we have in the rest of the park of it's very narrow, Kevin, Quinn,, HRPT:, You, know, I? Think I need you for the dimensions: there. Kevin Quinn,, HRPT: With, the bike, path. Lowell Kern- Chair,, MCB4: Is it as wide as we can possibly make yeah Ian Hampson,! melk: Sorry, I was muted. Ian Hampson,! melk: It's about 16 feet with two feet of gutters on either side. Lowell Kern-, Chair,, MCB4: Okay,, so there's at least some room for someone to jump out of the way of the illegally bike on the bike: best Madelyn Wils, HRPT: Part of our bike, path. Yeah. Lowell Kern-, Chair,, MCB4:, All, right. And, my last question. I'm, going to steal one from the committee chair. Is there, a spot at the west end for lending for a water, taxi. Noreen Doyle,, HRPT: Yes,. So we are not building it. But, one of the things that by shifting the historic location, further east Noreen Doyle, HRPT: If, there were a feature. Noreen, Doyle,, HRPT:, waterborne transportation component that could work at the site.. We've talked about that. You can't see it here,, but the. As. You can see,, there's no trees,, there's now anything that kind of goes right to the edge at the,, the South. Lowell Kern- Chair,. Mcb4: Southwest corner. Noreen Doyle, HRPT: last corner. So,, you know,. If you wanted to have something at some future, point. I think that there is room for that. There, Lowell Kern-, Chair,, MCB4:, Right. And it when the location of the historic ship prohibit that Noreen Doyle, HRPT: Location with his Noreen Doyle, HRPT:, Side, or the east, and should not prohibited. It actually,. We think that we looked at the whole south side for the historic ship and Noreen Doyle, HRPT: We're sensitive to not wanting to block us from Milan, among other things,, and it's also, if it's,, you know, a more active zone that the overall periods, design with more activity towards the east and more relaxing towards the west,, so Noreen Doyle,, HRPT: I, think there are things to think about. If there is a water taxi or a ferry or whatever. But we're not there yet and for the moment, there seems to be space for something in the future. Lowell Kern- Chair,, MCB4: Okay, I just wanted to make sure that we would. I mean, I understand,, putting the historic vessel further east,, so not blocked views. The. Only thing that will block is the boathouse that 96 Lowell Kern- Chair, MCB4: But. If you have a water taxi or a ferry, stop at the far end, I want to make sure that those ships coming in are not going to,. You know, generate awake or anything that's going to affect the historic vessel., Right., Noreen, Doyle,, HRPT:, Well, I think that bringing the water taxi further East would actually affects the non motorized voters. The kayakers, and everything else like that. More. So, that's another reason to think about keeping them further west,. If that ever happens, Lowell Kern-, Chair,, MCB4:, All, right,, I'll, leave, I'll leave that I know there's some people from the community boathouse on. If they have that question, when just Jeffrey gets to the public. Thank you all very much., This is a great design,. It keeps getting better. Every time we see it, yes., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Hello,, Blake., Blake, Kurisu: Yes,. Thank you for the presentation, I'm really excited about this. Two, quick, questions., One, and I might have missed this at the last meeting,. But it looks like there's a different fencing on the north and south side of the pier. Blake Kurisu: And. You know, I understand the need: Blake, Kurisu:, For, a more chain, link. Blake, Kurisu:, Kind of fence in the activity area where balls might get thrown into the water. But I'm wondering about the rationale of continuing Blake, Kurisu:, With, Blake, Kurisu: More chain link, look all the way to the West side of the year. And. My second question is about the Blake Kurisu: Building and it looked Blake Kurisu: In. One of the pictures like there is a vehicle in there.. So I just want to learn a little more about the interaction. Maarten deKadt, WPE Co- Chair: Between Blake Kurisu: The vehicle entrance and the Maarten deKadt, WPE Co- Chair: Bike Path. Blake, Kurisu: You know, in that area. Kevin, Quinn,, HRPT:, Mm, hmm., Ian, Hampson,!, melk:, Sure, I could speak to the to the fence. It's Ian Hampson,! melk: Good, that you pointed out, or rather identified that we do have,, you know,, quite a significant fence along the north side. That's done primarily to keep you know, Aaron's, balls or Frisbees or whatever may happen in the activity field. From going in the water. Ian Hampson,! melk: Saying for the children's play escape the reason why we've extended that fence topology farther to the west was for the efficiency of the detailing, because we have a great change along the north side along the Belvedere in the Overlook Ian Hampson,! melk: We actually have Ian Hampson,! Melk: A disconnection from what's currently installed a long, pier 97, which is the HR PT standard. Guardrail, a guardrail is being maintained everywhere, except for the northern portion between the tip of the Overlook, all the way to the entrance of the activity. Field. Ian Hampson,!, melk: And. We did that approach, not only for the efficiency of the detail,, but also for its size. The HRP standard guardrail is quite heavy and takes up a Ian, Hampson,! melk: Lot of with dimensionally. Right. So by using a thinner detail, we're able to actually make them more efficient use of the space as well. And. We're able to join specific elements together without taking up too much room. David Jaubert:, Okay., Kevin, Quinn,, HRPT: And, the building, vehicle. But. What you're talking about it. That's, the yard for maintenance, forces., So I know it looks like a pickup truck, is in that rendering. But. That's actually unlikely to happen. It's, really, electric golf carts mo tracks. It's, our stuff you've seen the park generally Kevin Quinn, HRPT: So, we'll have a few of those. And they're charging up and that's where they transfer materials. Noreen Doyle, HRPT: In size so that if we needed to bring a pickup truck with a bunch of plants or whatever it is., Noreen Doyle,, HRPT: That would work and not be blocking the Esplanade or everything else. Like that. But, but,. As Kevin said, the Guatemalan Park vehicle is a lot smaller. Blake Kurisu: Thank you. Jeffrey LeFrancois- WPE Co- Chair: Thank you, Marty., Maarten, deKadt,, WPE, Co-, Chair:, Thank, you., Maarten, deKadt,, WPE, Co-, Chair: Thank. You for this presentation. It's, been a pleasure to watch this develop into a really,, really lovely project and Maarten deKadt, WPE Co-, Chair: Other people have said that,, but I felt I needed to echo. It. Thank you so much. It will be. It will be an asset to the community. I. Believe I am correct. That this is one of the first projects on community has examine that actually is incorporating solar panels. Maarten deKadt, WPE Co- Chair: On, the roof. Maarten deKadt, WPE Co-, Chair: And. We have several others in the community has often requested it, and I can't help, but Maarten deKadt,, WPE, Co-, Chair:, Say,, hooray., Thank, you. This is a wonderful moment for us to see it actually included in the design. Maarten deKadt, WPE Co- Chair: So I have Maarten deKadt, WPE Co- Chair: Two questions. Maarten deKadt, WPE Co- Chair:, One is,. Why are not there more solar panels on the canopy structure. Another logical place for solar, panels. And? The second question I have is,. We have not.. You have not talked much about the overall energy efficiency of the building: itself. Maarten deKadt, WPE, Co-, Chair:, The, Bronx, River alliances,, just a river house up in Maarten, deKadt,, WPE, Co-, Chair: In start starlight park. It is 100% off is connected to the grid that is 100%, often use batteries. I understand your, your Maarten deKadt, WPE Co- Chair: Strategy of not using batteries,, because that adds a lot of expense to the building and kind of have to be the buffer, and that actually makes sense to me. Maarten deKadt, WPE Co- Chair: But,. But you have not talked about the overall energy efficiency of the building. The,, the boathouse, using vines and other accessories on the outside of the building to prevent the game. Maarten deKadt, WPE Co- Chair: That, the sun, with rain. I have the feeling that I heard the louvers would accomplish some of that. So. The question really is the word: what the overall energy efficiency of Maarten, deKadt,, WPE, Co-, Chair: Solar panels on that can not be energy efficient, feel good., Thank, you., Kevin, Quinn,, HRPT:, First of all, I. Just to let you know, I worked on the starlight river House. Also, in my eye before this job. I was a chief architect for New York city parks. So as I know that building inside now. Maarten deKadt, WPE Co- Chair: It's, a great feeling. Yeah. Kevin Quinn, HRPT: And, then Kevin Quinn, HRPT: There were a few geothermal wells,, which we can do. Here. Kevin Quinn,, HRPT: Actually for a lot of their energy savings. That's right., Kevin, Quinn,, HRPT: But, with that said, we're not really far enough along with this building to ascertain what its energy use is going to. Be, we're really at this Kevin Quinn, HRPT: Late schematic, stage. So. We need to really get into sizing the equipment and the pomson, and all that to really tell you specifically what it is. Kevin Quinn, HRPT: But as I was talking, I remembered. We're, actually changing the lights on the promenade on the pier to be solar powered lights. So I do not know I Kevin Quinn, HRPT: should mention that before,, but these are the lights on that staff. Prominent those will also be solar power bias and, aside from the lights. There, is not a whole lot of energy draw on this,. On this project. Kevin Quinn, HRPT: We're doing pretty good. But. We still need to do the math. Toshiko Mori: So. The building has very little windows and except on cafe, as actually shaded by there can not be above. So in a way,. It's incredibly well insulated yawning., Toshiko, Mori:, So, there's very little heat loss or he gained because of it. And I. Think we try to compensate the lack of Windows by appearance of movers,, but I. Think Toshiko, Mori: Our intuition is that it's going to be incredibly energy efficient building, Kevin Quinn, HRPT: Your own Kevin, Quinn,, HRPT: Kind of minimum, be LEED silver. By the way,, we're not going to certify it necessarily,, but it will be designed to LEED silver Marty. Madelyn Wils,, HRPT: We are very cognizant about making our Madelyn Wils, HRPT: Park. Madelyn Wils, HRPT: When. We can energy efficient. So. It really is a top priority. Madelyn Wils, HRPT: So, we're going to model it and but what the design of the building and Madelyn Wils, HRPT: Of, the all the mechanicals Madelyn Wils, HRPT: We, always are looking at that and we'll get back to all of you about when we do model it and how we're doing. But it's a very key component for us. We are looking at this everywhere in the park. Now, and Madelyn Wils, HRPT: Everything. We do right now is about energy efficiency. So. We appreciate that and we'll get back to you. Madelyn Wils, HRPT: On, this Jeffrey LeFrancois- WPE Co- Chair:, Thank, you., When, Maarten, deKadt,, WPE, Co-, Chair: I. Thank you for that. Jeffrey, LeFrancois-, WPE, Co-, Chair:, Oh,, sorry., Sorry, I did not realize you had another. Follow: up. Maarten, deKadt,, WPE, Co-, Chair: Just to comment. Now, stop at the fact that you're doing, energy efficiency on that building the model- and it's not going to come back to us about it- is Maarten deKadt,, WPE, Co-, Chair:, A, really wonderful thing, and you should be proud of yourself. For. Thank you so much. Noreen Doyle,, HRPT: Anyway,, we're channeling you Noreen Doyle,, HRPT: Let me know. We figured out that solar would work. Here. We were channeling. You Maarten deKadt, WPE, Co-, Chair: Well,. Thank you very much for that. And I'm. Looking forward to hearing about the energy efficiency of the building,. When you, when you come up with Lowell Kern- Chair,, MCB4: Marty,, you say solar panels, enough, eventually they're going to listen. Jeffrey LeFrancois- WPE, Co-, Chair: Thank, you everybody on when on the phone. 1212****414: They are more 1212****414: When we just lie,, I'm I was just wanted to stand up for windmills. They're small windmills would get you more. Jeffrey LeFrancois- WPE, Co-, Chair:, That's, a comment. Thank you., 1212****414: Know. The comment was, actually, I agree with JD about the building and 1212****414: I. Just do not think it fits there.. It just does not look. Right. Especially the signs, but the rest of it. Too. It looks like a commercial building. An office building. It does not. It's jarring. What's, the part to me. Jeffrey, LeFrancois-, WPE, Co-, Chair: Okay, and that's it. 1212****414: Thank you for that. Lowell, Kern-, Chair,, MCB4:, Jeffrey., Can I respond to go in Jeffrey LeFrancois- WPE, Co-, Chair: Sure. I was going to go ahead. Lowell Kern-, Chair,, MCB4:, Wine. If. You go north of this park. Lowell Kern- Chair, MCB4: You've got the kind of peer and the sanitation peer. So, there's absolutely nothing there. That feels like a park at all.. I know the trust. JD— MCB4: Whoa. Lowell Kern- Chair,, MCB4: Yeah. JD— MCB4: This is not a debate. Lowell Kern- Chair, MCB4: I'm not debating I, was Drunk Lowell Kern- Chair, MCB4: And,, you know, the,. The other thing I was going to say is that I know the park need asked for a I'm like a restroom there and I know the part that needs a maintenance facility there. So it may not work really well,, but it's something we asked for previously. 1212****414: Well I do not say that it does not need the functions.. It has 1212****414: I'm. Just saying that to me it's. It looks very commercial in the middle of a park. Jeffrey LeFrancois- WPE Co- Chair: Thank you. When Jeffrey LeFrancois- WPE Co- Chair: I'm, going to Jeffrey LeFrancois- WPE Co-, Chair: I'm, going to make a couple comments and then we're going to go to Katie and the public. Jeffrey LeFrancois- WPE Co- Chair: For this so Gina,. If we want to tee up Katie and move for into the panelists,, so she can ask her question. Jeffrey LeFrancois- WPE Co- Chair: I'm, starting on the building. I found it. I liked the contrast that particular elegance,, especially when you saw the view from the highway of the content, piping. Jeffrey, LeFrancois-, WPE, Co-, Chair: And, then the sort of very linear element of the building up against what seems to be a marrying of circular and geometric designs throughout the park. Jeffrey LeFrancois- WPE Co- Chair: I rather liked,, even though at first, it felt a little cold to me, but it grew on me.. I want to applaud the perforated canopy, I think,, letting a little bit of sunlight through Jeffrey LeFrancois-, WPE Co-, Chair: Is really important in places like this and not full shade. Jeffrey LeFrancois- WPE Co- Chair: My two questions are around,. Have we chosen a wood, material, I noticed quite a bit of wood and the benching, and a particular in the northern sections of the pier, and is that a standard, Park. Um,? What are we Jeffrey? Lefrancois- WPE Co- Chair: Are, there specific ones being considered for this year. Ian Hampson,! melk: We have chosen with material. It's called Kemeny. It's an engineer would fabric fabricated from Pine and it has the same performance almost as an EP HR PT Ian, Hampson,! melk: Their mandate is to not use any tropical hardwoods and milk also agrees with that. By practice he pay is also utilised elsewhere in the city of New York. Ian Hampson,!, melk: So. We we've seen it so it's your ability and if Noreen Doyle,, HRPT: you're curious about Madelyn Wils,, HRPT: Jeffrey, Jeffrey, we've done an enormous amount of research on this, and we're using it on pier 26 Madelyn Wils, HRPT: And we'd like the way it looks. You'll like the way it looks when it opens, and we think that this is the best word. That's available., Madelyn Wils,, HRPT: That can substitute for hard would like a pay and one that actually look. We'll look good as it ages. So I think you're going to like it. When you see it. 1212****414: Thank you. It's going to get started. Jeffrey LeFrancois-, WPE, Co-, Chair: And, then Ian you're planting scheme is gorgeous. But. It looks like you were, showing all three seasons of bloom,: a various things. Jeffrey LeFrancois- WPE Co- Chair: At, one time through out there. Jeffrey, LeFrancois-, WPE, Co-, Chair:, And I just want to make Madelyn Wils, HRPT: Climate, change,, Jeffrey, LeFrancois-, WPE, Co-, Chair: I know that Madeline but I rarely Jeffrey, LeFrancois-, WPE, Co-, Chair: I still be in line actress and cherry trees. All the same time. That's a little bit specific but I could not resist the comments. Jeffrey LeFrancois- WPE Co-, Chair: As. It looks gorgeous. Jeffrey, LeFrancois-, WPE, Co-, Chair:, But, I, hope we're planning, as the park does for three seasons of color and then winter structure. Of course, as well. Ian Hampson,! melk: We have,, we have and rendering programs, of course, have limitations. Jeffrey LeFrancois- WPE Co- Chair: That I gotcha., Ian, Hampson,! Melk:, In general,. We tried to communicate the prevalence of where we're bloom density would be,, but there will be definitely seasonal interest and change over time. Jeffrey LeFrancois- WPE Co- Chair: Great., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Thank, you., I'm, going to So, Brad and Chris I, see your hands just went up and I your last two members of the committee, I guess implore you to be brief., It's 809 and we have five more items on the agenda. So Brad,, please., Brad, Pascarella-, CB4:, Yes., Brad, Pascarella-, CB4: Two. Questions will put. Mr will be brief and we have the money to build this and when will it starts and my third point is,: can we get the kind of transfer station to take down their neon colors. So? The sign will look better. Madelyn Wils, HRPT: Hey. Well, as you know, we have the money in the state budget to bill the park a it is a and, as you also know, there's a Madelyn Wils, HRPT: Huge amount, Madelyn, Wils,, HRPT:, Of pain,, those being referred by government right now and we're part of government and Madelyn Wils, HRPT: We're suffering it too. So. We hope that so we are completing the design and we are working with the state to figure out how we can move forward on this project. Our intention is to move forward on the project. Madelyn Wils, HRPT: No money was cut, Madelyn, Wils,, HRPT: From, this Madelyn Wils, HRPT: Project. So. That's a good thing., Madelyn, Wils,, HRPT: We know that the governor wants to get it. Done., Madelyn, Wils,, HRPT:, But, there's a lot of noise. As. You can imagine, right now on 1212****414: Colbert and Madelyn Wils, HRPT: We need to get through that a little bit before we can figure out what exactly our schedule of construction will be. Jeffrey LeFrancois-, WPE, Co-, Chair:, Thank you,, is that it Brad Pascarella- CB4: Yeah, I was not joking about taking that color down on the contents. Madelyn Wils, HRPT: So, yeah., Madelyn, Wils,, HRPT: Um,, that's interesting., Madelyn, Wils,, HRPT: Let's. Take a look at that., Brad, Pascarella-, CB4:, And,, Mr., Chair., Brad, Pascarella-, CB4:, Yes, I know we always talk about water taxis. But. Would it be possible to actually put it on the drawing and say water taxi landing, site., Brad, Pascarella-, CB4:, Well,, I, suppose., Jeffrey, LeFrancois-, WPE, Co-, Chair: That? Is that appropriate thing? I do not consider the trust to be the appropriate mechanism to be doing the, the development and planning for it. Um,, so Jeffrey LeFrancois-, WPE, Co-, Chair: Yeah,, an ideal world, they're showing it and you're right. I. Guess we could have a considered. I was heartened by this plan that it actually gives what I see is a little bit more flexibility to a potential landing long term. If we can convince the city to bring service here., Brad, Pascarella-, CB4:, And, Madeline. Thank, you so much. We've been waiting for solar and green for years, and we really appreciate it. Thank you., Madelyn, Wils,, HRPT: Oh,, it's our pleasure,, because it's really important. Jeffrey LeFrancois- WPE, Co-, Chair:, Thank, you., Christopher, Chris, Lebron(, MCB4, WPE, Member):, Thank, you., Chris, Lebron(, MCB4, WPE, Member):, Everybody, I just wanted to say to HR PT to shoot on milk really making green space out of nothing, and it's heartening to see the hard work coming. In. Chris, Lebron(, MCB4, WPE, Member): During, this time, that raw fish right now, and secondly, to comments made about water. Taxis. I'm, aware that peer 90 was dredge to host Chris Lebron( MCB4 WPE, Member):, The, US naval ship comfort was done and record timing. I do not know how deep they went,, but that is another option for water taxis on the Hudson River Park. Chris Lebron( MCB4 WPE, Member): So. That may be something we want to look into in a future meeting with etc. I believe they're, the ones that manage them: here., That's all,. Thank you. Everybody. Jeffrey, LeFrancois-, WPE, Co-, Chair: I think that the Jeffrey LeFrancois- WPE Co- Chair: Cruise terminals different than the peers that are in the rest of the park. There are DC and environmental regulations around dredging in these areas,. If I'm, not mistaken,, Madeline that we'd, obviously much deeper conversations, rather than he is, and that type of thing. Madelyn Wils,, HRPT:, Well,, I, mean, I'm. Sure nori would like to chime in. But I'll just say,, so the comfort got an emergency permit to dredge because it was truly an emergency. Dredging is really complicated and difficult under the best circumstances, meaning Madelyn Wils, HRPT: The passenger ship terminal, which is not in the park,, but in the Hudson River Park act. It actually says that no dredging is allowed.. So Madelyn, Wils,, HRPT: That is a big issue.. I will say that Madelyn Wils,, HRPT: As time goes. On. Much of the park is being silted in Madelyn Wils,, HRPT:, When, I, say much of the park. I mean, in waterpark. It's just Madelyn Wils, HRPT: The, the cycle and the way that the Madelyn Wils, HRPT: That's happening and Madelyn Wils, HRPT: If. That's not an area that I think is Madelyn Wils,, HRPT: Going to be very Madelyn, Wils, HRPT:, well, received. If. We start opening that up, but Madelyn Wils,, HRPT:, You know,. It's just the way. It is that Madelyn Wils, HRPT: The,, the depths of the water around the park are just very shallow and Madelyn Wils,, HRPT:, And I. Think just as time goes, on. We have to accommodate to that. Jeffrey LeFrancois- WPE Co- Chair: Thank, you,, darling. Thank you for raising Chris I'm Katie,. Thank you for your patience from the men from the boathouse Jeffrey LeFrancois- WPE Co- Chair: Yeah, either. Jeffrey LeFrancois- WPE Co-, Chair:, Yes., Hi., Catie, MCBH/, Pier, 96:, I'm, Katie, Savage. I'm on the board of directors from Manhattan Community boathouse, which operates out of pure 96, which is directly south of your 97 or 97, is actually our northern Catie MCBH/ Pier 96: Border for our environment. So. Anything that happens on the south side and the water is effectively in our environment and puts our kayakers at risk.. Catie MCBH/, Pier, 96: So, the historic vessel will then, if that were to leave for excursions that interferes with our free public program, water taxis would effectively kill our public program,, which serves 17,000 people on average per season. It's. Currently, the main draw to the north side of the park. Catie MCBH/ Pier 96: So that,. That's a huge issue for us. So. How can we address keeping our programming and,? You know, finding a way to maybe use the north side of the pier. So. It does not interfere with our investment. Jeffrey LeFrancois- WPE Co- Chair: Thank you for that. Katie,, Russia,, you're, battling. Can. You speak to whether or not this historic ship is planned to do excursions or she'll stay put at the pier. Noreen Doyle, HRPT:, No,, I, mean, I'll. Just start with the point that the park overall was designed for boathouses and historic ships. Noreen Doyle,, HRPT: And. It was designed for historic ship location at Pier 97 specifically and for the boathouse that we built. Obviously at Pier, 96, Noreen, Doyle,, HRPT: And throughout the park and throughout the harbor kayaking and Russell's work, together. It's, not always ideal,, but with operational planning,. You can think about it. Noreen, Doyle,, HRPT: You're not open every day a week. Every hour the historic vessel might not be either depending on what it is and whether it has to move or not is one of the things that can be considered as that planning continues. Noreen Doyle, HRPT: With, whether we can even bring it to the pier that programmatically,. The Community Board has been on record as wanting a historic vessel.. Noreen Doyle,, HRPT: The North side does not work. It's, very narrow defenders that you can kind of see sticking out of the pier on the far left at the top of the page,. There are there because Noreen Doyle, HRPT: Vessels coming. I mean,, it's kind of,, it's a fuel transfer facility, so vessels working vessels come in and out of that location. Noreen, Doyle,, HRPT: And in the past have basically bumped those vendors that you see, sticking out there. So putting any kind of vessel on the north side. There really does not work. And. It really also does not work with the design. Noreen Doyle, HRPT: Of, the Belvedere, and the Overlook for other reasons. And. So the south side is the spot that would work for a historic vessel and I think you're, raising operational questions that are important questions that I do not think it's either or Catie MCBH/ Pier, 96:, Either, I, Madelyn, Wils,, HRPT: I just want to point out,. He knows the design of the pier on the north side, how the corners rounded off- and it was done that, specifically because of the Madelyn Wils, HRPT: Content barges having a difficult time maneuvering around that and that just made. I mean we really studied putting a boat on the north side. And. That's really where we wanted it,, but it just was not going to work with the content. Operation. Madelyn Wils,, HRPT: But. We are a park of many colors and we,. You know,. We work with the vote, houses and the historic ships and we somehow managed to incorporate boating and historic ships and I. Think Madelyn, Wils, HRPT: We would do the same. Here, we're not we're not,. We would,. We would not put a ship there without considering the needs of the boathouse, so Madelyn Wils,, HRPT: This is going to be an ongoing conversation.. This is not where it ends. It's, just where it starts. And. You know the stork. Both is not a done deal. Either. So! It's a process and you'll be part of the process. Catie MCBH/ Pier 96: Thank you, beyond the historic boat. There's. Also, the water taxi, that would be moving frequently and causing week, which would also pose a big issue for our kayakers, Madelyn Wils, HRPT: Definitely have a big effect. It's true. Noreen Doyle, HRPT: Is. Not our current proposal is Jeffrey LeFrancois-, WPE, Co-, Chair: Just to be clear,. That is the trust, is never put forward that the board has been long, been advocating for lateral, Westside ferry service and had identified Jeffrey LeFrancois- WPE Co- Chair: Peer 97, as sort of key element of that plan. I'm recognizing,. There may be conflict with that along the way. I did you just want to ask about the South Side appear 96 with regards to your use and access, and there is additional abilities for you on the south side of 96 right. You Catie MCBH/, Pier, 96: Know, the way 96. I mean,, it's not on your map. 96 does not stick out very far. It's, very short., Catie MCBH/, Pier 96: So 94 is our southern boundary and 97 is our northern boundary got that space and the imaginary line that connects the end of those peers? Is our space for kayaking. So. It would be very difficult to keep it's already difficult to keep people away from those peers. Catie MCBH/ Pier, 96: You. Everybody wants to investigate,, especially when the concerts were happening on 97, so having other attractions, there. Catie, MCBH/, Pier, 96: Will be difficult. The. Other major thing beyond the boats is fishing. Catie, MCBH/, Pier, 96: Fishing is a big issue. When we're kayaking up by pure I and looking out for fishing lines, will people be fishing off of the south side of 97, potentially Catie MCBH/ Pier 96: Interfering with our kayakers,. You can't see the fishing line you throw your Catie MCBH/ Pier 96: Pole out and you hook somebody that's a big safety issue as well,, especially on the weekends. We, are very, very busy on the weekends. So anything that I understand. Catie MCBH/ Pier 96: During, the week, you know, things can happen when we're closed, but Saturdays and Sundays from May through October, always busy. So. Anything that's moving around within our environment poses a huge issue., Noreen Doyle, HRPT: So Katie. We do environmental education that involves fishing and other activities in the water and again Noreen Doyle, HRPT: The issues that you're addressing here. We have that three other boat houses in the park as well. We do environmental programming. We do other things in other places., Noreen, Doyle,, HRPT: And. We basically work with people to try to figure it. Out. So, Noreen, Doyle,, HRPT: That is the best answer that we can give you at this point, you know,, we intend,. We want to bring local school kids near pure 97 out to the fear to discover what lives in the river. Noreen Doyle,, HRPT: So, whether that is through fishing or through other things. We do not exactly know yet,, but I, mean, your,. Your concerns are not unique to this spot, and we've basically manage well with all of the other build houses that we have. So,. You know, that's the best thing that I can say right: now., Catie, MCBH/, Pier, 96:, Okay., Jeffrey, LeFrancois-, WPE, Co-, Chair: Thank, you very much. And thank you,, Katie. Appreciate, you raising those issues., Um, I do not know if we need a letter. Here. Jeffrey, LeFrancois-, WPE, Co-, Chair:, My inclination is that we are continuing to applaud the design. Jeffrey LeFrancois- WPE Co- Chair: All of the concerns that were raised regarding the playground,, the louvers on the building, FDNY and maintenance access to the building. Jeffrey LeFrancois- WPE, Co-, Chair: Access to the Belvedere, up and down. Jeffrey LeFrancois- WPE Co- Chair: Seem to have all been addressed. If somebody on the committee feels. Otherwise,, please let me know. Jeffrey LeFrancois- WPE, Co-, Chair: Because. If not, I, I do not know that, there's a need for a letter. Here. Maarten, deKadt,, WPE, Co-, Chair: I, agree that there should not be a letter or we do not need a letter and I look forward to the next presentation. Noreen Doyle, HRPT: Can I. Just ask you Noreen Doyle, HRPT: Kevin, do,. Do we need one for PTC, Jeffrey, LeFrancois-, WPE, Co-, Chair: That's, true PPC may need you may require one Kevin Quinn, HRPT: They have not asked we. You were nice enough. Kevin, Quinn,, HRPT: To give us one to begin with, for the overall schematic, plan. So I think we're good. As far as PVC is concerned. Jeffrey LeFrancois-, WPE, Co-, Chair:, Okay., Jeffrey, LeFrancois-, WPE Co-, Chair: Well,. Thank you all for that very much.. This is big and,. You know, Madeline hold on to that money from the governor please and get this built. Madelyn Wils, HRPT: Believe me, I'm working on it. Okay,, good., Jeffrey, LeFrancois-, WPE, Co-, Chair: Our next item. Jeffrey, LeFrancois-, WPE, Co-, Chair:, scope of work for the plan; restoration of private passage., The sculpture in Clinton Cove,, which is actually just south of where we were doing this evening. Jeffrey LeFrancois- WPE, Co-, Chair:, Bye,, everyone., Bye., Madeline., Thank, you., Madelyn, Wils,, HRPT:, Man, Thank, you to shake. Oh, thank you., Thank, you. Jeffrey and low Jeffrey LeFrancois- WPE Co- Chair: Low, Jeffrey, LeFrancois-, WPE, Co-, Chair:, In, everybody's teams. Thank, you for that on 97, we're very excited. Jerry Van, Eyck,!, melk: URI by Glad to hear it. Ian Hampson,!, melk:, Oh,, good evening., You, too., Jeffrey, LeFrancois-, WPE, Co-, Chair:, So, who's, doing I'm, Jeffrey LeFrancois-, WPE, Co-, Chair: Private passage, update, Kate O'malley, HRPT: I am hi I'm Kate. Kate, O'malley, HRPT: From, atrocity., Hi., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Janine. Do. We have a screen share: here. Jeffrey, LeFrancois-, WPE, Co-, Chair:, Okay., Kate, O'malley,, HRPT:, Okay,, great., So I'm, going to do a brief overview of the scope of work for the conservation of private passage by Malcolm Cochrane well. Next slide. Please. Kate O'malley,, HRPT: Thanks, so private passage is the formal name of the large sculpture that we more commonly referred to as the bottle. It's, a piece by Malcolm Cochrane. That's located Kate O'malley,, HRPT: As Jeffrey mentioned and Glen cove adjacent to the pier 96 boathouse. It was installed on April 2005, so it's been in the park for about 15 years, now. Kate O'malley,, HRPT: And, as you can see, from the image on the right. It's starting to show with age, a bit, and so thanks to grants from council members, Corey Johnson and Helen Rosenthal,. We've been able to start this project to conserve this sculpture. Kate O'malley, HRPT: Next, page,, please., Kate, O'malley,, HRPT: So. We started this project by hiring Wilson conservation or a well known art conservator based in Brooklyn. Kate, O'malley,, HRPT: And, so we've been collaborating with them and with Malcolm Cochran, the artist to develop a set of specific recommendations for how to restore the sculpture. Kate O'malley, HRPT: So. The primary scopes of work are the application of a new Exeter, you're finished,. You can see an image on the bottom right, that Kate O'malley, HRPT: The pieces, starting to rust. It's, been exposed to whether Members of the public interact with the piece. It also went through Hurricane Sandy. And. So it's starting to need some work. Kate, O'malley,, HRPT:, The, sculpture itself is made out of steel, and there was an applied coating that made it resemble each bronze. Kate O'malley,, HRPT: And. So for this project, we're going to remove that applied coding, make any repairs necessary to the steel. Kate O'malley, HRPT: Then apply a new system, that's going to be more resilient and something that we're going to be able to maintain our own moving forward. So. We think that will really be an improvement that will allow this to sort of stand up to time. Kate O'malley, HRPT: While we're at it, we're also going to replace the glazing and all the portholes. You know some of them have become scratched. If. You look at broken over the years. We've replaced them,, but we're looking to use more resilient materials and then also on the interior, Kate O'malley, HRPT: You, know, the,. The piece was flooded during Hurricane Sandy. And. While we did the best that we could. We tried on multiple occasions. Kate O'malley, HRPT: You can see on the interior and the image on the upper right,. You know,, there's some rusting. There are some dirt that and, you know,. So there's going to be a thorough, cleaning, they're going to take care of the rest. And. It's going to be returned to us. Looking brand new. Kate O'malley,, HRPT:, So,, please., Kate, O'malley,, HRPT:, In terms of schedule and logistics. The piece is going to need to be removed from the site so that this specialized work can be done in a Kate, O'malley, HRPT: Metal working, facility. So the pieces going to be off site for about three months on the disruption to the parks should be minimal.. There will be perhaps a day or two of partial closures, and this immediate area just to get the piece in and out. That will be coordinated as necessary. Kate, O'malley, HRPT: And our overall timeframe as a little bit. Tbd. We need to get final approvals from the Public Design commission, we'd have some contracting to work. Out. Kate O'malley, HRPT: And. We just need to make sure everything is in place with our funding,, given the current state of the city's budget,, but something that we're going to work out and we're really excited to be able to do. This. That's,, that's basically, it. So take any questions. Jeffrey LeFrancois- WPE Co- Chair: That's great,, Kate., Thank, you., Um. Any questions from the committee JD— MCB4:, Yes. Are. You think this is just terrific.. This is a wonderful piece of public art. It children, love it and I love it too. I! Thank you for doing this., I hope we can write a letter thanking Corey and Helen for the funds for this, because this is a wonderful piece of public art., JD— MCB4: Work,. Where does it take three months. Kate O'malley, HRPT: Um, they're going to have to sort of blast the Exterior start surface off, it's going to be done. Basically in a foundry. And, then it's going to go to a specialized coding, space. And! So there's just a bit of you know it's careful, we're and specialized. So it's being taken off site., JD—, MCB4: And, the interior. The furniture inside is that JD— MCB4: Going to be polished up. Kate O'malley,, HRPT: Yes, they're, going to clean everything, they're going to do an assessment. Once. They have it open and they can get in it and they'll do whatever it needs to happen to make it look as it did when it arrives. JD— MCB4: That's, great., Thank, you., Jeffrey, LeFrancois-, WPE, Co-, Chair: Does. That mean will lose that patina finished as well as the rest, Kate O'malley,, HRPT: Know. What's going to be replicated, the rusty will remain,, but the effect that when each bronze is what's going to happen. Jeffrey LeFrancois- WPE, Co-, Chair:, Great., Thank, you., Anybody else on the committee., Jeffrey LeFrancois- WPE Co- Chair: Any members of the public. Jeffrey LeFrancois- WPE Co- Chair: JD,. Are you formalizing the idea of a letter to Korean held on this. JD— MCB4: Yes, I am. I moved that we write the letter thanking Corey and Helen for JD— MCB4: For the funds for the funds to JD— MCB4: Restore Jeffrey LeFrancois-, WPE, Co-, Chair:, Thank, you. Is there, a second on the motion. Jeffrey LeFrancois- WPE Co- Chair: Thank you, Sally. I'm seems like a pretty straightforward. Letter K. Did, you receive. Was, that a recent was this fiscal years this years in the making,. Just so I can note. Noreen, Doyle,, HRPT:, And I think that the funding from Corey may have been last year,. We can Noreen Doyle, HRPT: Get you that actually Jeffrey LeFrancois-, WPE, Co- Chair: Said, Okay, that'd, be great. If just so I can include us Kate O'malley,, HRPT: So, we can get you that Jeffrey LeFrancois- WPE Co- Chair: Thank you. Jeffrey LeFrancois- WPE Co- Chair: Okay, great to hear that we love in new public art improvements to our existing public art. So. Thank you for that. Jeffrey, LeFrancois-, WPE, Co-, Chair:, Um, next item on our agenda. Moving to city parks to present on the temporary public art exhibition coming to Bella Abzug park in the summer of 2020 Jeffrey LeFrancois- WPE, Co-, Chair: Also referred to as Hudson Boulevard area around Hudson Yards,, and we have 1212****414: A brief presentation on that. And, Jeffrey, LeFrancois-, WPE, Co-, Chair: Have. We moved over that present person presenting Janine-, MCB4: I, believe it's Nicole's presenting,, but she will. She can be promoted.. Let me see. Jeffrey, LeFrancois-, WPE, Co-, Chair:, Let's, see. Nicole,. Are you planning. 1212****414: On it., Nikkole Mojica: They'll actually be Elizabeth masella from Parks. Nikkole Mojica: Who will Nikkole Mojica: Be, leading the presentation. Jeffrey LeFrancois- WPE Co- Chair: Thank you. Sure thing. Jeffrey LeFrancois- WPE Co-, Chair:, Yep. There. She is. She raised her hand and everything. Nikkole Mojica: Oh, great. Elizabeth Masella: Can, you Elizabeth Masella: Hear me Yes., Elizabeth, Masella:, I'm, Elizabeth, Masella:, Hi, I'm, Elizabeth, masella, I'm, the senior public art coordinator and YC parks. Elizabeth, Masella:, And I'm, here also with Nicole from the Hudson Yards Hell's Kitchen alliance, to share just a brief informational, Elizabeth Masella: Presentation with you about a temporary public art project. That will be coming to Bella Abzug Park,, hopefully later this summer. Elizabeth Masella: And for I, think it's been a while, since we've been to district for with public art., Elizabeth Masella: Just. To give you a brief overview,, our parks program permits temporary public artwork in parks and all five boroughs were. A small team of two Elizabeth Masella: Temporary are is considered anything on view for up to one year and all projects are funded by the artist or the exhibitor Elizabeth Masella: They're required to maintain and cover all custom installation for the artwork. Um,. But right now our entire program is kind of on hold for the time being. Elizabeth Masella: And, you know, we're aiming for August for this project, ultimately,. If there's still a lot of restrictions in place at that time. Elizabeth Masella: We can postpone it. We Nicole's been into the artists, they're, aware kind of the situation and we're going to continue to monitor to monitor that safety is of utmost importance. So. The artwork is going to be a bronze sculpture. I'll show you. Elizabeth Masella: Some, slides in a moment. Elizabeth Masella: And, it's quite large. It's, going to be the world's biggest bronze gorilla sculpture and by the Australian artists. Do Jillian mark., Elizabeth, Masella:, It's called King, Mcara and MacArthur has a real gorilla, who lives in Uganda,. The artists are proponents of wildlife, conservation. Elizabeth Masella: They met the gorilla on a travel to Uganda and are creating the sculpture to honor him and girl populations around the world. And you'll, see on the first slide and area marked out where the sculpture will go. Elizabeth, Masella:, The, Alliance gone out and measured to make sure it will fit. There will be plenty of space to in keeping with ADA accessibility and it'll be 4000. Pounds will be quite heavy and be held in place by its weight and won't Elizabeth Masella: require any anchoring. Elizabeth Masella: It'll be moved into place by a crane, which can be done in a few hours from the roadway that you see there,, and it should take a few hours, and we'll find a time to do that. When there's not so many pedestrians. Next slide. Elizabeth, Masella: And, that shows you in the larger scheme of the park. Where will be. Next slide. Elizabeth Masella: This is an earlier rendering. It's not going to be quite that large, I think there. It looks like it's about 20 feet: tall. Elizabeth, Masella:, So., Elizabeth, Masella: This is an earlier model of the gorilla. Elizabeth Masella: That will be in the park. Elizabeth Masella: So. That's essentially it so August tentatively 2022 July, 2021, Elizabeth Masella: And I'm happy to answer any questions. You might have. Jeffrey LeFrancois- WPE, Co-, Chair: Thank, you Elizabeth Jeffrey, LeFrancois-, WPE, Co-, Chair:, Any, questions from members of the committee., Jeffrey LeFrancois-, WPE, Co-, Chair:, Right., Nicole or Bob,. Did you want to add anything? Bob Benfatto-, HYHK:, No,, I'm good, I must say. Jeffrey LeFrancois- WPE Co-, Chair:, Thank you, Blake, I saw your hand, go up. Sorry about that. Blake Kurisu: Yeah, I was just wondering if we could get a little more context on how this particular Sculptra was chosen,. You know, Blake Kurisu: I'm just curious about how it fits in,. You know, either with Blake Kurisu: The time during or with the setting, you know, to me, to be honest,. It feels a little out of place, and particularly in the current environment,, it might feel a little more out of place. Blake Kurisu: You know,, given that we would be coming out of this endemic, hopefully the time that this would be shown. Elizabeth Masella: So, the artists approached on the Alliance, I do not know, I'm Nicole. If. You wanted to say anything about kind of the. Why of the sculpture in your park. I mean generally our program. We look at site, suitability in terms of Elizabeth Masella: How an artwork might impact the use of this regular use of the space, you know,, art is kind of in the eye of the beholder. You know,, our partners. Elizabeth Masella: You, know, may feel a certain connection between this and the site, you know,. We do try to be thoughtful about why a piece and where things like that., So, Nicole. I, do not know. If you have anything, you wanted to add on that note, Nikkole, Mojica:, Sure, I'm in some of our early conversations about the peace and the artists expressed interest in into a raising awareness about the gorilla and using sort of the status of the parks location as a as a way to do so and then engage encourage rather conversation. Nikkole, Mojica: About, about the species and the animal,, and then Nikkole Mojica:, basically trying to tie it into by way of how it looks and encouraging people to sit on it and engage with it, tying in this sort of sense of community and unity. Elizabeth Masella: And ultimately, um,. No, it is temporary. So, we'll go away after some time. Blake Kurisu: Thank you. Blake Kurisu: Thanks,, like Brad Pascarella- CB4: Well can I at least say it. The gorilla in the room. Let me,, let me say, Carl Wilson-, Speaker, Johnson:, Jeffrey, you're, muted. We, can't hear you. Lowell Kern- Chair,, MCB4:, Somebody, Jeffrey, LeFrancois-, WPE, Co-, Chair:, To myself, all day, long. Again,, Jeffrey, LeFrancois-, WPE, Co-, Chair: Does, the parks, Department or the alliance require any correspondence on this. Elizabeth, Masella:, Um, no. Since. It's temporary. We do not require any Elizabeth Masella: Resolution or anything. If you feel that, like some keyboards. Do, you like to issue a letter of support, if you so need,, but we do not require it. Jeffrey LeFrancois-, WPE, Co-, Chair: Says. The committee feels strongly about issuing a letter of support. Jeffrey LeFrancois- WPE Co- Chair: I'm in different. I think that it's allowed to happen. Um, I think it's okay. And, given that Marty and I are the letter. Writers. If. The company does not want to write a letter. I'm, okay with that. Bob Benfatto- HYHK: The Alliance is not asking for a Bob Benfatto- HYHK: Lot of them. Jeffrey LeFrancois- WPE Co- Chair: Okay, thank you. Jeffrey LeFrancois-, WPE, Co-, Chair:, Okay,, great., Elizabeth,, I'm, Nicole. Bob,. Thank you very much., Bob Benfatto- HYHK: Thank you. Elizabeth Masella: Thank you for having Jeffrey LeFrancois- WPE Co- Chair: Thank, you everyone. Or I'm on to the next item on our agenda from the Department of sanitation regarding the compost collection program, suspension for I'm sure they're going to get into this,, but Jeffrey LeFrancois-, WPE, Co-, Chair:, The city stopped,, not just curbside composting. I'm in light of the Kobe outbreak,, but it's also been put on halt at Jeffrey, LeFrancois- WPE, Co-, Chair:, Green markets and Hudson River Park has also suspended their compost. Collection. So I did not local community gardens,. A review of access. Lori said: ecology center in Manhattan. There's, really nowhere to compost. So. We asked for a brief update, Jeffrey LeFrancois- WPE Co- Chair: On, the Y and with what we might be able to do to request getting some of it back online, not curbside, pickup. But. What locations around the city and in our neighborhood. In particular,? We can request. Jeffrey LeFrancois- WPE, Co-, Chair:, So departments, invitation. Who. Do we have this evening. Jeffrey LeFrancois-, WPE, Co-, Chair:, Oh, Risa, Marissa, Yanni-, DSNY:, Versa., Yeah., Jeffrey, LeFrancois-, WPE, Co-, Chair: Sorry about that. Marissa, Yanni-, DSNY:, That's, okay., Hi,, I'm, mercy, Yanni and then Hadley's on for on community outreach.. I also have on here with me and you and Marguerite from our Bureau of recycling sustainability. Marissa Yanni-, DSNY:, So they're, going to be getting into the composting suspension, as well as answering all of your questions. Marissa Yanni- DSNY: I'm, just here to say, hi and make sure everyone you know, make sure you see the who I am as your liaison and just give a quick update just from Department of sanitation., So I think everyone knows about our streets, ripping rules that are in effect., Marissa Yanni- DSNY: And do know that the they will be in effect, rules will be in effect again from May 18 to the 24th. Marissa Yanni- DSNY: And, then alternate side parking is suspended again for another two weeks from May 25 of June seven, Marissa, Yanni- DSNY: Just want to flag that on May 21 and may 24 are already scheduled, alternate star parking suspension days for two holidays. So just want to keep that in mind for folks. Just in case, you did not see that. But I'm, going to turn it over to Andrew and Margaret. Jeffrey LeFrancois- WPE Co- Chair: Thank, you,, Andrew, Marguerite, Andrew, Hoyles(, DSNY):, Well,, everyone., Andrew, Hoyles(, DSNY):, It's, me, and Royals I'm, the senior manager or organics outreach with the Department of sanitation and Andrew Hoyles( DSNY): You know,. We really want to start just it believe it was. We were invited earlier by Manhattan. See, before committee and for March 12 Andrew Hoyles( DSNY): And. We are going to present to that meeting to talk about all of the various options,, both the curbside composting program and the drop off programs that were available to all residents and see before. And, you know, two months later,. We are in quite a different location. Andrew Hoyles( DSNY): Quite, a different reality, given the global pandemic,, given the Andrew Hoyles( DSNY): You, know,, loss of life and the,, the loss of revenue to the city and the emergency Andrew Hoyles( DSNY): Status at the city's in which was actually declared on the 12th of March,, so Andrew Hoyles(, DSNY): You, know I I'm. I work specifically on the curbside program. The brown, Ben program,, but not great news. We had to be suspended. The program. Andrew Hoyles( DSNY): As of March 4 Andrew Hoyles(, DSNY): Or may 4. Excuse me. As of May 4. Essentially the city needed to free up funds for code, response. And in doing so,. That was one of the hard choices that the Commissioner had to do. When the mayor asked for program, cuts., Andrew, Hoyles(, DSNY):, When service, so residents in Manhattan for,, you know,, you had to actually opt into the program. He had an opt in program where you Andrew Hoyles( DSNY): Signed up online and you received a site visit from staff, and then they would talk to your building super or your,. You know, your building maintenance and then provide bins and service. Andrew Hoyles( DSNY): The alternative, where the drop offs,, which there were a handful of Dropbox around the city,, particularly in see before and Andrew Hoyles( DSNY): We actually suspended those drop offs to stay in the Recommendations and Requirements really of social distancing that were put out. Andrew Hoyles( DSNY): By, the governor by the mayor by the various health departments, New, York, City, Health CDC, so on so forth. So. At this stage there are supports for composting, are actually compost in your home. If. You have access to a worm bin or if there's any backyard, space. Andrew Hoyles(, DSNY): Jeff,, even I did here, you know, with gardens,, but the even the Gardens,. The green thumb gardens are close to non garden members right, now. So, even that Andrew Hoyles( DSNY): Is, a Andrew Hoyles( DSNY): Not an option at this immediate moment and Andrew Hoyles( DSNY): I know that as a response. The,, the city wants to reevaluate one social, distancing, measures. Andrew, Hoyles( DSNY): Are take a step back then, you know,, we'll be able to re, evaluate some of the options for drop. Offs. However, part of the cuts that were part of you know the scaling back of these programs. Andrew Hoyles( DSNY): Our program partners,, the New York City compost project actually lost its funding in this, and also our education with garden when I see, which the department also funds. They, were also, unfortunately, defunded for emergency. Coded response. And, so even with the fact of Andrew Hoyles( DSNY): You know some of the people who are staffing. These drop off some of the people who were processing the material that was collected at the drop offs. You know those were the sites that were also lost as well. Andrew, Hoyles( DSNY): Mark Marguerite, I want to ask you have elements you want to add to this. I think I covered all the aspects of the real, the drastic, you know, Andrew Hoyles(, DSNY): Shift,, you know,. We had the largest program for composting in the world. In March, we've been in the margin. Now,. We actually have quite a small program,, given the reality of Covid-19 and then the response. But I want to see. If Marguerite has anything she wants to add. As far as that. Marguerite Manela- DSNY: Yeah, sure. Can, everyone hear me. Jeffrey, LeFrancois-, WPE, Co-, Chair:, Yes., Marguerite, Manela-, DSNY:, Great., Hi,, everyone., My name is Margaret Manila and I'm. The Senior Manager of Community composting and compost, distribution. Marguerite Manela- DSNY: At, the at the Department of sanitation. So. In my role as manager of Community composting I. My main role there was to oversee the NYC compost project, which introduced mentioned Marguerite Manela- DSNY: That, we will. So, we are going to, I'll, just be a little more specific about what that program is Marguerite. Manela- DSNY: It was a it is this there are, there's a skeleton crew still employed and funded by us through the end of this fiscal year, but starting on July 1, Marguerite Manela-, DSNY: We will be suspending the program for Marguerite Manela- DSNY: The suspension is intended to be temporary, with funding return to the partners,, but those. The program was made up of seven. Marguerite Manela- DSNY: Teams, based at seven different partner organizations, big reuse, Brooklyn, Botanic, Garden earth, matter., Lower, East, Side, ecology, center,, the New York Botanical, Garden, Queens, botanical garden and snow Carver, Cultural Center and Botanical Garden. Marguerite Manela-, DSNY: So I just wanted to be clear about what that means. And. As Andrew said: Marguerite Manela-, DSNY:, While the. While the compost project was no longer operating, many food scraps drop off sites. They were processing composting, a majority large quantity of the food scraps that are collected at many different drop off sites throughout the city. Marguerite Manela- DSNY: And. They were also in a technical assistance role, supporting Marguerite Manela- DSNY: A lot of what we call the community hosted. Food scrap drop off, sites. There are a handful in Manhattan for and Marguerite Manela- DSNY: So we,, you know,. We still have a small team at sanitation and will hopefully be able to continue focusing on composting in the coming year,, but Marguerite Manela- DSNY: The reality is that we, you know,. We will be the ones Marguerite Manela-, DSNY:, Supporting, Marguerite, Manela-, DSNY:, Supporting, the composters and residents that those seven partners,, along with grown YC, have been supporting to date. Marguerite Manela- DSNY: But yes,, as Andrew said,. We do have Marguerite Manela- DSNY: We do have resources at the Department of Education,, you know,. We still have the online. Marguerite, Manela-, DSNY:, tip sheets and other educational materials and we're looking into how we're going to make sure those are. Let's continue to be available and widely promoted throughout the year,. But it surely it's the class. Jeffrey LeFrancois- WPE Co- Chair: Thank you. Um,. My frustration is extreme on this matter, because it seems you know where the waterfront parks and Environment Committee, and we do not often have a lot of environmental issues that we can advocate around other than Jeffrey LeFrancois- WPE Co- Chair: Asking for things. And, so that this was the first item. The. First item: acrosss the board on the chopping block was rather alarming,, given the fact that we're still lining up at farmer's markets to buy produce, and yet at the very place we would drop off that compost. You can't do it. Anymore. Jeffrey LeFrancois-, WPE, Co-, Chair: So. Is there any potential for drop off sites. I'm, not the curve there at all, or that's completely been eliminated. Marguerite Manela-, DSNY:, Um,, well., Marguerite, Manela-, DSNY: As of now, Marguerite, Manela-, DSNY:, Much of the funding seems to be eliminated out of the draft. Budget. Marguerite Manela-, DSNY: What I, will say is that over the past two years, we expanded the we expanded the number of bootstrap drop off sites that are listed on our map. It's annotation. Marguerite, Manela-, DSNY:, Hudson, River Park trust is running some of those drop offs. And. The way we did that. We did. We did not have funding,, but we had a goal to add about 60, more sites. Marguerite Manela-, DSNY: And. We had been funding at that time in the beginning, the beginning of 2018. We started doing this 97 sites that we were funding through our partners,, the ones I just mentioned, and also grow. My see and Marguerite Manela- DSNY: So we opened up the community hosted bootstrap Java program. So. If you seen those orange those big, Orange square signs that say public bootstrap drop off site created those as part of that program for volunteer run sites to open up to the public. Marguerite Manela- DSNY: And accept food scraps drop off sites and if they were open, regularly. Marguerite Manela-, DSNY: Like six consecutive months of the year with a minimum and then once at least once a week at the same time, every week,, then we would list them on our map. Marguerite Manela- DSNY: So. There should have it in front of me, but I'm Marguerite, Manela-, DSNY: That makes those sites. It's approximately 60, Marguerite Manela-, DSNY: I, believe 60 sites. Right. Now I will double check that if you'd like. Marguerite Manela- DSNY: Those sites can test it. You know,, we were not funding them were happy.. I know that we would be happy to list them on a map. When. You know when we're out of the emergency response. Mode. And, when we make that map active again on our website. However, Marguerite Manela- DSNY: You want acknowledge that there are major concerns about those sites being very overwhelmed,, especially given this ascension of the curbside composting program and also another key factor is that Marguerite Manela- DSNY: Many of those sites. Marguerite Manela- DSNY:, were actually able to run public food scrap drop off sites because they were enrolled in curbside composting, service. And. So a lot of those sites. Marguerite, Manela-, DSNY: I, think especially men. Marguerite, Manela- DSNY: They also were not Marguerite. Manela- DSNY: They were not making their own compost,. They were. They were running the drop off site,, but then sanitation with collecting and so really realistically Marguerite Manela-, DSNY: It will be all of the sites. Opening back up. Again. Jeffrey, LeFrancois-, WPE, Co-, Chair:, Right. Any comments from the committee. Jeffrey LeFrancois-, WPE, Co-, Chair:, And I do not see anything in the public, place. Blake, Kurisu:, You know,, one thing I just wanted to mention is that,. You know,, under Alan's leadership on aces. We, came up with a survey that we surface to block associations about the Blake Kurisu: Department of sanitation, cuts, you know,, specifically looking at for data around the priorities in our neighborhood. Blake Kurisu: For, these costs and they giving us some other data points and verbatim quotes help to advocate for this. So, you know,. Maybe that might be something you know obviously I defer to Blake Kurisu: The chairs here as well as Alan, but you know might be something that we can incorporate some of that invoice. Our support for these programs that you know. Totally agree are completely on vital. Jeffrey, LeFrancois-, WPE, Co-, Chair: I certainly would entertain that and I was going to ask them to be okay with a letter formalizing. Our concerns that this composted, the citywide composting effort, was so aggressively cut, Jeffrey, LeFrancois-, WPE, Co-, Chair:, As a whole,, and perhaps we can incorporate some of what he has put together as well. And, our letter. Jeffrey LeFrancois- WPE Co- Chair: Leslie Boghosian, Murphy, MCB4: Was, going to ask you, Jeffrey, um,. This is going to be coming up in the budget. Task Force meetings, I guess,, like where the priority is and I Jeffrey LeFrancois- WPE Co-, Chair: Wonder. If that's the appropriate thing, we can just fold this into our budget. Jeffrey LeFrancois- WPE, Co- Chair: Our budget question, because that's certainly going to be coming. Up. But, we've also never sort of formally Jeffrey LeFrancois- WPE Co- Chair: This was a part of, like, the as they appropriately pointed out, a part of the emergency action around Covid-19 response. Jeffrey LeFrancois- WPE Co-, Chair: So,, you know, it's sort of like when something's there, probably stays. But. Once it gets taken. Away. You, know,, so,, um,, so I'm have the inclination,. I would like a letter on this out of the committee of people would be okay with that Marty, I think it should go. Jeffrey LeFrancois- WPE Co- Chair: To, the administration, with a CC to the Speaker and the sanitation, Commissioner. Maarten deKadt, WPE Co- Chair: So, the question is,, where did. Where does the funding come from and how much does it need? Maarten deKadt, WPE, Co- Chair: We have to be talking to people who are involved., Jeffrey, LeFrancois-, WPE, Co-, Chair:, I. Guess I just want to register an objection that there are many other things that the representation is responsible for Jeffrey LeFrancois-, WPE, Co-, Chair:, Including streets, weeping and that seems to have no problem roaring back to life and then turn back off, um, you know, I will ad hoc. Um,, so I listen, I'd, be writing the letter. So. We do not want to do it., That's fine,. We folded into our budget asks that I'd like direction accordingly: salad. Sally, Greenspan: Yeah,, so Sally, Greenspan:, So, I, sorry, Okay., Sally, Greenspan:, Okay,, I, agree with the letter writing.- I think we should do it because you're right,, once it's gone,, it's gone., Sally, Greenspan:, And I, think that we should propose some sort of a compromise. I mean I know it's expensive, and I know about Cobra and roll the budget cuts. Sally Greenspan: But. If we could just salvage a semblance of it where we have pickups at certain locations versus just wiping the whole slate. Sally Greenspan: That's meaningful,, because then it's easier to revive in person instead of just killing the whole program. Sally Greenspan: Once it's killed. So let's keep it alive, where we can as economically as we can. Until we get through this time. And, then we can restore it to where we'd like to see it restored,, but that it's not dead. That's. What I would like to see in the letter. Jeffrey LeFrancois-, WPE, Co-, Chair: That sounds good to me. Alan, something to add., Allen Oster: Yeah,, just to follow up. Allen Oster: With me,. We have Allen Oster: A survey going out. Allen, Oster: Hopefully. We can find out already to Allen Oster: Black associations and some other community groups. Allen Oster: Perhaps. If we get some quick response, we can fold in some of that information that we get from the community in terms of the letter that we send to the administration to the Speaker's office. Jeffrey LeFrancois-, WPE, Co-, Chair: I'm, fine, with that. Allen Oster: I do not know how soon. You want to get the letter out. Allen, Oster:, But I think Jeffrey LeFrancois- WPE Co-, Chair: This was to be through our normal process. Right, of, like,. Let's do this. Now. Let's bring this up at Jeffrey, LeFrancois-, WPE, Co-, Chair:, You, know and have the letter voted on it, the full board meetings. So. Maybe the survey would not incorporate, but I really liked Sally's a suggestion that I think I'd like to package into emotion. Jeffrey LeFrancois-, WPE, Co-, Chair: If. You guys would entertain it the idea of a compromise that while we recognize the need for budget cuts, acrosss the board at all agencies- and this was an aggressive first tack on a very green important initiative that has seen really great growth over the years.. Jeffrey LeFrancois- WPE Co- Chair: And that we'd like to see some of the funding restored to provide some greater access for compost, drop, off., Allen, Oster: Okay,, so we'll just throw you the information and if it's no in time for your letter, we can add on to it. Jeffrey LeFrancois- WPE Co- Chair: Okay, great. And, like just posted the survey in the chat. So. Thank you for that Blake, Sal,, you're. Okay with that emotion, is there is there? Is there a second on that. Jeffrey, LeFrancois- WPE Co- Chair: Thank you, Leslie. Um,, any objection, I would Chris Lebron( MCB4 WPE Member): Learn to Sorry. Chris Lebron( MCB4 WPE Member): Is a possibility on this letter to acknowledge Chris Lebron(, MCB4 WPE Member): Sorry,? Is there any possibility to acknowledge that we would like funding for composting be done,, but that whatever plan comes into place, keeps into mind. Chris Lebron(, MCB4, WPE, Member):, The seriousness of code right, like have a mess density at a drop off area, is incredibly Decatur. So like if he is not. Why, in the marriage, to revive this to add money in the plan also include Chris Lebron(, MCB4, WPE, Member): Opportunity to speak, like sufficiency. Jeffrey, LeFrancois-, WPE, Co-, Chair:, Sure., Jeffrey, LeFrancois-, WPE, Co-, Chair:, I'm, fine, with that. Jeffrey, LeFrancois-, WPE, Co-, Chair:, JD. Did. You have a question. JD— MCB4: I'm, opposed to this letter, I like Leslie suggestion of wrapping it into the budget. Task Force. I really think given so much. We all have to deal with,, including sanitation., JD—, MCB4:, That I. Do not think this letter will be perceived received with quite JD— MCB4: The import that we take it. So I'd, rather JD— MCB4: be incorporated into the budget task. Force., JD—, MCB4: I think that's more effective. So I'm not I'm against a letter. Jeffrey LeFrancois- WPE Co- Chair: Thank, you know, um,, any other objections, Sally. Sally Greenspan: No, I'm, not object., I'm,, I'm, fine, with, I do not care where we put it. It just has to be Leslie Boghosian Murphy, MCB4:, Yeah,, exactly., He, fine., Sally, Greenspan:, It's, okay in the budget lead,, we should put it in the most appropriate place where it's going to get the attention it deserves. Sally, Greenspan: I'm, not looking to necessarily make a separate letter,, but I just do not want to see us kill. The program. There was a time when the program was first Sally, Greenspan: Implemented before it was rolled out when we could just go to the green mark and we could just go to a few places and then Sally Greenspan: As as it became more and more popular was rolled out. So, let's go back to phase one, or as minimal as possible to keep it alive. Sally, Greenspan: Where. The letter goes, is to me secondary. If it's a suggestion to make it go in the most appropriate place where it's going to get the most attention. That's. What we should be doing. Jeffrey LeFrancois-, WPE, Co-, Chair: Well,. If the committee would indulge me as the former second vice chair of the board. I recognize that Jeffrey LeFrancois- WPE Co- Chair: Issues, like this get pretty low on our list, quite frankly, in the budget. So I would ask that we do write this letter, separately, and likewise requested to be included in our budget request. As well. Jeffrey LeFrancois- WPE Co- Chair: So I'd like to move forward on the motion. Jeffrey LeFrancois- WPE Co- Chair: I have one objection. Any other objections to the letter. Jeffrey LeFrancois-, WPE, Co-, Chair:, Any abstentions or President, not eligible Jeffrey LeFrancois-, WPE, Co-, Chair:, JD, I appreciate the grand and likewise. The objection. Jeffrey LeFrancois- WPE Co- Chair: But, the letter passes. Thank you., Well,, Jeffrey, LeFrancois-, WPE, Co-, Chair:, Our next item and thank you to the proper sanitation. I know. This, did my impression was that at us,, obviously you're spearheading a program. That's getting taken out from under your feet. Jeffrey LeFrancois- WPE Co-, Chair: A, very fast updates on Andrew Hoyles( DSNY): So. Thank you, guys. Thank you. Marissa, Yanni-, DSNY: Thank you,. Thank you, John Jeffrey LeFrancois- WPE Co-, Chair:, Thank, you., Absolutely. I'm on pier 76 you'll recall earlier this year, it became a flashpoint for the governor. That's. A report very quickly put together a task. Force, unfortunately, right as the task force was coming up with recommendations. Jeffrey LeFrancois- WPE Co- Chair: A pandemic hit. The task force has since been put on hold,, but the board myself and level have certainly been Jeffrey LeFrancois- WPE, Co-, Chair: Keeping it on the toe pound on NYPD radar, and we are continuing to expect updates from them accordingly,, given the fact that the Governor has, as part of the budget, has deadlines in place for relocating the operations of the pier as they relate to Jeffrey LeFrancois- WPE, Co-, Chair:, To, pound Jeffrey, LeFrancois-, WPE, Co-, Chair: Was, not hoping to have discussion on that. So. If everybody's okay, with that update. I'd like to move to the next item. Jeffrey LeFrancois- WPE Co- Chair: Which, is regarding another of our peers in the Hudson River Park access to pure 86, which of course is inherently hot tied to the intrepid, and we all know the museum and pier in Hell's Kitchen. Jeffrey LeFrancois-, WPE, Co- Chair: That. Here was closed as a part of,, you know, the state of being put on pause by the governor,, given the fact that we are clamoring for public space and how crowded Hudson River Park is Jeffrey. Lefrancois-, WPE, Co-, Chair: We were alarmed and upset by the fact that this year was closed. And. While we recognize that it's, in a sense, tied to the operations of the Intrepid, we were no less.. Please buy that. It's also been our long understanding, Jeffrey LeFrancois-, WPE, Co-, Chair: You, know the Jeffrey LeFrancois- WPE Co- Chair: The intrepid at least with the city, long before the Hudson River Park existed,, and they have long been renegotiating a new lease. Jeffrey LeFrancois- WPE Co- Chair: With, the park. And. So we thought it was appropriate to sort of bring this issue up this evening and I believe the President of Museum is joining us tonight and the Intrepid also submitted a letter to the committee.. Jeffrey LeFrancois- WPE Co- Chair: Which was in the Dropbox that explained their position, reasoning for closing the pier and likewise with what they're responsible for as it relates to Jeffrey LeFrancois- WPE, Co-, Chair: Here at six before I took. Any questions from the committee, I want to pass it over,, Susan., You're, on. Thank you for joining us this evening and for your patience so wanted to give you an opportunity to address our some of our concerns. Jeffrey LeFrancois- WPE Co- Chair: And, your unmute Susan Zausner: It was very profound. How I started now. Susan, Zausner: I appreciate it, and I just first and foremost hope everybody in Susan Zausner: Yours around you are all healthy and safe and I have to start out by saying,. You know, I, totally understand this conundrum. You know, I do not come at this, as you know where this big steel, ship and there's anything Susan Zausner: That. We should have over anybody else. The intrepid has been impacted in our family has been impact. Our intrepid family has been impacted, just like everybody else. Has. And as part of the executive order. Susan Zausner: We, had to close the museum. And. Along with that comes the pier,. As you probably all know, Susan Zausner: We operate the pier we maintain it. We, ensure it we staff it. We provide security, we provide bike paths, crossing Susan, Zausner: All of the all of those elements that allowed the peer to be active and open to the public and to our visitors. Susan Zausner: So. Under this executive order, though. We also had a follow allowing only essential staff and the most Susan Zausner: minimum amount possible in order to secure the premises. So,. As you may or may not have seen the parking lot acrosss, the street is locked, up. Nobody can enter., Nobody can exit. Susan Zausner: We do not have security over there.. We are using the security for both the pier and for the ship and Susan Zausner: And unlike,. Unlike other areas of the park. Unlike other peers, HRP,, it does not Hudson River Park does not provide any kind of staffing, Susan, Zausner:, For, us. And. So in order for us to protect both visitors,, whether it is just to appear or to the ship and protect our staff. Susan Zausner: We have that minimal amount and we can not maintain it. Now,. We can not do what we need to do to make sure that it's safe and secure for anybody to come on. Susan Zausner:, So that,, that's the impetus for it being closed and we are working towards reopening like everybody, else's. As, you know, I, am sure we're in Phase four of four phases. Susan Zausner: Once. The pause is unpause in our area and we're going to do everything we can to make sure that we can bring it back and open up all areas as soon as possible. Jeffrey LeFrancois- WPE, Co-, Chair: Thank you for that. Susan,. Thank you for the letter,, a couple of hands going: up. Lowell, Kern-, Chair, MCB4: Hi, thank you. Jeffrey part of my concern about this. Lowell, Kern-, Chair,, MCB4:, Is, that you know more and more. I mean, we've been trying to work with each other for a long time to make. This seem less like a private peer, Lowell, Kern-, Chair,, MCB4: But. This really hit home for me that it really is a private peer. It's open when the Intrepid says it's open., It's, closed. When, the intrepid says it's closed. Lowell Kern- Chair, MCB4: Admission is through the intrepid metal, detectors. Um,. We did finally get the exit moved, so you can go on to the pier for nothing without having exit through the gift shop,. But this really is a private peer and at this point I'm Lowell Kern-, Chair,, MCB4: You, know what bothers me about. That is not that the Intrepid has a private peer,, but the that the Intrepid does not pay rent for their private peer Lowell, Kern-, Chair,, MCB4: Um,, the other Jeffrey, I. Think you have that this slide to have the slide accessible from the working group,. The other people who do not pay rent for the pier or the community, boathouse Lowell, Kern-, Chair,, MCB4:, And I- think that's, I do not even remember. Who else was,, but it was it's people who are not making money. Doing this and I know the intrepid is a not for profit, but Lowell Kern- Chair, MCB4: You're Susan you're dealing in a lot bigger dollars than the community boathouses every other peer, even not for profits. Bob tallies group downtown Manhattan. Youth pays rent for the pier and, you know, I, understand, that. Susan, Zausner:, You, know,, Lowell, Kern-, Chair,, MCB4: Visitors have dropped off to the intrepid, and you know your revenue is not going to be what it's like, but you know: Lowell Kern-, Chair,, MCB4: Frankly, between the intrepid and the trust. I'm more concerned about the trust's finances than the intrepid finances, and I'd really like to see the intrepid, since you basically have a private, pure paying for a private peer, Susan, Zausner: Will. You allow me to address a couple of those points, because it's actually an elephant. I feel like in the room that is so long overdue to address and I appreciate your bringing all of that up and Lowell Kern- Chair, MCB4: That's up to Jeffrey LeFrancois- WPE, Co-, Chair: I'm, fine, with the response there. Susan, Zausner: I appreciate that., A, couple. Just a couple of points, and you know we have felt that has been the perception. Right. Yes. You pay$ 1, a year, there's! No doubt that in the typical sense of rent. Susan Zausner: That is what transpires between us in Hudson, River, Park, trust. But, unlike other peers. I, do not think what Susan Zausner: What is recognized is that we pay over$ 400,000 a year out of our operational budget, and that is strictly for maintenance of the up land. Susan Zausner: For security,, not to mention a million dollars of insurance that we have to pay ourselves, that we do pay the bike path, folks that we do pay for the utilities. Susan Zausner: And. All of that comes out of our own pocket. And. So that's about a million dollars a year to maintain what is that hundred thousand square foot. Susan Zausner: pier. So? It is all it's all on us. Part of that whole deal of building appear for the for the morning of the Intrepid was that we would operate, maintain and pay for those costs going forward., And I know. You know that there is a new Susan Zausner: Lease you'll shortly be seeing there are additional expenses were paying for. We're going to be paying for what it's going to be marine Susan Zausner: Repairs now of the pier and we're going to be paying for a part of the Hudson River park that we do not even have any rights to for repairs to that and maintenance, and so that is I. Do not,. I do not think that's been Susan, Zausner:, Known or recognized, and I just want, I guess, to be able to say that in lieu of friend, it is an expense that Hudson River Park does not have to pay Susan Zausner: And, so they may not receive direct dollars for it,, but instead they're not paying for it, and we are up keeping this peer in its own right. Lowell Kern- Chair, MCB4: Jeffrey, Mann., Lowell, Kern-, Chair,, MCB4:, Sure,, um,, Whoa., Lowell, Kern-, Chair,, MCB4:, JD Jeffrey recognized me to get Jeffrey LeFrancois- WPE Co- Chair:, On, it., Lowell, Kern-, Chair,, MCB4:, You, know,, part of it, Susan. I understand what you're saying, but take, for example, pure 57, which are XR, has a master lease for they are responsible for the entire upkeep of the pier. Now, I'm, not saying the Intrepid should pay. What R XR is paying in rent. Lowell Kern-, Chair,, MCB4: For, the pier., But I, think there's probably somewhere between$ 1 and whatever it is R XR pays or Chelsea piers pays where they're responsible for those peers that would be, you know, would help the trust's finances. Immensely. Susan Zausner: Low, but we are, we're not for profit,. They are a multi billion dollar companies, I mean not Chelsea piers, but Chelsea piers is a for profit. Company., Susan, Zausner: We are, and you can look on all of our all of our financials of$ 35 million company now. We're, also a zero base,, not for profit. Susan Zausner: So, any monies that we make, over and above the red. Over and above the expenses that we have goes right back into serving the community. Susan, Zausner:, With, programming and just I want to paint a picture. But. We had over a million visitors. Last year. We just cleared a million visitors. Last year, 10 years in a row. Susan Zausner: And, we had 150,000 140 6000, to be exact visitors who came on the pier for free. Susan Zausner: And. Now we also,, we also have to, and I know. The magazine has been a big challenge and a big issue. But I just want to quote something because I wanted to bring this up. If I had the chance, and that is Susan Zausner: The New, York City Police Department did a security and vulnerability assessment of our peer of our of our property in 2016, Susan, Zausner:, And, I quote an active shooter, hostile takeover or detonation of an improvised explosive device at the museum would cause heavy casualties and collateral. Damage. Susan, Zausner:, Because of the museum's location and number of visitors on any single day, the perceived affiliation with the military and indirect relationship with veteran communities and other at risk. Groups. Susan Zausner: further increases the risk of a hate crime incident or an act of terror,. The volume and density of visitors, combined with the physical constraints of the facility, also adds to the risk Susan Zausner:. That is why we want everybody to go through the mags, and we work together, you and I, and Dan when we walked to the pier and we walked to the Welcome Center. Susan Zausner: To try to make it as seamless. We said that whatever is the shortest possible line that is out. There is where people who want to go for free can enter. The signage is there. Susan, Zausner:, Will move. We move the signage according to what is the shortest line and they get a ticket that says free access, because that is also for insurance purposes, and it gives the disclaimer that they're going on to the pier. Susan Zausner: And so,. So everything is done with a purpose of safety and caution,, but that we spend a huge amount of our budget,, a large portion of our budget, maintaining and operating back here, and we also Susan Zausner: I mean it. You know,. We have also spent so much time fundraising to build that year. So. We spent we raised$ 60 million in 2006 to eight. We spent 10 million of our own money to redo that peer Susan, Zausner: We've raised$, 8 million to build a cogent plants so that we can take down that growth structure of a heating and cooling tower on our, on our Susan Zausner: Peer we already implemented that. And. Now we've raised 4.6 million to take down that cooling, tower. So. We can open up 4000 square feet more of parkland Susan Zausner: Which is under that and rebuild. What is still would not piles under that and make it the concrete. The concrete piles and more open space. So Susan Zausner: So we're raising money. That's designated strictly restricted monies for the capital projects to open up space., Susan Zausner: We're, trying to protect the visitors, both those who want to come on to the intrepid and just onto the pier. We offer free amenities on the pier Wi Fi. Susan Zausner: We have a cafe. We have all we have free exhibit on the pier. So we're doing rethink, and this is said with humility. We think we're doing everything we possibly can to try to engage Susan Zausner: And bring in the community. On top of the fact that we have in the community that we offer free programs out to the public. And, we asked the public. Come on. Susan, Zausner:, You know, to us free Fridays, astronomy, nights, movie nights, festivals., Come on, and have a plethora of activity and content for free. Susan Zausner: So,. So this is killing us at the pier is closed. Today. I mean we all want to go back there and I understand. If the summer is coming along and rolling along and we need open, space., I, mean,, Susan, Zausner: We're, going to have to try to figure something out for everyone's mental health. We get that. But I just I hope, there's a better understanding. Susan Zausner: Of the significance of the dollars. We spend to make the pure better to keep the pure safe to open it up and to protect all of the people that are coming. Our way. I'm Jeffrey LeFrancois- WPE Co- Chair: Thank you,, Susan., JD, Jeffrey, LeFrancois-, WPE, Co-, Chair: You're on mute. Lowell, Kern-, Chair,, MCB4:, Sorry., JD—, MCB4:, I, understand your concerns. JD— MCB4: I'm, sure we all do. But I, have to ask JD— MCB4: Since the intrepid came. In. It has been a dispute with the Intrepid and the community about the public access. It's gotten a lot better. JD— MCB4: Now,, but you still have to go through to get onto the pier. I. Go there now and then to see how it works and it works. Well., JD—, MCB4:, You've made improvement, but I do not understand. This. This is a public peer. The side is a public peer, JD— MCB4: And. Are you saying you can not. It's? How can you close a public peer, JD—, MCB4: It's? Not your peer., So I'm. Just helped me out. Here. Susan, Zausner:, It's. It is the way that our agreement is with the Hudson River park that we have to maintain it,. We have to ensure it. We have to do all of that. And during this JD— MCB4: I'm, asking who JD— MCB4:, Who CLOSE THE PUBLIC peer JD—, MCB4: We're under the guy side. JD— MCB4: Just, talking about the north side. It's, a public peer who closed it, Susan Zausner: Where. We under the guidelines of the executive order, consistent with closing the intrepid, had to close the pier. Susan Zausner: Because. We can only allow Susan, Zausner: As. Excuse me, wait one second, as a byproduct as a byproduct of who we are allowed to have as a central workers. There. Susan Zausner: We can not protect the public and we would be liable if you tripped and fell Susan Zausner: Because it had not been swept and there had been gravel or there was a puddle, and in this crazy weather there was ice under that puddle. You'd be suing us for that, and we have nobody there to take care of that ice for that moment., JD—, MCB4:, Okay, that's,! That's not my issue. I understand where you're saying, I would suggest to Jeffrey and Marty that we raised the concern that a public peer has been closed.. Jd— MCB4: Because, the Intrepid apparently says they can not have maintenance to open up. I do not know any other peer publicly in the Hudson River park. That has been closed without rationale: Susan Zausner:, I do not know if there is a and I do not know this at all., So I claim ignorance,. If there's another entity. Susan Zausner: That relies on their day to day operational business revenues. So. While we have fundraise to do all the capital improvements, we rely on our operational revenue to pay for that and we are at zero right now. Zero JD— MCB4: And Susan, I understand,, but it was part of the original agreement with the community. That would be an accessible. Here. You have to maintain it, whether or not JD— MCB4: It's open or closed so I just am asking Jeffrey and Marty that we examine this. A little further. It's been a I understand, Susan's, a lot of pressure and a lot of concerns. I understand that at the same time, I think the board should JD— MCB4: Insist. That is public peer, not be closed. JD— MCB4: Out of concern that suddenly they can't maintain it as they did. Before. Susan Zausner: Not maintain not protected.. We can't protect people on there right, now. And. As soon as we can start bringing our team back. That is when it can be opened up again with the appropriate protocols. Jeffrey LeFrancois- WPE Co- Chair: I understand. Susan, for that JD, and thank you, Susan, a lot for walking us through that and giving a painting. Jeffrey LeFrancois- WPE Co- Chair: Quite frankly, a very full picture to, to your point that had not been aired in a long time. One of the things that is I think distinct about the situation. Jeffrey LeFrancois- WPE, Co-, Chair: Is. The fact that the intrepid could not exist without the pier and our Hudson River Park could not exist without its peers. Jeffrey LeFrancois- WPE Co- Chair: And, the Hudson River park it whether it's the way that it was created or not needs revenue to exist, and we have long been advocates of our park and it always seems to come acrosss as us,. You know, Jeffrey LeFrancois-, WPE, Co-, Chair:, disliking the intrepid I actually do not think that's the sentiment that the committee has ever wanted to express. Jeffrey, LeFrancois-, WPE, Co-, Chair:, It's, unfortunate., The way that this tends to play itself out because we recognize, you know,. We've had presentation with you guys in the past, around your cost of school programming,, the number of folks in the district that memberships. And we totally Jeffrey LeFrancois- WPE Co-, Chair: Recognize, the arts and cultural value of the institution. Jeffrey LeFrancois- WPE Co- Chair: Not, just in New York City. But, as the country as a whole. Our focus has always been about public access to the pier and so Jeffrey LeFrancois- WPE, Co-, Chair:, JD, I. Think memorializing. Your point is important.. And I also think just recognizing that, as the Intrepid is continuing conversations and looking at least with the Hudson River Park. We can air what we think might be an appropriate thing to consider. Jeffrey LeFrancois-, WPE, Co-, Chair: In, the confines of Elise around access. So Chris, I saw your hand just go up,, but I think I want to steer clear of any. You know Jeffrey LeFrancois-, WPE, Co-, Chair:, Dislike., I'm, not sure the right word. I'll find it when we're writing the letter,, but to really clarify on this, what are,, what our trustees, here. Jeffrey LeFrancois- WPE, Co-, Chair:, Chris, Lebron(, MCB4, WPE, Member):, To, piggyback on Jeff JD, and on Chris Lebron( MCB4, WPE, Member):, Most importantly,. We understand what the intrepid means, what it means, as a living memorial to the British iteration or victory over fascism. Right. Now we're in an incredible space.. I took Chris Lebron( MCB4 WPE Member): A bite for the first time today. After like two months. Chris Lebron( MCB4 WPE Member): With Chris Lebron(, MCB4, WPE, Member):, 11 Memorial, this open door. There is a public space. I understand wanting to protect one of our nation's like Chris Lebron(, MCB4, WPE, Member):, Identifying, markers of greatness. But. At the same time,. We really need Park, space., And I've always said we can leave our space and whether or not it's been northern portion that fear or the Chinese appear. Chris Lebron( MCB4, WPE, Member): I think our resident here in Hell's Kitchen from overcrowding and potentially starting as a way of Chris Lebron( MCB4 WPE Member): Infections is a priority, just,. You know, for this community for the for the city. So. It would be nice to have here at for open,, especially as we get greener and lower days while we're locked out- and it does not seem like a lot of Chris Lebron( MCB4, WPE, Member):, Times,, too., So, you're, right. I think we should memorialize something a letter or make effort to ensure that their next release does not make them feel as if they're the onus is on me cases emerging like this. Ever again. Chris Lebron(, MCB4, WPE, Member): To shut down something that we desperately, ai. Not we know we need to see it on your social media,, but even calling for open streets,. We need more open, spaces., Jeffrey, LeFrancois-, WPE, Co- Chair: Yes, thank you., Brad Pascarella-, CB4:, Yes,, I, believe, Nora is still here., She can comment, and then we have the electives on the line. So Brad Pascarella- CB4: Wonder. What their thoughts are: Noreen Doyle,, HRPT:, Hey., Hi., Yeah, I am still here.. I'm sorry. You, see me. Hi. Noreen Doyle, HRPT: I am still here.. Um, Noreen, Doyle,, HRPT:, You know, I think that the fact Noreen Doyle, HRPT: That Hudson River Park, is responsible for ensuring or doing the best we can to think about people. Safety does matter. You know,. This point. Susan is making about Noreen Doyle, HRPT: How. Do you lead people onto the pier when there is no staff to facilitate that there? You know it's a different periods,, not a landscaped Park pier., Noreen, Doyle,, HRPT: It's appear that was landscaped. You know, basically for lots of people to come on to it. Noreen Doyle, HRPT: Principal a for the purpose of the museum,, but also for views and other things like that. So. I do think that is a not that needs to be solved,. No matter. What., And I, think that is a valid concern for Susan and the park to suggest needs to be considered.. Noreen Doyle, HRPT: Everything exists within the context of a history. I mean, I've, been to many meetings. Susan has to Noreen Doyle, HRPT: You know where I know. We know that community board for has Noreen Doyle, HRPT: before my time before, Noreen Doyle,, HRPT: Time. You know the when the internet came to the to the community. Noreen Doyle, HRPT: The, promises that were made about public access were inherited,, at least by the trust. Noreen Doyle, HRPT: And. We want as much public access as we can have that is our goal. I mean, before everything else we're a park,. We want that to happen. Noreen Doyle,, HRPT:, The circumstances of the closure and everything else like that are not easy and like interpreting what is essential. You know, I, mean,, JD,, I totally,, totally hear your question really: do. Noreen, Doyle,, HRPT: But I also think that the physical configuration of the intrepid and everything else like that is not Noreen. Doyle, HRPT: The same as, like,. If we had closed. I do not know period before right. I mean they're, they're the expectations when you get on to appear that has lots of stair towers and other things like that were designed to be able to get people on to the intrepid are different and JD— MCB4: From our Noreen Doyle, HRPT: Perspective running security,. We would have to look at things like that,. Where do people hide where you know sightlines all those things we talked about for peer 97, Noreen, Doyle,, HRPT:, So I am not the business person at all.. Susan can vouch for me on that on anything to do with the renegotiations for the intrepid, please Noreen Doyle, HRPT: I do now,, having worked once for Community Board for a long time ago before the park that this is a long standing, issue. How. Do we get public access to the park, so Noreen, Doyle,, HRPT: My. Only comment at the moment is that I understand kind of what you're all saying you know it is people want and need more open space right, now., Noreen, Doyle, HRPT: The park is under enormous pressure. For that you all know the crowding problems that were the poster child of excess crowding for the for, you know, in the cove area. Noreen Doyle, HRPT: And, you know, I,. We can talk with interrupted, for sure. To, see what's involved in this. Noreen Doyle, HRPT: But I do not have an answer for you, Brad, or anyone else here, right, now, other than to say that I think you know we're Noreen Doyle,, HRPT:, We're hearing both perspectives, discussed, I, can say: Jeffrey LeFrancois-, WPE, Co-, Chair: Thank you for that boring. Jeffrey, LeFrancois-, WPE, Co-, Chair:, Low, Lowell, Kern-, Chair,, MCB4: I get all Lowell Kern- Chair, MCB4: The issues about access. I, understand that,, you know,, Homeland Security says the intrepid is a potential target and that you need certain security there I'm at the point now where Lowell Kern- Chair, MCB4: You know, we've done everything we can see, Susan. I know: we've worked with you before I think we've done everything we can. Lowell Kern-, Chair, MCB4: To make this as public as we can, it to me.. It comes back down to the money if there are other not for profits, paying rent for their use of the parts of parts of the park. Lowell Kern- Chair,, MCB4: And,, you know,. Let's just talk about the not for profits: Manhattan, youth., The, boathouse, they're, all paying some kind of rent. I, do not understand why the Intrepid is Jeffrey. Lefrancois-, WPE, Co-, Chair: A desire is your, did your hand intentionally go back. Up., JD—, MCB4: Very,. Very briefly, just her address no rain. All I'm suggesting is that the board, get involved in these discussions about that peer that it JD— MCB4: does not become a set completely where we have not really discussed the access to the public. Peer. This is a long standing. Issue. I appreciate what citizens going through. I think we all do., But I, think we need to be involved., Jeffrey and Marty in the discussions about how to resolve this. Noreen Doyle,, HRPT:, Thanks,, Judy., Jeffrey, LeFrancois-, WPE, Co-, Chair: Thank, you all for this. Any other comments from the committee, Alan. Allen Oster: Thank, you ever Allen Oster: So. The two issues is access which is security. And. Then there's the money, situation. Allen, Oster: Maybe, would help. Allen Oster: To understand what Susan was pointing out in terms of what they pay out and what other sections of the park do not pay out. If it is not a burden on the trust, they can do an analysis for us. Allen Oster: What people are paying and what they're not paying for. Instead of someone saying, well,, we pay this. We pay this. They, do not pay to freaky get. Maybe a spreadsheet,, maybe something simple, just to point out what Allen Oster: Other sections of the pocket paying in rent and getting back from the trust in terms of Allen, Oster:, Maintenance or whatever, and see how that compares to the traffic there. And. Then this way you can see where money is not going or should be going or is not going in,. You know, highlight what the real numbers are. The security issues, I think is very important., Allen, Oster:, And I think it's something that may be untold things: straight. Now, maybe folks have to loop without having access for a while,. We all have to make sacrifices. Again, that's,. That's something! The trust has to work out., I, think with the intrepid in terms of Allen Oster: Getting access for the public. I mean, they have to be. The Trust has to be sure that Allen Oster: They're securing the public and the Intrepid has to, you know, before right in saying in terms of what they can do, what they can't do. Allen Oster: So we've got two issues: here. But, I think the money thing we maybe, I get it. Is that a burden in this in this time for somebody in accounting to come up with something. So we can see how it lays down on paper in terms of who's, paying what night., Thank you. Jeffrey LeFrancois- WPE Co- Chair: Nora. And. Is there anything Jeffrey, LeFrancois-, WPE, Co-, Chair: On that Noreen Doyle, HRPT: Um,? We have the ranch information relatively readily accessible, but, as Susan said, there are other you know, who's responsible for maintaining appears who's responsible for other aspects of security or whatever that vary from place to place. That is not quite as readily accessible, so Noreen, Doyle,, HRPT: I, will say: that, yeah, that,. That information will all be public.. It, probably will take us a bit of time to assemble the full picture instead of just yeah the ranch part of it. Jeffrey LeFrancois- WPE Co- Chair:, Okay., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Um I, we're not seeing any comments or questions from the public. Um. Any. Other questions from the committee or comments from the committee. Jeffrey LeFrancois-, WPE, Co-, Chair: So. Some of this seems to like it needs to be memorialized. Certainly JD had Jeffrey LeFrancois- WPE Co- Chair: A, suggestion around that I am interested in hearing what you'd like to have be a part of a motion. Jeffrey LeFrancois- WPE Co- Chair: JD— MCB4: I'm sorry,, asking me, Jennifer. Jeffrey LeFrancois- WPE Co-, Chair:, Yes. Do. You have something JD—, MCB4:, Yes,, I, would. I suggest we write a letter to the Hudson River Park and Susan to JD— MCB4:, express our JD— MCB4: Appreciation of the intrepid and Susan's theory of the intrepid, and that we are concerned about the closing of the public part of the pier and we'd like to sit down and talk about it and discuss JD— MCB4: How to reopen it without JD— MCB4: Harm to the intrepid JD— MCB4: Something, like that,, mainly a discussion and also perhaps involving the Hudson River, Park least I. Think Lol is concerned about that as well. But I'm just suggesting we thank the Intrepid. We say how much we appreciate them, but we'd like to talk about the public peer Jeffrey, LeFrancois-, WPE, Co-, Chair:, Okay., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Like, I, see you nodding. Anybody else on that. Jeffrey, LeFrancois-, WPE, Co-, Chair:, In, that regarding that as a whole,, we are interested in not just the short term reopening of the pier but figuring out. Jeffrey LeFrancois- WPE Co- Chair: Ways to both make it I think both Doreen and Susan's point a safer peer generally, not just the hard scape than it is today. Jeffrey LeFrancois-, WPE, Co-, Chair: And, how that can be incorporated in any consideration given and then negotiations ongoing, Jeffrey, LeFrancois-, WPE, Co-, Chair: At, the intrepid and the trust. JD— MCB4: Jeffrey, and we are. We are cognizant. Where of the difficulties the Intrepid is facing, providing security. We were aware of that. Jeffrey, LeFrancois-, WPE, Co-, Chair:, Okay. Anything else on that, folks. Is there, a second on the motion. Jeffrey LeFrancois- WPE, Co-, Chair:, Thank, you,, Chris. Um,, any objections., Jeffrey, LeFrancois-, WPE, Co-, Chair:, abstention, abstentions or present not eligible Jeffrey LeFrancois-, WPE, Co-, Chair: Okay emotion carries Susan,. Thank you for duking it out this evening and staying with us until 930.. We really appreciate it. And I think like you. We, just as much want phase for to happen just as quickly as phase one can so best of luck and thank you very much., Susan Zausner: Thank you. Goodnight, everyone, Jeffrey LeFrancois-, WPE, Co-, Chair:, Take, care,, um,, Jeffrey, LeFrancois-, WPE, Co-, Chair: final moment of the item on the agenda. There. Did, the Allen did ask to bring up a point of old business. That I think we all hope is short. Jeffrey, LeFrancois-, WPE, Co-, Chair: With regards to the budget,. The mayor has already made considerable cuts to this year's we're operating under the current fiscal year. Jeffrey LeFrancois- WPE, Co- Chair: Which ends at the end of June,. We have a new budget,, the beginning of July, those discussions,. The budget hearings are actually ongoing. Right, now., Jeffrey, LeFrancois-, WPE, Co-, Chair: I. Think it's important for the committee to think. Through a number of things. I know, we raised the compost, thing. Jeffrey LeFrancois- WPE Co- Chair: But. There have been multiple articles around in the New York Times,, the journey. The journey. The Wall, Street Journal,, as well as others around the devastating cuts that the Parks Department is going to be facing just in the time of what we will most desperately be needing Jeffrey LeFrancois-, WPE, Co-, Chair:, Our, parks., We all know what that means,, whether it's a reduction in pruning of weeding of,, you know, security,, all that kind of stuff. So. Besides those two items and recognize it. I, know. I do not know if we want to prioritize what type of parks asked, we want to do based on our other asks: Jeffrey LeFrancois-, WPE, Co-, Chair: But. Is there anything else that Jeffrey LeFrancois- WPE Co- Chair: The committee would like in our sort of more urgent budget, items. Jeffrey LeFrancois-, WPE, Co-, Chair: And I, see what raised your hand. I'm sorry about that., 1212****414:, Do I have mine up to Jeffrey LeFrancois- WPE Co- Chair: Your hand is up.. Yes. Comments. 1212****414: I just wanted to say, I hit the wrong button last time and you did not get to vote, but I'm voting for both of them. Okay. Thank you., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Any, other Jeffrey LeFrancois-, WPE, Co-, Chair:, You know,. We always ask for our comfort stations and we asked for, you know,. We put Hell's Kitchen Park back on the map in terms of a renovation. We. I'm, trying to think, off the top of my head. I've, been taking through all that Jeffrey LeFrancois-, WPE, Co-, Chair: I, think the Parks Department's budget is about., I, think I read 590 million and there's already an$ 84 million cut on the table,, which is massive.. 1212****414: Everybody's got that. Now, you know, I mean,, it's 1212****414:, All Jeffrey, LeFrancois-, WPE, Co-, Chair: But. What is our Jeffrey LeFrancois- WPE Co- Chair: Is our priority Park safety., Jeffrey LeFrancois- WPE Co- Chair: And security? Is it general Park maintenance, you know,, Jeffrey LeFrancois-, WPE, Co-, Chair: tree limb, pruning garden, maintenance, sports, fields., Jeffrey, LeFrancois-, WPE, Co-, Chair: I, welcome thoughts on that. Otherwise,. We will Jeffrey LeFrancois-, WPE, Co-, Chair:, I! Think repackage what we've done in the past,, based on the priorities that we've done in the past. Jeffrey LeFrancois- WPE, Co-, Chair:, And,, and,, sort of, you know, keep those as they are. Chris Lebron(, MCB4, WPE, Member): Yeah, sounds good. Jeffrey, LeFrancois-, WPE, Co-, Chair:, Any I do not see any other hands. Jeffrey LeFrancois- WPE Co-, Chair:, Yes., Chris, Lebron(, MCB4, WPE, Member): Briefly,. What Jeffrey LeFrancois- WPE Co- Chair: I'm having a hard Jeffrey, LeFrancois- WPE, Co-, Chair: time, hearing you. You're Jeffrey LeFrancois- WPE, Co-, Chair: Very, far away. Even, though I'm in meat packing and you're in Hell's, Kitchen., Jeffrey, LeFrancois-, WPE, Co-, Chair: I'm, still not getting that throw in the chat. Box. Chris, Lebron(, MCB4, WPE, Member): I will Jeffrey LeFrancois- WPE Co- Chair: Thank you. I heard you'll, throw it in the chat, box. Um,. So with that everybody will I, guess repackage and you know just highlight our long held priorities. Jeffrey, LeFrancois-, WPE, Co-, Chair: Around, our parks and environmental asks in the budget and the budget. Task Force I'm Jeffrey LeFrancois-, WPE, Co-, Chair:, Alan, Jeffrey, LeFrancois-, WPE, Co-, Chair: I, said you at all business. Allen, Oster: Good. Thank you. Coach, here. I'll make this brief,, but I did want to say. I had not been to the park in quite a while, since this whole Allen Oster: Crisis. I was there for that big weekend in May,, which everybody heard about. And I just wanted to give a shout out to the Allen Oster: Before I started, I want to give a shout out to the staff of Hudson River park for the condition that the park is in. It is an absolutely beautiful, shape. Allen Oster: Or, given the circumstances that they're working on the now with the limited schedule and everything else. The guys are doing a wonderful,, wonderful, job. And. If we can write a letter., Allen Oster: thanking them. I, think we should. But. If not, I'm, sure, Noreen can pass it along. But there was one thing I had missed when I was out there on that beautiful day, it was the sound of the helicopters. Allen Oster: So. By think, we do not want to take our eye off the ball on this. Yes,, Mr., Kern, Allen, Oster: The last time I was there was about a Allen Oster: month and a half ago, so Lowell Kern- Chair, MCB4: So right, Alan. You are so right.. I have not heard Allen Oster: The head, it was limited. Allen Oster: Activity, there. But there was still chop, is on the ground idling for considerable amount of time. They were still coming in very close to the to the walkway at the southern end. I think there are still safety and security issues. Allen Oster: Due to some prodding earlier. This year,, the Allen Oster: A company, did start to implement some safety features, where they would have somebody watching the cars coming in over the walkways and the bicycle paths. Allen Oster: We did a letter back in November, about our concerns.. We have not heard anything back on that yet. Maybe. We should follow up. Allen, Oster: But, perhaps going forward. Since things are going to start getting busier, hopefully in a positive, way., I'm sure a blade will start activating again with their helicopter runs,. Perhaps we can have Allen Oster: With the park in terms of what the protocol is going to be to safeguard people on the walkway of the bicycle paths and securing security, some of the issues in that site. So I won't take up any more your time, but I. Think, let's not forget about those birds. Allen Oster:, Thank, you., Allen, Oster: And, please nori until the guys that are doing a wonderful job., Noreen, Doyle,, HRPT: Thank, you very much. I mean, I will say that we, I have been in the park a few times. I'm going in. Noreen, Doyle,, HRPT:, Once or,, you know, once or twice every two weeks, and the park does look great. And. Thank you for noticing. Our,. Our horde staff is so proud of it there so protective of it still Noreen Doyle, HRPT: When. They could not come back when we were on our most skeletal staff,. They were like itching to come back. Every single one of them is worried about their particular area and the weeds growing and everything growing and they really want to be there.. We do have more people, Noreen, Doyle, HRPT:, Field staff, starting to come back now, and we appreciate you noticing. Thank, you., Allen, Oster:, Thank, you. I'll, be the voluntary soon. Noreen Doyle, HRPT: Safely though. Noreen Doyle, HRPT: We got to make sure it's safe. Jeffrey LeFrancois- WPE, Co-, Chair:, Thank, you., Jeffrey, LeFrancois-, WPE, Co-, Chair: Um,. Thank you for that. Level. Jeffrey LeFrancois- WPE Co- Chair: And, Alan., Sorry,, I'm, Lowell, Kern-, Chair,, MCB4:, Alan, Lol, Jeffrey, LeFrancois-, WPE, Co-, Chair:, Lot of l's I'm Jeffrey, LeFrancois-, WPE, Co-, Chair: Chris,, the point on, do it. That was just returned. Last year, I can tell you, it looks beautiful. And, I'm, really happy. Even, though I complained about it being done over Memorial Day weekend., Jeffrey, LeFrancois-, WPE Co- Chair: Last year. That lawn is in stellar condition and it's been a pretty remarkable to watch that part transition from an active play field to a picnic., Jeffrey LeFrancois-, WPE, Co-, Chair:, And and sort of very passive massive field,. Given the ban on active sports, um, with regards to cruise ship measures. I do not know that other committees per view is to say, Tell. Should not be soliciting Jeffrey, LeFrancois-, WPE, Co-, Chair: Sales for tickets, right, now., Um,, Jeffrey, LeFrancois-, WPE, Co-, Chair: Does. Anybody feel that is in the purview of the committee,. You know,, we had talked to Martin I, had conversations, etc. Around shore power and specifics to cruise ships. But obviously,. That was Marty,. I think it was three and a half, three, four months ago or 25 years ago, is what it feels. Like. 1212****414: Do, not listen.. It was 20 years ago that I did start it that Jeffrey LeFrancois- WPE Co- Chair: Fair, when totally fair on that point, um,, 1212****414:, So, Chris,, I, definitely Recognize Jeffrey, LeFrancois-, WPE, Co-, Chair:, The, concern., Jeffrey, LeFrancois-, WPE, Co-, Chair: I think it speaks to the lack of education around the issue,, not necessarily the cruise ships desire. Jeffrey LeFrancois- WPE Co- Chair: To to Jeffrey LeFrancois- WPE Co-, Chair: You know, make money. Chris Lebron( MCB4 WPE Member): With that it was more about the state of health and safety measures, they're taking when they eat grass and Ingress on the ship. Jeffrey LeFrancois- WPE Co-, Chair: Yes, it just Yeah., Jeffrey, LeFrancois-, WPE, Co- Chair: I do not know that it's Jermaine Jeffrey LeFrancois- WPE Co-, Chair:, If people,. The majority feel strongly Jeffrey LeFrancois- WPE Co- Chair: Obviously,, it's a committee,. We can do that. Um,, but Jeffrey LeFrancois-, WPE, Co-, Chair:, It's,, it's,, I. Guess we could write a letter on that the,. You know, airlines, I, guess,, too., Jeffrey, LeFrancois-, WPE, Co-, Chair: So, it's Jeffrey, LeFrancois-, WPE, Co-, Chair:, It, sucks,, quite frankly, Well,. It does. 1212****414:, I, mean,. First of all, we're the Environmental Committee. What we ought to be doing is commanding everyone for the less pollution we have so much less than we had before. They see how all of this happened. 1212****414: I mean,. We had much, much more. And,, and now we have incredibly less. If you've looked at the maps of the pollution, it's,, it's amazing. Jeffrey LeFrancois- WPE Co- Chair: Absolutely. Leslie Boghosian Murphy MCB4: He was not going to bring this up. I'll just started out there cuz it's going to it's going to come up in a few months. Anyway, I've been talking with Brad's office and then some members of some local block associations about getting the cruise ship. I'm getting into the electric power. Jeffrey LeFrancois- WPE Co- Chair: To plug in,. Do not let that that's what I was referring to with regards to show to Leslie Boghosian Murphy MCB4: Our, right., Yeah,, exactly., So, Jeffrey, LeFrancois-, WPE, Co-, Chair:, Party, and I had a GM Leslie, Boghosian Murphy, MCB4:, Go, ahead., Sorry., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Marty and I. Had a conversation. I think it was back in December, January that the Sunday Times to the big Expo say yeah at the terminal. Jeffrey LeFrancois- WPE Co- Chair: When brought it to the committee's attention. Many of us for on it. I'm, Marty and I had a discussion with etc around it and the specifics of developing a short power plan at the Manhattan cruise terminal, um, of course,. This was all pre pandemic., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Yep., And I think that it would be appropriate to bring this up in and in the next month. Um agenda. As a formal item. And, we can ask,, etc. To come forth. Accordingly. Leslie, Boghosian, Murphy, MCB4:, Well, I'll email, you separately, because there has been some behind the scenes: movement on that. Jeffrey, LeFrancois-, WPE, Co- Chair: As far as Jeffrey LeFrancois- WPE Co-, Chair: Legislation on the topic as Leslie Boghosian Murphy MCB4: Well, so. Okay,, awesome., Leslie, Boghosian, Murphy, MCB4:, Great,, thanks., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Okay,, Alan, I, see you grinning. So I'm, going to take that as a motion to close out this meeting. I want to thank everybody for their patience. For their diligence for their willingness to look us all like Hollywood Squares and try to find the camera at the same time. Jeffrey LeFrancois- WPE, Co-, Chair:, So,, Jeffrey, LeFrancois-, WPE, Co-, Chair: Let me, the gorilla. Jeffrey LeFrancois- WPE Co- Chair: And, the gorilla. Jeffrey LeFrancois-, WPE, Co-, Chair: With that everybody as they say. Thank you and good night. Leslie Boghosian Murphy MCB4: Good, night., Bye, guys., Jeffrey, LeFrancois-, WPE, Co-, Chair:, Thank, you., Take, care., Thank, you., Leslie, Boghosian, Murphy, MCB4:, Everybody., Thank, you.,.",
            "summary": "I still have a few things that I'm, like so got to work through Noreen Doyle,, HRPT: We were very stressed when we did our first board.\nRashid can talk about the historic vessel side of it and to Noreen Doyle, HRPT, Me and David Sharpe I'm, so pleased to be back here received before to give an update on our peer 97 project.\nWe feel that the historic ship location is much better located, kind of on the South East corner of the plan which people will be looking at when I say: this, Kevin, Quinn,, HRPT, Your side of it is the architectural and design side.\nAnd people were sort of like even Jeffrey LeFrancois- WPE This is Evan William from Hudson River, Park.\nHow, many people right your full board meeting last week or the Noreen Doyle, The public session had Noreen Doyle, HRPT: 26 speakers.\nJeffrey LeFrancois, WPE, Co, Chair: Everybody, besides the speaker or presenter, should and will stay muted throughout the meeting, members of the public who have joined through the online link will be asked..\nEverybody will move to the first item on our agenda with a presentation from the Hudson River Park trust regarding the progress of peer 97, Kevin, Quinn,, HRPT, Okay, pleased to be back here with see before to give an update on our pure 97 project.\nSince then, we've been to the public design Commission received it positively,, but to give us some minor comments that I think made the project, a little better.\nJust wanted to point out that the actual project boundary includes the frontage is in front of pure 98 and 99 here, 98, being Con Edison and pure 99 being DS, and why the Department of sanitation and we're doing improvements, alone, Going from east to West,, which means on this picture going from right to left.\nIf you're walking, you know down south work from here 98 and you Ian, Hampson!, A, splash pad and water feature for children, young children, toddlers and older children.\nThis- is what we presented last time as being that the choice that we offer the public, Ian Hampson!, melk, You can decide to go directly west, towards the end of the pier or go right and find yourself in a more immersive botanical zone that shady lots of visual interest places to sit and read, and quiet.\nThen what you have is either a sunlight choose from to lay in through relaxin or you could sit and read and Sunday, you know, via Ian Hampson!, Melk, lounge chairs, that we have designed along the, the northern edge there, a suitable for tandem, seating Then.\n11 foot overlook down to the lower portion of the park inside this wooded zone and You're able to, you know, come back up to the top of the stairs here.\nOne important thing: I wanted the community board to be aware of is that we analyze every square foot of this building to make sure that it was really needed.\nMoving from the cafe bathroom plumbing Broomfield, office, maintenance, shop and service yard that there's a change in heights here, so David, Jaubert, The function of the building is reflected in the way that it's organized,, which allows it to have a very individual quality and the facade of the building will be David Jaubert, wrapped with aluminum panels, which have a very macro reflective, quality., David, Jaubert: That provides some capacity and some transparency and these movers will be surface with a very interesting color..\nThe North elevation, and just to the right of that, looking at the edge of the service yard and then the primary East elevation,, which is what most people will see from the city and the prominent and the drive.\nAnd wanted to be sure that Community board saw that before we see the renderings, because the still renderings will seem a little silver to, but actually it's a very dynamic kind of subtle, color.\nSo, to hear today we're going to speak a little bit briefly about the signage as a standard with the other Hudson River Park projects.\nThat can be seen from the prominent as well as driving south along the highway, and this building really acts as a beacon, and a way to introduce not only this project, but the overall park system.\nThis is a view from the highway as we drive South sinker 97 for the first time with the signage of Hudson River Park.\nDavid Jaubert: Not only for our building and the pier,, but also for the overall park system.\nWe have various flood and point lights that are going to be applied to David Jaubert, The underside of the building and along the very top edge of the river running continuously around all four facades.\nWe actually think a better location is on a south side to the east and Kevin Quinn, HRPT: Create, some water disturbance with awakes, but also puts our historic muscle on a pretty vulnerable spot.\nBut I can give you the starting point,, which is that the park was designed with the concept of kind of vegans at major entrances and pure 97 being the northernmost kind of public pier in the park.\nThat is the official kind of look of the park and the intent was to try as Noreen Doyle, HRPT: To 13 feet wide for the Hudson River Park sign.\nIt's a very tough with area and JD—, MCB4: We're, very good Kevin, Quinn, HRPT: Not in these renderings, but we are looking at, at different material where the service yard is Kevin.\nWhat we're calling the Overlook, which was that area that gives you the view over Ian Hampson!, melk, The, far west side of the pier and under the Hudson River in the distance.\nIt is the good and the bad about having seating right over there,, but I'm Kevin Quinn, HRPT: A place for the weary parents sit while the kid goes up and down a slide for Jeffrey LeFrancois- Or, as the parent wants to join them, because Noreen Doyle, HRPT, Thank you.\nNoreen, Doyle,, HRPT, Which, people, Sally, Greenspan, Think of that right : We go to the image right at the end of the pier next to the Like, a blank space that might be an opportunity.\nI, hear JD his comment that it feels corporate, but I think this is actually a very subtle design and Visitor Center at Frank, like rights, Darwin Martin house in Buffalo.\nAspect of our team, looks at any design before the community obviously sees anything or before we send anything out because of things like you're.\nAll asking Noreen, Doyle, I would say that we are still looking at the Noreen, Doyle,, HRPT, Western side of the building and the louvers on that to make sure that our team can get access to the louvers from the water.\nSo working with operations in the plan, is to basically wash it from the, from the roof and it's accessible from David Holowka David, Holowka: Panels, coming right down to the sidewalk level, And I'm kind of concerned about maintenance vehicles bumping into them, and you know, Madelyn, Wils,, HRPT, Um,, so you're not seeing a final absolute design.\nI, think you mentioned FDNY access to the roof, but the maintenance needs been taken into account as well for the Kevin Quinn, HRPT : I agree that the playground for at least the toddler part needs to be fenced in Lowell Kern, Chair, MCB4, specifically talking about the kids playground.\nArea, they've, been in the design for quite a bit now You look at the place, scape here, you'll notice that the North, we, we actually use them at the threshold for with a toddler play area.\nOkay, I did not get a chance to read it because we ran through the slides to quickly I'm fine with the Hudson River Park and The pier 97 sides.\nNow I'm heading out of the park on the bike,, the bike, path, itself, um,, Lowell, Kern, Chair,, MCB4, It looks like there's a nice separation between the boardwalk area and the bike.\nThink that we looked at the whole south side for the historic ship and Noreen Doyle, HRPT: We're sensitive to not wanting to block us from Milan, among other things,, and it's also.\nIf it's,, you know, a more active zone that the overall periods, design with more activity towards the east and more relaxing towards the west,, so Noreen Doyle, HRPT: If, there is a water taxi or a ferry or whatever.\nOnly thing that will block is the boathouse that 96 Lowell Kern- Chair, MCB4: You have a water taxi or a ferry, stop at the far end, I want to make sure that those ships coming in are not going to.\nIt looks like there's a different fencing on the north and south side of the pier.\nIt's, been a pleasure to watch this develop into a really,, really lovely project and Maarten deKadt, WPE, Co, Chair , Other people have said that,, but I felt I needed to echo.\nI, understand your, your Maarten deKadt, WPE, Co, Chair: Strategy of not using batteries,, because that adds a lot of expense to the building and kind of have to be the buffer, and that actually makes sense to me.\nBut what the design of the building and Madelyn Wils, HRPT: We are looking at this everywhere in the park.\nWhen you come up with Lowell Kern- Chair,, MCB4: Marty,, you say: solar, panels, enough, eventually, they're going to listen.\nOther thing I was going to say is that I know the park need asked for a I'm like a restroom there, And I know the part that needs a maintenance facility, there.\nI want to applaud the perforated canopy, I think,, letting a little bit of sunlight through Jeffrey LeFrancois, WPE, Co, Chair, Is, really important in places like this and not full shade.\nI know that Madeline but I rarely Jeffrey, LeFrancois, WPE, Co, Chair: I still be in line actress and cherry trees.\nWe have the money in the state budget to bill the park, a Huge, amount, Madelyn, Wils,, HRPT, Of pain,, those being referred by government right now.\nThank you for your patience from the men from the boathouse Jeffrey LeFrancois- I'm, on the board of directors from Manhattan Community boathouse, which operates out of pure 96, which is directly south of your 97 or 97, is actually our northern Catie MCBH/ Pier 96: Anything that happens on the south side and the water is effectively in our environment and puts our kayakers at risk.\nJust start with the point that the park overall was designed for boathouses and historic.\nWe do environmental education that involves fishing and other activities in the water and again Noreen Doyle, HRPT: We have that three other boat houses in the park as well.\nWe just need to make sure everything is in place with our funding,, given the current state of the city's budget,, but something that we're going to work out.\nHave it open, Jeffrey, LeFrancois, WPE, Co, Chair, Great., Thank, you.\nMoving to city parks to present on the temporary public art exhibition coming to Bella Abzug park in the summer of 2020 Jeffrey LeFrancois, WPE, Co, Chair: Also referred to as Hudson Boulevard area around Hudson Yards,, and we have 1212****414, I'm, Elizabeth, masella, I'm, the senior public art coordinator and YC parks.\nOr I'm on to the next item on our agenda from the Department of sanitation regarding the compost, collection, program, suspension for I'm sure they're going to get into this,, but Jeffrey LeFrancois, WPE, Co, Chair, The city stopped,, not just curbside composting.\nI'm in light of the Kobe outbreak,, but it's also been put on halt at Jeffrey, LeFrancois- WPE, Co, Chair, Green markets and Hudson River Park has also suspended their compost.\nBefore committee and for March 12 Andrew, Hoyles(, DSNY): We are going to present to that meeting to talk about all of the various options,, both the curbside composting program and the drop off programs that were available to all residents and see before.\nAndrew Hoyles( DSNY): Quite, a different reality, given the global pandemic,, given the Andrew Hoyles( DSNY): You, know,, loss of life and the,, the loss of revenue to the city and the emergency Andrew Hoyles( DSNY): Status at the city's in which was actually declared on the 12th of March,, so Andrew Hoyles(, DSNY): I work specifically on the curbside program.\nHe had an opt in program where you Andrew Hoyles( DSNY): Signed up online, and you received a site visit from staff, You know, your building maintenance and then provide bins and service.\nAndrew Hoyles( DSNY): Our program partners,, the New York City compost project actually lost its funding in this, and also our education with garden when I see, which the department also funds.\nMy frustration is extreme on this matter, because it seems you know where the waterfront parks and Environment Committee, and we do not often have a lot of environmental issues that we can advocate around other than Jeffrey LeFrancois- And, so that this was the first item.\nMarguerite, Manela, DSNY, Hudson, River Park trust is running.\nMarguerite Manela- DSNY, were actually able to run public food, scrap drop off sites because they were enrolled in curbside, composting, service.\nI would like a letter on this out of the committee of people would be okay with that Marty To, the administration, with a CC to the Speaker and the sanitation, Commissioner.\nGuess I just want to register an objection that there are many other things that the representation is responsible for Jeffrey LeFrancois, WPE, Co, Chair, Including, streets, weeping, and that seems to have no problem roaring back to life and then turn back off, um, you know, Um,, so I listen, Be writing the letter.\nKeeping it on the toe pound on NYPD radar, and we are continuing to expect updates from them accordingly,, given the fact that the Governor has, as part of the budget, has deadlines in place for relocating the operations of the pier as they relate to Jeffrey LeFrancois- Which, is regarding another of our peers in the Hudson River Park access to pure 86, which of course is inherently hot tied to the intrepid, and we all know the museum and pier in Hell's Kitchen.\nYou know, the state of being put on pause by the governor,, given the fact that we are clamoring for public space and how crowded Hudson River Park is Jeffrey.\nWhich was in the Dropbox that explained their position, reasoning for closing the pier and likewise with what they're responsible for as it relates to Jeffrey LeFrancois- WPE, Co, Chair: Any questions from the committee, I want to pass it over,, Susan.\nAs, you probably all know, Susan Zausner: We operate the pier we maintain it.\nWe provide bike, paths, crossing Susan, Zausner: All of the all of those elements that allowed the peer to be active and open to the public and to our visitors.\nWe are using the security for both the pier and for the ship and Susan Zausner: Unlike other areas of the park.\nIt does not Hudson River Park does not provide any kind of staffing, Susan, Zausner, For, us.\nThe other people who do not pay rent for the pier or the community, boathouse Lowell, Kern, Chair,, MCB4, And I-.\nI know the intrepid is a not for profit, but Lowell Kern- Chair, MCB4: You're dealing in a lot bigger dollars than the community boathouses every other peer, even not for profits.\nSusan Zausner: That is what transpires between us in Hudson, River, Park, trust.\nI. Do not think what Susan Zausner: What is recognized is that we pay over$ 400,000 a year out of our operational budget, and that is strictly for maintenance of the up land.\nRepairs, now of the pier And we're going to be paying for a part of the Hudson River park that we do not even have any rights to for repairs to that and maintenance, and so that is I.\nI do not think that's been Susan, Zausner, Known or recognized, and I just want, I guess, to be able to say that in lieu of friend, it is an expense that Hudson River Park does not have to pay Susan Zausner: And, so they may not receive direct dollars for it,, but instead they're not paying for it, and we are up keeping this peer in its own right.\nI do not know any other peer publicly in the Hudson River park.\nThe fact that the intrepid could not exist without the pier and our Hudson River Park could not exist without its peers.\nOur focus has always been about public access to the pier and so Jeffrey LeFrancois- WPE, Co, Chair, JD, Your point is important..\nAnd I also think just recognizing that, as the Intrepid is continuing conversations and looking at least with the Hudson River Park.\nThat, Hudson, River Park, is responsible for ensuring or doing the best we can to think about people.\nYou know it's a different periods,, not a landscaped Park pier.\nI. Think that is a valid concern for Susan and the park to suggest needs to be considered..\nI mean they're, they're the expectations when you get on to appear that has lots of stair towers and other things like that were designed to be able to get people on to the intrepid From.\nDo people hide where you know sightlines all those things we talked about for peer 97, Noreen, Doyle,, HRPT, So I am not the business person at all.\nI do now,, having worked once for Community Board for a long time ago before the park, that this is a long standing, issue.\nDo we get public access to the park, so You know it.\nIs people want and need more open space.\nThe Trust has to be sure that Allen Oster: They're securing the public and the Intrepid But, I think the money thing we maybe, I get it.\nI suggest we write a letter to the Hudson River, Park and Susan to JD— MCB4, express our JD— MCB4: Appreciation of the intrepid and Susan's theory of the intrepid, and that we are concerned about the closing of the public part of the pier and we'd like to sit down and talk about it and discuss JD— How to reopen it without JD— MCB4, Harm.\nTo the intrepid JD—, MCB4: Something, like that,, mainly a discussion and also perhaps involving the Hudson River, Park least I.\nIs, it general Park maintenance, you know,, Jeffrey, LeFrancois, WPE, Co, Chair: tree limb, pruning garden, maintenance, sports, fields.\nBefore, I started, I want to give a shout out to the staff of Hudson River park.\nWith the park in terms of what the protocol is going to be to safeguard people on the walkway of the bicycle paths and securing security, some of the issues in that site.\nNoreen, Doyle, HRPT, Once or,, you know, once or twice every two weeks, and the park does look great."
        }
    }
}