{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "title": "CBFull Board Meeting",
            "publishDate": "2020-12-02",
            "shortDescription": "",
            "lengthSeconds": "3:37:00"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "XS_x7mMaQBw",
            "fillerWordCount": {
                "uh": 501,
                "um": 678
            },
            "readTimeFullTranscript": "126 min read",
            "readTimeSummary": "18 min read",
            "wordCountFullTranscript": {
                "schools": 49,
                "paint": 38,
                "hate": 31,
                "school": 29,
                "crimes": 29,
                "building": 28,
                "percent": 23,
                "lights": 22,
                "workers": 21,
                "mark": 20
            },
            "wordCountSummary": {
                "schools": 14,
                "education": 7,
                "students": 7,
                "paint": 6,
                "health": 6,
                "hate": 6,
                "president": 6,
                "building": 4,
                "percent": 4,
                "wall": 4
            },
            "fullTranscript": "Got it? Thank you. You're, welcome all right. How are we doing here? 19 we're getting there all right, hi mark hi, hey there good to see you Peter hi Richard, all right, I'm going to press start the webinar, which will start letting attendees into the room. Hmm, okay, we're recording we're live streaming. Can we send this to Christian, send it back to Christian you press submit and it'll go to Christian and it'll, and at the bottom of the form and it'll go to Christian and to me I. Think right is that right it goes back to into the former email you know so, okay, so we all have access to it. Okay, we're not expecting to do this real time right, we're going to just admit at the end of the meeting right, but please only submit for the ones that you're here for don't fill in your how you would have voted if you had to leave the meeting all right, we'll give folks a couple more minutes to file in, but we've got a quorum. Meanwhile Christian, could you put the link to sign up yes sure and if anybody who's, not speaking, could mute, please so, okay, well, it's 6:31 and we have a quorum. The NYPD update I expect at 6:40. Let me just make sure they're, not here, okay. Well, I'm going to welcome you all to the December community board, 7 full board meeting. Thank you all for coming to our meeting the program for this evening is that we will have an NYPD update. That's scheduled for 6:40. I, keep thinking that I need to give them a couple of minutes but to allow folks to arrive. But you will arrive on time and so that's terrific, and then we will go into the business session. Then there will be a chairs report and then we will have public comment both from our elected officials and from members of the public. That's kind of our program for the evening and let's see everybody's here very good. Okay, so just to use the time that we have there was an error in the or a correction to be made in the minutes. There were more people listed as being present than were actually present, so I have gone over the list. I think those who, let me know about that. There are three names that will be deleted because they actually didn't attend the meeting but other than those three deletions. Are there any other changes or corrections to the minutes? I'm not seeing any hands so I'll entertain a motion to approve the minutes and seconded I see a second okay, so moved and seconded all those in favor. Please raise your hand if you can use the blue virtual hand. Please do it and if not, then we'll do the hand count. Some of us can't raise our hands because the machine doesn't. Let us do that. Okay, America you're, going to record both the a bolt this way for each boat and use the form also right, absolutely because we won't know the results of the form until the end of the meeting right yeah. So I have 25 plus me and let me see about Audrey Physical Hands Audrey is two Doug and Peter Sampton are three four Louisa is five Doug Mcgowan is six, Shelly is seven, sema is eight and Christian is nine, so that's 25, plus nine is 34. Thanks, lower your hands, please, okay. Anybody opposed I'm not seeing anybody opposed anybody, abstaining, nope and there's nobody, that's ineligible, so it's 34 to 0. The minutes are approved so as we don't have dead air time, while we're waiting for NYPD to join us. Let me just make sure that they're, not here great, so Christian and Linda. Do you want to do the vci? You have three liquor licenses. Three SLA applications, yep Christine I mean we could buy them. Yeah they're, both yes, go ahead, they're very exciting. The same folks who have sent Ambrose on the east side are bringing police here. Amazing we've got lava. Lobotomy, which is fantastic. Is that this one and anyway, we've got three really exciting. Restaurants that are coming here just take a look and we can bundle them, and so anybody any questions you have a second do. We vote they're already bundled on their phones. They are bundled I, don't see any I, don't see any hands raised. So do you want to take a vote? Should we call the question yeah close that question okay, so same deal guys if you can use the blue electronic hand, please do so and then I'll count the rest of the votes, all in favor, okay, Marco Christian. Do you want to explain the voting sheet that Christian sent around? Why don't we finish this first rich and then we can take care of it. Yep, okay, so I have 30 blue hands plus I. Have me, let me see who else Audrey is two I see. Shelley is three Doug Kleinman is four Peter. Sampson is five Andrew Ridgie is six Paige and Paige there you are is seven Louisa and Christian is eight Louisa. Is nine and I think that's everybody. Oh hey blanche, great! So that's ten and Jeanette. Do you Wanna vote Paul and Paul Fisher is 11. Okay, sorry, yes, I vote, I couldn't unmute there you go okay, so I have 30. Plus 12 is 42. hands down. Please you want to post okay, anybody opposed I, don't see anybody, abstaining nope, and is anybody ineligible on this one? I'm not hearing any so I have 42 to 0 and I. Think captain burns has now joined us for the NYPD update, possibly with captain Zuber as well. Let me just look at so Captain Burns Welcome. Captain Burns is the executive officer of the 24th Precinct. Thank you for joining us. Welcome to community board seven and I. Don't know whether captain Zuber will be with us or not. I. Don't see him right now, but captain burns. If you would like to say hello and then give us your update and report on the 24th precinct. This would be a good time and thank you all right. Good evening, everybody I'm Matt Burns, I'm the executive officer of the 24th precinct. You know I'm just going to go over some things that have been happening in the last month. So right now for the 28 day period, we have 11 robberies versus 16, which is a difference of minus 31.2 percent. We have 13 felony assaults versus 11, which is an increase of 18. Burglaries. Are 25 versus six for an increase of 316 percent grand larcenies are 27 versus 37 for a decrease of 27 percent. If you notice the burglaries have increased a lot over the last 28 days, we've made some good arrests. We had an individual who had committed four of those four commercial burglaries. He was arrested committed two on the same day. We actually the guys, did a great job catching him, and then we have three people that were entering apartment, buildings and stealing packages and we were able to catch them also. So we have we've had a good work done by you know the men and women out there, so thank you. So the burglaries were that were residential were from lobby areas as opposed to invasion of a home right, so the majority of them are packages that are left by you know. Ups or Amazon, prime in the lobbies and individuals are entering the lobbies and taking the packages out got it. Thank you Christian. Can you put into the chat again the link to sign up to speak for the members of the audience members of the those attending? We ask that you sign up to speak by using the form that Christian's gonna there's a link that Christian's going to drop into the chat right now, not to waste time. If you want to speak or have a question for either the 20th of the 24th precinct, you can raise your blue hand right now and we'll call on you until we can get the sign up sheet cooking. Is there anybody that has a question or a comment for the 24th precinct and captain Burns I have received a community constituent expression of concern, captain burns with Resp and it's with a particular address which is 244 west 101, but I've heard the same issue raised by others, which is folks congregating and smoking marijuana on steps outside of somebody's home. In this particular case it was not. It was you this I think that's the correct NYPD term, but they're. You know, we've seen this in parks, we've seen this outside of residences and other places as well. What should folks do when they experience that and they think that it's over the top or have a problem, yeah I mean they should definitely reach out and call 911 or they can call 311, and you know we keep close track of the three-on-one complaints, everything and try to send our NCO officers and our study sectors. You know to hot spots so that they can address any conditions that you know the community is specifically complaining about, but I took the number now the address you just told me and I'm gonna, you know, make sure we pass that along. So we can have the officers that have that sector steady. You know, keep an eye on that place in particular right. Thank you. Questions from the board for the NYPD. It doesn't look like captain Zuber is going to be able to join us, although it's only 6:42 right now, awesome, oh hey! He is here, I'm sorry there you are captain. Thank you very much for joining us. Welcome to community Board 7. We just heard from captain burns of the 2-4 and we'd be grateful for your report. Yes, I was listening in on that. Thank you. Happy Thanksgiving, everybody happy to say that we had a very uneventful weekend for the most part, as goes the Upper West side. So it goes to city and I'm happy to say that we are actually doing pretty well we're seeing a couple spikes in a couple areas. One of them is grand larceny, auto we're seeing stolen cars. That's happening around the city, so it is something that we are noticing here in the 20th precinct as well, and it's really across the board we're having cars that are left unattended and running. Okay, that's definitely something that we can all agree. That's a crime waiting to happen, we're also seeing cars that are stolen from parking lots from garages and on the street. In the past, we've seen a lot of motorcycles being stolen. That continues. That's something that it's relatively easy. Unfortunately, motorcycles are parked on the street legally and they're relatively easy to move off with just manpower, one or two people, however, something that we're seeing a little bit more often now is this high tech now that we all have cars that are push button starts and they have the smart fob. Unfortunately, there are people that are very tech savvy who are able to utilize some devices that rotate through the frequencies that are commonly used and they're able to just check cars until they find one that works and they're able to drive off. With that we're kind of putting our heads together here in the precinct saying: well, what can we do? What can we tell the public to keep your car safe, because your brand new, 2020, Toyota or Honda or Mercedes should be very safe? You know what the best thing we came up with so far: let's go extremely low tech. Let's back decades ago, when we had a lot of cars being stolen just so, they can go joy riding we all protected them by putting the club on our steering wheel. That's because people were breaking the window with the screwdriver or with bolt cutters, and then they would break open your steering column and they would hot wire your car. Well, what we're seeing now and a couple of rest we've made show that these high-tech thieves are not carrying any tools with them. That would defeat something as simple as that metal club on their steering wheel. In fact, they're going the opposite direction. They look like everybody else and if you or I a responsible adult was on the street, and you saw somebody open a door and drive off in that car, we would just assume that car belongs to them. So, just like having an alarm system on your house deters most burglars having something as simple as a club on your steering wheel, that's visible through your non-tinted New York legal windows should deter most car thieves. Wow, okay, are you? Are we also experiencing captain Burns was speaking about burglaries that were thefts of packages from common areas in residential buildings. Is that also happening in the 2-0? Absolutely so that's something that happens year-round, but across the city across the country. You always see an increase this time of year to the season. People want to go Christmas shopping and Hanukkah shopping, but they don't want to go to the store. They would rather just come to your house or your apartment building, and do that we've been talking about this in several of our Zoom meetings in the past several CB7 meetings, we talk about it with our neighborhood block associations. Please tell your neighbors. Tell your resident association, keep your lobby door locked, don't let anybody buzz in if they don't belong in that building and try to get those packages, not just out of the lobby where they can be seen from the street, but also out of the hallways. The second floor, the third floor that is invisible from the street, because once the person does manage to buzz into the building, they're relatively free to roam the hallways until they see something that looks to them like they want to steal. Okay questions for either of the precincts. I see one hand here, and that is who is it? Oh, it's Roberta, Seymour Roberta, I'm getting a lot more scam, calls and I know that in the past the both precincts have sent out some e-blasts. We could certainly put one up on the community board about you know. The scams that are increasing exponentially right now have is that possible? Yes, I'll definitely reach out to the community Affairs Bureau and the Crime Prevention Bureau and we'll see what, if they have anything updated, if not we'll just put out some of our more recent ones that are still very much in tune with what's happening now. I know for a fact what you're talking about I got three of those calls myself today and if anybody knows how to stop the calls. Please hit me up on the side right. Thank you, yeah. They also seem to be coming by email. Don't they where they pretend to be your bank asking for your information, I'm not just pleased everybody. Your bank is never going to ask you to pay a bill or to pay a fine with Iphone or Apple cards, or apple pay cards or best buy cards. Okay. If it sounds wrong, if it feels wrong, it is wrong. Okay, there's no problem, even if it is a legitimate credit company who's calling you or somebody who's trying to settle the debt. There's nothing wrong with coming in to talking to us and we can kind of walk you through that very good. Okay, any other questions either from the board colleagues or from the audience. I'm not seeing any jelly. Has a question yeah just a comment: the IRS never calls you. So if you got a call from the IRS know that it's not real, it's impossible to get them too, but they won't call. You yeah got it very good, so captains burns and Zuber. Thank you very much for being with us. Are there any other trends that your officers are finding unusual or having occupy their time, especially with respect to how people are acting on the street and so forth? There was a rash of some unfortunate incidents a month or two ago, I'm wondering if that trend is continuing or what your officers are seeing on the street. The one thing that we're seeing more often this year than we ever have before is due to the outdoor dining because of coba we're still going to experience. Something excuse me. Let me start again they're going to be studying this last year for decades to come. We have no idea all of the ramifications, but what we can point to is the change of people dining inside the dining outside these temporary facilities outside we've seen a lot more unattended, property being stolen, I think we've talked about it either last month or the month before that continues. So please, if you're dining outside, do it great support the local businesses. One hundred percent keep your per your belongings on you or in front of you, okay, just so much as having your jacket on the back of your seat as you lean forward, and you lean back, you don't realize that somebody just took your jacket with your wall and your cell phone just like that. Please be aware of what's going on around you and keep your belongings physically on you or in front of you, so you can keep track of it. Thank you. Captain, yes, sir, can I ask both precincts what you're, seeing with what's happening on the streets? Have there been more crashes, fewer crashes, more injuries, more summonses, fewer, what's happening well, I mean I can say that for the year the 2-4 is definitely down in crashes right about this last 28 day period and week to date we're kind of even with where we were last year. I mean overall injuries and collisions are down, but you know, as things have started, to open up and people have started to travel again. We've seen our accidents, our collisions, increase to the same level they were at last year. Is that concerning? Is there as much use of the roads as last year, I mean just from my own perspective. I think that the you know the amount of traffic. That's in the city you know, based on compared to when Covid-19 first started happening. I would say that it's pretty comparable to pre-Colby times, okay, well, okay, any other questions from either board colleagues or from the community for just for NYPD. Right now, we'll have public comment later Christian dropped into the chat, the sign up sheet for public comment, so you can sign up now for any of the other items that are going to be following: that's including our business session and then the public session later on. So you do have to sign up individually, so you have to use the form multiple times if you want to speak on multiple applications with that, though, recognizing the demands on your time, especially captains, uber I, understand you're on a particular duty tonight. So we thank you for making the time to be with us and if I don't see any other questions, you're of course more than welcome to stay- and we appreciate your being with us for the report and to do it at a time when we can predict it and so forth. So that's very helpful, but I think we'll move on with our agenda unless there are other questions for the precincts which I'm not seeing so with our thanks. I appreciate your being here. Let's go back to the business session and I think we were ready for the preservation committee and there are three resolutions: three properties and applications at issue. There. I have the slides available. If you want them, and just so either Michelle or K, let me know who's going and what you need. I'm gonna try and take care of it tonight. So yeah I think slides would be good to just put a visual with what we're talking about. Nothing is terribly complicated in these three resolutions, but just so you follow what we're up to okay all right, this yeah. This is 18 west 75, fairly, straightforward, stoop, restoration, it's for a straight stoop. The tricky thing is that somebody back aways raised the parlor floor, 23 inches, and so it's not an exact replica of what was there originally but a lot closer than what we've got now, as you can see, and so yeah that's the existing and then that's yes, the proposed restoration. We had a suggestion in our committee that, rather than the each of the two front, doors having divided light- that we would have a single pane, a larger narrower window on the front so that shot on the right there. That diagram is not what they're going to propose. They took our suggestion and what they'll bring to landmarks next week is a single pane on either door. That's pretty much it unless any of the committee folks have anything to add, but I could I say, okay, that in effect, this new owner is trying to replicate the tax photo from 1940 and meet the lines and elements of the two other buildings that were also designed by the architect back in the building was built, 1889 1890. So this new owner is trying to replicate what the building looked like then. Hence the straight stoop and they're going to replace the metal railing with a masonry fence. Thank you Michelle. Yes, it should be a nice addition to the block. In our opinion, it passed unanimously in our committee and we commend it to you. Okay, all right, I'm gonna stop sharing any questions or comments before we take a vote not seeing any. So, let's go back to that. Are you ready to call the question? Okay, all those in favor, please raise your hand, use the blue. If you can and then we'll count. The ones who can't okay looks like we've got 34 35, very good, okay. Now, so it's in terms of physical hands. It's me christian. What just happened: Louisa, Peter and Doug Clyman is five. Let me see, rich Robbins is six Ethel. Shepherd is seven Audrey. Thank you, Audrey is eight Paul Fisher are, can you be? Are you in the chat? The Shelly is nine Orange Blanche's, ten Well Fisher says yes, that's 11 and I don't see any others, so it's 11, plus 31 is 42 already. So thank you. Let's lower hands, please anybody opposed I, don't see anybody opposed. Okay, anybody, abstaining, I, don't see anybody abstaining and is anybody ineligible, so it passes 42 to zero and now I guess the next one is 2211 Broadway, the appthorpe yeah? Okay, you probably know the appthorpe it's a venerable early, 20th century building on the corner of well fills a whole block on Broadway between Broadway and West End 78-79. Our piece of it tonight only concerns the northern facade and really mostly something that's not visible easily from the street, but they have water infiltration the area ways on the north side. They are trying to address that the only tricky part about the area, there's two things to mention. One is obvious: on the right-hand side, you see that bench that was added at some point and they were open to either keeping it or not. I think our committee was fond of it and there was some personal history involved in that event. So that's the way we, our committee felt like that, should be kept and fixed up and then the other concerns that in the area ways in the bottom of the area of each of the area ways there are some sidewalk lights now you know or you've seen those around. Those are the little yeah the little round, things that sometimes crop up on the sidewalk and if they're illumined below you can it gives a kind of a nice glow. These are a little bit. These are in terrible shape. They could be replaced. They would prefer not to replace them. The argument for not replacing them I suppose is that again they're very. They would be difficult to see unless you really wanted to look over the low wall there and look down. So the majority of our committee was convinced that was okay not to replace them, not to just to put a waterproof membrane there to keep the water out of the building and but there we were divided on that so I. The vote on this project was I. Believe four in favor and three opposed because of the lights and I. Don't know if anybody wants to say a friendly word about the lights, so I see, Madge has your hand up and then maybe others want to speak and I. Will too Madge your muted bench? Did we lose match? Okay, can you hear me now? Yes, okay, I voted against this because a building of this quality and this importance in the neighborhood which is going to do this project anyway. It's not that they're going to have to tear something up that they wouldn't have done. Otherwise, not to do it and restore it. I felt was very short-sighted. I mean you can see the space. It's not like. It's completely out of view. You can see it so if they're going to do it I think they should do it right and do and restore it to what it had been. Okay may I respond to that. Why don't you what why don't we hear from all the hands and then the chairs wrap up at the end? Okay, so Paige has her hand up. Yeah, hi, I have a question and then a comment. I, don't understand on the paragraph you guys recorded the vault lights and metal framework are not an integral element of the design of the app orb are not replicated anywhere else in this individual landmark and are not common or frequently observed feature of other buildings in their on the surrounding historic district. Can you explain because it these are actually original pieces to the app? So that was my addition to the minutes. So maybe it's fairer for me to jump in the I understood the applicant to say that these were original to this building but they're. Not this is the only place where they are there. So that's what I was trying to say and we have seen one or two applications. There are a few scattered vault lights here and there in our district to be sure, but there aren't they aren't a defining characteristic, the way. For example, they are often seen in Soho and in Tribeca that those features are not a regular part of walking down the street, and here they're, even hidden away from you a little bit they're, certainly visible I. Don't think anybody would contend that they're not visible in the strictest sense but they're behind a what is it about four and a half foot tall wall made out of ground? You know four foot wall made out of granite so, and we considered this on another property on Columbus Avenue between 72nd and 73rd street a few years ago, which also discovered that there was vault lights that were hidden by something and then and our board I think actually recommended that they not have to replace them. It wasn't a unanimous vote that time either, but LPC did require them to do so or to put in those diamond-shaped metal, cross-hatched surfaces which one can talk about separately anyway. That was the impetus behind that part of the resolution. I would like to comment then. Now that I understand the background, I don't believe that this building is not like a commercial building in Soho, but it serves the same function. These are very clever in-ground walkable skylight, as it were, to illuminate a gloomy basement and storage spaces underneath and the beauty of it is that in the night time, if they leave the lights on they glow. So it gives a very lovely effect to the perimeter of the building, particularly on the very busy side of the street, where you have the bus stop and you have people coming by. It deters people from wanting to jump over there and hide, or do worse, so I have to agree with Madge. Thank you for opening the discussion match that this is part of the app Thorpe and I. Don't think it's a good idea on an individual landmark that you should start picking and choosing what is convenient to restore or what is visible or not and I would encourage the committee to reconsider that and it should be fully restored. Thank you. Okay, I think Jay had his hand, that's the next one. I saw right, yeah I, don't have to repeat what page said and what Madge said, but I discussed it at the committee meeting and I was one of the three committee members who dissented from the majority and in addition to what page said, while this is a small piece of the total architecture of the app Thorp, there's, not only a physical benefit as Paige described having it, but it's also historical and it recalls an era when natural light was precious and artificial light was not easy to come by, and so it has a historical significance in addition to the physical significance and really other than some expense. The presenters on behalf of the app, though, really didn't, have a particularly good reason for not doing it and all things being equal. You know it's a piece of history and it's a piece of architectural history and I think that since they are able to do it, they should replace these vault lights with new ones. I said I see, Clary has her hand up and I see. Richard Ash has his physical hand up and then we'll go back to the chairs and then I suppose. We should also hear from see if there's any public Christian. Is there anybody from the public that has signed up for this? No okay, so Kay and Michelle in that order, Clary Richard and then Michelle sounds good. Okay, so it's clary here so I agree with what Madge and Paige and Jay have said, but just to add one more specific piece to that. We, and for that better LPC have a and we should have a higher standard and a higher degree of scrutiny for individual landmarks. I mean this is one it's a fabulous building, but whether we think it's fabulous, building or not is an individual landmark, and that is a very small subset, very distinctive subset of our of the buildings in our historic districts that have landmarks protection, so that to me puts me very much over the you know over towards saying no to not to their proposal to eliminate this feature. So I'm gonna vote, no. Okay, thanks all right and who's next Richard Ash there he goes I know that we're not supposed to consider this, but I always do, and in particular here where the restoration that's proposed, doesn't involve these lights. It would be something extra. What was there any discussion at the committee as to the cost or disruption or any reason why the building felt that it was impractical to do it or unnecessary I yeah I can answer quickly and then probably there's better answers but they're in terrible shape. So they could, they would be replaced not restored man, they could be. They are over a Boilie boiler room, so that was you know one of the building's reasons for not particularly you know. Can you just elaborate on? Why is the fact that there were boiler rooms? Well, there's you know pipes and you know all kinds of junk down there, and so the whether light would actually get up to them was some a consideration. Got you Michelle I had a look-see of the building before I went to the eye doctor got my pupils dilated and there's no other area that has these vault lights and, in fact, if everybody can kind of picture between going west between the parking garage and the corner, West end there's a wall there. Also there are no vault lights there and I disagree. That light is important now because of the enclosed four-foot fence, the granite fence and I thought. The applicant was very sensitive, not to mention costs. When we discussed vault lights versus not replacing the vault lights because everybody kind of knows they are much more expensive, but he was I agree with Kaye that he, the architect loved the building and wanted to do the best for the building, but I, don't think it makes it personally I, don't think it makes a difference whether the vault lights are there or not, because nobody's going to see them. You really have. Most of us would have to kind of crawl up a little bit to the wall, to be able to see the vault lights inside and I agree with Kay that these are in a place where there's leakage onto the boiler room, which is dangerous. It's okay, I see Barbara, Adler and I, see Paige as her hand up again in general, I'm going to discourage us from having multiple times to speak, although we are doing okay with time so perhaps a little bit here. If we can move things along so okay should we go to Barbara first and then Paige and that's good and then Christian. We don't have anybody from the public signed up for this, I'm not seeing any blue hands and no are we. The last person from the public is for question number. Six very good. All right I just wanted to say that I love these fault lights, and it seems to me that when I was a kid you saw many more of them, but you hardly ever see them anymore, so I think they're, really historic. The way I'm becoming also and I definitely think that they should be repaired, and it would be a shame to just close them up. Thank you and then Paige, just a quick ps. The issue is I've. Just heard three people talk about deterioration, didn't maintain, them, aren't visible, etc. There is stewardship that goes with every property and I agree with Madge and Clary. This is an individual landmark, and this is a responsibility of the owner to maintain all aspects, not just pick and choose the easy ones like screw in light bulbs, where it's convenient and ignore major capital, expense and who's. To say that in the future that boiler may disappear and the natural light is going to be better again so I don't think it's our generation that should dictate removal of things which are pretty much intact. There's enough of that artifact to be able to replicate so I would think hard before we start arbitrarily picking and choosing and helping the owner allocate funding when it's their responsibility to maintain the landmark and landmarks does not. The commission does not entertain any discussion of cost, so we have to keep it a level playing field, so it's equal to all people who live in landmarks. That's all I wanted to say and I would vote against the removal of this. Thank you. Okay, rich Robin's, here I, don't have the ability to raise my hand. I've been physically raising my hand for a while I didn't see. You sorry. My comment here is: it seems to me that if we truly are not considering cost, if we just have a decision, would we rather these to be restored or not restored? We have to make up our mind. I'm leaning, you know if cost is not at all a factor, then I think you know why not restore them correct and it becomes a question of should we be considering cost and what both K and Michelle wrote to me is that we're not supposed to consider cost correct so, given that we're not supposed to consider cost and if we're not considering costs, at least in my mind, why not have them? Then it seems like I'm at least going to vote against now. I question: that idea of should we consider cost or not, but that's not me just to question that. That's not my decision so, given that it seems like for me, the answer is a no, but that's the question is all else being equal: are we better off restoring them or not? Okay, all right! Well, let's just make sure one last time there's nobody signed up from the public to speak right, that's correct, okay, so the only other thing is about the bench. If anybody cares one way or the other about the bet that's built into that wall there well, because of Doug they're gonna keep the bench and resurface. I didn't know it was cement until I looked at it more carefully. It's not granite, but they're going to resurface it and color it the same color as the granite wall and add the plaque for a dog, and this was it your grandma that used to yes, there yeah, okay, all right so shall we call the question. The resolution, as stated, is to approve the removal of the vault lights. So if you're, not if you want to retain or have them replace the vault lights, you'd be voting no or abstaining, so the so all those in favor of the resolution as presented. Please raise your hands now blue. If you can and then not. If not all right looks like we've got 11 blue hands and then I'll start. So I'm a yes, let's see any other yeses in physical hands. Audrey! Yes, Audrey is yes, so that's two Paul Fisher, I'm not sure if you can hear but looks like that's it. Unless I'm missing something somebody: okay, yes, okay, that's three and no other physical hands. So that's 11, plus three is 14, so it's obviously not going to pass. But let's continue with the vote. You know: hands down. I can't get I can't find the hands down button. So please lower your hands all right thanks! Okay, now anybody voting against. Please raise your hand now: okay and then physical hands, I, don't see any on this page I see Louisa and Shelley. That's one! Two, let me see Peter Sampton is three Christian is four Paul Fisher Small Fisher is five Doug Mcgowan is six I see Ethel is seven rich Robbins is eight, do I have any others blanche? No Blanche is a no thank you. That's nine! That's everybody! So I'm sorry, 18 plus 9 is 27. hands down. Please anybody, abstaining I, don't see any other hands. Oh wait are Courtney Urena and Catherine abstaining. Is that what we're doing you can just nod very good? Okay, so there's three there? Okay, so I have 14 to 27 to 3 and there's nobody. Who's got is ineligible right, okay, typically, what okay so hands down? Please, typically, what we do in a situation like this instead of just saying no to an approval, is to there's an opportunity if somebody wants to make a motion to disapprove the removal of the vault lights. Obviously, I shouldn't be talking about that, because I voted the other way, but for good practice. If somebody wants to make that motion now is the time I've raised my hands. Okay and match has your hand up too so I think it's yes, I think we should do that, but it's not quite as straightforward as that, because the resolution and I think nobody disagreed with this, or at least wasn't what we were explicitly voting on spoke favorably about the bench I think recorded the fact that they said they would keep the bench so I think the resolution needs to be rewritten to be in praise about the bench and disapproval about the removing of the glass okay. So that sounds like a motion to me. Yeah, there are a way we can make an approval if they restore the lights. No, because their application is to remove the vault lights. Can I just ask one question: why do we? Why can't we let the original vote stand it? We, it just gets sent in that fashion. Why is it absolutely necessary to in fact reverse it and take another vote? Is there anything I, don't think it is, and I am not quite sure. It seems to me that the vote is reflective of the sentiment and understanding in at the board, and it should stand as it is. I think the only thing I would say to that is that semantically there was an application to approve and the resolution to approve failed that doesn't it isn't the same thing as saying that the res that there was a resolution to disapprove so not only that the resolution, as it's written cites the reasons to approve the reasons in favor of removing the vault, whereas now the rationale is reasons that various of us expressed tonight to restore the vault and those aren't in the existing resolution that was disapproved in the way they would be to support a disapproval. So we've already had a pretty good discussion of this. So if I could move us along here, I see a couple of hands up. I, don't know if you're voting on the resolution that Clary just made- or you want to be heard- I want to be here. Okay, Linda go ahead, I have a quick question. How do we enter this on that sheet? So I don't know how to use that so I if I'm going to no. So no, this is fine. There are extra lines on the voting sheet, yeah mark if I may. This is a good opportunity to talk about the form. Yes, please Christian go ahead. Thank you, okay, hold on a second! Let me put it up in the screen a moment. I may have to help you do that no I can't share hold on okay. Here we go okay, so to so this form that allows us to vote. You click on the your name, so we know who you are you scroll down, then you'll have to enter an answer on every single row. As you can see, we have the approval of the minutes and then we have a resolution after resolution, as is the case in paper. I added three extra lines. So if we have extra resolutions extra votes, we can record them here, unfortunately, also because this is required to make a selection. If, let's say we don't use any of these mark them as not eligible I, guess that we know, because we have to put something. Oh okay, so christian. If somebody has to leave the meeting early, they should mark ineligible to vote on all the remaining corruption. I would say so. Yes, that would be the best I guess, but next time we can do something better but yeah for now. Yes, okay, that's really helpful! Thank you! So much and now, of course, just enter the security code at the end here and then you can submit okay, so Chris you're, saying that if for the next vote for this particular vote number three for the app store, we're going to be voting at number- eight, yes, correct Christian, maybe I'm looking at the wrong form, but I don't see my name on this here: okay, it's alphabetical by first name: oh, my first name by first name. Okay! So, let's see here, okay, yeah! Sorry, thank you. Christian and a key thing here. Don't share the link right, don't share the link with anybody. No very good, all right! It's only 7:22, but I would like to move us along I, see a couple of hands up and there's a so. There is a motion on the floor, so K and Michelle. Do you want to call on hands or yeah? So they do. We have the actual motion. Are they well I? Guess I made the most? Am I mute, I'm not you so I, it's Clary I made the motion and I would be very happy to have the chairs of the committee rewrite the actual words that will go to LPC consistent with the sense of my motion. We'd I'd I have not written out exactly okay, yeah I think we got the idea of it if I may to clarify. Would that be that we will disapprove? The removal of the lice would approve the rest of it right. Well, we I'm not sure what the rest of it is other than because I can't remember which I read many hours ago, but we affirmatively want them to restore the bench. Okay, which they agreed to do I would reflect that they said they would and that's why we're saying yes about the bench yep. So that's the motion and Madge has seconded it. So, okay, why don't you take it away from here? Call on hands and then let's vote. Okay, anybody need to speak to that Jay. You have your hands up right. No I was just gonna. Okay, I'm gonna say quickly that I agree with Ethel that we could send a motion to disapprove. But in this case, since we want to partially approve, we do need a substitute yeah motion and the motion in substances to approach okey-Dokey. Let's move it on yep, let's go say if all right: okay, just a quick question: how does this new resolution get recorded in this? Is it one of the new resolutions that Christian says number okay, so those of us who supported would vote no on three and yes on eight? Is that the mechanics Christian and mark? Yes? Okay, thanks? Okay, so everybody know what we're doing enough to go ahead and take you back. You still have two hands up, but I see Richard and Madge Ryan's matches and shorts; okay, yourself, you're, muted. What's the security code, that was a second email, oh golly, okay, I, don't think I got it, but okay, nothing's easy these days. Okay, Richard, I'm voting early, oh and often great. So that's it, you can't do it in Wisconsin, but you can do it here. Okay, so we're ready. I have a question. Rich Robin says it. Oh sorry go ahead! I'm voting early, I'm sorry, okay, all right! So those in favor of the new resolution, which is to disapprove the application to remove the vault lights. I hope that is English all those in favor of that new resolution. Please raise your hand now and then I'll count the physical hands. Okay, let it settle down for a second okay. So where did rich robins go I see rich Robbins is one Doug. Kleinman is two. Let's see, Christian is three Paul Fisher is for Paul. Fisher is what I'm sorry is? Yes, that's five. I'm going to the next page. Bear with me. I see Louisa is six, Robert is seven, Shelley is eight I, don't so Peter Sampton is nine okay and then I'm gonna go to the last page. Ten blanche is ten: okay got it and then let me see last page anybody else. No so there's 10 plus 19 is 29. So obviously it's gonna pass hands down. Please, okay. Anybody opposed to this res this new resolution, Audrey votes now Audrey is one mark, is two and then I see any other hands. Clary I, don't think you mean to vote against this. Was your resolution? Put your blue hand down Mark I meant to vote yes for it. Thank you. So now it's 30. Thank you. Roberta Clary did you vote no on your own resolution. How are you muted, Claire, you're, muted? You just voted no on your own resolution: Clary, okay, lower hair hat okay! Thank you all right, oh I, see so now it's 10 plus 2 is 12. Okay, all right those hands down. Please and then let me see if I can help with that here we go they're all down. Okay, anybody abstaining on this one I see three blue hands and any physical hands. I see Howard as a physical hand. I don't see any others okay, so it's four plus one is five and nobody's ineligible the same as they weren't last time. So this resolution carries 30 to 12 to five to zero. Okay, if I may, for those of you that couldn't find the security code just putting your name in lieu of that, your name- yes, okay, thanks all right, Kay and Michelle. That's number three you've got number four as well. Moving along yeah parenthetically up Thorpe Farm once covered 300 acres on the Upper West side, I learned something new. There you go okay, so yeah. So moving on to our last one. This is 328 west 108, townhouse there. It's a paint job that went slightly awry. The finished product is on the left right, correct, that's correct, yeah! Okay, the trouble here is that the paint that was used is not one that could be approved on a staff level at Landmarks Preservation committee. It's the elastom, elastomeric paint. Somebody probably knows more than I do about that and the so. The question is: do we approve it and there? Oh wow great, there's more information than I ever thought, I needed to know about that. So the question is yeah. It probably was not the ideal paint to use here. It's a thicker paint and there may be some other questions about it as well, but it's a good, solid paint. It looks good. The question we had in our committee is since it was done. This way would requiring you know the stripping of it and repainting with a different paint, do more harm to the facade than leaving it alone. The one of the good things about this pain is that it lasts longer, and so, regardless of how I personally feel about painting the facades of brownstones and townhouses, the idea of being able to not repaint it again in a hurry, sounds good to me. Anyway. Our committee agreed. We voted anonymously to approve that it was okay to leave it, as is, and that's the vote that we took and the vote that we'd bring to you today. Okay, questions about that or other thoughts. Oh hi, this is Irena. Just a point of clarification. Is it the wrong paint that was used? I'm sorry I missed the first part of your presentation, yeah the wrong type of paints, not the wrong color, just the wrong type yeah- and it was you know it's a okay paint to use, but it's not one that the that was approved on staff or could have been approved on staff level at LPC. It would require it. Thank you. We don't usually I guess we don't usually get applications for approvals of paint jobs, but because this is a different kind of paint, a little thicker lasts a little bit longer and it could not be approved in the office at LPC and that's why they came to us both Kaye and I stared at this building for a long time separately, and it was remarkable to me how they got in every nook and cranny because you can see by the picture. It's a beautiful and ornate building, beautiful job call the question I see, hands up, I, see, Clary I, see Paige and Rich Claude. You got one for you. Oh now, you're muted now go ahead. Yeah did they receive a violation, not that we know of. We just know that they went to staff and staff said to go to CB7, okay, because even if they didn't I thought, the wording of your resolution didn't make sense where this has already been done. Normally we would word it to approve legalizing an existing condition and it is an existing condition. Now the resolution was as if it were a prospective paint job as I recall, so we should probably change the word in that's my suggestion. Yeah. In fact, let me make a friendly amendment if that, if that's the fastest way through to a phrase, the resolution in terms of approval legalizing legalized code with that, thank you Larry sure we can make that alteration. Sure page Paige are you here there you go I have a question: I see that we're going very victorian with initials who is Jay a Jay Adolf, oh Jay, Adolf. Okay, earlier in the minutes, I put the names of the people who on the committee who came to the meeting and then their names are breathing right. No just curious. All right now to quote you Roberts from pretty woman. This is a huge mistake and I will explain why. Okay, because, first of all the last I have another question: do we know if the bra? If the stone is limestone or brown stone or red sandstone, it is red, common brick, it's red, brick, okay, so all right, sorry about that. Okay, still a huge mistake and the reason is elastomeric paint is like taking a dry cleaning bag, putting it over your head and sucking the oxygen out. What happens is you actually create a bio chasm between the paint and the brick which is not smooth and moisture, can't move through the brick or through the mortar, and you get deterioration, it's not as bad as if it's on stone, but when it's in brick and you have pointy mortar, it will fail. So the thing is here: the contractor needs to do the right thing and put a poultice. There are methods to be able to remove it. You don't have to sandblast it power, wash it or whatever. It's two or three applications of various paint removals made by peel away is one company I think prosoco does another one, but this is what it this is like putting in anti-fowling paint on your clabbered farmhouse someplace, you just don't do this and I think the reason why the landmarks is asked CB7 to weigh in on it, even though it's a highly technical issue, it's just the wrong thing to do, and the other problem is when it starts to peel it's going to peel at a very different rate. Somebody had mentioned about all the interstices and nooks and crannies that have been coated. In this thing, it's going to look terrible and you're going to get mold. The owner will thank us for making the contractor do this because it will get mold and mildew will grow on it. If you leave a rubber glove out in the garden for a couple of weeks, it turns green and black. So this is what will happen so I think we should take a much stronger stance and put the technology in the hands of the commission and ask that the paint be removed and the work done properly is originally specified. All right. Thank you. I see, rich robins has his hand up and Ira as well. Okay, so I just learned a lot more about painting brownstones than I ever knew. Two minutes ago, I was wondering why on earth would LPC care what paint people put on their houses and I? Think Paige put it very well. I just searched for Lpc's guidelines on paint to wonder like what can't do they approve, or do they not approve and found an LPC guidebook that I posted into chat with some specific language that says, do not use paints described as waterproof as they may trap water inside materials and accelerate deterioration. If you have questions about what type of pain is appropriate, reach out to LPC and then separately, it says coatings described as waterproof can not be approved by staff. These types of coatings can contribute to and sometimes accelerate deterioration of, historic materials sounds like Paige wrote the book Ira and then Doug well. I have to thank the La. The landmark submission via rich Robbins, help seconding what Paige said because I was going to second. If nobody else did the one thing is that not only will it create work for the contractor, but it'll also create work for generations of lawyers, but that's not our problem, so just wanted to point that out. Thank you, okay and then Doug. So I was present for this meeting as a non-committee member and I do remember. Voting in the affirmative I thank Paige for schooling, us on this and I understand my concern or my the topic at the meeting I remember was of the thickness and that I remember the applicant discussing that it that there was a micro millimeter difference in thickness. I did have a concern that if it were to ever be repainted again, a micro millimeter then builds up and builds up over time. So I didn't realize. That was not the main concern, as Paige just pointed out. So I am I'm going to be voting to either against or to abstain on this now. Thank you thanks. One quick, I'm sorry I do remember that the applicant and please anyone else that was present for that meeting. Please refresh my memory. I. Remember the applicant discussing the breathability of this paint and saying that this particular paint was breathable, so just in all fairness, I remember that being discussed. So that was a question that came up yeah, that's correct, Doug, that's my recollection, also I think I was called next day today. Would that make any difference? If we found out if I can say I, you know clearly I mean the applicant. Was the owner that now I couldn't say for sure whether we voted on the basis of disinformation? It's hard to know at this point frankly, because we it was discussed and assurances were given on the durability and breathability of this particular paint, and what we're hearing tonight is I, don't want to use the term diametrically opposed but inconsistent with the information that formed the basis of our decision. Okay, let's go in order, then Kay, you have I! Think you have Linda next, then the next have a propensity for spending other people's money. This is a privately owned town house the and meets all of our standards aesthetically or the building itself, and they are claiming that it's breathable, as I'm sure their contractors did too, but the onus is on them. We went through the rebars went through the enamel brick years ago. That's what gave us local law 1198 that doesn't pertain to this and I think that if this, if it looks lovely I, think they're going to have to deal with it down the road if it starts to mold if it starts to have a deleterious effect on their facade they're going to make that change, but right now they've already invested. This is not a great time to say: oh by the way, you're gonna invest another couple hundred thousand dollars to take it down and repair it, and then you're gonna have to sue the contractor to do it. So my feeling is, we are not technologically geared toward doing this. I know we have a couple of architects on our board that are, but this isn't our choice. This was the owner's choice. This was the building owner's choice and as long as it subscribes to the basic parameters of the aesthetics of landmarks, I think we should vote for it. Okay, thank you, I'm looking at the time, but there are some hands raised. So let's keep going okay, Ken Linda just made the point: I was gonna, make I agree with her: okay, great Jeanette, sorry, yes, so I'm a little perplexed by this. It sounds like it's a technical aspect that the owner is supposed to use a particular type of paint for technical reasons to preserve the building's facade. It's not really for aesthetic reasons, and we don't know whether the contractor swiped in a cheaper paint or the owner said no I absolutely want this paint. We don't understand what that arrangement is so I, don't think it's fair to say it's the owners or the owner's going to have this cost or not. It might have been a contractor or contractor off the books or something else, but I don't think it's also right for the community board to be put into this situation where we have to determine this highly technical thing. So I would request that the applicant certify that the paint meets the standards of the other paints that landmarks has requested for the site and if it does we're fine with it, if it has all these technical problems, then it does then we're not fine with it right and I'm sure when it gets to the commission, they will have those that expertise available and there all right. What do we do? So? What are we doing about double dipping? Okay, well, Richard hasn't spoken, oh I didn't see, Richard, okay, great and then double dipping. Let's just keep it to like one minute. If you can guys because people have already spoken, I think you know it's getting to be 7:45 and we have a light agenda. Let's have a light meeting. I look I! There are two issues. One is the aesthetic issue, which is what we generally deal with in landmarks, and the other is a technical issue and I would propose an amendment for the resolution to approve the paint on an aesthetic basis and refer to the Landmarks Commission's expertise with respect to the technical issue of breathability I would accept that Michelle all right, I, yeah I, don't really want to get into an aesthetic argument, because I don't think that's our job, but I did say something about it and anyway, LPC is going to decide if the paint is yeah. I could live with that. This way, we give it right back to LPC to decide. So, in fact, the amendment would be that we approve the aesthetic appearance of the paint job and defer to the Lpc's expertise with respect to the technical aspects of the conformity of the paint to what is appropriate for all the reasons that Paige said. Yes, this way we'll know for the future how to approach this yeah. Okay good. Can you get that jot that down Michelle sure you've got the original thing? Okay, all right good you've got Stephen and then a quick rebuttal from Paige, okay, Stephen and yep I'll. Just be brief. That I agree with some of the last comments and I like the last idea. I just want to make the point that I sometimes feel I. Sometimes I'm not an expert, but I can't tell the difference between when we are speaking about preservations issues or if someone is sharing their personal preference on what they think. Something should look like and I think that's a line that we should either discuss or understand. This is about us improving people's homes, not necessarily giving them advice on how to do it, and I'm not an expert, but I sometimes feel that that's a client that gets crossed quite often right job is to determine our take on appropriateness, whether it's appropriate to the in this case historic, district or not. Paige, also known as Julia Roberts I like that yeah, so, which gave you the tool in which you can feel comfortable, and that is that the guidelines for masonry paint specifically exclude this type of paint. They used the wrong thing whether the owner was complacent. I, don't think so, whether the contractor got it off the back of a truck I, don't know, but I think that the hook here is that there are certain means and methods that the landmarks have worked very hard to help in various brownstone manuals sign manuals, all sorts of things to help the applicant. This should never have happened and to excuse this just because it looks pretty now you won't like walking by it when it's stippled with black dots and green algae. This is not something that, if you're too squeAMI'sh- and you don't want to deal with it fair enough but I- think the guidelines speak volumes, there's a recommended paint. This is something that should never happen and it shouldn't be approved. Do you feel like landmarks? Commission has the necessary expertise to determine in this particular case whether this particular paint was, is okay or not? Okay, Paige, that's kind of the thrust of where we've gone with this resolution. I agree, but I think it can be a little stronger because you can quote the fact that the guidelines state that elastomeric paints rubberized paints are not to be used on historic properties. Okay, thank you. Yep, we'll add that looks like Richard's trying to speak. They call the question Richard go ahead. Richard you gotta unmute I, I'm better off muted, but we disagree to accommodate Paige's comments. Maybe we can say that the community board 7 questions the appropriateness, but leaves it to the commission to determine that something like that. Well, how about we question the appropriateness and note what rich put into the chat about the paint being on a disapproved list or whatever the right wording is not do it I see Paige nodding, I, see Richard, nodding, I, see the clock, says 7:48, so I'm hoping that we are ready to vote Christian. Is there anybody who signed up who speak on this from the public? Absolutely no okay, so those in favor of that now drastically reworded resolution. Please raise your hands blue. If you can physical, if you can't and I'll come back to you again, can you repeat the resolution mark? Could you please lay out what it is now yeah? So, as I understand it, the resolution is to approve the appearance of the paint on the wall, but to defer to the LPC, to note that the LPC has included this specific kind of paint as one that is not approved for this kind of use and to defer to them on to whether the appropriateness of the actual choice of paint is appropriate in this setting did I get that Richard and Kay. Yes, yep all right, mark I think you missed I, think you missed. My first comment that K had said was an okay friendly amendment, essentially that to reflect that they've already done it, and this would be without a landmarks, LPC approval or ours for that, oh legalize yeah, legalize, yes, I got that unauthorized, existing condition, yep, K and Michelle are actually taking the notes. Okay, so with that in mind, either raise your hand or don't mark. Is this resolution? Is this the new resolution number four? Now it is the resolution number four. Thank you, and so the amendment was considered friendly. So we no longer have a yes, no on the correct the waterproof we're just okay, so I see a lot of blue hands and then I'm gonna look for physical hands and I'm gonna add my own to it. That's one. Let me go to Christian is two Shelley is three Peter Sampson is four Doug Clyman is five I see Ethel is six I, don't think Blanche is raising your hand Paul Fischer. Are you a yes? Your, yes is seven. Let me keep going I already got Peter Sampton right, okay, so I have seven plus 32 is 39. Thank you. We're gonna lower hands. Anybody opposed I just want to clarify Paige voted in favor, so she's, okay with it with the amendments yeah, okay, Louisa I, understand that. But the thing is that you don't have to explain your vote. No, but I'm happy to I mean landmarks, has very specific rules on what to do. People are going to be complaining about windows for years, so you can't say that. Oh, it looks okay, but it doesn't follow the rules. My feeling people say no okay, so Louise is voting. No and I see three other hands and let me see if there's any other physical hands I don't see any other physical hands. So I have it's yes with the friendly amendment. Can I just ask a question: we're kind of voting, but okay I know you are but I think Louisa raises a point. This is contrary to landmark's own guidelines and I think it should be much stronger. Wait! A minute. Excuse me, the issue: is it doesn't matter what it looks like it's the wrong material but landmarks? Send it back to us. Paige was as clear. So let's continue with the vote all right, so anybody abstaining on this so Mark count me as a no I'm sorry, very good. Hey mark I had a question about the Google form we'll deal with that in a second okay, so I see four hands. I think those were the I'm sorry I think well hands down, because we've gotten the no votes now we're going to take abstention, votes. Anybody abstaining on this mark. Is it okay if I change, to an abstain from a yes, that's? Okay, thank you. Okay, so I see one two three abstains now. Is that what I'm saying? Okay I changed my vote to abstain. Thank you! Okay, three, four, all right, so I've got four abstentions, so I've got nine and seven is thirty. Six now I've got 36 to five to four to zero, okay and that is it for preservation. Thank you, Michelle and Kay. Thank you thanks, Kate yeah. Thank you up. Next is Clary and parks and environment. Oh hey, mark I had a question a clarification question about the Google form, so this is number four yep still yeah and it's number four. Yes, then we're in favor of the amended right in favor of the resolution. As it's been amended. Okay, thanks! Thank you! So Clary take it away or do you want the slides up ladder? You have to move all right, you're right, I've unmuted! Do you want the slides? Yes, please! So that's not our slides it, but it's on the same program. I'm not criticizing you! There we go okay, so this is a project in Riverside park at 107th street mid-level between the lower level and the top level is a set of stairs that is in terrible shape and it's right next to a charming structure that I think doesn't necessarily show on the slides, called the volunteer house that was renovated restored about probably 15 years ago. Actually, the architect on that was one of a former member of our committee and our board, but anyway the stairs are in terrible shape and there you go that slide. This one, that's! Okay! Here's this! Here's a slide of the stairs in terrible shape, so terrible that it's been they've been closed for a while and that's a big functional problem. So what's particularly interesting about this project is not so much the physical project, but the fact that it's a collaboration between Riverside park fund and the parks Department, where a donor- and we don't know who it is- gave. What obviously was a lot of money to the Riverside park fund is 750,000 or more because that's the cost of this project without specifying any particular projects that use it. As you think is most important, and so in collaboration with the parks Department, the Riverside parks conservancy that received the money, chose to do this staircase because there's such an urgent need and the dollar amount is within the amount that the donor has given. But the great thing about that, aside from this wonderful donor, is that, because it's not being funded by city funds, the parks Department can do the project but minus many of the 200 plus administrative steps that are required, not this type of stuff but administrative procedures that are required. When the city pays for a capital project in the parks it can go much faster. The procurement process is can be radically simpler and much. It ends up being much less expensive because it's minus a lot of these many administrative steps that just end up costing money. So we're very pleased about that. The project itself, you can see what terrible shape these steps are in. Please mark if you can get the next one okay, so there on. The right is an example of a very similar set of stairs that was restored in 2009, and the left side is a little too difficult to read on the slides. But basically what's happening is that the risers are being replaced, the there's a new, concrete under structure and then the risers have been replaced and the steps themselves are the Tre the riser. These threads rather are being replaced by new bluestone. Unfortunately, although we always look for some increased degree of permeability in our projects for ecological reasons, because the concrete itself is solid, there will be no more permeability here than there was, as these were originally constructed by the in the Robert Moses Era, but they will look gorgeous and they will be consistent with the way in which other stairs have been restored recently. So that was that's slide number eight. Let's see nine and ten I, don't think, there's much new okay, so here's 87 street stores that were restored 107,110th street and on the left, you'll see what this blue stone is going to. Look like and here's a couple of other and oh I know they the hand rail is not the handrail. Current handrail is not consistent with required with ADA requirements, so the handrail is going to be replaced with a very simple central handrail. Sorry, that's my husband calling on all my phones anyway. So that's that we approved it. We were very pleased with it and it because one other thing, because we've been talking about landmarks all night, the park is a scenic landmark, because this is really more about function in a park and not a major building reconstruction, as we typically do. Our parks and Environment Committee considers projects like this, but what we always have in our resolution is something that refers to the language of appropriateness. The Landmarks Commission is always an advisory as we are advisory. It too is advisory on city projects like this, so it doesn't go through a hearing, but we incorporate in our resolution, as we've done here, language about its appropriateness to the scenic landmark. So that's the story on this one. Okay, questions: okay, Clary! This is Irena. Is it these steps? Don't appear to be ADA accessible or not, no they're, not so no there are steps, there's no way to try. There are steps, okay, so there's no ramp or no it's not a ramp. I mean it will get the railing. But it's not a rail and it's not what's called a step ramp. It steps it's steps, yeah, that's what I thought thank you looks like Janet has her hand up: okay, Jeanette, yes, sorry as soon as I went to hit on mute, like an email came and it opened up a website so I just had you indicated that the donation wasn't specific to the project and that they chose these steps, which you know all seems good I, just wonder a little bit further north. The drainage is really bad where you have a lake and you can't even walk along the path and if anything could be done there temporary or something what part of these funds? Well that's a completely different question, but I. Let me say something about that. You know this project is a given at this point. The parks Department consulted with the conservancy and it's possible that there was more money to this donation than the 750. We don't know that we don't know who the donor was, but so that's the and this was an urgent repair and so everything fits and there that's what was chosen but Jeanette. There is some good news about drainage there. We have it our budget priorities, but I think that the parks Department has Gosh. Who could remember this can do you remember, there's money, I, think coming along for pathway for drainage and redoing some pathways, particularly in the exact in the general area, you're talking about the higher end of our district and then further up as well, so that should be coming within the next year or two, but it's not part of this project. Okay, thanks. Let me call the question sounds like we can all those in favor. Please raise your hand now blue. If you can physical, if you can alrighty so in terms of the physical hands it's mark is one Christian is two Shelley is three Peter. Sampson is four. Let me see. Rich Robbins is five Doug Kleinman. Six Louisa Craddock is seven, is Paul. Fisher voting looks like I got a yes there, that's eight Blanche nine. Thank you blanche and that's all the hands I see plus 33 is 42. That might be all of us, but let's lower hands, okay hands are lowered. Anybody voting against, don't see anybody nope anybody, abstaining, don't see anybody and it looks like nobody's ineligible for cause, so I have 42 to 0 to 0. Please remember to mark your voting sheet accordingly and thank you Clary we're moving quickly on to Y-E-l and that will be Stephen and Blanche. We have one public member to speak on this one on number: six. Okay, thank you great Christian. Could you promote that person to panelists so that they're ready right yep? Thank you great. So we have a res yl resolution as a background. This specifically came days after the New. York City closed the school, so it was a bit not say reactionary, but it around that context. So, specifically, there was a conversation about that. We had a board talk around those concerns and we came out with a resolution, specifically speaking to a couple things that matter: I'm not going to go through the whole resolution, because I think it would take some time, but I'll do some highlights. I first want to start out by thanking Catherine who wrote this. She wrote an incredibly comprehensive, incredibly intelligent and I'd say the word lovely resolution and I would note for future. She has footnotes in here which I was incredibly impressed and I did not do that. So I had to make sure that I said it was Katherine, but it was a really great resolution and very thorough and very comprehensive and I. Thank her a couple points in context. The context was that this was days after the schools closed I, think there was a series of facts that were frustrating one: we've put out a handful of resolutions out of yell I. Think one of the things we've consistently been frustrated with, as a group has just been processed. So from the process itself there always seems to be inadequacy. So there's a lot of conversations about process and I. Think, there's also a lot of frustration about how things are made, how these decisions are made. They're off some people use the word black box, but it seems to it's difficult to get how decisions are being made and I think this plays into the context of this. So with that, I'm not going to go through the, and thank you for Christian for bringing this up, but I'll go through a couple highlights context and then I'll ask for questions. So the background is a couple facts to speak of. This was in lieu of 11 on November 18th. The city's closed because of the positivity rate, one fact to know that in the school system is closed, based, the school's closing is based on a city or regional test, positivity rate in New York city. It's a city-wide three percent test, positivity rate over a seven day, rolling average. It is a single metric that they're using, and that is a threshold for schools, closures and that's why it closed. The resolution goes on to speak eloquently of a series of things. It goes to a background of a lot of safety issues and concerns and facts that are recommended through closings. It brings up some busing issues and concerns that was brought up across the by board members. It specifically continues to speak about the challenges of remote learning and the process for which that is being rolled out or enacted specifically goes on to talk about process. I'll quote a couple of lines here: the New, York City has not presented or executed a plan for meeting the education or and comprehensive needs of all students remotely including students in district 78 district 79 schools, which are very unique for people that may or may not know. The dnd does not appear to be prepared for the transition just for school openings or closing. So I think that we're consistently are concerned about the preparation. So we then go into resolve, ask for resolve and there's a series of ones that we do again. I'm gonna run through and highlight and speak to the last one then open it up for question, specifically we're asking for the mayor, the Department of Education Department of Health and mental hygiene, health and human services to develop a robust and evidence-based approach to school bus safety, openings and closings. There's concern that there is not a process, a robust process for that. There's also a concern that not enough people are being brought into these conversations that it's being done by a few people. So it asks for the video he should survey administrators teachers, staff, students, families guardians they should continue to consult with superintendents and the Cec. We think it's very limited in terms of how they're making these decisions a handful of other things that are asked for as a DOE to develop and a target education plan for New York city. It has for a user-friendly and accessible website to communicate and then specifically about the closings and about this three percent threshold, which I think was a conversation of much debate. It asked for the mayor and asked for the governor as well and the DOE to create an interagency and cross-section task force so that there's more people involved in decision making. It asks for a consistent criteria and he asked for multiple metrics and it says that because, since the three percent I'm gonna pause for many and get back, the three percent rate was done back in May. Since then, there's been a tremendous amount of learning, there's been a tremendous amount of data and what we keep hearing is: oh, let's learn and I think we're trying to encourage to say: there's lots of information, lots of data that has happened. One specific piece of data that I will bring out is that we have learned that the schools in itself are very safe as of this date, and this could have changed, but around the 17th, the school system randomly tested more than 71,000 students, 42,000 staff members across 3,000 schools. Only 189 came back positive, so it is it's fairly factual based on that data that schools are safe. So that being said, I'll just continue on. We want the task force. Should the cancer should include DOE leadership and constant cons? Constituents again ask for more people in the room, but it said it should consider how test positivity rates are determined for what geographic areas as well as whether or not schools should be closed for the population and level. The decision-making process should adhere to recent research, statistical, sound methods and public health guidelines. It talks about a handful of other organizations such as the who, which has different metrics, that they're giving guidelines to, but they wanted to make it appropriate for New, York City and according to the standards of fairness and I, think a really nice line to end it with is that children and you should not bear disappropriate burden to New York City's effort to reduce Covid-19 transmissions and outbreaks or suffer unnecessary consequences for New York City's response to the pandemic. So with that I will pause or and look to ask questions. Look for questions, I, see a handful of rape and in no specific order. I see Christian with his hand, raised yeah if I think. If I may, it seems to me that some of this is obsolete. Now, based on what happened this past week in terms of what the announcements that came out as to the reopenings of the schools on December, 7th and so on, I do commend. You know this was very thoughtfully done and the result of and I a lot of what you were proposing is still should go forward, because even though they have come with a new plan and which probably aligns with a lot of what you were asking for, I'm sure they know they're not still involving enough people on it and I wish. We should make that point. I, think we agree and I think it's been acknowledged as an update, since this was done between now and then number one. There was a sense of urgency to get this out and there was a lot of debate whether to wait. I think, I'm still very happy. We did that the it was just announced just for everyone and I think that's what you're alluding to Christian is that the elementary schools will be opening up middle and high schools are still not, and there was some conversations, but by some of our committee members to ask me to put some friendly amendments to address that I think we agreed to that. We can get into that, but there was context of that to tighten that up. But as of now, there still is not element, they're still not they're, not opening up secondary or high schools, and they still have not said how they even determined to open up the elementary schools. They just said: they're opening them up so I think that process is still confusing. I'm going to go through the raised hands and they're, also blue hands. Ethyl I. See that your hand is raised so I will go to you. Thank you. I have I absolutely admire the effort and I think it's daunting and terrific I am having engaged in such things myself and having been forced to have footnotes and so on. I would only suggest that it is very much not necessary for community boards, or at least this one to be writing resolutions with footnotes. I think that things can be targeted, simplified focused as appropriate, I. Don't think and I think that something that has some of these scholarly references, wonderful as they are, does not necessarily help the communication, which is appropriate to our role. That's in general, I, say it respectfully and with admiration, but I, don't think it's at all necessary I do more important I. Do echo what Christian just said: I appreciate that you did all this work and that there have been significant changes in the very last days. I think that it is important to acknowledge. In fact, what has occurred and I am a layman in this, but even as I listen to you Steve and the summaries, there have in fact been both on the mayors and the governors for and others clarification for better for words, but discussions and specific clarifications about the positivity rates, the variations, how they are being evaluated, both in the city and elsewhere. That's just one example. Secondly, the recent changes and the openings have been again for better for work, but they have. It has to be at least acknowledged here, because there has been some kind of adaptation or change, and that is that there's been considerable coordination among and between the unions, the teachers and the city, the mayor and so on. So that I would only suggest that in order to have I, think I really respect this, but it would be helpful to focus target and make some of the points that you want to see continue in the future. While acknowledging, in fact, some of the criteria that have been used and in fact some of the enunciation on of the plants in the future and I would suggest that, for example, in the late reading that I've done, I read the New York Times and I read some of the publications. Today and again, I'm a layman in this. But there were a number of sophisticated analyses of how this was indeed. Finally, an excellent effort, one with criteria and beginning to recognize how many of the shortcomings of the process in the past and that this has been good and may continue to be so I think targeting being very specific, not as worthy wordy and finally getting to what has occurred, but what needs to occur in the future and just making those distinctions. Well, thank you Ethel a couple points and mark. Maybe it's the second time someone brought up the new, the updated grammar schools while I speak to this. Maybe you could pull up Bev's note about the friendly amendment and we could read it, but Bev did send over a friendly amendment and perhaps we'll add it. So we can address that and it will be in here. There was a friendly amendment between the committee members and we're going to add it, but I did want to mention one thing Ethel. As of now there's a difference between what is the criteria and then what people are talking about and as of today, even though you may have read, there's data coming out in the New York Times. There is one official criteria for opening closing schools as of today, and it's a three percent rolling average that has never changed. They haven't evolved that they haven't presented any new numbers. They haven't presented a new criteria, they've talked about it, but that's our whole point. There is no new criteria, there is no criteria other than that, and that is the whole point of this, and specifically, I'm just going to say we're asking for a consistent criteria and multiple metrics and that has not been met today. Even though they opened the schools, they didn't even say why they didn't. They just said we're opening the schools. There was no we're. We have now looked at the three percent and we're gonna have x, y and Z. They just opened the schools and it causes parents to continue a parent like myself and others that you don't know what the metrics are. There's still a feeling that a dart often goes on the wall, and they say it feels good to open it up. That's my concern, but specifically I have not. There has been no information that I've seen out of the DOE. That officially says we open up the schools, we're moving the rate to this, we're, including this disc. That criteria has not changed. That's not exactly true. They have a ban of that three percent, and the problem is that they really haven't explained clearly what the new criteria is. But then we could just say I, don't think it is a new criteria until they formally explain what the criteria is. I think we're splitting here as I know that they are expanding. It and I know that they're saying things, but there is no formal presentation of the criterion explained and that's what I'm saying I see more hands up. I'm going to pick Shelly because again he's to the left of my screen and I skied that so you're up Shelley you got to meet me I. Think there was a wonderful discussion at the committee and I think it was very timely and very important I'd like to underscore some of the things that are essential that are in there that haven't been addressed by the mayor and the decision makers. Families are not consulted, students are not consulted and knowing from my niece who's a nurse whose assignment is a good part of New York City, to advise as a nurse to advise the school districts and schools. She all the principals she's spoken to complain to her that no one consults them and they don't have what they need and that's as of this two days ago. Even so, you know a couple of days ago and it's been ongoing, so that whole piece of who is consulted and how these decisions are made is still in big question and the second on the criteria. The big issue to me was the single criteria, and maybe now it's another single criteria and not or more but not explained we yell and scream when one criteria is used to evaluate a child, that it's not fair, that the child should have many assessments and modes of assessment to evaluate, but when it came to a decision about closing the whole school system, it was 3.0 very sad and I. Think that's why these pieces and others in the resolution are crucial and be necessary ongoing. Not only for this situation but for the way major decisions are made that affect the children and the families of our community and of our city. Thank you. Shelley we've got some other board. Members and I do remember, mark that we have somebody in the community, so I haven't forgotten that yeah and it's gonna be funny. So let's try to move along. Actually, the person from the community have made a mistake. He's going to be speaking at the public section: okay, great one, more time: Catherine Captain! Are you still there yeah? Thank you for everyone's comments. So far, it's so helpful to get comments both on the issues and also on the resolution itself. I first want to say that with something you know, part of what was discussed at youth education. Libraries is the difficulty of writing a resolution on something. That's this complex and that's so high-stakes a concern was that we're, not public health experts, I'm an educator, I've taught in public schools, but we don't have the expertise to kind of make these to make claims, and so that's why I think it's so important to include information and that's why we conducted research I want to make clear that this is not written in a these. This is that we're not citing scholarly sources or citing this in an academic way. They're links to reports that are in the public discourse with really helpful information as a board. We can't just make stuff up or make claims based on beliefs our opinions, especially with something that's complex, so I think it would have been irresponsible to not include evidence and cite the sources. I wanna say very emphatically and I learned a lot through this process that remote learning has been harmful and is not as effective by a lot by a long shot as in person learning and the disruptions, and the chaos has been really harmful for students. There are students that can't even be accounted for. Schools don't know where they are and with this level of disruption, New York City is going to lose some students that are in the system that just aren't going to come back. So it's really scary what the impacts are of having such a chaotic process and there's a ton of options in terms of improving safety in school or improving safety protocols and making sure that schools are adhering to those protocols and then communicating that to families, so they feel safe. Sending students to school and the other piece is that private schools are taking a much more nuanced approach. Many private schools in New York City, where there's a lot of options for how to close when to close, and so I just want to emphasize that the process does need to be improved not only and both in terms of taking into account recent research by public health experts, but also taking into account the rights of students and families, and there are a lot of options for improvement, and this is going to continue for the next year, because this one instance could be resolved and then it's the next thing down the road. So that's all I want to say and I appreciate, Stephen and Blanche for bringing this up and facilitating this process. Thank you, Catherine Mark. Could you just read Bev's friendly amendment and then I think we have three more hands up that I see if you don't have it up, I'll get somebody and come back I. Think in light of today's announcements, does it make sense to offer a friendly member of the resolution recognizing the lower grade reopening for some and the movement away from a blanket three percent rule as positive first steps? That's the that's! What I have yeah and then she I think that's the sentiment that I think there was maybe some back and forth between us, but it tightened up, but to both Christian and Ethel's point just. It was in addition to the second bullet of fact, which would add a an understanding of what the current status is subsequent to the writing actually of the resolution. While recent announcements for the planned reopening of elementary schools and district 75 schools show movement away from the three percent metric, it is unclear what criteria will be used in future to trigger closures or to reopen the upper grades. So that's going to be added as a friendly amendment. Hopefully that addresses some of the concerns that were brought up. Let's move, we got three more hands up Elizabeth. You are up hi Stephen, thanks to you and Katherine, and the whole Yel team. This super timely and your quick response to turn around a resolution like this is very notable. My question is more of whether we would consider I, don't know if it's a friendly amendment, but for those of you who have been reading about this issue in the news over the last weeks, this has really been a movement that started with parents and a group of parents. It was not done by our elected officials who would not stand with them. Very few of them actually stood with them during this. So I'm wondering you know just to bolster their cause. If there's any reference or friendly amendment, we could make that just shows a sign of support for what these parents did over the last two weeks to really put pressure on the mayor and the governor to get this done. I think that would help them with their cause. I mean they still have a petition out, and this is just one step in a long road for I. Think keeping the schools open I'll stop short of thinking. We should you know, sign on to their petition or anything like that, but I think it would be worthwhile to perhaps you know, give the parents a shot on the arm by maybe adding a clause or a reference about their hard work to get. This done be happy to take that as a friendly amendment and we'll we can add a line to acknowledge that thanks Ira, you are next and by your facial expressions. You are very eager to speak, so mute unmute yourself trying to keep this brief. We were talking about parents, I'm a parent. I've got one kid one child in elementary one in middle and one in high school we've been in distance learning, remote learning, whatever you want to call it now for nine months, it doesn't really work. It's more remote than learning the slight in part of blended learning that we have is relatively ineffective when it's one day a week we have one youngest is: has remote, learn sorry in school learning, two and a half days a week that seems to work a little bit better. Just so you understand what is meant by in-school. Learning is not anything like you or I recognize. It is a very different experience as well we're in almost constant contact if a day goes by without something for one of the principles, if not two or three of the principles. The communication between the Central Board and the principles is quite awful Sheldon. It has not improved. Since you spoke to your relatives, the principals are still fairly unaware of what how this is really going to play out even at the lower levels, where they're going to implement it next week. They know they're going to be back in some fashion, but what has been portrayed as getting rid of the remote learning in the elementary schools only will occur in those schools where there has been a very low level of sign up for the in-school portion. So, for example, if you have a kid, a school classroom with four kids in a classroom now you might be able to go to that 12 and have those just those remote seating, six foot with masks and all the other stuff which is a bit different, but from many schools, particularly in our community board, where there has been a fair number of students who have signed up for the full-time or part-time in school, whatever part-time they've got is what is gonna stay. What's gonna be here so when we say that things are still floating around, that's exactly what's gonna happen and there's not a word about the middle schools. The governor says, eighth grade the mayor says six fifth grade so the mayor and the governor, and then they start talking Orange and yellow and red. And what happens if you have those zones and that's another overlay, so the governor and the mayor still have separate ideas. I listened to the governor for 40 minutes yesterday and the governor trumps, the mayor, there's still other lawyers here, I'm not going to go on, but it's not what the papers portray it to be, and that's what I want you to understand and we got into this without much of a plan. We hit the three percent trigger and we really don't know how to get out of it, and that's really the point of this resolution. I hope is how do we get out of this now and that's what I got to say thanks Tyra I think those last two points were very in sync in the sense of, but you know, I, don't think the papers are an accurate assessment as well and let's keep moving okay. Sure I think we have two more I see Ken with the blue hand, and I saw rich, raise his hands, so Ken yeah I think it's pretty clear that they have moved beyond the three percent. You know I think we need to give the decision makers here at the benefit of the doubt. None of us has been through a pandemic before or specifically with this virus. The science continues to evolve. They realize that elementary school students are much less at risk of transmission, transmitting and they're, also at great risk greater risk than middle or high school students of having real damage as a result of not going to school. So they made that decision. So it's pretty clear that they moved beyond the three percent. Their ideas are evolving on this and so I think we should give them credit for that now. The other thing is the process which you're objecting to, and it is good to have as many stakeholders as possible, but the problem is you don't want to. You also have to be able to be very fast on your feet, because this virus is changing. We've got a surge going on right now and you've got to react very quickly, so you don't want to do anything. That's going to bog you down where you can't react quickly, so I'm very inclined to vote either now or abstain for those reasons. Thank you. Ken Rich yeah, similar lines that I was going to say. Definitely appreciate all the work on this. Obviously this is a tragic situation, but it's not the mayor's fault it's worldwide and the fault of the virus and really hard to get this right. I do think the announcement this week that came out. Obviously, since this resolution was written about elementary schools, does seem to use an ev, a robust, evidence-based approach, at least with elementary schools and I. Think. The other main factor that we're not discussing here is that the teachers union has massive control of the situation, I'm not sure of it, but I think that the three percent guideline was what it took to get the teachers union to agree to open the schools at all, so I think De Blasio's hands are tied both with the teachers Union and he's got Cuomo looking over his shoulder and has the risk of Cuomo overruling him at any moment so I mean it sounds like the main issues that we have are lack of transparency and also a lack of involvement of many other groups. Now we don't know if there might have been some representatives of some of the groups that we talked about. Principals, students, parents weighing in we know they're, not surveying every parent, because I'm one I haven't been asked, but I think Ken's point was one that I was going to make as well, which is we've got to balance the call that we want for them to make robust evidence-based decisions with getting viewpoints of a lot of different groups, and those two often can be at odds, and it might be a case where the more people you have involved, the more of a cluster f. You have and the less that you have those experts who are making really good evidence-based decisions, especially when you've got the union that has massive control and you've got the governor weighing over. So I think we should think about what we really want to get out of this and what the goal is of doing this, and also think about just what the constraints are on the Doa and De Blasio. So can I respond to that, I'm going to respond, First, Catherine and then I'll respond. So just certainly a couple of things, I agree with and certain things I clarify look. The union has edible influence. I think we've stayed clear of that. As the third rail I think your point about De Blasio, you know not having to pandemic yet I agree. It's a pandemic. I also think that his job is to organize this and in September, as you must have kids too. You know when you have three stalled, starts. I, think my opinion in other people is that it wasn't planned very well. You can't control what happened. You certainly could plan the process. I know in May. He said: May was too early to start talking about education. I think that's absurd, so I just want to speak the facts of that. I'm not happy with what he's done. That's just my personal opinion and I. Think it's in there I'm not a I'm not going to praise De Blasio for anything he's done around this plan. I actually look happy that he's forcing the schools to be getting schools open, but I'm not comfortable with his plan his process. You said there wasn't about information, we do know we did bring in constituents. We had principals, we had superintendents in a previous meeting. The blanket statement is, none of them have been involved in the process, yet they are doing it and you have the principal's union literally doing a no-confidence vote and asking it to go to this state. So you know we're not just I. You know, I, agree that you can't have 500 people in the room. The idea that you would have principals, who have to do everything and have some representatives in the room would be it would be advantageous. So I think that's an example. My understanding is it's a very small room that are making these decisions. There's a handful of people there's a little bit of under unstated things because we didn't want to kind of. There was some back and forth between the committee to make a compromise, but I don't believe it's a robust process for people making decisions and in terms of I just want to be clear, even though that they opened up schools. There is no change of the thing. There was no new metrics. There is nothing right now. The school's closing rate is still three percent rolling average and the middle schools and high schools are still closed and they've pointed oh we're seeing these things, but that is the formal position and until it is formally changed and then rolled out to other schools, that's the school I just want to be clear now and whether they just said hey, let's open up elementary schools because there's a lot of pressure. We don't know because the communication is very slim on these things. I want to keep Katherine I heard. I know you have your hand raised. There was I think there was somebody else who wanted to speak and then we could do maybe I know that mark is really wants me to keep moving but I'll. Let you go I'll continue going. Let me just ask if there was anybody else who wanted to speak and then since I know you wrote it. If you can be brief. I know that mark is giving me the interest to move forward. So Catherine did you want to say something brief and then yeah I just want to clarify in response to Ken and Rich. I appreciated what you shared I think. Those are really great points in this case like there is a lot of debate about whether there should be mayoral control of schools and whether the mayor should be able to make decisions on his own we're, not questioning that we're not getting into who's involved in the ultimate decision making process. What we're saying is that if you don't involve schools and you don't involve superintendents and administrators and families, it's really hard to function, because, as principals said in our last meeting, which informed our last resolution, they might get a mandate that they can't do. And then the mandate changes a few days later and parents may have no idea what's going on, and so you have to involve people in order to have a functional process and the process does need to improve like it didn't work this time and we don't have evidence that it's going to be okay next time and the priority of this resolution is to advocate for the process to be better in every way we could think of in order to advocate for children, because they because they're not being taken care of well enough and that's not okay and it's very high stakes for them and that's the purpose of this resolution. Okay, thank you. So someone want to call the question because I know I think we're ready to call the question okay. So the question is cool. Question is called those voting. Yes, please raise your hands now and then I'll get the blue. If you can and physical, if you can and then we'll. Okay, all right so I see 26 blue hands and then I've got Shelley. Let me see I've got Doug. I've got not Shelly again, I'm sorry. It's jumping around I got Shelley and Doug Clyman Paul. Are you in or out on this one? What is this? Paul is yes, thank you. That's three Blanche's Mark Blanche is yes, that's four! Okay, that's four plus 29 is 33, so clearly it passes hands down. Please anybody. Voting, no I, see one blue hand anybody physical hands voting. Now let me just double check the next page, no just the one. Okay, so one voting. No anybody, abstaining! I am me too. So I've got one. Let me see any other physical hands, abstaining, Christian and mark okay and then Andresa and who I'm sorry? Actually she has an option, that's a blue hand. So I've got six. Let me just double check the next page, half always one more. So I'm sorry and then there were six plus three is nine. I'm sorry, I lost Count, Peter Sampton, I'm sorry is ten. Okay, there were no voting. No right I got that right. There's one voting, no one, no vote, okay, thank you and then nobody's ineligible. So it passes. I'm going ineligible. I've done work with DOE, okay, so 33 to 1 to 10. To 1 the resolution carries I was trying to game when folks would, when we would hear from elected officials I. Obviously misjudged I see that there are two elected officials that are with us, I'm going to interrupt the business session just for those two and that are those are Gail Brewer and Mark Levine. We are in the middle of our business session, so we'd be grateful if your remarks could be brief, but I'm going to call on the two of them right now, whereas Gail is here. Actually let me I can wait. Mark I can wait. If you want I'm happy to wait, it's going to be another 20 or 30 minutes. So I'm all right, I, like listening all right. Well, then mark Levine, I, think you're under Eric Cuello, so I'm not sure which one to open up. Are you with us Eric? Can you help me here? Okay? Well, it looks like I'm here too and happy to wait along with Gail all righty. Thank you, council, member, that's great okay! So I'm gonna rescind what I just said and we're gonna keep going our agenda. We have two more resolutions to carry. One is the HHS resolution and I'm calling on Catherine and Shelley now and then we have a new business resolution since we didn't hold steering this month. There was a request for a leave of absence by one of our colleagues, and so I'm going to ask for your approval of that leave of absence. That should just take a minute and then we'll hear from our elected officials. Then I'll have my chairs report and then we'll continue from there in the public session, all right, so Catherine and Shelly take it away. Do you want me to call up the resolution after me? Go ahead, okay I'll go first and then I'll call in Shelly. So yes, if you could pull up the resolution, this is written in response to a recent Fbi report on hate crimes and the facts are crucial and so I'd like there to be kind of a visual representation of what I'm sharing. This is our condemnation of hate crimes and support for education and training. Much of a good work, that's already being done in the community. This resolution is based on the following facts: the Fbi reports, data on hate crimes defined as being motivated crimes motivated by biases based on race, gender identity, religion, disability, sexual orientation and ethnicity. Crimes include intimidation, destruction, damage and vandalism, simple assault, aggravated assault and other offenses. According to the Fbi in 2019 hate crimes from the United States rose to their highest level. In more than 10 years, more murders motivated by hate, were recorded than ever before. More rapes, motivated by hate, were recorded than ever before. I analyzed that data myself and it's gone up every year for a while. More almost one in ten victims of hate crimes were juveniles. 55.8 percent of hate crimes were motivated by a race, ethnicity, ancestry, bias, 21 by religious bias and almost 17 percent from sexual orientation, bias of race, ethnicity and ancestry. Bias 48 were motivated by anti-black or african-american bias. A religious bias, 60 were anti-jewish and 13 were anti-islamic. What I just cited doesn't include all categories and the language that I use is based on the Fbi report reports, language of increases from 2018, anti-semitic hate crimes, increased by 14 percent hate crimes directed at Latinos, rose, 9 and hate crimes against those who identify as Lgbtq increased, including an 18 increase in crimes against the transgender Community New York City, in particular, reported the following incidences incidents per bias, motivation, 90, race, ethnicity, ancestry, in that category of bias, 266 in the category of religion, 53, sexual orientation, one disability, zero, gender and 13 gender identity. I do cite the Nypd's hate crime reports. If you want to look at that information so far, you can scroll down mark. Thank you. So far in 2020 there have been reports that there's an increase in bias, crimes against those who identify as transgender and asian American Fbi data under counts, the number of hate crimes in the United States. For two reasons. The first is that local law enforcement agencies are not required to report hate crime data to the Fbi. So last year 2172 agencies of 15,000 reported data according to the Fbi. This represents 93 percent of the U.S population. The second reason that this is likely an undercount is because many victims do not report incidents. Previous Department of Justice studies estimate that an average of 250,000 people are victimized by hate crimes each year. According to the 2020 department of Homeland Security report, and this just came out in October called homeland threat assessment racial and this I'm quoting racial and ethnically motivated violent extremists. Specifically white supremacist extremists remain the most persistent and lethal threat in the homeland white supremacist extremists have demonstrated long-standing intent to target racial and religious minorities, members of the Lgbtq plus community politicians and those they believe, promote multiculturalism and globalization at the expense of the white supremacist extremist identity. Since 2018 they've conducted more lethal attacks in the United States than any other domestic violence. Extremist movement, the report notes that quote racially or ethnically motivated violent extremists could seek to exploit concerns about social injustice issues to incite violence and exploit otherwise peaceful protest movements. End quote: the number of white nationalist groups grew 55 between 2017 and 2019, therefore, be it resolves that community board 7 rejects and condemns all forms of hate and white. Supremacist extremism affirms every person's rights to freedom of expression, protest and safety and stands in solidarity with all those who are targeted because of their race, ethnicity, religion, national origin, gender and gender identity, sexual orientation, immigration status, disabilities and all other classes protected by New York City Human rights law. It further resolved that community board 7 calls on the mayor to include more robust, anti-hate crime and community resilience, which is art curriculum, which is already committed to appropriate for in-person and remote learning in New, York, City schools, and we also call on the Manhattan district attorney's hate crime unit to provide more education, outreach to schools, community groups and religious organizations on strategies for reporting and identifying hate crimes to law enforcement, as well as information on available resources and supports which they already do. We also call on community board. 7 Manhattan also calls on New York City to provide the Manhattan borough president's office with resources needed to continue to build on their effective diversity, equity and inclusion. Work they've done great work, so we commend them and we thank them and we would like there to be more of that. Importantly, they ask questions on community board, applications related to demographics and they make this public this data publicly available. In order to evaluate whether community board members are representative of districts, they regularly review and modify the questions to enhance both data and the review process. To enhance this further, they could include more questions and possible responses related to demographics and applicants, experiences with diversity, equity and inclusion work. It would be great if we had even more information about representation and also community board people who are applying or who are current board members, their commitments and their experience in this area. The Manhattan borough president's office also provides board members with diversity and equity and inclusion training in collaboration with the New York City Commission on human rights. As we've discussed a lot as a board with additional resources, they could provide even more support for our board and for other community boards to address issues specific to our boards and districts and more guidance for us to develop diversity, equity inclusion, task force and committees, so that boards, including community board 7, can take more proactive stances and also develop strategies to address individual and community bias that biases that lead to discrimination and hate crimes. So the assumption in that resolve is that we all have responsibilities here and we appreciate the work of the Manhattan borough president's office and would like to see even more of that via further resolve that community board. 7 Manhattan calls on the NYPD to continue to improve data collection and reporting on hate crimes and provide training to improve trust between law enforcement and communities to encourage more reporting of hate crimes. So thank you for listening to that, and does anybody and I want to hand it over to Shelly and then hear any questions and comments? Okay, I think that's comprehensive, I think it says a lot, but I think we're on our way, because and I'm glad the borough president's on, because I think it's the first time with this training where it has been explicit, it has been targeted, it has been a diverse type of diversity training and we especially to underline that we need more of it and some way we can bring this home to the individual communities to make sure that we are addressing the issues of diversity and equity in our community and not leaving out groups or not being sensitive groups or not doing a type of outreach. That is necessary. It's not enough to say you believe in something we have to live it. Okay, any comments. Questions looks like you, have two hands raised: Linda Alexander and William Ortiz, please Linda and then William I want to commend you for a really thorough presentation, and thank you very much. I also want to say: I didn't see it because I would have read it I think it's even more effective when we're able to read it and it doesn't have to be recited. I want to thank you for that. It was took a lot of time to prepare, obviously, but I don't see it in our resolutions or our minutes, so I would I posted on the I'm sorry. It was posted on the website and we did circulate it this afternoon when we realized that there was a that's, probably working but okay. So maybe if we did a more timely way, we would be able to read it in the future. It's very excellent and very thoughtful and thank you very much I think that's really good feedback, Linda and I appreciate it. The reason in this case that and yeah we I- we did submit it last week and it just the complete resolution wasn't available in this case. I think that the reason I think it's important to make sure that those facts and that information is heard and that people have people are able to take in the specifics, because I think in this case it's the specifics that matter but I. Thank you for your feedback on that. I. Think it's helpful. My point is that if we have been able to get this on an earlier basis, we all could have read it and really appreciated how thoughtful it is rather than hearing the basic presentation. Well taken yes, William hi, can you hear me I just wanted to? First of all, thank you for writing this. It's extremely important- and you know hate crime- is something that's very terrible and anything that we can do to help educate people on diversity. Inclusion is really important to me. One thing that I noticed that wasn't on here, but I assume is not part of the language. Is there any way to add and offer protection for hate crime if it's classified as hate crime to lower income, people or homeless, people who may be attacked, assaulted or just or you know, misinterpreted? There's a gentleman who sits in front of our building every day my parents building every day on Amsterdam and he's he just sits there and I think it's just he rather be outside I'd rather be outside and inside and he's harmless he's a nice guy. He always asks for some change, but I worry that one day someone will just you know, do harm to him and I. Just don't know if that would be classified as a hate crime or just as a violent crime. So I wonder if there's any way we can offer some protection against a homeless or even just low-income people I think. That's a really good point. If I think that there is a way that is that's not in the language of the that's not in the language of the either the Fbi categories or I believe not in the language of protected groups, according to New York City Human rights law, but that doesn't mean that we can't include that in the resolution and so I think we could. You know I think we could say something to the effect of that. We say something to the fact of, and anyone who is vulnerable, including people who are homeless or low-income or something to that effect that are targeted because of their position. I think we can incorporate that into in what we condemn and also what we're asking to educate people about. I think that would be easy to do. Yeah I totally agree, it isn't in the protected classes, but it's point very well taken. Thank you. Will you thank you guys so Mark? Is that a friendly amendment, or how do we do that? Yeah? That's a friendly amendment, you'll write it up and make sure that we get it before we send out the resolution. You'll also tell me to whom you want the resolution to go. It looks like Ken has got his hand up and then I'm gonna move us along if I can yeah I, just the, whereas portions of the resolution all addressed hate crime, which you know which we all would decry and the first part of the resolve, addresses ways to reduce hate crimes which is really important. But then it moves suddenly to Dei training, which is really doesn't have to do with hate crimes, but has to do with addressing more subtle forms of prejudice, and so I'm wondering whether they, both those things, belong in the same resolution. You know the interesting thing: I learned in education if someone says a word to someone and it isn't addressed or breaks their pencil and it's not addressed over time. Things escalate and be, and more bullying takes place and more expression of prejudice, bias, bigotry and so on and eventually leads to hate can lead to hate or feed that so I think it's all connected. Okay, it's different levels but I understand your concern, but I think that's why it's there. We have to educate people on the community level about what the bias is. What prejudice is what how to appreciate and the richness of difference among people rather than be uncomfortable, and if we can do that and we may be able to reduce ultimately the hate crimes, but point will take him. Yeah I agree with Shelly and can I also just want to clarify that the Fbi defines hate crimes as being motivated by these biases, and that is what the trainings are designed to address and then also we're also calling for the Manhattan borough president's office to have more resources. So they can work with community boards to develop task forces and strategies and stances to address bias in the community that leads to discrimination and hate crimes. So we're calling to kind of address this kind of to take responsibility for this kind of as a community to reducing it in our city and our neighborhood all right. Let's move this to a vote. Shall we question calling the question? Okay, everybody in favor. Please raise your hand now same deal blue hand. If you can physical hand, if you can okay, so I see a bunch of blue hands, I'm going to go to the next page, so physical hands, I've got me. Let me see me: we've got Christian Ethel Shelly is four Peter. Stampton is five. Looks like rich Robbins is six Doug. Clyman is seven. Is there anybody else? Oh fishers? Yes, Paul Fisher is a yes, that's eight. Do we still have Blanche so I have eight plus 30 is 38. Thank you hands down. Thank you. Anybody voting! No, I'm sorry I get the privilege of marrying Zach. Who has somebody needs to mute and then thank you. So I'm sorry, I'm gonna lower hands again and then ask for votes no votes. So if you're voting, no, please raise your hand. Now. Okay, I only see one. Oh there's, two okay and I don't see any physical hands. Okay, so I have two anybody. Abstaining on this one, so lower your hands. Please! Thank you. Anybody abstaining I, see two that are staining any physical hands. Nope very good mark I'd just like to make one announcement. Okay, give me one second I announced the vote is 38 to two to zero, so that so that's that Shelly, real, quick and then I want to get us to one more thing. Okay, our health and Human Services committee meeting for this month will take place. This Thursday the third at seven pm, we're going to meet, to discuss ways to respond to child abuse and support the mental health and safety of children. I'm going to be doing this in collaboration with the safe horizons and New York City alliance against sexual assault, we'll also have staff from the Mount Sinai sexual assault and violence intervention program. We plan to discuss forensic examiner and trauma-informed practice. Training for doctors, physicians, assistants and nurses, child advocacy, centers, child-centered care facilities and possibilities for more free, affordable mental health care for children and youth, especially those who have been abused or in challenging situations. We welcome you to join us on Thursday evening at seven o'clock and just request the zoom connection. Thank you very good. The zoom connection is already up on the website. Okay, I have one new business which is offered by the chair because we didn't hold steering so I. Don't have a steering vote on this. It is a request for a three month leave of absence by our colleague. That's Amy, Hyman. It is required by the borough president's general counsel that we take a vote on these things, so we take a vote on these things. It is a matter of personal, as a personal matter has to do with. We often distinguish between whether a relieve is sought for business reasons or for medical or personal reasons. This is a medical and personal reason relating to herself and her family. I. Commend it to you and ask for your approval to grant that leave of absence. No questions very good, I'm gonna call the question unless anybody has a, as has an issue or a question, so we will mark this on the number nine on the voting form. That's correct. Thank you. So hands raised I see, go ahead and keep raising your hands. If you're inclined I'll get the physical hands in a second, so I'm one Christian is two. Let me see, Peters Hampton is three Shelly is four Ethel is five Doug Clyman is six rich Robinson's is seven Paul Fischer. Are you with us? Yes, thank you. Blanche is a yes, that's, eight Paul is nine Catherine is ten and I don't see any other hands. 10 plus 34 is 44, I, think that's everybody, but let's lower hands. Thank you. Anybody opposed don't see anybody abstaining, one abstention and no one's ineligible. Thank you. I have a chairs report that I would like to make, but I'm going to call on Gail, Brewer and Mark Levine first and then we'll go to that. Then we'll go to the shares report and then the public session so borough president Brewer you're up and then mark Levine you're on deck. Thank you, I will be quick, congratulations to all the work helicopter, so this is an old topic. I want to thank people Adams, because she's been in touch with the people in New Jersey. I've been in touch with people in this Westchester we've been in touch with people who are complaining. The 311 calls are way we're going to try to put together a discussion in December with New York people and then early in 2021 with the New Jersey people and obviously, if there are folks on board seven who want to be involved. Let us know it's we're. Gonna have the Faas actually agree to participate in quotes, meaning they'll, listen and obviously Eastern Helicopter Association, some of the companies and so on, and elected officials. I have to say Congresswoman Saf has always been very supportive. It is an endless challenge, but we are going to keep trying I want to thank Julie, Vettila Martin who's, a West Sider who just got something to say. If you haven't seen it, what an excellent article she went out to New Jersey she's been following it with her app and she's, been done. The kind of research that Julie Vettila Martin does so anyway, that's the story with that. I think you know only too well in terms of education in the general sense, with the child care seats, we got a lot of elected officials to sign on a letter to the mayor. I think I mentioned that 550 slots of child care, meaning head start and child care early childhood education got cut from the rural Manhattan, some of them on the Upper West side, and it makes you live it, so we're gonna try to get them back. We can point out that if you only get three k or kindergarten, you are not getting all day support and you know all you have to do is be a parent. All you have to do is read the papers and talk about what's happened as a result of Covid-19 etc. So we want that those slots back. We have run into the problem, as you know, in Manhattan, where they say there aren't enough poor people and the fact of the matter is they're in pockets like at NYCHA, and then the surrounding zip code kills us in terms of the numbers. People need it, and people come here. Scott Riverside who got killed in this said people come because they work here. They want to put their child in a high quality, all-day support and we're not able to right now they're, not able to at least they won't be next July, also regarding education in the broadest sense, we're still talking about these devices on a call. This morning it was a discussion Midtown with some of the folks focusing on homeless, about the lack of internet connection in the shelters. It's a ongoing issue. We are still we're closer. The controller's office has been helpful, but we still have 50 million sitting in the bank from last year to pay for the devices allocated your money capital money to buy technology. Obviously, it's changed from in school to perhaps needed in home, but you need that device all the time roblox from a school construction authority roblox on the department of education. We now have two letters from DOE and SCA explaining what they plan to do so we're getting closer, but it is a challenge that again, very outrageous. In my opinion, we're still also focused on this director of the public realm I. Think you've heard me talk about it before, but every time I have to deal with another situation regarding restaurants outside which we love I, see the need for it, because I'm still trying to coordinate between the different agencies to make sure this restaurant desert doesn't do what it's supposed to, and there isn't a steadfast person to ask. You have to have several different agencies. I think you know only too well. What's going on with the Lucerne and I want to thank community board, seven, you are known borrowed. Why does not citywide for the amazing work you did along this? Who knows? What's going to happen? The Judge James has said folks have to go to the Radisson Hotel, which is in lower Manhattan I, assume they're gonna have to go next Monday and Tuesday. However, there is a an appeal that has been filed by the downtown residents to try to stop it. That's gonna be her tomorrow, you know as well as I do that has a chance, but that's what I don't know I think it's hard, but I don't know, and the relationship that the West side has developed with these men is very special. It's going to be very hard to lose it and also got a Riverside did get the donor to donate as an anonymous. It's a board member I, don't know who it is, and many of the men at the Lucerne are now working at forgotten Riverside in their green keepers program, so to lose all that not good. In my opinion, in many ways, I want to mention, of course, there's something that Ethel and I worked on recently, and only that push got me to look at the research. But you may know this, but in terms of Riverside, south and affordability. As you know, Riverside itself got 421a in terms of a tax exemption and something that I should have known a while ago. But it's apparently an estimated 304 units on site and 277 off site units have already expired in terms of 421a or they will expire this year and make it very difficult for those who live there, because they do not get rent stabilization and an estimated 447 on sites on site units and 94 offsite are still active, but they will be expiring either next year or 2028. Between that time period, two buildings, 40 Riverside boulevard and 33 West End Avenue are MIH, so they are they're permanent in terms of Riverside center, which is the later version that Ethel and Richard spent a lot of time. On and I did it's 512 units and it's permanently affordable, so they got they're staying in terms of the community board. As you know, the application is due February first for new members and for those who are applying and I wanted to say, I know that the budget is coming up. It seems very early and far away, but it will be upon us very quickly, so December 8th, we have a session to talk about schools and how you can apply and then for nonprofits like culturals, it's December 10th, it's all on our website. Thank you very much and congratulations. Board 7. Thank you for president we'll go quickly to mark Levine and then we'll continue with our program mark. Thank you, Mr chairman, and thank you Borah president, for that outstanding update. I'm going to be brief and just focus on a single topic which is Covid-19 specifically the coming vaccination program for New York City, which I'm sure is on everyone's mind, but first just a reminder of how stark our current circumstance is. Tonight there are over 1200 Covid-19 patients in New, York, City, hospitals, that's the highest number since early June and we're now averaging 2500 new cases a day, and none of that reflects what we expect will be a post. Thanksgiving surge probably won't feel that until next week, so this is real and in fact the health department today made an important change in its guidance for the public they're. Now advising people who are at high risk, which is those who are age 65 and over or those with underlying conditions, to limit any travel outside the home for non-essential purposes and to avoid entirely social gatherings again, the first time since the spring they've offered guidance like that, and it is important and we're gonna need to do much more if we're gonna flatten this new curve. But there is light at the end of the tunnel in the vaccines and, in fact, we're expecting that this month, New York City should receive shipment of between two and four hundred thousand doses, which is a significant start that will mostly be targeted to healthcare workers. There are more healthcare workers than that in New, York City, depending on how you count it probably seven hundred thousand. But this is an important first step. There are many questions about just how this vaccine program is going to be rolled out for our city and real questions of equity that I'm focusing on and in fact on Friday at 10. I'm co-chairing a hearing with my colleague Carlina Rivera, on this very topic when the Department of Health will be speaking on the vaccine plan, invite any of you to join us and to speak, but I mentioned equity, because, yes, healthcare workers should be top priority, but that can't just be physicians and nurses. It should be anyone who works in a hospital in a covered facing position from people who clean the rooms to translators, to hospital cafeteria workers. And yes, when it comes to congregate settings we need to prioritize those in nursing homes. But we know there is enormous risk in jails and homeless, shelters as well, and that needs to be a top priority and when it comes to essential workers, there's consensus around police and fire and transit workers as well. There should be, but let's not forget essential workers in supermarkets, doing food delivery working in laundromats or pharmacies. Let's make sure we build equity into this plan, something I'm working hard on with colleagues on the council and again, which will be focusing on in the hearing on Friday, which I welcome any of you to participate in thanks for having me and I hope everyone stays safe. Thank you, Councilmember Jeanette! Do you have a question for the council member? Yes, I. Do council, member Mark, Levine I understand that there was proposed legislation at the city council related to visitation at hospitals during you know this Covid-19 time and from personal experience we had a lot of difficulty. I had discussed it preliminary with Council member Rosenthal, but I was just wondering if you were familiar with that legislation and if it was moving forward so that in the case that we do have a situation as bad as we did in March and April, that visitation was handled a little bit more consistently and better for the families who are have a loved one in the hospital in the ICU. Thank you. So, thank you, Jeanette that matters entirely in the purview of the governor, so I'll check into it would not be legislation of the council. It could be a resolution on the matter, but of course that would only be advisory, and but this has been one of the most painful aspects of this crisis, for those who have had loved ones in the hospital and for patients as well and I. Think we're all fearful of what could lie ahead in hospitals. I think we can avoid the kind of crisis that necessitated that I'm hopeful we will if we take the appropriate measures but I'll circle back to my colleague, councilman Rosenthal, on this and to the health committee staff to find out about this resolution, but in the meantime, just want to make sure you understand. This is entirely under the governor's office. Thank you for raising it. Okay I see two more hands and then we're gonna move on so Sema and then Andrew see me. I can't seem to hear you you're, not muted, but I can't seem to hear you sorry. Is this better yeah? You got it. Okay, sorry about that. Okay! Councilmember I have two quick questions. The first is: are these vaccinations, voluntary or mandatory for frontline workers, and second, are school staff and teachers also considered frontline workers for this purpose great questions, so the question on whether vaccination will be mandatory has not yet been determined at this point. What we have is really guidance coming out of there's an arm of the CDC that deals with this, and even that would technically only be advisory for New, York, City and state, although we're probably going to follow most of it, I think in practice. However, employers such as hospitals will probably require this of staff and that's not a governmental decision. The government will have to make decisions about broader public vaccination, which will be a later phase, but I do expect that most employers will require this, just as you know, you're required to get your measles vaccination in many contexts, but as for the question of teachers, yes, teachers are considered essential workers. I, don't know how this distinguishing between those who are working remotely exclusively and those who are in person, but certainly the guidelines that are coming out of the CDC do include teachers as essential workers. Fantastic thanks. Thank you. Andrew thanks mark hi, Councilmember Andrew great, to see you too. So the state released a grid, I guess it's like a five-phase vaccine distribution system and in phase two. It says essential workers and it lists a bunch of different categories, including grocery workers. It does not expressly say restaurant workers and then, if you jump down to phase four, it says other essential workers, but yeah on who they are, and my understanding is that it's not clear. Yet if restaurant workers will fall into phase two or phase four I definitely think. Obviously, restaurant workers have been front and center. If you read the New York Times article about delivery workers not directly employed by restaurants, but they work for these third-party applications and their situation. Now it's just really tough. So just say you know any clarity or push to try to get restaurant workers into phase four, I'm sorry into phase two yeah. It would be extremely helpful because there's just a lot of questions, even among restaurateurs about what phase they'll be in and how that will impact, whether or not they're operating at what capacity etc. Thank you, Andrew, I, totally agree and I will bring this up in the hearing on Friday I'll. Try to get clarity, there's a lot. That's not clear! Yet in this state's plan, which is part of the way I'm pushing now to make sure we don't leave any critical people out great. Thank you for that all right. Thank you! So much councilmember, thank you for president we'll hear from representatives of other elected officials as part of the public session, but I'm going to pivot to the chairs report, now a couple of quick things and then one that may take a couple of minutes. First is congratulations to Ethel Schaffer for her very well attended presentation on the zoning and land use and other history of Riverside South and Riverside center. If you men, if you didn't see the presentation, both the recording of it, a link to the recording of it and the slides that informed it are on our CB7 website, it's a terrific presentation, kudos to Ethel and I, commend it to your attention mark. Thank you. Very much. I also want to congratulate Madeline innocent that she's probably left us by now, but Madeline, as you may know, was also a poll worker in addition to all her work in the community and has been profiled for both of those kinds of work. I would have put it on the website, but it is actually part of a church's messenger newsletter thing and it doesn't really seem, like that's appropriate for a governmental website. So I want to call it out and say: congratulations to Madeline, for it was actually written by an editor of the New York Times. So it also is a good read. We can supply it to you offline if you're interested in taking a look, but congratulations to Madeline on all that work yeah. She worked all nine days of the pre of the yearly voting. Yeah I want to remind all of our committee chairs that actually I want to inform and remind, as you know, the Department of Information technology and telecommunications or Doit is our webmaster. It used to be the case that certain aspects of our website, John or penny, could update by themselves. There was a code they could use and put things up in a matter of hours. That is no longer the case, so everything we want to post on the website, including things that are in our news, feed and whatever else have to go through, do it I, don't know whose idea this was I, get the very strong impression that do it doesn't want to this task any more than we want them to have this task. But it means that, and it's not just one community board but 59. So it means that the lead time necessary to post things on our website just got longer. So everybody and we are obliged to post on the website the text of our resolutions. We have done that it came down to the wire, but we've done it. What it means, though, is that we need all of our committees to submit their materials, especially resolutions for the next full board or any kind of agenda items for the coming meetings further in advance than we have already been asking you for. So please we have the agenda for Tuesday, I'm sorry for Thursday with HHS, I'm not sure we have a final agenda for any of the meetings next week. Please may I ask that get done right away and then now the last is a personal matter which I have shared with my board colleagues, but we'll share with the public, and that is that, as some of you have noticed and been kind enough to comment on, I've been having some health issues since last summer, and it's been interfering with my physical health, obviously, but also my ability to work. I don't want to be a drama queen about this. It is not life-threatening I'd rather, I have caregivers, who are advising me that, in order to keep it from getting to be more serious, I need to step down as chair of the board, I am committed to a smooth transition and I have heard from a few folks about ways in which to do this. You will not be shocked to learn that there are many different ideas about how to do. This I interpret the bylaws, especially considering the bylaws as having a great deal of flexibility, since I haven't actually resigned. Yet my intention is to resign as of the January full board meeting at which we would hold a special election for chair I. Would ask that, as many of you as can come to steering- and we will open the floor at steering as a mini full board meeting just for the purpose of receiving nominations, we wouldn't be doing any other work, but we just received nominations for a chair who and then so steering would be. The nominations. Full board would be the vote. I've been encouraged to think about doing this faster and I have resisted. I am finally resolved not to do so. For these reasons, one is that I believe that the full board should be the venue for any vote for chair. It is the one meeting a month that every board member is expected to be in attendance at and if we were to hold a meeting and any other night, I'm confident we would get a quorum, but there might be folks who had a commitment or had a conflict that conflicts with that, and then they would be disenfranchised from voting for cheer and that isn't fair and there's no way to predict that. The other reason that I'm committed to the full board vote is and to the Gen is that it's January it's only a month away. I will stay in office and do everything I can to make sure that everything works smoothly and then to hand off and transition to the next chair as efficiently as I? Can you know I'm not going anywhere? You know I'm not going to leave anybody in the lurch, but it's important that we have an orderly process and part of that process is to make sure that anybody who wants to run for chair has the opportunity to call around to just as I did and others did in the last contested election for chair to make sure that they have an equal chance to be heard by their colleagues and to have an informed vote when the time comes to vote. So for those reasons- and it's only a few more weeks than the steering meeting for this month- that's why I made this decision now. I know there are those that don't agree with this. I'm going to call on the on Josh Cohen, who is the chair of the election committee, who I think wants to address his view or his committee's view on this and then, unless there's other action, I will move on well, I, don't think, there's anything that more. That needs to be said. You know, you've said pretty much everything you've made the decision, and you know we didn't necessarily agree with it. But you know we'll take nominations at the steering committee and then we'll have the vote on the Will board in January. I'm not sure what else there is to say very good I just wanted to acknowledge the significant amount of work done by the elections, Committee Josh and Susan Schwartz. Who also is the bylaws committee. My decision to do this in the way that I have outlined I think is in the best interest of the board, but I deeply respect the amount of time and effort that has been put into an opposing point of view and I. Don't so I don't make that decision lightly, but that is what I think is in the best interest of the board. If anyone else wants to address this issue, I I'll open the floor for a minute and then we're going to move to public session Mark Brad Holman is unattended now very good, so he'll be the next after any colleagues want to speak, doesn't look like anybody does so I am so. Could you promote? Yes, senator you're way ahead of me as always. Thank you, Christian, okay. So well, let's call on I. Don't think anybody else? Oh there is a raised hand who's that authority Catherine go ahead. I just want to say thank you to mark for your devotion, your integrity and your kind heart and commitment on our board and through this process and the transition, and thank you advan in advance for what I and the rest of us know you'll give to the transition process. So I just wanted to say. Thank you very good thanks, so much so Senator Hoyleman, probably not the leading introduction. You were hoping for. Welcome. I'm sorry in your hand, go ahead and second, that I will set up a website for flattering mark later, but right now, I'm going to call on Senator Hoyleman and try to stall for a little bit of time. So he doesn't have to follow that remark, but thank you for joining Us Senator Hoyleman Welcome to Community Board 7. Thanks for having me and thanks for all your work and mark I mean I. Really I'm stunned sitting here on zoom, because you're such a mensch and I know that all of your colleagues agree with you. More importantly, I think the entire community agrees with that. What a wonderful job you've done and continue to do as a community leader we'll talk about it sometime. What led you to this decision? I respect it but I gotta, say we're gonna miss you a lot because you have been the eyes and ears for so many offices. I know I, speak for a lot of my colleagues in government and saying that without you and your leadership collectively we couldn't do our job, so I'm really honored to serve with you mark and I mean that sincerely I'll pivot very quickly. Just to a few points that I was going to raise today. Today's World Aids Day and we have to think about the 700,000 people. Who've died from Aids HIV, while we're in the middle of another pandemic. In so many ways the Aids HIV epidemic. You know led us to this moment in understanding Covid-19. So many of the people on the front lines of Covid-19, the professionals, the professional medical and research personnel were the same people during the Aids crisis. People like tony Fauci, but today, I announced a package of bills that I have introduced with a number of colleagues, including assembly member O'donnell and Assemblymember Gottfried around the issue of pre-exposure prophylaxis, we're going to try to make prep universal, universally accessible to New Yorkers, particularly New Yorkers, who are in communities of color, who have suffered disproportionately currently under the Aids HIV crisis. So we're going to do things like eliminate co-pays ensure that insurance pays for prep as well as post-exposure prophylaxis and even ensure that you can go to a pharmacy and get a prescript and get a prescription without having to go to physician. First, that's my first point. My second point is that I've introduced legislation to end storage, foreclosure auctions in New York during the pandemic. In our district. Just last week, a woman called our office. She is a small business owner had her personal possessions in a storage facility in Queens they were going to be put on the chopping block because she was late on some payments due to Covid-19. My legislation would stop those types of foreclosure proceedings from occurring. It's unconscionable that an individual would lose all of their personal positions and, in this case, her small business possessions during this pandemic. Third I had a bill signed into law by governor Cuomo, actually two bills. One allows you to quit your gym membership by going online and indicating as such, a lot of constituents complain about the gym memberships and particularly during the pandemic. They shouldn't be forced to go to the headquarters of New, York, Sports, Club or blink fitness to do so, even though some of those companies are actually requiring that my legislation would override that as well as make it much easier to get out of these automatic free trials that you often see online. Secondly, another bill the governor signed is my legislation on strategic lawsuits against public participation. These are lawsuits that are filed by powerful and wealthy people and interests, people like Donald Trump or the real estate lobby, Mike Mckee, who many of you probably know once testified in front of the city Council about the rent laws. He was sued by the real by the Rent Stabilization Association, the Landlord lobby for 40 million dollars for defamation. This new law that we that is signed by the governor will put the onus on the plaintiff to pay the fees of the defendant if a judge determines that the plaintiff is trying to silence the speech or criticism of the defendant and then finally, I'm participating I participated in a Covid-19 vaccine. Trial I lived to tell the story, which is I, think a good one, which there were some side effects that they were mild, so I do believe that I got the actual drug and not the placebo I signed up online, which I think you can still do at Nyu go to the NY, just Google Nyu Vaccine Center, if you're, interested and I think they're still taking participants, but I'm hopeful that the results over the last couple of weeks showing that these vaccines have over 90 percent efficacy rate are going to hold, and that will be out of this mess sooner rather than later, particularly with a new federal administration. That's going to get the vaccines to the people who need it most are front line, workers, seniors and other vulnerable communities. That's my report mark. Thank you so much. Thank you very great, so we're going to continue on with our public session Christian I, don't see, I, don't think I have the list of people who've signed up. I think you have, that is that correct, you're still, muted there Christian Nicole painter, signed up by the way yep, okay yeah. We have five people from the public sign up for to speak. Okay and I know there are a couple of elected representatives who are in the mix there. Maybe there are some of them too, so Christian, why don't you just call them in whatever order you see them? Okay, first is gonna, be Nicole painter great. Let me allow her to speak, hold on once you're promoted a panelist there's when you call on people, please promote them to panelists, so we can see them as well as hear them. Thank you. Okay! So Nicole painter, you go ahead. Hey Nicole, hey! Thank you! I just wanted to let everyone know about an exciting project happening on Columbus Avenue called art on the Ave. We filled some of our vacant storefronts with artwork from local artists. We did a called call for submissions. All our local NYC artists, the art, follows the theme of the art of healing. You can look for this art on the app logo in different storefronts pick up a brochure explore the art. We also have QR codes on the windows, so you can listen to a short pod like one minute, podcast thing from each artist talking about their work and the impetus for the specific work that was chosen and there's a little intro by Michael Imperioli. So it's all socially distanced outdoor gallery walk, just something fun to do, but still be safe, so I hope to see you there. If you have any questions, you can go to art on the app nyc.com and I'll drop it in the chat yeah. Please drop it in the chat and Nicole just remind us of the boundaries of the Columbus Avenue bid and where we might find these yes, so the bid is from 67th to 82nd. Currently we have artwork from 70th to 77th, including the schoolyard fence. There's a big photo installation great thing: there's a map on the website that has all the spots way ahead of me. That's great thanks! Okay, next, we have Andres Believer go ahead. Andres you have to mute yourself. Okay, let's keep undressed for now. Let's next would be highly tutorial: hey good evening everybody. My name is Haley Tetro, I'm a resident of the Upper West side zooming in from 72nd street, I'm also a CUNY public health student and this semester. I've been working on advocating for a resolution through the New York City Council, so I wanted to just bring your attention to that. The supplemental nutrition assistance program or snap allows 1.6 million New Yorkers to remain food secure and provide healthy options for their families. Unfortunately, snap users currently have extremely limited options to purchase their groceries online for safe delivery to their homes. Since the start of the Covid-19 pandemic online grocery delivery has become an increasingly utilized service for those who can not safely shop in person and snap users should have the same level of access to this resource. New York City Council resolution 1320-2020 calls upon the United States Department of Agriculture to expand the number of retailers that are permitted in the snap online purchasing program. We must ensure that this resolution has passed and that we are giving our best efforts to fight hunger and food and security in our city. So please contact your city, council member and urge them to support resolution 1320-2020 thanks. Thank you. Christian Mr Bolivar well like next, let's go to Nike first and then we'll try, Andrus again very good and I. That would be a nightcare high polite, yes, hi good evening. Everyone thank you for having me I'm here, along with Haley as well from the CUNY School of Public health. I'm working in the same class I think I'm here to piggyback on what we previously talked about in terms of remote learning and school closing and how important it is that we still continue to teach our children on the importance of nutrition education right now as their home, quarantining, social, distancing and remote learning. Of course, they're either overeating or eating junk food, or not eating as they should be. So it is important for schools to continue their nutrition education, physical activities as they should be remote learning or in person. But it's really hard for us to know right now that if schools are teaching nutrition education, either in person or remote learning, so I'm urging for this community and all communities with schools to urge their council members to support a bill that would have schools report to the Department of education. What they're teaching in terms of nutrition, education, the frequency because it's needed so that we can prevent from our children having obesity or diabetes, so I'm just urging for this community to either pass the resolution or support our current laws that are on this topic right now. Thank you. Okay next is Zak Campbell. Let me just follow up with. Is it a Necker Hippolyte? Thank you. Please send to our board office at Cb7.Org, any material that you would like us to consider with respect to the initiative. You're talking about and I'll share it with the appropriate committees. Okay, thank you. Let's see if Andres is still with Us Andres Oliver. I'm sorry hang on one more second Christian, because I think Bob Robert SBA has got a question, maybe for Anaika well for yes Sir! Thank you for both of the students. I wonder. Is this the same bill that council member Levine presented at the health and Human Services Council's 1326-2019, which talked about obesity and diabetes and curtailing the warning against sugar content in restaurant menus and menu boards and signs, and that we had one of your I guess faculty members Dr from the CUNY public health school? Is this the same bill that this one is actually a different bill? It's similar to the bill 1283, which talked about just reporting on nutrition education in school, but I am familiar with that bill and that you're mentioning and the CUNY school did work on that bill as well to get that passing well. This is good because it I think you're presenting a more comprehensive package. I think the other bill is a good bill, but you're you and your colleague there you're, rounding it off and, as Mark said, I mean I'd like to see the also. What is the number? Let me jot down the number and I'll. Look it up sure it's bill, Intro, 1283-2018, all right, okay, 2018! So it precedes 13 20 laid over in committee right now, all right, so that's tell me the number again, please 1283 Right-2018 and that's in the city council correct, and that was also supported by Miss. Oh man, she was the board for Manhattan the board president of Manhattan and Mark Levine Gail. Oh, you mean she's the hamburger president. Yes, she was on the call just a minute ago. She also introduced this bill along with Mr Brown. Okay, I think that's terrific! Thank you very much. Thank you. Sorry to interrupt. Please go ahead. Okay, so the next person so last call for Address, Bolivar. Okay, then suck Campbell, please hi, Good Evening, Board 7, I'm Zach Campbell, I'm the community liaison for the American Museum of natural history and before I, even go into my updates. Mark I want to send you our best wishes. May you kick whatever is ailing you and, as usual, I'm here to provide the monthly update on the gilder center at the last meeting in November, I noted that we were finishing up with the excavation and foundation phase of the work and transitioning into the superstructure phase. So excavation and foundation is now substantially complete and superstructure is underway. Work in December is going to include formwork and rebar installation, as well as structural, steel and concrete pouring for walls and columns in the seller level slab and moving up excitingly into the first floor of the new building. Our contractors are still planning to work in a counterclockwise direction, starting at the north end, then the south and then into the center and the operation for superstructure, will proceed obviously floor by floor each floor, taking approximately one month to complete for the month of December, we anticipate approximately 20 to 30 trucks per day and ramping up our workforce to over 100 workers on site per day thanks very much, and if there's any questions happy to take them any questions for Zach or the museum. Okay, so Christian who's. Next, okay, the last speaker is Jax Bronwell. Well, there may be other speakers, because I know that Shanna Harman Goff is with us from Senator Benjamin's office. I think I saw Hannah Weinerman from Congressman Nadler's office and I'm looking right at Greece pair from assembly member Gottfried's office, whoops and Liam just joined us. Okay, we're just turned on I, just moved from the public in general. Oh I'm, sorry, forgive me go right ahead. You got this once again, you're way ahead of me just from Bill hi good evening. Everyone I was also kind of confused on where to sign up for the kind of elected officials part, so I just quickly put my name on the Google sheet just in case, but in any case I am here on behalf of the Manhattan district attorney's office, Psy Vance, I'm here covering for my colleague Alan, who usually presents at these meetings and covers this area just to go over a couple things very briefly. We do want folks to check out our updated hotline and resources page at manhattanda.org victim-resources. So not only can you find our hotlines for different crimes such as hate crimes or domestic violence or financial crimes, but we've also included resources that correspond with those crimes. So we definitely want folks to stay informed on that information. Outside of that, you can also follow or subscribe to our newsletter and follow us on Twitter to continue to stay updated on the different things that our office is doing. The last thing that I do want to talk about is the public safety curriculum. Our office provides a series of presentations from again hate crimes, domestic violence, sex crimes and there's an entire list that I'm more than happy to share with the board, but we are looking to increase our engagement and provide more presentations, and we definitely encourage folks to think outside the box when it comes to these presentations, we've done presentations with elected officials that have been crafted to be panel discussions for community members. We've also done presentations with different community board committees such as the Public safety committee for CB10, to kind of be a part of their regular meetings so that they can stay informed on these different issues throughout the year. I'm more than happy to connect you with our education team that really works on different groups, whether that be a school. A community group like this or different community based organizations to really craft a great presentation that provides impactful information to their group or to the community I'll include that information in the chat box and I'm happy to answer any questions. Thank you great. Thank you. Please do put your contact information in the chat box. I just got a text asking me to do the same thing. So please do that before you leave us Robert. Are you asking a question of Mr Brom deal. No I have an afterthought on the little chat I had with the students, let's get to the public session first I, because I think the students have left us so they'll be following up with you. Okay also I have a proposal that I'd like to make. Thank you Christian. Okay. So I'm sorry, no I'm sorry christian hold on a proposal about with respect to the 1326 bill and the one the students presented that we proposed to the speaker of the city council that we, what the term we use is bundled but put them together for an omnibus nutrition bill. That I think would make it more attractive. What's worrisome to me is that the 2018 bill is still sitting there. I hear you listen. This is a perfect kind of thing for us to be involved with, but it's got to go through a committee, so well I'm going to propose it to Shelly and Catherine yep. That's the right procedure. There you go that's the right procedure and then eventually come back to full board after that right. Thank you. Okay! I'm sorry, Christian now go ahead. Okay, so there's anomalous sign up to the sign up, form, I, guess for clarity for the next football meeting. We should have a separate form for the elected official society. Well, we'll figure this out. Okay, so I see in this order: Bryce Pair, Liam, Galligan and Erica Overton. So that's just the luck of zoom. So that's the order in which I'm going to call on you guys, please so Bryce Pears with Assembly member Dick Godfrey, the 75th District Bryce go ahead and then we'll follow that with Liam who's from Assemblymember Danny O'donnell's office and then Eric Overton from Assembly member Linda, Rosenthal's office and I. Think I saw Julian De la Porta, but I'm not sure about that. So I'll look for him, while Bryce gives his report go ahead. Well, thank you so much mark and thank you for your distinguished service to the community to community board seven. We will look forward to continuing working with you on behalf of the community. You know, Dick Godfreed himself has lived in community board, seven most of his adult life, almost his entire life, that's right, and so we're sorry to see you step down as chair, but congratulations on a job very well done. I know we're running really late. I'll keep it very short, happy holidays from Assemblymember Gottfried as Health Committee chair. He does express some concern and joins the city in supporting the effort to drive up blood nations. The city's blood supply is ordinarily about seven days worth because of the pandemic. It's been very hard to conduct blood drives we're down to about a three day supply. The city has launched a give blood NYC campaign. Today, it's being coordinated through the New York Blood center. We ask that you please go online if you're so entitled to Nybc.Org backslash donate to please consider donating blood this holiday season. He looks forward to working with all the new progressive members of the legislature in both houses and there'll, certainly be a lot of issues involving co-va vaccines coming up, and we look forward to checking back with you all in the new year. Thank you, happy holidays. Everyone thanks so much Bryce and thank the assembly. Member for us looks like we have assembly member row here, so we're going to keep going with Liam Galligan from Assemblymember Danny O'donnell's office. I noted that Shannon Harman Goff is with us and hope. K is with us and Mike Stinson is with us. So let's keep our conga line going Liam you're next all right! Thank you mark. Also, thank you for your work. I'll, save all the praise for the website that you said: you're gonna make so there you go and then just to plug two things. One. We have a rat academy tomorrow that we are hosting online on zoom with department of Health and the Morningside Heights Community coalition. It's open to everyone. I will post the link in the description just to learn how to prevent rats on your block and in your building. That will be at 1 pm, and you can also ask questions. The second thing is more legislative. Two weeks ago on November 20th, it was Trans Remembrance, Trans Day of remembrance, honoring, the Trans Americans, who have been killed far too many, and we have legislation that passed. The assembly actually unanimously passes Senate, overwhelmingly Democrats and Republicans to make all single stall bathrooms in the state of New York gender neutral. This has already been happened in the city in the state of California, in many states and municipalities with absolutely no problems. It's a simple piece of legislation that will make life safer and easier for transgender, gender, non-conforming and non-binary and intersex New Yorkers, who just want to be able to you, know, use public accommodations in peace. It's currently sitting on the governor's desk has a month to sign or reaching it and we're just trying to make sure that we get the word out on that. So I will post links to that in the description and I hope everyone had a safe and happy thanksgiving and wish everyone a happy holiday. Thank you. Liam Erica, you're next, followed by Shanna, Harman, Goff, hope, K and Michael Stinson hi everyone, I'm Erica Overton from Assembly member Linda, Rosenthal's office. First thing: the assembly member had a Rad academy. Last week we had dozens and dozens of upper West Siders join us. We recently got a series of complaints about rat activity in Riverside park and so we're working with department of Health and mental hygiene and parks to see what we can do there to step up extermination efforts and then second, the assembly member, has heard everybody. There has been rigorous debate about the west end open streets problem there. Many people feel that the area is not safe. The area would be not today is not safe, because there is also not a real, dedicated community partner to actually maintain the area, and so there was a community group that is interested they've been on CB7 calls in the past and the assembly member convened a meeting with NYPD and DOT us and this community group to see what we could do together to not just shutter a system but to hopefully improve it and so more barricades, and maybe shortening the block so we're not hitting up against 96th street and causing congestion. So we will see what we can do if we can all come to a compromise and improve something and then last but not least, the assembly member sent a letter to the New York State Department of Health, I'm sorry, the New York State Department of Health and mental hygiene, health and hospitals about adding more test Covid-19 testing sites. On the Upper West side, we did not beat the holiday rush, and so we were preparing, hopefully for the next holiday rush and they did add another micro testing site on 51st street today. I think it may have been only for today only and so we are pushing that so we're not in the same predicament. We were before pre-thanksgiving or there was just long hours worth of lines all over the Upper West side for people to get tested. So if anyone has any questions, I'll put my information on the chat and you can follow up separately. Thank you, Erica Shanna Harmingoff. Please welcome to cd7 on behalf of Senator Brian Benjamin. Thanks for joining us go ahead. I don't need to introduce myself mark. Just did I first want to say thank you so much mark for your leadership and your kindness for to sending the elected officials and the staff's emails. Letting us know when is the appropriate time to join in to the call. So thank you so much, even if I'm off by an hour or so, but it's perfectly fine. Thank you so much for your kindness. That means a lot to us and so we're gonna miss that for sure, and hopefully the new chair will be as gracious as you have been to all of us. So, as Senator Brad Holman said earlier, it's today is World Aids Day and Senator Brian Benjamin Co-sponsored a bill with Senator Rivera, which provides Medicare payments for comprehensive HIV special needs plans, and although there is no cure, we have made a lot of progress. However, there is still work to be done in the month of November Senator, Benjamin partnered with whole foods and gave away a significant amount of turkeys and groceries throughout the entire district and as well as organizations that say that they needed some food to give out to their people in their neighborhoods. So that's an update and one final thing is: our office is giving away business empire awards. So, if you all know of any businesses who have done outstanding work during Covid-19, please let me know: I put my email and office number in the chat and we will make sure that they get an award for their work that they've done during Covid-19. So thank you so much. Thank you. Shannon I, assume that you want the you want businesses that are located in the senator's district. Yes, that's correct! That's great senators district is a little bit. Oblong when it comes into our district, but it's basically along the Central Park West Corridor over to about Columbus above about what 90th street. Is it correct, very good thanks so much so anybody has an idea for the Office of Senator Brian Benjamin. That's how you follow up hope. K is with us, I'm not sure if she wants to speak, but I'll give her the chance probably need to unmute okay. Well, even though he doesn't have his cute baby on his lap, I'm going to call on Mike Stinson from Comptroller Scott Stringer's office and, if hope can join us. That would be great mark. Thank you and I know you don't like the attention, so I'm just going to say thank you for what you've done now. You've got it go ahead, just two quick things from our office two weeks ago the comptroller took court action to force the city to comply with a subpoena issued pursuant to his investigation into the city's preparedness for in the response to the Covid-19 pandemic, following months of stalling and refusals to fully comply with the subpoena issued in June. The comptroller today filed well two weeks ago, filed a petition in New York County Supreme Court, seeking a court order to comply, compel the city to promptly and completely comply with the subpoena. The petition details how the city has consistently stymied the production of documents repeatedly missed production deadlines, several of which the city set for itself and recently declared it would not be able to provide all requested documents until April at the earliest. Nearly a year after the comptroller launched the investigation so I'll give you updates when we have that on those and just one other thing, I'll drop in the chat to understand how New Yorkers relationships to work and family have changed due to the pandemic and to identify policy recommendations to advance moving forward. The controller's office in partnership with a better balance, are conducting a survey on workplace flexibility. So if you could, please share that or fill it out. I'd be greatly appreciated and thank you mark, and hopefully we can get you out of here before 10:10. Oh, thank you. Okay last call Julian delaportes with us. Oh yes, okay! Let's ask for hope. K first from Senator, Robert Jackson's office hope are you with us? Maybe not all right. Julian looks like you're gonna back clean up today good evening. Everyone I will keep this brief. We've all been on quite long, but mark I would be remiss if I did not. Thank you. Like everyone else. You have been tremendous this community and that's I, can't say enough. I just wanted to bring to everyone's attention that tomorrow night we're having a very helpful housing clinic where constituents can speak to lawyers and also ask questions we're going to be discussing housing court and breaking down the basics of non-payment, eviction cases I'll be posting a link in the chat, but for those who do not have are just currently calling in you can call me at 917-903-2851, that is my council cell and it's unfortunately, on all the time happy to help you very good Julian. Thank you. So much I don't see any other hands raised or any other people waiting to speak. Christian am I correct on that, yes, you're, correct! Thank you so I guess we're ready to start part two of our meeting so anyway I the senator stole my ending line tonight, which was to be remembering World, Aids Day. I'm sure everybody on this call, with the possible exception of Julian, has a story to tell, and it's worthy of a moment of reflection, hey well done. Michael Stinson, the so I will instead end with my sincere regret that I'm not able to finish my the term that I started and acknowledge that it is the greatest privilege of my career, professional or volunteer to be a part of this board and to have been a chair for a while. With that I'll entertain a motion to adjourn I see Shelley. Even though he's muted I'm going to read his lips and say that he's so moving and I, I'm going to infer that Kay Carpenter's nodding of his head is a second. Anybody opposed can answer to Shelley and decay other than that, I'm going to call it a night. Thank you all very much I appreciate the attention and the vigorous dialogue and your support throughout have a good night. Everybody good night.",
            "summary": "Hi, hey there good to see you Peter hi Richard, all right, I'm, going to press start the webinar, which will start letting attendees into the room.\nMeanwhile Christian, Could you put the link to sign up yes sure and if anybody who's, not speaking, could mute, please so, okay, well, it's 6:31.\nI think those who, Let me know about that.\nOkay, America you're, going to record both the a bolt this way for each boat and use the form also right, absolutely because we won't know the results of the form until the end of the meeting.\nAnd, then I'll count the rest of the votes, all in favor, okay, Marco, Christian.\nYou want to explain the voting sheet that Christian sent around.\nOkay, sorry, yes, I, vote, I couldn't unmute there.\nYou, know I'm just going to go over some things that have been happening in the last month.\nThere's a link that Christian's going to drop into the chat right now, not to waste time.\nYou want to speak or have a question for either the 20th of the 24th precinct, You can raise your blue hand right now and we'll call on you until we can get the sign up sheet.\nThe second floor, the third floor that is invisible from the street, because once the person does manage to buzz into the building, they're relatively free to roam the hallways until they see something that looks to them like they want to steal.\nOne hundred percent, keep your per your belongings on you or in front of you, okay, just so much as having your jacket on the back of your seat as you lean forward, and you lean back, you don't realize that somebody just took your jacket with your wall and your cell phone, just like that.\nI mean overall injuries and collisions are down, but you know, as things have started, to open up and people have started to travel again.\nWell, okay, any other questions from either board colleagues or from the community for just for NYPD.\nRight now, we'll have public comment later Christian dropped into the chat, the sign up sheet for public comment, so you can sign up now for any of the other items that are going to be following.\nSo, that's very helpful, but I think we'll move on with our agenda unless there are other questions for the precincts which I'm not seeing so with our thanks.\nBut I could I say, okay, that in effect, this new owner is trying to replicate the tax photo from 1940 and meet the lines and elements of the two other buildings that were also designed by the architect.\nOkay, all right, I'm gonna, stop sharing any questions or comments before we take a vote not seeing any.\nSo I see, Madge has your hand up, Your, muted, bench, Yes, okay.\nYou, know four foot wall made out of granite so, and we considered this on another property on Columbus Avenue between 72nd and 73rd street, a few years ago, which also discovered that there was vault lights that were hidden by something and then and our board I think actually recommended that they not have to replace them.\nAnd I would encourage the committee to reconsider that, Okay, I think Jay had his hand, that's the next one.\nAnd I was one of the three committee members who dissented from the majority and in addition to what page said, while this is a small piece of the total architecture of the app Thorp, there's, not only a physical benefit, as Paige described having it, but it's also historical.\nGot my pupils, dilated and there's no other area that has these vault lights and, in fact, If everybody can kind of picture between going west between the parking garage and the corner, West end.\nI agree with Kaye that he, the architect loved the building and wanted to do the best for the building, but I, don't think it makes it personally.\nI, don't think it makes a difference whether the vault lights are there or not, because nobody's going to see them.\nRoom, which is dangerous, I, see Barbara, Adler and I, see Paige as her hand up again in general, I'm, going to discourage us from having multiple times to speak, Although we are doing okay with time so perhaps a little bit, here.\nTo say that in the future that boiler may disappear and the natural light is going to be better again, So I, don't think it's our generation that should dictate removal of things which are pretty much intact.\nI didn't know it was cement until I looked at it more carefully, It's, not granite, but they're going to resurface it and color it the same color as the granite wall and add the plaque for a dog, and this was it your grandma that used to yes, there.\nAnd, then I'll start, So I'm a yes, let's see any other yeses in physical hands, I'm, not sure if you can hear but looks like that's it.\nI think we should do that, but it's not quite as straightforward as that, because the resolution and I think nobody disagreed with this, or at least wasn't what we were explicitly voting on spoke favorably about the bench I think recorded the fact that they said they would keep the bench.\nSo I think the resolution needs to be rewritten to be in praise about the bench and disapproval about the removing of the glass.\nChris you're, saying that if for the next vote for this particular vote, number three for the app store, we're going to be voting at number, eight, yes, correct Christian, maybe I'm looking at the wrong form.\nSay, if all right: okay, just a quick question: How does this new resolution get recorded in this.\nIs it one of the new resolutions that Christian says number okay, so those of us who supported would vote no on three and yes on eight.\nOh golly, okay, I, don't think I got it, but, Okay, Richard, I'm voting, early, oh and often great.\nSo, those in favor of the new resolution, which is to disapprove the application to remove the vault lights.\nClary I, Don't think you mean to vote against this.\nYou know it's a okay paint to use, but it's not one that the that was approved on staff or could have been approved on staff level at LPC.\nIf that's the fastest way through to a phrase, the resolution in terms of approval legalizing legalized code with that, Thank you Larry sure we can make that alteration.\nAnd I think the reason why the landmarks is asked CB7 to weigh in on it, even though it's a highly technical issue, it's just the wrong thing to do, and the other problem is when it starts to peel.\nSo I think we should take a much stronger stance and put the technology in the hands of the commission and ask that the paint be removed and the work done properly is originally specified.\nI have to thank the La. The landmark submission via rich Robbins, help seconding what Paige said because I was going to second.\nWe, it was discussed and assurances were given on the durability and breathability of this particular paint, And what we're hearing tonight is I, don't want to use the term diametrically opposed but inconsistent with the information that formed the basis of our decision.\nThis was the building owner's choice and as long as it subscribes to the basic parameters of the aesthetics of landmarks, I think we should vote for it.\nIt, might have been a contractor or contractor off the books or something else, but I, don't think it's also right for the community board to be put into this situation where we have to determine this highly technical, thing.\nBecause people have already spoken, I, think you know it's getting to be 7:45.\nBut I can't tell the difference between when we are speaking about preservations issues or if someone is sharing their personal preference on what they think.\nI, don't think so, whether the contractor got it off the back of a truck I, don't know, but I think that the hook here is that there are certain means and methods that the landmarks have worked very hard to help in various brownstone manuals sign manuals, all sorts of things to help the applicant.\nWe can say that the community board 7 questions the appropriateness, but leaves it to the commission to determine that something like that.\nSo, as I understand it, The resolution is to approve the appearance of the paint on the wall, but to defer to the LPC, to note that the LPC has included this specific kind of paint as one that is not approved for this kind of use and to defer to them on to whether the appropriateness of the actual choice of paint is appropriate in this setting.\nLet's continue with the vote all right, so anybody abstaining on this, I'm, sorry, very good.\nI'm, sorry I think well hands down, because we've gotten the no votes.\nNow we're going to take abstention, votes, If I change, to an abstain from a yes, that's.\nOkay, Jeanette, yes, sorry as soon as I went to hit on mute, like an email came and it opened up a website.\nFisher voting looks like I got.\nWe, had a board talk around those concerns and we came out with a resolution, specifically speaking, to a couple things that matter.\nI'm not going to go through the whole resolution, because I think it would take some time, but I'll do some highlights.\nI first want to start out by thanking Catherine who wrote this, And I'd say the word lovely resolution.\nI'll quote a couple of lines: here: the New, York City has not presented or executed a plan for meeting the education or and comprehensive needs of all students remotely including students in district 78 district 79 schools, which are very unique for people that may or may not.\nI'm gonna run through and highlight and speak to the last one then open it up for question, specifically we're asking for the mayor, the Department of Education Department of Health and mental hygiene, health and human services to develop a robust and evidence-based approach to school bus.\nIt asks for the video he should survey administrators, teachers, staff, students, families, guardians they should continue to consult with superintendents and the Cec. We think it's very limited in terms of how they're making these decisions a handful of other things that are asked for as a DOE to develop and a target education plan for New York city.\nConstituents, again ask for more people in the room, but it said it should consider how test positivity rates are determined for what geographic areas as well as whether or not schools should be closed for the population and level.\nIt talks about a handful of other organizations such as the who, which has different metrics, that they're giving guidelines to, but they wanted to make it appropriate for New, York City and, according to the standards of fairness and I, think a really nice line to end it with is that children and you should not bear disappropriate burden to New York City's effort to reduce Covid-19 transmissions and outbreaks or suffer unnecessary consequences for New York City's response to the pandemic.\nA lot of what you were proposing is still should go forward, because, even though they have come with a new plan and which probably aligns with a lot of what you were asking for, I'm sure they know they're not still involving enough people on it.\nWhat you're alluding to Christian is that the elementary schools will be opening up middle and high schools are still not, and there was some conversations, but by some of our committee members to ask me to put some friendly amendments to address that I think we agreed to that.\nThat I would only suggest that in order to have I, think I really respect this, but it would be helpful to focus target and make some of the points that you want to see continue in the future.\nThere was a friendly amendment between the committee members and we're going to add it, but I did want to mention one thing: Ethel.\nAs of now there's a difference between what is the criteria and then what people are talking about and as of today, even though you may have read, there's data coming out in the New York Times.\nThey just opened the schools and it causes parents to continue a parent like myself and others that you don't know what the metrics are.\nAnd I know that they're saying things, but there is no formal presentation of the criterion explained and that's what I'm saying I see more hands: up.\nFamilies are not consulted, Students are not consulted and knowing from my niece who's a nurse whose assignment is a good part of New York City, to advise as a nurse to advise the school districts and schools.\nDo remember, mark that we have somebody in the community, so I haven't forgotten: that, Catherine, Captain, So far, It's so helpful to get comments both on the issues and also on the resolution.\nSchools, don't know where they are and with this level of disruption, New York City is going to lose some students that are in the system that just aren't going to come.\nSo I just want to emphasize that the process does need to be improved not only and both in terms of taking into account recent research by public health experts, but also taking into account the rights of students and families, and there are a lot of options for improvement, and this is going to continue for the next year, because this one instance could be resolved and.\nI. Think in light of today's announcements, Does it make sense to offer a friendly member of the resolution recognizing the lower grade reopening for some and the movement away from a blanket three percent rule as positive first steps.\nMy question is more of whether we would consider I, don't know if it's a friendly amendment, but for those of you who have been reading about this issue in the news over the last weeks, this has really been a movement that started with parents and a group of parents.\nSo, for example, If you have a kid, a school classroom with four kids in a classroom, now you might be able to go to that 12 and have those just those remote seating, six foot with masks and all the other stuff which is a bit different, but from many schools, particularly in our community board, where there has been a fair number of students who have signed up for the full-time or part-time in school, whatever part-time they've got is what is gonna stay.\nI think those last two points were very in sync in the sense of, but you know, I, don't think the papers are an accurate assessment as well, and let's keep moving okay.\nOther main factor that we're not discussing here is that the teachers union has massive control of the situation, I'm, not sure of it, but I think that the three percent guideline was what it took to get the teachers union to agree to open the schools at all.\nI. Think Ken's point was one that I was going to make as well, which is we've got to balance the call that we want for them to make robust evidence-based decisions with getting viewpoints of a lot of different groups, and those two often can be at odds, and it might be a case where the more people you have involved, the more of a cluster f.\nI think your point about De Blasio, you know not having to pandemic.\nMaybe I know that mark is really wants me to keep moving.\nThose are really great points in this case like there is a lot of debate about whether there should be mayoral control of schools and whether the mayor should be able to make decisions on his own we're, not questioning that we're not getting into who's involved in the ultimate decision.\nThen the mandate changes a few days later, and parents may have no idea what's going on, and so you have to involve people in order to have a functional process and the process does need to improve like it didn't work this time.\nWe don't have evidence that it's going to be okay next time and the priority of this resolution is to advocate for the process to be better in every way.\nSomeone want to call the question because I know I think we're ready to call the question.\nLet me see any other physical hands, abstaining, Christian and mark.\nSo yes, If you could pull up the resolution, This is written in response to a recent Fbi report on hate crimes, and the facts are crucial and so I'd like there to be kind of a visual representation of what I'm sharing.\nIt further resolved that community board 7 calls on the mayor to include more robust, anti-hate crime and community resilience, which is art curriculum, which is already committed to appropriate for in-person and remote learning in New, York, City schools, and we also call on the Manhattan district attorney's hate crime unit to provide more education, outreach to schools, community groups and religious organizations on strategies for reporting and identifying hate crimes to law enforcement, as well as information on available resources and supports which they already do.\n7 Manhattan also calls on New York City to provide the Manhattan borough president's office with resources needed to continue to build on their effective diversity, equity and inclusion.\nThe Manhattan borough president's office also provides board members with diversity and equity and inclusion training in collaboration with the New York City Commission on human rights.\nAs we've discussed a lot as a board with additional resources, They could provide even more support for our board and for other community boards to address issues specific to our boards and districts and more guidance for us to develop diversity, equity, inclusion, task force and committees, so that boards, including community board 7, can take more proactive stances and also develop strategies to address individual and community bias that biases that lead to discrimination and hate crimes.\nThe assumption in that resolve is that we all have responsibilities here and we appreciate the work of the Manhattan borough president's office and would like to see even more of that via further resolve that community board.\nAnd I want to hand it over to Shelly and then hear any questions and comments.\nYou know, hate crime- is something that's very terrible and anything that we can do to help educate people on diversity.\nBelieve, not in the language of protected groups, according to New York City Human rights law, but that doesn't mean that we can't include that in the resolution.\nYou, know I think we could say something to the effect of that.\nI. Think we can incorporate that into in what we condemn and also what we're asking to educate people.\nThen I'm gonna move us along if I can, I, just the, whereas portions of the resolution all addressed hate crime, which you know which we all would decry and the first part of the resolve, addresses ways to reduce hate crimes which is really important.\nOkay, Our health and Human Services committee meeting for this month will take place, This Thursday, the third at seven pm, we're going to meet, to discuss ways to respond to child abuse and support the mental health and safety of children.\nUnless anybody has a, as has an issue or a question, so we will mark this on the number nine on the voting.\nI, think that's everybody, but let's lower hands.\nI have a chairs report that I would like to make, but I'm going to call on Gail, Brewer and Mark Levine first.\nI've been in touch with people in this Westchester we've been in touch with people who are complaining, The 311 calls are way we're going to try to put together a discussion in December with New York people and then early in 2021, with the New Jersey people and obviously, If there are folks on board seven who want to be involved, Gonna have the Faas actually agree to participate in quotes, meaning they'll, listen and obviously Eastern Helicopter Association, some of the companies and so on, and elected officials, I have to say Congresswoman Saf has always been very supportive.\nIt is an endless challenge, but we are going to keep trying I want to thank Julie, Vettila Martin who's, a West Sider who just got something to say.\nI think you know only too well in terms of education in the general sense.\nScott Riverside who got killed in this said people come because they work.\nI think you know only too well.\nIt's a board member I, don't know who it is, and many of the men at the Lucerne are now working at forgotten Riverside in their green keepers, program, so to lose all that not good.\nMy opinion, in many ways, I want to mention, of course, there's something that Ethel and I worked on recently, and only that push got me to look at the research.\nThank, you for president we'll go quickly to mark Levine, Thank, you, Mr chairman, and thank you Borah president, for that outstanding, update, I'm, going to be brief and just focus on a single topic which is Covid-19 specifically the coming vaccination program for New York City, which I'm sure.\nThere are over 1200 Covid-19 patients in New, York, City, hospitals, that's the highest number, since early June, Thanksgiving surge, probably won't feel that until next week, So this is real and in fact the health department today made an important change in its guidance for the public they're.\nLet's make sure we build equity into this plan, something I'm working hard on with colleagues on the council and again, which will be focusing on in the hearing on Friday, which I welcome any of you to participate in thanks for having me.\nBut I'll circle back to my colleague, councilman Rosenthal, on this and to the health committee staff to find out about this resolution, but in the meantime, just want to make sure you understand.\nAlthough we're probably going to follow most of it, I, think in practice, The government will have to make decisions about broader public vaccination, which will be a later phase, but I do expect that most employers will require this, just as you know, you're required to get your measles vaccination.\nI, don't know how this distinguishing between those who are working remotely exclusively and those who are in person, but certainly the guidelines that are coming out of the CDC do include teachers as essential workers.\nSo much councilmember, Thank you for president we'll hear from representatives of other elected officials as part of the public session, but I'm going to pivot to the chairs report, Now a couple of quick things.\nWhat it means, though, is that we need all of our committees to submit their materials, especially resolutions for the next full board or any kind of agenda items for the coming meetings further in advance than we have already been asking you for.\nWho I think wants to address his view or his committee's view on this.\nMy decision to do this in the way that I have outlined I think is in the best interest of the board, but I deeply respect the amount of time and effort that has been put into an opposing point of view and.\nSorry in your hand, go ahead and second, that I will set up a website for flattering mark later, but right, now, I'm, going to call on Senator Hoyleman and try to stall for a little bit of time.\nPeople like tony Fauci, but today, I announced a package of bills that I have introduced with a number of colleagues, including assembly, member O'donnell and Assemblymember Gottfried around the issue of pre-exposure prophylaxis, we're going to try to make prep universal, universally accessible to New Yorkers, particularly New Yorkers, who are in communities of color, who have suffered disproportionately currently under the Aids HIV crisis.\nAnd, I, think they're still taking participants, but I'm hopeful that the results over the last couple of weeks, showing that these vaccines have over 90 percent efficacy rate are going to hold, and that will be out of this mess sooner rather than later, particularly with a new federal administration.\nChristian I, don't see, I, don't think I have the list of people who've signed.\nI think you have, that is, that correct, you're still, muted there Christian Nicole painter, signed up by the way.\nI've been working on advocating for a resolution through the New York City Council, So I wanted to just bring your attention to that.\nIt's really hard for us to know right now that if schools are teaching nutrition education, either in person or remote learning, so I'm urging for this community and all communities with schools to urge their council members to support a bill that would have schools report to the Department of education, What they're teaching in terms of nutrition, education, the frequency, because it's needed so that we can prevent from our children having obesity or diabetes, so.\nSorry hang on one more second Christian, because I think Bob Robert SBA has got a question, maybe for.\nSorry christian hold on a proposal about with respect to the 1326 bill and the one the students presented that we proposed to the speaker of the city council that we, what the term we use is bundled, but put them together for an omnibus nutrition, bill, That I think would make it more attractive.\nK is with us, I'm, not sure if she wants to speak, but I'll give her the chance probably need to unmute okay.\nAnd I know you don't like the attention, so I'm just going to say thank you for what you've done."
        }
    }
}