{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "CBManhattan - Economic Development Committee & Arts & Culture Subcommittee Meeting -",
            "publishDate": "2020-12-03",
            "shortDescription": "Agenda\\n1.    Approval of previous month's minutes\\n\\nJoint Economic Development / Arts \\u0026 Culture\\n2.    Support for NYC Council proposed legislation Intro 2068 to facilitate outdoor performances \\n\\nEconomic Development Committee\\n3.    Update on Special District\\n4.    Vote to adjourn\\n\\nArts \\u0026 Culture Subcommittee\\n1.    Informational Presentation for Arts on Site\\n2.    Planning for Town Hall on Arts Reopening\\n3.    Vote to adjourn",
            "lengthSeconds": "3:56:17"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "XtagkEFRRG4",
            "fillerWordCount": {
                "uh": 261,
                "um": 462
            },
            "readTimeFullTranscript": "126 min read",
            "readTimeSummary": "22 min read",
            "wordCountFullTranscript": {
                "arts": 126,
                "streets": 64,
                "legislation": 59,
                "culture": 58,
                "sound": 57,
                "order": 52,
                "artists": 50,
                "performances": 47,
                "permit": 46,
                "program": 42
            },
            "wordCountSummary": {
                "arts": 50,
                "streets": 25,
                "institutions": 24,
                "performances": 21,
                "legislation": 19,
                "program": 17,
                "culture": 17,
                "street": 17,
                "artists": 15,
                "sound": 14
            },
            "fullTranscript": "Jake before we start I wanted to ask you: do you have a presentation or anything you want to share, or are you just going to be speaking, I'm just going to be speaking: I don't have slides or anything, it's more just content about the build that we're working on hi. It's crystal: hey crystal hi, okay! So it's six! Oh Clint, hey Anisha, hey Alicia! How are you good, okay, great I, think we have most folks here, so we can go ahead and get started just a couple of ground rules for this, since this is probably going to be a more active discussion than we usually have in economic development. So if you are not a committee member of economic development or arts and culture, this is a joint meeting of the two. This time. Please in the chat you know write your name and affiliation. We have one resolution that we're going to be talking about tonight and one speaker and we're gonna go ahead and do that first, since that will probably take up the majority of the meeting. If you are a member of the public and you have comments or questions as part of the presentation around Intro 2068, you can raise your hand in the zoom feature to Ray's hand, and we will call on you we're gonna, be limiting comments to two minutes per person from the public and the way that it'll be structured is that all committee members will have a chance to ask questions first and then we'll open it up to the public for comments. So with that, we will get started with approval of the minutes for November's economic development meeting and for arts and culture for November. So I'll do a roll call, I'll start with economic development and then I'll also do the roll call for arts and culture and Carolyn Redcliffe is here. Who is the arts and culture subcommittee chair and she and I will be co-hosting tonight, so we'll go ahead and roll a call? So first is myself Anisha, yes, an approval for the minutes. Megan joy, I believe she's absent she'll be coming later: Alastair Konamakis, yes, Andrea Gordillo, yes, Herman Hewitt, yes, Joe Kearns, yes, David Louie, yes, Alex Milotano! Yes, Richard Robiak, yes, Rodney Washington, yes and Andrew, Comey Andrew, okay, I see you sorry I was on mute, yes, okay and then I will go on to arts and culture. Carolyn Redcliffe, yes, Tatiana Jorio, yes, Olympiakaze, Olympia, I can't hear you but I see you Wendy Lee, yes, present Great Tariq Ramos Tariq! Are you on okay? Yes, I see your comment: Thomas Rosa, yes, Great, Ricky, Wong, Ricky, okay and then sorry Crystal field. Yes great. So we will move on to the first agenda item, which is our resolution and presentation around Intro 2068, which I believe is called open. Culture and I will hand it over to Jake from council member Van Brammer's office to give us an update on the legislation. Thank you and the first thanks for the invite and having me come and join the tonight's hearing, our meeting and talk more about this bill. My name is Jack I work for council member Jimmy, Van Brammer, he's chair of the committee on Cultural Affairs. It represents parts of western Queens, long island, city, Sunnyside, Woodside Astoria, I'm his legislative director and cultural affairs liaison and since the spring our office has been working with cultural institutions across the city to figure out. How could we better support cultural institutions during cover than this pandemic and help turn the city into a stage and figure out ways to work with them to create additional opportunities for income and to share their work during this time when venues and spaces are closed, theaters are closed and there's limited capacity for work. Since the spring we've been working on this program called open culture, you've probably heard of open restaurants and open streets and the idea of taking our public spaces and using them for things we usually do inside, but bringing them outside. While we can gather indoors in the same way, we used to be able to this program would be opening up the city for outdoor permits for rehearsals and programs for cultural institutions. This would open up the streets as a stage looking at open streets as that venue and turning the now complicated, permitting process into a one-stop shop right now. Working with the street activities permitting office SAPO, there are a lot of barriers to participation. There are a variety of fees forms you need to fill out and different agencies approving different steps to getting a permit and through this bill and through this program, we'd be turning into one application: one portal for free or low cost for organizations, arts, institutions and artists to do that programming and bring their work out into the city. This the introduction number is 2068. I am happy to send a link in the chat, so you all could see the older version of the legislation, but right now we are currently negotiating the bill with the mayor's administration. So there's a lot of updates and things that have changed. So I'm happy to explain that I shared with I believe Carolyn a fact sheet and I'm happy to try to share my screen so you'll have it I'm on my phone, so I don't know exactly how they'll work I think my video will be cut off if I try to do that so happy to answer questions as much information as possible and just kind of give a play-by-play of what the bill would look like. Does that work for all of y' all I think that's good. We I did if you're a committee member. The fact sheet is what the bullet points were in the email that I sent last night perfect. So you all got that great, that's good to know so, for the legislation, the specifics of it would be it'd be starting in March or the idea is to start in March and go until Halloween of next year, allowing for 2021 the nicer months to for these outdoor programs and events, while we're still figuring out what's going on with Covid-19 and the city is still responding to that, and for this it would allow for rehearsals and performances. It would be administered through SAPO street activities permitting office and eligible organizations would be cultural institutions that have received previous department of Cultural fair funding. This range is from larger museums to smaller institutions and neighborhood groups that receive the funding and the artists that they work with and for the spaces that they'd be able to program on it would be open to open streets as of right now, but we're exploring further options, so more spaces might be added later on, but the beginning would be open streets and for the program we are still negotiating final details, but for participation it will likely be a small fee of about 20 for a permit in order to engage in this program and get a permit for outdoor activity and I'm open to other questions as well. So if I'll refer to you, Caroline Indonesia the co-chairs to help facilitate questions. If that makes sense, Carolyn do you have anything. Otherwise we do have a number of committee members who have started to raise their hand so Alastair thanks Jack. Thank you. It's a nice relief to hear that the city is working on making the permanent process in any capacity simpler and cut in a lot of the red tape, because I think that's a big hindrance with businesses and institutions being able to conduct business and stay in business these days. One question I have for you is this: the purpose of this program is to obviously help artists and provide income to them. How will that work? If artists are performing in public spaces? Are they gonna? How will that turn into a revenue stream that will help them out great question so this program? What so right now, under the current situation with Covid-19 theaters, are closed stages are closed and most work for artists is very limited and we want to kind of turn the city into a stage into a theater into a performance hall and allow for ticketed and donation-based events to allow these artists to make a little extra income at this time and continue some of these traditional programs and for ticketing, cultural institutions, and these artists are great at figuring out ways to charge folks. So there's no restrictions on how they could receive funds, but they're able to receive funds with these permits, because a traditional outdoor programming permit doesn't allow for ticketed events. It has a larger fee associated with it, and so now we're decreasing that barrier for participation and allowing these organizations and artists to get onto the street charge a ticket for an event at a much lower, a more approachable cost. Okay, I'm just curious how that would realistically look like being able speaking with cultural institutions, folks have passed the hat done, so it's like similar traditional, like busking methods, or they just put on a QR code and have people scan to sign or ticket or pay for a ticket on their phone or have pay for a ticket in advance, going through their website and attending the event later on. There's no restrictions on how they could ticket the event, but they're now allowed to ticket for the event. Okay, thank you. Susan is up next I, believe and then Richard who hand is up physically. Oh okay and my hand is up hey. Thank you. I have a couple of questions. First of all, for the open streets: do you mean open streets that include restaurants or just the open pedestrian streets are? Is it inclusive of all open streets? The idea is to be inclusive of all open streets, but the specific streets will be determined in partnership with the department of transportation and the local council member as well. So there may be some addition, little streets added or some streets subtracted, based off that specific neighborhood and what's going on and what they deem appropriate so where we have open streets with restaurants. Now that where we have many complaints about the blasting music in current roving bands, there's no criteria that, if you know an area already has complaints or anything that is there any provision for taking existing conditions under consideration right now. The latest version of the legislation that we're working on the language for the specific spaces is up to determination by the department of transportation and in communication with the local council member. So there are major concerns within that community that council member could voice that to the department of transportation and make a decision from there. Okay. So, just to let you know up, one of the issues is that up till now D.O.T pays no attention to any of these situations. Does this include amplified sound and if it does do, they need a sound permit and the regulations for amplified sound would be the same under this program there I do not believe some permits will be granted with the open culture apartment. It is separate, and so that is separate from this program. So, okay, because right now, except for a few concerts, the police are not granting sound permits. So that would continue that, oh, the amplified sound is no longer or is not part of this particular intro. It would not be changing the rules for the sound permit in any way, so they need to apply to the same situation. Okay, so you have somebody playing on the street and they're selling tickets and somebody else is standing there and says: I don't want to buy a ticket but they're listening to the same music. How does that work? So, specifically, in the legislation we have, it listed that they're allowed to ask for admissions and tickets, but they're not allowed to stop anybody from walking through the street they're not allowed to stop people from crossing on the sidewalk or passing through it. It's still a thoroughfare, and so through conversations with many cultural institutions and working to draft this legislation. Many folks were not we're totally fine with having passerbys just come by casually. Listen. They want to stay they'll, ask them to buy for pay for a ticket, make a donation and like pay for their viewership and help support the artists, but if not they're, welcome to just listen pass by and then continue on with the rest of their day, but if they want to stand on their street, if we have an open street and people want to stand on their open street without buying a ticket they'll be able to right, there is nothing legally binding against them. Okay, my last question: someone wants to rehearse for five hours. What's to stop them so for the permits there will be specific times set for each one and I believe I. Don't know the specifics of how long they would all be because it's case by case and what people are applying for and what's permitted through street activities permitting office, so they would need to receive a permit in order to rehearse for the set amount of time that they apply for so right now, SAPO doesn't have any criteria. You know something like 8 am to 8 pm or something like that, so they would be setting a criteria, but we don't know what that criteria would be at this time exactly that criteria is not necessarily codified within this bill in this law. Okay, one I now have one real last question, so SAPO allows for community board input without any extra work or time from the applicant. Why can't that be part of this provision? The idea for this is to create decrease the barriers for participation with the permits and make them more accessible for organizations, and part of that is the time it takes to get one per to go through and get accepted. We've heard from organizations applying for Zappo permits, pre-covet and middle of this pandemic, that they didn't get approval until the day of an event or the night before, and that's not a condition that we want to keep happening with this, and so we're trying to expedite the process and that's why we're bypassing community board approval with this program. So what, since I work with sample all the time? That's absolutely true that happens and I know about it, because a lot of organizations will call me for help. That has nothing to do with all these other comments or barriers. This it's a product of sappo, and it has nothing to do so. If the community board, it's not saying that they needed to come to the community board, which would require scheduling, but for the community board to just enter comments. For instance, that's the way the Plaza works right now they don't need to come to the community board. But if we see an issue, we can enter comments and it doesn't take any extra time or effort. I would suggest that you consider making that part of the process taking note hearing and then I'll follow up on my end and check in thank you. So let's go to Richard since he had his hand up and then Alex I have my hand up a whole bunch of good questions. Susan. Thank you, Susan. My question is a little bit more simple in terms of the mayor's office. What kind of feedback have you received comments or criticisms or objections to the pending legislation, just to clarify the question just like their response from the mayor's administration and his office yeah? So being quite candid with you in the beginning, their first response is: why do we need something like this? They didn't see the need for supporting the cultural, it's a cultural community within New, York, City and helping them out during this time when their spaces are closed, they're unable to do performances, our city was able to respond for small businesses and our restaurants and bars through open restaurants and open storefronts, but still have minimal efforts and resources for cultural institutions, the second largest economic driver in our city. So there was a lack of understanding at first and then once they got it made sense, but it's taken a lot of work to clarify a lot of what how the current processes that exist for permitting and supporting cultural institutions could be barriers for participation as well and get in the way of them doing their work so trying to find ways to create a program and I believe we have create a program that supports cultural institutions instead of getting in the way of them. Thank you, Alex and then crystal I think crystal is ahead of me. Anisha, okay, crystal go for it. We were refused a permit for that. We usually play on 10th street every summer and the reason they refused it was. They said that the they are giving permits for outdoor dining and that we, our permit, would come under block party and they can't give two diverse permits at the same time. So my question is: are you aware of this as a problem, and can you help to solve it? You know can I ask which organization you're with just so I I'm happy to follow up on Miami as well theater for the new city. We mostly play in parks, which, of course, we couldn't do this summer, but we also perform on 10th street between first and second avenue and the one restaurant that is right next to us is delighted to have us perform. You know so, in other words, there's no conflict between the theater and the restaurant, it's only in sappo where the problem lies. So with this program, one of the goals and things I'm excited for are the potential partnerships with the businesses on those streets and the cultural institutions, programming them and activating those spaces as well, because they could work in partnership. You could have a show, while you're dining at this outdoor cafe and for no additional charge or you could buy a separate ticket for it or donate to the organization as well, and that currently, with their permitting process and I know during the summer, things were more complicated with Covid-19 restrictions from the state and the city. But with this program it would be trying to get rid of those issues and those discrepancies and allowing for those sorts of programs to happen at the same time as outdoor dining on those open streets yeah. They complement each other, actually absolutely yeah, all right. That's what that's all I wanted to say: ask Alex, I, think a lot of maybe the salient issues of concern, because certainly you know the argument in favor is that we should try everything we can to support a decimated industry in any way. We can, however, I think all the salient issues were raised in Susan's questions and that are I. Don't hear that there's going to be like any enforcement of this or it's going to be relying on DOT and possibly the people who are now in charge of open streets, and we already have the have existing issues with that enforcement. Overpopulation overcrowding in unsafe, unhygienic conditions, I see like this being very good for spaces that are more and you know. Maybe this is a question of private versus public. What is private, what is public but where the Astra place, or even Cooper, Square Park, you know places where there's much more space, especially if you're going to permit ticketed events without restriction, which to me has the potential for inviting a lot more people to an area, and there are some open streets programs that just can't accommodate I think the additional people or something has to be worked out. Where there's an accommodation made that results in some concessions on the part of the existing businesses, who already have their things outside right, I'm not saying that they should be. You know, first, come first served they get to stay there right, it doesn't seem like any of that has been worked out and I can see the potential for disaster where we shouldn't be having any disaster. But yes, there should be what crystal said: the ability to work cooperatively, what you said: the ability to enhance. What's going on, rather than decimating like already over burdened streets or like times, Square has a lot of space, though, could have you know? Theoretically, ticketed events I hear that the idea with this legislation and what we really wanted was to allow cultural institutions and artists to permit on pretty much any open space in the city that includes parks. Plazas parking lots, alleyways streets, not sidewalks, because people are walking there but kind of any space. That's available make sure to find some way to make that accessible for permit artists are so creative in how they could use space, and we want to make that available to them, but in working with the mayor's administration and the city on this and furthering this bill, we have found legal limitations to some of those spaces and with open streets as a starting point. We want to test this out a little bit as well, and we know these cultural institutions will be able to actively use these spaces. Be good stewards of the community in these open streets, activate them bring their art to these neighborhoods profit a little bit, but also do it. So, in a way, that's appropriate for the time we're living in they don't want to see massive crowds. They don't want people to get sick or they're artists that get sick from these events and we're trying to expand the program as well and I see this as a first step and seeing where we could go from there. So I understand the concern and we're looking to expand it and get more spaces added in, and we are just looking for an opportunity for these cultural institutions and artists to share their art with the communities and make a little money. At the same time. Thanks we're gonna stick with committee members to go first or go in this first batch, so Andrew you're up next thanks, I think I raised my hand correctly. Anisha I tried at least so I have a couple of questions and then a comment will like open streets where restaurants are allowed to create structures. Will art institutions and cultural institutions be allowed to create structures, because right now, I would say, every structure created by a restaurant is illegal and does not meet the department of buildings requirements that we heard about last week. So that was question number one to answer that, for they wouldn't be building any permanent structures. In any sense, these are temporary permits. So, if anything is added like a stage, a dance pad something small and light those are allowed for this, like a pop-up stage, you might see at a street festival or something like that, but it wouldn't be there for any permanent time. It'd just be there for the duration of the event, and that needs to be taken down as part of the permit and who is responsible for deciding what footprint an institution can occupy again. Seeing the open streets programs with restaurants, they've taken spaces next door to them, because it was a vacant, dry, cleaner, etc and some wrap entire corners. So I'm thinking of just performance, space, New York, which has frontage on first Avenue, which their frontage on first Avenue, is in a bot, is in a bus lane, so that would obviously be not available to them, but then their property wraps several yards into 9th street, which is a small quiet residential street that already has restaurants on it. So what footprint would a place like that be allowed to have I mean theater for the new city also has an issue right in front of them, which is why, when they do their big events, they do it on 10th street and basically the street gets closed off for the duration, which is fine. For these. All the permits will be reviewed by the city's street activities permitting office, and so they'd be reviewed through that and granted based off their review and for the frontage. So these organizations, if they have a home or don't, have a home and don't have a theater of their own, all organ all these organizations are eligible to apply to permit on open street, so not necessarily right in front of their establishment, but any space within the open streets like catalog of streets, available, okay and then I guess my last, I'm not sure if it's going to be my last, but for now it'll be my last. Is we heard from several residents last week and being a resident myself that between right now, the restaurants, the open streets program with the restaurants is not well managed and makes it very difficult on any given day to just get from point a to point b, if you're just trying to get groceries or get home from work. So while it makes perfect sense that we need to do something, it almost feels like it's a shame that our arts and culture institutions weren't considered before the restaurants, because the restaurants have now occupied so much real estate. That I can't imagine more street space being taken away from the public, but are the what I did not get from the legislation which is which I read which is unclear is: will these be for a limited period of time? So somebody applies and gets a permit for one day for four hours to do a theater performance, or will they be able to get a permit that lasts that entire period from March to January that perm, essentially for that period, blops off a part of the street from the public? These would be temporary permits. So it would be I believe, like eight hours max, so nothing going on for months at a time. So it's per event exactly okay, so this would per event so random example. If a local dance studio wants to put on a series of dance performances, they would need to apply for multiple permits for each night and if they want to do rehearsals as well, they would need to apply for sorry need to apply for rehearsal permits as well. So it's very different from the restaurant program where they can set up for the duration, exactly we're kind of taking the open aspect of the name, but it's a different program because it's a different thing: it's not every cultural institution, has a brick and mortar space and we want to make this available to all the organizations and artists out there from like a random quartet to a visual arts gallery to a dance studio to a local theater like we want to make sure that these permits are flexible for the type of work that they're doing as well. Thank you a question who is Galaxy S20? Are you a committee member or a member of the public? I am a committee member, but my answer is already answered: oh okay, great Ryan, hi thanks hi Jack I, I'm a member of CB3, which is why I just got to speak next, but I also am the executive director of fab NYC and we have a membership of more than 40 cultural organizations across the Larry Side and I'm sure you're aware. But I just want to share that. You know the lower east side has been identified as having more performing arts organizations than any other neighborhood outside the Broadway area, so the closures are really significant to what is happening to our theaters and the fact that they've never been part of any plan for reopening. Even you know, with 10 people, five people, you know every kind of social, distancing and safety measure you can imagine they have been completely excluded with no opportunity to reopen. So I would just say that you know some opportunity to sustain themselves, as we I think all expect. The closures, the indoor closures to go on for many months to come, is really significant to this community and to them trying to find ways to sustain themselves. I'd also just like to point out that many of our culturals do outdoor programming. Free programming have done it for many years in the past and that, although it's a big boon, that I think people will recognize that you're offering the option to charge for tickets. I'm also expecting that not everyone will even try to do that. They will. You know be in some ways consistent with how they've been in the past and just offer free public programming. I'm I want to say that it is important for local cultural organizations to be able to continue to be present to their communities, many of whom are here, and so I'm wondering is there any prioritization about? You know access to the open streets program to the opportunities to perform for folks in their own neighborhoods. This is something that we've discussed a lot of me speaking with different cultural institutions and also there's a call every day with cultural organizations deemed culture. At three and we've been discussing this program, everybody that I've talked to has expressed interest in activating their own community. They want to share their art with their neighbors because they're the people like they live in that neighborhood for a reason. They program in that neighborhood for reason, they're part of that community, and they love them so much and they want to share their work with them. They don't necessarily want to go out to some random neighborhood to perform for a traditional year. Having an outdoor season could make sense. But this is the time to bring their work to your local community and something they're all interested in doing so in the legislation right now. There is not any specific language around that, but I'm happy to check in on my end and see what else we could potentially add in regards to that, because the neighborhoods are the focus with this. We want to make sure that the organizations are given priority in their local community and there's not necessarily others competing for that space. That's great if I can just follow up Jack, I'm wondering because the legislation has developed quite a bit since when it was originally written, I think it would be great if I could do an update with our membership about where things are now and what the what you're working on, or even the obstacles you're running into, and I'm wondering if I can follow up with you to see if you might do an info session with our network and also just we would invite all the performing arts cultural groups in the lower east side to attend. Happy too I'll. Add my I'll put my email in the comments and feel free to send me a note thanks. So we have Andrew and Susan who have their hand raised and then we'll get to the two members from the public who have there two more things. One is who is going to be responsible for enforcing Covid-19 precautions around social distancing and if there are ultimately further limits placed on the number of people who can gather? Is that who's going to be responsible for maintaining that and enforcing that? So, with this program, all these organizations would still have to follow city and state regulations. Executive orders regarded to Covid-19, so gathering limits would still be in place. You're not allowed to have more than 50 people, I believe and with the permit as well. The organizations will be required to submit or the applicants will be required to submit a safety plan as well. We want to make sure they are thinking about Covid-19 in this. If they're going to have a more structured stage, event cast crew and audience, we want to make sure that they're thinking and acting appropriately and for enforcement, the institutions will be helping with that and making sure people aren't gathering if they are asking them if they want to donate things like that on getting people to cross through the street, but they'll be similar enforcement and regulation for open streets and open restaurants as well. So it'll rely on it's a complaint driven system similar to open streets of rely, local law enforcement and fields. Yes, sorry, the audio got interrupted so right now, the open streets program for restaurants relies on it's a complaint driven system that relies on local enforcement by the police department by the community board by residents, making complaints, etcetera so that'll be a particular similar process. I would say it's more similar to current outdoor programs or pre-Covid outdoor programs in coordination with the local NYPD precinct, because they're informed of these events as well and often would send out a community affairs officer to oversee the event, normally so I believe it'll be similar to that so enforcement's similar to. If somebody got a permit to perform in Tompkins, Square Park, yes and then my other was just a comment. I think Ryan raised it, which is I, would say to be fully supportive of this. I would want to ensure that this, the people who benefited from this were our local cultural institutions and that not random cultural institutions or arts organizations could just get a permit to perform in the lower east side. We want to make sure that this is targeted to the institutions that are in our neighborhood and have historically served our community. I'm not sure how that gets done, but I would strongly second that emotion or recommendation or request: okay, Susan. Okay, thank you. First I want to correct some information about enforcement. Local precincts do not enforce or not in charge with enforcement comes from the mayor's office of special enforcement, and they don't enforce these kinds of things and do enforce like the underground parties. We have it on our streets every day. We know that. So you know we should. You know, base our expectations on what is happening right now. I have a question about self-certification. The intro said self-certification, but if Sappo is now issuing the permits, does that mean it's no longer self-certified through negotiations with the mayor's office and the bill being updated? That is one thing that has changed, so it would not be self-certified. It would be an expedited process. Okay and another question regarding the current roving bands, which are legal as long as they're not using amplified sound, so we actually do because we're a destination area with lots of open restaurant streets. We do attract a lot from outside our neighborhood. How do you deal with permitting local organizations for particularly for a certain amount of time when you also at the same time have these you know? Brass bands are particularly popular right now. You have these bad brass bands, which don't need permits and they're in our open street areas. Specifically, did you repeat the first question for me: apologize so we're I think everybody here has agreed that they would want to be supporting local nonprofits for the permits. However, we are a destination area and we already without permits, attract bands, they're particularly brass bands, and they go up and down the open streets. They don't need permits because they're not using amplified sound, so you're gonna have a competition between those bands and the permitted organizations. And how do you deal with that? So for this legislation? We're focusing on making the process more accessible for these organizations to get a permit? So if these brass bands would like to apply for a permit to be in one space, charging ticket or admissions they're welcome to apply and be involved in this and with the local preference I'm going to check in and see how we could add that in to legislation, but for the enforcement part. That's a further conversation with the mayor's office of special enforcement, the local NYPD precinct and that community and finding a solution that works for that neighborhood because it's going to look different in every part of the city and how these streets work and how it'll work with performances in the open, restaurants and the open streets. So let me just clarify so these bands that we have now once the permitting starts they will not be allowed on our streets playing without a permit, not necessarily you. There may still be people that perform without a permit and there's an enforcement process for that. But they're welcome to apply for these permits, but you're, saying right now, it's legal for those bands to be there. Will this legislation make it illegal for them to be there without a permit, so we will have permanent people and unpermitted people in the same spot playing potentially okay, that's a really big deal. Okay and I just want to say as far as the enforcement you know, those of us that work on this all the time at our district service cabinets and everything we have gone through this again and again, it's not a local conversation. It's not happening the police, don't want to do it, they're not doing it and they're not being charged with doing it. The office of special enforcement is too overwhelmed and really is not spending their time on this kind of thing, so I just want people to be realistic. Thank you. We have one more board member Olympia you're next and then we will go ahead and open it to the public to speak. Olympia can't hear Olympia. Can you hear me now? Yes, great so hi Jack, so thank you so much for being here tonight with us, I serve on art and cultural subcommittee at Community, Board 3, and I'm one of the people who put forward this resolution and first of all, I want to thank you and your boss, council, member Jimmy, Van Bramer, for that you know working tirelessly for arts and culture for the city and also for understanding that it is not just about industry. Culture is beyond that right now, of course, the pandemic has taken attacks in you know the really the likelihood of a lot of our fellow citizens, but also it may have a huge impact in the long term about what arts and culture and what kind of art workers do we have, and our district Ryan already mentioned. That has a concentration of venues, but we also have a concentration of people of workers and, with that in mind, I wanted to say that you know the we need to, of course make sure that whatever legislation we pass doesn't perpetuate segregation, or things like that. So even though I understand the need for priority for local organizations, I would think twice about legislating segregation. It could make sense in the way in the guidelines that SAPO and DOT will develop, have some you know precedence for organizations that are locally connected, et cetera, but definitely as a planner and an architect myself. I would see huge problems about segregation with legislating language that excludes people from public space. This is definitely not I think what your legislation is trying to do, because we know who will be excluded and who and I. You know, look forward to continue working with you to serve. You know not just CB3, but all arts and culture of the city, thanks Olivia and with the local preference. I totally understand what you're, saying and I hear you I think the idea worth exploring finding it based off zip code or within that community district or neighboring that street, and we don't want to necessarily segregate folks. We just want to make sure that if you are a resident or resident cultural institution in that neighborhood you're able to program there so totally understand great. So let's go ahead and open it up to the public for comments. The non-con non-board members, so we have first Alejandro and then Dylan and then Judith so Alejandro you're out. Thank you hi Jack. So, just a little bit of context. I am the director and chief curator of a long-standing organization in the lower east side that has actually dealt with straight activity permits office for over 30 years. I'm surprised that I have not received a call from you actually because we're one of the few non-profit organizations that actually has a grandfather permit to do a six block. It used to be a ten block festival in the lower east side, where we basically host performances, music vending all across Avenue C. So that would that say and I really appreciate all the points raised by Susan Alex, their Olympia very well taken I think you should definitely considered all of what the council members have told you I do want to mention that I was in a video conference, call organized by the Department of Cultural, Affairs, Commissioner, Mr Casals and the street activity permits office a couple of months ago, and they wanted to update us specifically cultural organizations that you know have a relationship, a long-standing relationship with both of these organic institutions, and they were very clear about the new restrictions. You know the street activity permits office that they will be implementing up until further notice. One you made very clear, which was the 50-person capacity limit that was to be enforced on any street activity permitting event. And obviously you know this would include not only staff working on this event, but also audience so. While, yes, you may provide a seating diagram for them to let them know how you can fit 50 people within a block radius, keeping in mind also that some blocks are longer than others. You know they're all different sizes and also keeping in mind that, as someone already said, restaurants have taken over basically most of that real estate already, and they there is just no way to do anything aside. Where could you just are, very, you know, you're just basically forced to work with them in some way or another, and you know they have to abide by their own rules of capacity, and I'm just saying it's so you have I think it's a great idea, I think it's a bit late honestly to be thinking about this, as someone already mentioned, unfortunately, for non-profit organizations that not only have provided this type of activities for the community for years, but are also free of charge. Like someone also already mentioned, for example, our institution wouldn't necessarily be charging anyone to see. You know an artist performed as part of our artistic presidency program, for example, or as part of our theater lab program of our Lois Ida Festival. So it's a good intent, I think it's hard for us for city agencies to coordinate, and it looks D.O.T and Zappo, and the major's office still trying to figure stuff out, and it's very important that you reach out to the right. You know to the right people and I think you're doing that right now, which is you know and I, appreciate Carolyn for actually inviting me to this meeting today and the opportunity to have to talk about this. So that is what I'm gonna say. I'm you know I'm available to talk further jack. If you want to discuss again because we just have been dealing with this type of activities for so long, so I would definitely invite you to on a conversation with us for anything you need. So thank you for the opportunity to talk tonight, thanks for sharing your perspective about this and for continuing to putting on the programs that you've put on in the past and trying to activate your local community through programs, and I'm I'll be putting my email in the chat. So if you have access to the chat, feel free to send me an email and happy to have a conversation with you more about this and hear more about your perspective and I agree. We've needed this back in the spring and that's what our office has been trying to do, but we are where we are and we're at a point where we might see this start next spring and make spaces more available and the permitting process more accessible for cultural institutions and artists of all sizes and profits and wallet sizes, and what have you to be able to bring their art to the street and make a little bit money off of it. Thanks. Thank you again. So Dylan you're up next and just a reminder we're going to try to keep these two around two minutes in the interest of time, so Dylan, you're next and then Judith right after you can skip me. I no longer have my question. Thank you, Judas. I'm sure that if you wouldn't mind oh Judith Zabarowski, 9th Street, A1 Block Association. Thank you. Can you number one if someone can just remind me of the closed streets hours because they don't come to mind at the moment? Is it eight to eight I believe it's eight to eight a.m, to eight pm? Thank you and my second question: is there a reason why it's going through October 2021? The idea is to with the timeline being March 1st 2021 to October 31st 2021. We want to activate the have the permits available for the mostly warmer months of the year, so late winter to mid fall. We got the Halloween date from the open restaurants legislation. Originally, that was the original time it was set to expire before the mayor, extended it to a full year year-round program, and so we were originally borrowing that date and we want to. We don't want to have organizations out there in the winter when it's too cold and unsafe for artists to be performing, so that was the expiration date and right now it's a temporary program. We don't know what the whole cultural ecosystem is going to look like next year after the summer, and so it is open. For extension, we can extend it later on, but right now we do have the expiration date of October 31st 2021. Thank you, Peter Kramer, hi good evening. I hope you don't mind we're in the middle of eating and I. Don't think you want to see that, but glad to see everybody here from the neighborhood and our other boroughs. My questions comment. First, the comment about the capacities of these public events. We represent Petit Versailles, which is one of the New York City's community gardens and the garden rules are limited to 25 people and that's regardless of the size of the gardens and the other question was: is there any? Are there any monies that will be made available to the arts organizations because it's great that you're helping to facilitate the permitting, but without additional monies, because presumably there would be the expenses of setting up stage or you know, hiring a sound system that type of thing, so those were just two points that I wanted to make and thank you for your attention. Yeah! So apologies. Can you repeat the first question for me: I want to make sure I got that right. It wasn't a question as much as you said, the limits, oh for capacities. Thank you. Sorry about that. So, for the capacity for the events, it would be limited by any city and state executive orders regarding group gatherings from the mayor, the governor. So we do not have specific requirements or restrictions. I would be following any Covid-19 related guidelines for that, and then the second question, my apologies: could you repeat that, for me, aside from the facilitating of permits across agencies, are there monies that will be made available to the arts organization with any of this legislation? The legislation itself does not have anything regarding grants or funds for the artists, but in speaking with cultural institutions and those that are working with artists on a regular they're, exploring little micro grants for artists and ways that larger organizations could either sponsor smaller organizations. The cultural community is very extremely resilient and flexible and supporting their own kind and artists that are struggling right now and so we'll likely see something pop up within the community. But this legislation doesn't mandate anything or have any funds designated for that specifically, thank you, Eris, I'm not trying to pronounce the name you're right good! Yours is good I. This is late, but it's not too late. I, don't expect we'll be ready to open allowed to open by the time the weather turns again so I. I'm thankful that this is still moving forward. Hopefully it does still keep moving forward in terms of local organizations. We run this we've been running a space on fourth street for a long time now and most of the people that perform there are organizations that are not local organizations they're from around the city, but they don't have an office and they don't have people that live in the east village, but they perform in the East village a lot, so it is their local neighborhood, even though they can't afford to live there. So I think I urge you to keep that in mind. You know you'll see people showing up that are not local, but the east village is their home. I had a question about where, like when this legislation started, it was much more open. Is this now being just restricted to where there is open street permits, so no parks, no plazas? No, nothing like that correct and back when we discussed this I believe back in July with the league of independent theaters. One of the early conversations about this. It has been limited down based off their a variety of legal restrictions, for permitting on many public spaces and open streets were decided as a space that is varied across the city. There are many of them and continuing to expand, so we are able to add even more spaces onto the list that are available for permits once the program has started. This is just the beginning in my mind, we'll do a last question comment from Andrea sure thank you, jack for all of your very thorough answers to all our questions. But my question is actually something that Susan said: I just wanted to clarify, and it was about the concern over having permanent and unpermitted events and in open cultural spaces. I just I want to understand the concern around that. A little bit because it's I can understand the concern around Covid-19 related situations, but you know all of our cultural institutions are non-profits and are subject to the same kind of registration and certification of our safety plans, so I that is in place, even if you have just like one person coming into your office, so I'm just trying to understand why that would be a concern, particularly given in the past. There are permanent and unpermitted events on much larger scales. Yeah. You want me to answer there, I you or anyone. I, don't know this. Is it I just wanted to understand a little more? So this is the concern you have what exists. Now we have a lot of brass bands coming, so you have a brass band and they're playing say for an hour in on an open street which happens all the time. Well, then, another group gets a permit to do their performance, but they're not going to be heard. I mean they're going to be drowned out. You know how could how can they perform next to this? Okay, not that we're saying we don't want both we're saying that it's going to drown out it's not going to allow the permitted event to do what they're trying to do. Okay. Thank you, awesome, so I believe those are all the questions. Nobody else has their hands raised. Jack. Thank you so much for coming. If you could share your email in I'll, do that right now! That's it and then, if there are any other questions, obviously feel free to email, Jack and then also reach out to our district office. If you have any clarifications about anything that was presented today, so we can move on to working on our resolution about this Joe. If you could bring that up on the screen, that would be great. Yep. Give me a second yep and Carolyn. If you would like to share your updates on the resolution, because they were some that were made from the last version that was seen last month, it does seem from this conversation that we've had that there will likely be a lot more edits to be made. So please everyone gather your thoughts about that and move through it, but Carolyn. If you do want to go through before we start, can I ask a question sure. So the conundrum for me is based on this presentation. It seems that this legislation is still fluid, that there are a lot of things that need to be added to it, etc to properly account for a range of issues. So if we draft and pass solution pass a resolution tonight supporting this bill, this, in my opinion, the bill still needs and I believe we heard, needs a fair amount of work so we're we are essentially passing. We would be passing a resolution assuming we passed it for legislation that has not yet been finalized. So is there any reason? Well that that's my overall, so I'm happy to open it up to the arts and culture committee and Economic Development Committee members to weigh in on this. It seems like from what Jack has presented to us. Yes, these are active negotiations and I believe likely. Some resolution, like resolution to the negotiations, will be voted on sometime this month. So what happens in our resolution isn't necessarily I guess the most important I view this resolution that we are going to be working on as our opportunity to say that we do have some concerns that we are supportive of this legislation, in the sense that we are supportive of a program for arts and culture to be able to have something in this pandemic. But I do think. We could also list that there are certain contextual factors of our neighborhood that are important to understand when saying that we are supportive of this Carolyn. Yes, I think it's really important to pass the resolution in support of the legislation and saying that we want to support something being done to support arts and cultural organizations. The legislation may change, but I think that, from what we're hearing from the council member's office is that a lot of the reservations that we have are being addressed in terms of how it's being permitted and also that the right, the regulations that would have to be followed in order to you know, get a permit to do it. But I do think it is important to show support for the legislation for the impact that it has on the arts and culture community in our neighborhood I. Think it's really important. As Ryan pointed out, we have the most performing arts organizations outside of Broadway and they're, just like being held hostage, Carolyn Mike. My question, I'm sorry to interrupt, wasn't about support or not support. It was really purely about timing. So if this legislation is moving forward this month, then it makes perfect sense. We need to act. That was my primary question, not support or lack of support, just timing of a resolution on a bill. That's still being negotiated. Well, I! Guess it's a matter of opinion, because I do feel like it's important that we craft resolution and that it's passed that because I think that it shows support for a section of our community that is suffering right now and is undergoing terrific hardships. They need to be able to perform and I think. The resolution and support of that shows the city that our neighborhood is responsive and that we are concerned about this issue, opinion so I agree. So I think that in the interest of time we should start working on the resolution. Carolyn. Do you want to read what you have put together? Sure, oh back to the top and Susan I, got your edits or comments to this also, and we can add them in after Carolyn, Okay CB3 supports the New York City Council Bill Intro 2068-22 proposed by New York City Council member Jimmy, Van Bramer, chair of the City Council Committee on Cultural Affairs, Libraries, International, Group, Intergroup relations to facilitate outdoor performance permits for impacted arts and cultural organizations and recommends amending Mayor De Blasio's emergency executive order 148 to allow amplified sound for outdoor performances as regulated by local state and federal guidelines with enforcement by local precincts, whereas New York, City Council member Jimmy, Van Gramer has proposed legislation, Intro 2068-2020 to facilitate outdoor performing for art events and performances produced by established organizations impacted by Covid-19 and whereas it has been a great loss to the city as a whole that in the warm summer and fall months of 2020, outdoor arts and cultural programming was banned and the focus was only on assisting the restaurant industry. With outdoor dining and whereas artists, cultural workers and arts and cultural organizations of all sizes, including many located in Cd3, have been impacted to a devastating degree by Covid-19, the sector lost 69.2 percent of its total jobs since February 2020 according to the center for an urban future art in the time of Coronavirus New York City, small arts organizations fighting for survival and whereas the impact of the loss of accessibility to the performing arts has also had a detrimental effect on the emotional health of our community as a whole. Therefore, we urge mayor De Blasio to amend executive order 148 by banning all amplified sound so that outdoor performances, which would be regulated by local state and federal guidelines and enforced by local precincts, would allow established arts and cultural organizations to be accommodated and make performances accessible to the general public, as this would allow performers to go back to work and funnel funds to the support of economies that support that supply performances. And therefore, we asked the New York City Council to pass Intro 2068-2020 that would benefit Cd-3 arts and cultural communities and the overall Cd3 economy. Andrea. You have your hand up and then Alex sorry I. It was regarding something previously I, don't know if it's worth I see that Jack is still on. I was wondering if he could speak on the timing of the I guess voting on the bill. I, don't know, if he's actually what's the timing of voting on this, so we don't have a vote date scheduled right now, but we're optimistic that we'll have a vote in the council before the end of the year. I'd just like to comment that if we craft the resolution and it's passed by the full board, that would be December 17th, so it would be timely in terms of arriving great. Thank you, Alex. So I think that this is a okay resolution in terms of supporting the theory, but it lacks it. Obviously anything that we've discussed tonight, which would be commenting on the what would happen in practice or what our expectation is with respect to what this bill should contemplate and what continued discussion should contemplate even from last month to this month there it seemed to have been vast changes in what we were discussing right. So last month there was amplified sound and which is still part of the title of this bill and also in our resolution, amplified sound and really anywhere, and now it's open streets and only amplified sound consistent with what the existing regulations are. So as opposed to a band which I appreciate the difference between the band and the allowing the amplified sound again. So I don't even know if it's speaking to what the information was that we got tonight, but I think we should amend it to be consistent with whatever the up-to-date discussion is because it seems a little different. The other thing is I think we should comment on the fact that, although we support this, that there I don't believe that there has been anything worked out there, maybe there's the idea that it will be. But it doesn't sound to me like there's been anything worked out about the anticipated consequences of grouping all the grouping and the cultural organizations, together with the outdoor dining and the people in the street. How we're going to accommodate that which we should like. We should figure out how to do. It should have been done before. All of these things should have been done. At the same time, there should have been open streets and what to do about shut down cultural institutions and performance spaces and open dining, but they didn't do that right, so they really should be doing it now if they want to add another element to an already overburdened situation, it seems like it's going to involve self-enforcement. That's all I got out of this. Was that there's going to be self-enforcement, so the people who have the restaurants are still going to continue to enforce themselves and then whoever else comes along is going to be expected to enforce themselves and I. Do appreciate what Susan said, which is they're going to the expectation is they're going to be adding and requiring I guess permitted right so requiring permits of certain people, but the city is already allowing unpermitted activity and it doesn't seem like they're addressing that either so we're requiring permits of some people and not other people, so I see already a discrepancy in how it's going to be applied or how it won't necessarily have to be applied to some groups while being applied having to be applied to other groups. So none of that has really been worked out in this and I think. We should ask that these things be addressed in the ongoing discussions because I don't there wasn't anything that I heard that, like the permitted versus impermanent it was. It didn't seem that anybody was even familiar with that, but there hasn't been a discussion of any of these things or hasn't been a resolution of what these issues are, but I see them as issues and they should be resolved at the front end so that everybody could try to do this in a coordinated way. You know where everyone benefits. Thanks Alex I, completely agree. I feel like that was part of the miscommunication of the last meeting that it was like. We were talking about very different things. One thing being amplified sound where the legislation wasn't necessarily about that and I think a lot of that was really confusing and we have gained a lot of information tonight. I think it's just a matter of figuring out how to get it in this to this resolution, without staying here forever Olympia. So I was going to respond to two of the comments of Alex. Just because I think there is some confusion still Alex. There will always be people breaking the law. You are a judge, so the legislation I mean you work with law. I understand from previous conversations. However, basically, what I wanted to say is that currently, if somebody abides by the law, there is not a way to get illegal permit to host outdoor arts. You know and cultural events, so what this legislation is going to do will create an illegal and expedited way for this thing to be permitted either there may be people. Susan was talking about legal unpermitted on the street people doing illegal things, because obviously that's outside of that didn't interrupt you. It would be nice if you allow me to complete my sentence and then you can talk again, so basically the unnecessary the unrelevant thing to the relevant. But yes, so what I wanted to say is that actually what Susan is talking about is a little bit more nuanced, because, given the fact that there are legislation and that there are executive orders and state and city orders right actually, I would be surprised unless it was a political manifestation. No kind of permitted was given, for you know, events, so this kind of roaming bans, I'm not sure exactly. It's probably first amendment or something like that, and you never. So what is it? They have? You say it's unpermitted, but it is legal because it's if I can take so the city rules. Only city has regulations only on amplified sound and volume and so they've just it's never come up. It's something that hasn't been an issue, and we didn't have this before Covid-19. So it's new and there are not regulations to cover it. Therefore, it's legal, it's unprecedented, it's new, but it's legal, but I have my hand up yeah, I'm. Let me just finish the three points I wanted to make to Alex's points, and then I'm not sure Susan. This was not happening before because it really has to do with first amendment and public space and I. Think if there needed to be I mean a roaming ban playing music, it's not like. We actually have the guy with the bicycle and the radio blasting that is also going around before pandemic. But that's not true. What do you mean it? They are not doing it as first amendment I work with the police, I know which concerts and which things are billed as first amendment. These are have never in our neighborhood been first amendment issues and it is unprecedented before Covid-19 I mean anyway. So we are talking about a draft bill here and I think there are things that can be legislated and the purpose of this bill is clear. It is about arts and culture organizations that, if currently they abide by the law they can not perform in the public space. So I believe that this resolution needs to focus on the arts and culture and what this legislation is working on and I believe that other issues as I tried to say before quality of life nightlife other issues that we have I think we're going to have a CB3 town hall about open streets in general and they can be addressed there, but I see it as impertinent trying to discuss about this deal around those issues. The other thing that I wanted to say that was brought up is basically in terms of the amplified sound. The reason for which we had added. That is that currently the executive order 148 has a complete ban. So even if the translation passes an outdoor performance theater or whatever, they would need to have amplified sound, so we're trying to say that once they will have a permit, they will also need to be allowed to use, amplified sound and that's why we wanted to address that. For this resolution, I have my hand up crystal. Go ahead: okay, first of all, there are legal limits on the amount of amplified sound. You can have. They exist right now. Police department can close you down. If you are too loud, that's number one. The other thing is that you at this time they may be allowing off the record roving bands to play, but actually legally you can not perform in the street without a permit period. You can't so you know if somebody want, you know things slip through the cracks etc. But as far as this resolution goes, that's all they can say we want to give permits out for groups to play, which implies that if you don't have a permit, you can't perform thanks. Crystal Susan you're up next I. You know, I'm not speaking to argue one way or another for the bill at this moment. What I am saying, I just want to clarify I work with the law enforcement. That's part of my job. They say that they, the bans, are legal. The law enforcement and the police are at this time, unlike before Covid-19 are not enforcing the sound issues. They're, not closing anyone down at all. They have given that over to DEP could only do it on scheduled visits. Things have changed. There are drastic changes, so I'm trying to explain what exists right now. It may not exist after Covid-19, but in working with the mayor's office working with police working with all the agencies, I'm trying to explain what's happening now and amplified sound is not part of this. It's a totally separate issue from this intro. Yes, you know the thing about the roving bands and trying to incorporate that into the resolution. I think that would be very difficult. Okay. This resolution is addressed towards arts and culture organizations, doing a legally permitted process and have to you know, accommodate arts organizations that haven't been able to perform or work all right. If somebody is doing something on their own, without authorization, I have seen a pickup truck with amplified instruments Sunday it parked at the 8th street or the 9th street entrance of talking, Square Park, repeatedly. Okay, they have a sign out for Venmo. It's like that is to me an issue that is separate from what we're trying to deal with in this resolution. I do not understand how we can incorporate trying to deal with unauthorized performance on the street. We're trying to deal with organizations who are trying to follow the law apply for a permit that says that they have to follow guidelines from local state and federal, which should cover the arts organizations. Most of them are very responsible because they have to pay the fines. The other thing that you have to look at this, the new wrinkle and the legislation, is now asking the arts organizations to pay twenty dollars a pop for, if they want to rehearse and that they would have to apply for a separate permit for every one of those events that they do on the street, whether it's a rehearsal or a performance. Okay, it's just like there seem to be a lot of things being written into the legislation and negotiation with the mayor's office. It's no longer like a self-permitting process. The organizations have to go through SAPO. They have to provide certain safety restrictions so getting into how you know. How do we police unauthorized performance I mean that's not what the resolution is about. The resolution is about trying to support an industry that is suffering greatly right now and allowing them a legal process by which they could perform and by which they could ask for donations or sell tickets, at least not meant to address people who are roaming, the streets doing whatever they want to do. We have more comments, I'm going to keep it to committee members for the time being, since there are still a number of them, but please be thinking about how this resolution is going to reflect all of the things that we have all been talking about, because we do need to get there Andrew yep. So I'm just confused at this point. The resolution and the discussion we, the presentation we just heard and the background materials that were sent were to support Intro 2068-2020 this permitting process, but this resolutions also appears to be asking us to support the overturn the adjustment to an executive order banning amplified sound, there's a lot of background noise here in my office. So what exactly? Are we being asked to support the legislation that was outlined to us and attached to the meeting materials, or are we also being asked to somehow adjust this amplified sound Carolyn? Do you yeah I? Do it's like it states very clearly that the outdoor performances would be regulated by local state and federal guidelines and enforced by local precincts would allow established arts and cultural organizations to be accommodated and make performances accessible? Okay, the amplified sound. It's not saying that it's like a free-for-all. It's saying that if the executive order could be amended to allow the use of amplified sound to go along with those permits to me, that's what the interpretation is. It's not saying that you just totally lift every restriction on amplified sound Alex, I'm sorry, I'm actually trying to draft something because I think we're getting stuck on the tree and I'm sorry I even used the example I used for the forest and the example really is that this is just you know. It's a resolve. We're supporting the idea, in theory, with the expectation that everything is going to get worked out in the wash or we're going to be able to address it sometime down the road in some other forum and I just want us to include what our concerns might be about how the city hasn't contemplated all these uses outside at the same time, and that there are still outstanding issues of having them exist collaboratively all of these uses and understanding that there isn't any enforcement in place for misuse. I am not saying that anybody in particular is going to misuse whether it's a cultural institution or a restaurant at this point misuse the space, but it has happened in specific instances in the past, so we should just recognize that those things seem to be absent from this discussion so far. That's it a couple of warehouse clauses that just says that, while at the same time saying we wholly support this in concept- yes thank you, Olympia I mean I'm exhausted. I basically was gonna. Do the point of order, because this is obviously two members of the Economic Development Committee, both of them with ties to nightlife and SLA, and even at the last committee meeting instead of constructively suggesting language. So I want to thank Alexander for finally drafting some language. They just go on a binder while arts and culture committee members and the constituencies that we represent feel really like it can be offensive. The discussion that is being had here today and I want to make sure that we all understand we all live in this neighborhood. We all have children, dogs our lives, so we care about quality of life and that's why CB3 will have a town hall about quality of life and things like that. But this resolution, I want to remind everybody, is from the arts and Cultural Committee and it is subcommitting I wish it was a committee. We wouldn't be discussing many other things, but basically it is about arts and culture, and the legislation is drafted. That way, because and that's why I wanted to understand, you know that legislations can not be detailed. That's why they come with guidelines and they're attached to agencies that enforce them. The legislation is the big idea, and this is, it should be permitted to have outdoor performances and our community in city. Three of us and culture definitely agrees and desires. That and I believe it is our duty at CB3 to also you know, reflect that in a resolution and all these other concerns I believe they're, very valid concerns, but actually are part of that downhole that we're going to do and the resolution about quality of life, but has nothing to do with the legislation designed for the needs of arts and cultural organizations. I think so we're going to keep it I see. I know that there are other hands up, but I think we're going to keep it to only committee members for the time being, because we need to finish drafting this. Are there any other? Are there any comments from any other arts and culture commit subcommittee members that have any specific language or anything else otherwise, I feel like we should start at the top Richard. You have your head up if I understand Andrew's comments earlier from the discussion that I've heard this evening, I'm a little concerned about what might be considered a mash-up of a whole bunch of issues within one resolution, I'm uncertain about the amplified, sound issue and I think it muddies the water here. I would be very happy to vote for the resolution if we separated out the sound issue. I, don't know if that's possible, but that's my thinking on it now. Thank you. I have my hand up. Well, sorry, it doesn't show is having your hand up. Please go ahead. You need amplified sound with the speed or you have because the air it just dissipates for any of the folks in the arts and culture subcommittee, or are more familiar with this when you are getting a permit already through Zappo for an outdoor performance. Are there already guidelines about amplified sound? No, you mean, because there is a superseding guideline for the city. There is a legislation of how much decibel we can have right now. There is no limitation in public space. I'm pretty sure that we have. You know decimal meters. Would you like me to explain how it how they're permitted so the sound permits and come from the police department and the police department right on the sound permit? They don't allow full decimals, so they will allow like in the park they'll say 80 decibels at 25 feet. So that means, if you have a decimal meter at 25 feet, it should not go above 80. Sappo doesn't do that. It comes from the police department, so it is totally separate. But if could I just add a technical issue about a resolution Anisha so first of all, I want to say I totally agree, and this is part of a technical thing. I totally agree with Carolyn. All those comments about the bands were not for this resolution. I was just talking about a situation. I was not suggesting in this resolution, so this resolution is about 206a. It is not about an executive order if you want to do a resolution, reversing an executive order. That should be a separate resolution. One resolution shouldn't cover two different, but things is not correct, because we very often pass resolution that may address different kind of things. These two things are one over the other impacting the subject. Our subject is outdoor performance for artists and that's why we both support the bill and, of course, as Krista and any other artist can explain to you- can not have out or performance without amplified sound that is currently banned by the executive order and the executive order by the way is multi-pronged. It covers a lot of issues, so we're only talking about a tiny point within the executive order. That needs to be amended because it currently has complete ban I didn't know that we were had those you and I were having this conversation, but so, if I can just finish my technically, if you read this is something we bring up all the time and if you read how to write a resolution, shouldn't cover two different things. If you want this to only cover outdoor performances, then it should be to cover outdoor performances and not be for 2068, and then you can, and then you want to put in your amplified sound. But if you're supporting 206a amplified sound is not part of 206A, not suggesting you shouldn't vote on it. I'm just saying it should be a separate resolution going to us going to a separate place. It's not even going to City Council. However, you know there are ways that I, don't I'm sorry I feel like this is becoming an argument and Anisha I don't know is this? What you wanted me to respond to. The question is really like: how do we address amplified sound with in this resolution? If both committees decide that they want to include, it seems like maybe asking to amend this executive order. It I think that is really the dividing thing here between us. This concept of amplified sound, so I wonder if there's a way to reference it without saying amendment of this executive order, because whether it should be a separate resolution or not I think maybe it's something around again that we have a lot of noise in this neighborhood, and you know we want to make sure that considerations around ample time sound or sound permitting is included. So I want to make my point of order, and this is not directed to our district manager. It's not directed to you Susan, but you're, giving some information and I believe the information that you are giving reflects sorry, somebody has TV on. Can you silence them yeah? Could everybody meet themselves who's? Not thank you. So basically, what is happening here is in terms of you know how community boards are chartered and the kind of trainings that we get at the city. We do a resolution based on the needs of our communities and the Archer cultural subcommittee is dealing with that you can send the same resolution. 8,000 places beat agencies, elected other kind of stakeholders or organizations. I, don't see any problem with that, but I believe in order for the brevity I think we should listen to what Alex Amendment has drafted the amendment that Alex has drafted, and if there are any other amendments we should consider them and move on, but I would go from now on with just with concrete language amendments, because otherwise we're gonna end up doing one more month, as we did last month at the service to the greater community by not passing anything Alex. Where are you on any language or anybody else? On any amendment, I'm sorry I'm trying it's hard to well withdrawn. What I would say is that there should be awareness clause first of all, maybe like in this at the top, maybe after the second, whereas first, whereas clause that the CB3 understands that now this proposal will at first because I, understand they're trying to have it in more places will at first be limited to the city open streets program and whereas CB3 recognizes that the city has failed to contemplate the possibility of cultural institutions, utilizing open streets or any public space, while also permitting open dining as well as continued pedestrian use. Experience Alex not to be incredibly annoying, but is there any way you could email me the language just to sure, of course, I can do you want me to email it this second or I? I'm just putting this out there, as proposed like the proposed ideas. First yeah whatever's easiest for the group, but yeah I sent you an email. So just if we want to do it right literally live that would be helpful. I wrote it out because I have to shut down my screen in order to get to my emails and then the final, whereas clause I think- and it doesn't need to be at this in the same place as the two of these. But just that- and this is the part I'm trying to phrase properly is, whereas CB3 is concerned, that the city has not adequately addressed how the current open streets program will accommodate all of these uses and then I guess this is where I stopped, because Anisha asked me where I was and I think I was trying to come up with something that would. We would want to exhort the city to establish clear guidelines for how all of these uses should function together and be regulated. That's it the do. You want me to type into the chat room. Will that help you or will it help you more? No, if I do it via email, because, like I said I have to minimize my screen to do that. The chat is also fine. If you want to just chat it to me, everybody can at least see it right, yeah that that's totally fine again, I'm open to other language or minimizing the language or changing the language. I was just trying to get the ideas out yeah. Let's start with your ideas, I think one historically. What you need to do in order for us to follow the amendments that you write is clean up the document so maybe take out your notes from there and place the, whereas is exactly where Alex is suggesting. Otherwise we can not follow we're we'll get there. We need the text and then we'll insert it and you'll be able to see it yeah, but right now we're actually seeing the notes, we're not seeing where, in the amendment and where, in the resolution, it's being it's going to be inserted well first, she has to put it in the chat. Yeah. Here's one, I'm Andrew Comey! So is there as because this amplified sound thing is still an issue. I saw a comment from Herman. Is there a way to make the turn the executive order amplified sound thing into a whereas so this resolution supports 2006 8-202-0, but then we have a whereas clause as Carolyn and Crystal articulated something to the effect of, whereas in order to effectively have a performance amplified sound is necessary blah. I'm not expert at crafting a resolution. It's therefore it is part and parcel of supporting the efforts of art and cultural institutions and not an outright request to just amend this executive order. So it's putting it's put in the context of the legislation, because one is you can't effectively have a performance in some cases without amplified sound. Would people be comfortable with that, as opposed to it? Just being this very mushed up thing, any comments on that I? It was what I had suggested before that we stayed it, but you know soften that language about I. Think that would work yeah that if it's included in the resolution as whereas that arts and performing arts organizations would need to have access to amplified sound for street performances, I think that would address my concern Carolyn. So we do have two members of the public with their hands raised and it's a one thing, it's very hard for us to follow the text amendments the usually way in which we do it in other communities. Is you finish the one proposal like we still need to read what Alex's proposal was? Then you draft the new proposal that was put ahead by Andrew and then you actually need to understand if it works. If everybody, especially the arts and culture subcommittee, members, feel comfortable with that and then normally once if the members are lower ready to vote generally, the public doesn't contribute while we're writing a resolution, never in land use. There is a public comment area, and now we are working. So it's very hard to follow already we're following through two amendments. You know so I recommend that we read what we where we are, and we finish the resolution sure so I think because Alex is putting forward three new, whereas statements, let's wait for Alex to put those in and then we will go through those three because I believe they're in succession. Maybe and then everybody will have a chance to comment on those I think I'm waiting can I. I've been one of the people with a hand up for 45 minutes. Might like ask a question. So typically, when we're working on a resolution, we don't silent public to speak. It's usually just committee members, but I heard you just say you were opening it. So I apologize well, I was going to say, since we have this lag, I will open it up to you and to Laura Great thanks. I've just heard the use of the word performance a lot and yet I see that it's talking about cultural institutions, doing you know different kinds of activities, so I just want to make sure that you know participatory art engagement that might not be straight on performance is well represented in the language. I'm not it's very tiny. I can't really read it, but that's just my only concern. I wrote it as a question above, which is I'll, just try to read it. So it's clear is this for performances only or is it for engaging in art activity outdoors, for instance, lecture demonstrations where audiences can participate as well in the intro? Is there any information about any limitations on the types of organizations that are able to use it? I'm saying I, I'm gonna, add I mean again. Normally the public's at this phase is too late to participate so but fundamentally I pasted for you. The legislation is for any kind of outdoor arts and culture organization activity. However, there are different parameters if you're doing a performance as opposed to an outdoor exhibition or something like that, and so I mean I. Think that you should just read the legislation and see if you figure it out. Laura you'll have the last comment from the public. Thank you very much and I just want to I appreciate everyone's work to craft, a resolution that residents can enthusiastically support and organizations that represent both residents and businesses can enthusiastically support. I. Think that's really important and I really appreciate everyone's work. I have just heard repeatedly that CB3 has one of the has most commercial noise complaints in Manhattan or New York City Susan will know the answer and I just think that a result that a whereas pause it acknowledges that, as a reason, I have to make another point of order. This is a member of the public and she's suggesting amendments to a resolution. We don't traditionally do that. They had an opportunity earlier during the meeting to speak about the general. You know issues, and so I'm not seeing how this is constructive for a resolution that already was delayed from last month with the contribution of those public members and also Father committee members. I want to make it in the record please in the meaning, because we are making one more time. We are opening something that we addressed. We said this resolution is about arts and cultural, and it is not about quality of life. We're going to have a town hall about quality of life and I think it is very important, I'm not sure, calm down everyone, calm down, Olympia, please relax! Okay, please! You know Alisa allow the chair to chair the meeting Olympia. Please stop, let's go ahead and move forward. I think we all heard Laura's comment whether the committee decided to include that in the resolution is up to the committee. So now that we have Alex's three, whereas Clauses Joe, do you want to read from the top and then we'll focus on those three warehouses yeah before I do Alex did I place them in the right spot. I thought I did, but I just want to make sure that I think that the third one was probably going to go further down, but you have them all in the same place. Can you just take the all out of the second line in the middle of the third paragraph, because it's a mistake? Yes, you got it there's a way to make it a little bit bigger. Yes, let me try it's very big on my screen. So if you guys are not seeing it, they don't necessarily have to be there. I just figured that the first two at least are more introductory okay. Is this or in terms of folks being able to see it? Yes, okay, so what I'll do is I will read the three clauses as they stand right now and then happy to kind of adjust or move them around. I. Think Alex to your point, there's probably a better place for the third one, but let me just do it in the surface of reading it, which is all right, so the three new clauses, whereas CB3 now understand now under right, that this proposal will at first be limited to the city, open streets program and, whereas CB3 recognizes the city has as yet failed to contemplate the possibility of cultural institutions, utilizing open streets or any public space while permitting open restaurants and dining and expanded pedestrian use and whereas CB3 is concerned, the city has not yet adequately addressed how the current open streets program will accommodate this use in its discussion of this legislation, so that exhorts the city to establish clear guidelines and parameters for this added use and its enforcement. And then the next warehouse clause can I make a suggestion on the third. Whereas could we include, after the and a statement about- and this includes the use of amplified sound for performances, and that way you would be addressing the issue of amplified sound for performances and stating that that's what it's for then having the last. Therefore, okay, can we go back down to the last there? Therefore, the only way I see to add that will be to will accommodate this use, including amplified sound I mean it's a it's an it a different idea and just tacking it in as a little clause. So I don't know if you really want to do that, but okay I'll put it in brackets. Just that way now scroll up, so that way folks can see the lines again or will accommodate this use, which would include the ability to have amplified sound I guess is better phrasing. I mean I think we can not put this in the context of the legislation, because the legislation purposefully doesn't deal with that. It is the executive order that deals with that, so it could be a separate whereas, as Andrew was suggesting I think I'm sorry. Is it the part about the amplified sound? That would be separate, I'm just yeah, because that one is part of the executive order not of the legislation, but if the legislation is still being in the process of dealing with the mayor's office and amended that perhaps they could amend it there. It seems like to me that this is still in enough of the open discussion that we could include anything that we think is appropriate or meaningful. That should be part of that discussion right, because, if even if it isn't actually in whatever the actual resolution is, it will ultimately end up somewhere in practice right. So we have to say at this point, even if down the road we get a say in another venue yeah, because the what we're being told is somewhat good because they're in negotiations with the mayor's office about it. So if we have it in the resolution following that, they should look at that particular aspect of the performances that I think to me. That would be a way of addressing it. Andrew, you have your hand up, yeah I, think it's fine here, but I still am pushing to amend the opening section of this, such that the opening section really reads that we support the legislation right go up some more so this opening bold statement in my opinion would end at outdoor performance permits for impacted arts and cultural organizations period right and then this whole thing about the amending. The executive order becomes a whereas clause, which I would ask I, would impose on Alex to try and help craft, because I'm not fluid in warehouse clauses I mean, can I ask what is I mean I'm okay with it, but I don't understand. Why is this important for you, because if the substance is not changed right, no, because I think what we've heard and what people have concerns about. Olympia is the impact of just of amplified sound in an order already noisy over saturated, so I want this to clearly be put in the context of supporting the ability for art and cultural institutions to perform in a way that is, you know, conducive to what they need to do right. So what I've heard from Crystal and Carolyn, not every performance- and we just heard I'm sorry from the person who was speaking about you- know a reading or some other type of activity on the street that would not necessarily require amplified sound I. Just want this clearly to be tied to performances that need amplified sound so that it's not we're not just we're not. We are not blanketly asking for an amendment to the executive order for the sake of asking for it we're asking for it in the context of supporting this open streets legislation, so I have a proposal then thank you, Alex I knew you would I was hoping you would so we then maybe we should move that particular phrase further down and construct it like this, whereas Cv3 recommends further recommends that the city executive order, 148 amended to allow amplified sound for outdoor performances, which would be regulated by existing local state and federal law or federal guidelines. We don't need to change that it's more of a therefore than whereas this one, it might be a therefore yeah, I, agree and also Joe I. Don't think you need the word now in the first yellow amendment, it's where CB3 understands you know, okay yep, and where would we propose talking that amplified sound, therefore, is it not just replacing the this where, therefore yep I think so I mean? Let me just put it I'm literally just doing this live and Alex I, unfortunately, was not able to type fast enough to capture everything that you said again, but can't you just change this one to therefore hold on to amend executive. Can you take out the first phrase, so it's like. Therefore, we urge the city to allow established arts and cultural organizations to be I, think it might change that. We urge the city to allow established arts and cultural organizations. I would either to be accommodated by allowing them out to perform outside you know, or in the open streets program or I, would say to host outdoor performance. Yeah I would take out, accommodated yes and to yeah, that's fine and then take out and make performances accessible to the general public yeah or to pro, to hold outdoor performances accessible to the general public right yep. That makes sense. Yes, what was the to be accommodated part you wanted me to yeah take out, because that's so just cut it accommodated by allowing them to hold I would just put. Therefore, we use this established arts and culture organizations to hold yeah just extra words, yep and then so. Do we want to cut this? No. Can we scroll up because yeah you still need that? Okay, so we have two therefores, so I would just put this I would. Is it actually entitled Mayor De, Blasio's emergency executive order? Yep I mean mayor that is De Blasio, you can say major Al executive order, I talk about executive orders all day long and we refer to them as Eos, which are the state ones or city executive orders, you're, correct, probably city, executive, yeah, I would just say the city executive order 148 because it identifies it to allow it to sound, better I, always see it as mayoral as opposed to City, Council or something I mean, though only the mayor I, think so it's just distinguishing it as executive order 148, which the city promulgated as opposed to the state correct. So not having read the executive order. How does this? How does amending this executive? So will this allow anybody now to perform outside using amplified sound and we're relying on the police department to say it's too loud? No, it would be regulated, it should be, which would be regulated by existing local state and federal guidelines. Okay, so it would just they would then have to file for permits for amplified sound just like they had to before. It was banned right, so I believe enforcement by local precincts. Or do you think that that's I mean that is a we kind of an argument and it exists with the guidelines. So I don't know that you necessarily have to leave it there yeah. We can dig it out, I think so, if you could walk me through the practicals of how this works now. So if I'm, an arts organization and I want to have a performance on the street, I need to apply for a permit, and that goes through Sappo. Is that correct right now, the way it or it has been in the past when you do an event and you a street event, it goes through Sappo. The precinct will not issue you a sound permit until you have the certificate from Sappo authorizing it so got it. So then, so you get the SAPO permit Carolyn and then you have to apply for the sound and then you go to the precinct with the permit from Sappo, and they will give you the sound permit, and this executive order has prohibited people from even applying for a sound permit. My understanding is that Zappo has totally axed any outdoor performances period. You know our street events, so there's performances in the park with sound permit, so Susan could can so. This executive order prohibits a concert in the park. If you apply and get the that's, what I'm not understanding, one thing, I really don't understand, is Sampo never permits anything in park. So this is just for streets yeah. This is just for streets. The one sound permit that was permitted in the park was a concert that was billed as a first amendment concert. It was put on the application, so that's the only sound permit other than that the police are not issuing sound permits at this time. That doesn't mean it's they're not going to change that right. But what is this executive order currently banning, which is the mayor, has an executive order that banned sound permits period for any anything, that's I haven't read it. That's my understanding and the only way to change that is for the mayor to revise his executive order right Andrew. If you want to read it, I posted the executive order here exactly as Susan says. It states that it doesn't allow any agency to issue sound permits. Great Alex has her hand up. Oh it just in terms of order and what, where things should go I'd should we leave the last. Therefore, that's one question, and then maybe what we should do is take out the phrase of my last, whereas clause, which I think should go someplace else, I, don't know that it should go up at the top, because the arts and the art subcommittee had. You know good language for why this is so relevant, which should go higher right, but maybe taking out the exhorting the city to establish in its continued discussions, exhorting the city to establish clear guidelines and parameters for this. You used as part of open streets and its enforcement, so I mean I, don't know, I didn't care either way if it stays in the whereas or it goes to a. Therefore, I'm just I recognize that I wrote two things in there. I mean Alex, ultimately, I think what you're trying to ask is not gonna be an issue of the legislative body. It's gonna be an issue of the agency that will be enforcing that I appreciate that, but by Jack's own presentation it is a continued. You know it is something that they're kind of discussing, but not really establishing anything. For me just think it should be something that happens during the course of the continued discussions like how do we do this? How do we affect it and not just leave it to D.O.T, but we can leave it in awareness clause. If you want to leave it there, that's fine! I'm just thinking of an edit that will make it more effective. I'm not saying that you don't want to have it, but right now, I'm not sure it makes sense. That's what I'm saying I think needs a little bit of editing. Can we read the whole thing so that we understand what it is right now because you moved it around, you can still move things. Do you want me to read it or Joe? Do you want to read it from the top from the first, whereas and all the way through sure yeah, you have to read the I guess title CB3 supports the NYC council bill in Intro Right Int 2068 2020, proposed by NYC council member Jimmy, Van Brammer Chair of City Council Committee on Cultural affairs, libraries and international intergroup relations to facilitate outdoor performance permit permits for impacted arts and cultural organizations, whereas the council member has proposed legislation, Intro, 2068 2020, to facilitate outdoor performing for art, events, performances and performances produced by established organizations impacted by Covid-19 and whereas CB3 understands this proposal will at first be limited to the city open streets program. Sorry, and so do you want to do quickly, an amendment because this one doesn't make sense, we either need to say facilitate outdoor performing for us as a produced by established organizations, or we just say for art, events and performances. You don't need both yep excuse me, Anisha can I ask. Could you explain because I have some technical concerns and I, don't know where you want people? Do you want to read the whole thing? Do you want to read each paragraph and have people add their comments? What is the format that we should be using in an organized manner? So it seems like, since we've added a number of things, let's do one full read through and then we can so everybody understands how everything flows and then we can go back and make specific edits. Thank you. So Joe keep on going. Okay. Where was I, you were reading the word performing yeah sorry. Now it was a joke, whereas CB3 understands that this proposal will at first be limited to the city open streets program and, whereas CB3 under recognizes the city has as yet failed to contemplate the possibility of cultural institutions, utilizing open streets or any public space while permitting open restaurants and dining and expanded pedestrian use. And whereas it has been a great loss to the city as a whole that in the warm summer and fall months of the 2020 outdoor arts and cultural programming was banned and the focus was only on assisting the restaurant industry with outdoor dining and whereas artists, cultural workers and arts and cultural organizations of all sizes, including many located in Cd3, have been impacted to a devastating degree by Covid-19 parentheses or open parentheses. The sector lost 69.2 percent of its total jobs since February 2020 according to center for an urban future. It's a art in the time of Coronavirus New, York, City's, small arts organizations fighting for survival, and whereas the impact of the loss of accessibility to the performing arts to the performing arts has also had a detrimental effect on the emotional health of our community. As a whole and whereas CB3 is concerned, the city has not yet adequately addressed how the current open streets program will accommodate this use open brackets, which would include the ability to have amplified sound in its discussions of this legislation, so exhorts the city to establish clear guidelines and parameters for this added use and its informa and its enforcement, and therefore we urge the city to allow established arts and cultural organizations to hold outdoor performances accessible to the general public, as this would allow performers to go back to work and funnel funds to support to the support economies that supply performances, maybe a tweak there and therefore CB3 further recommends amending city emergency executive order, 148 to allow amplified sound for outdoor performances, which would be regulated by existing local state and federal guidelines, and therefore we asked the New York City Council to pass bill, Intro 2068 2020 that would benefit Cd3 arts and cultural communities and the overall Cd3 economy. So Olympia you have a question or a comment: I have three edits to suggest one. Is you still need to delete? The word performing is redundant where it says to facilitate outdoor art events and performances. You don't need to say performing art events. What performing is a leftover just take it out, okay and then the second edit is where it says: artist. For some reason, it's capitalized it can be low case. I, think it's on the fourth or fifth, whereas yes, and then the third day that I'm suggesting is to take the last whereas and make it a. Therefore that is the second to last after the executive order, because that's where it would make sense so I would trans I would make this. Therefore, instead of awareness and then whereas, given that CB3 is concerned, yeah something like that, I think it makes more sense there than here. What do you think? That's fine. It would then be like, therefore, given that CB3 is concerned, that the city has not yet adequately addressed how the current open streets program will accommodate this use. It I would say at legislation, comma it exhorts CB, CB3, exhorts, the city to establish clear guidelines and parameters for this added use and its enforcement. Should we take out the brackets, then yeah I guess I got the brackets if you're gonna leave it yes, yep and now I would move it I think below after second to last, I would put it I think that's where it makes sense in the flow of the argument. Okay, what do you think Alex is that where it makes more sense, yeah, that's one I would put commas the comma for the, which would include an after amplified sound and then amplified sound, comma yep. Okay, I have a suggestion in the where therefore, okay, basically start at the top and okay can I suggest that you insert for permit amplified sound for permitted outdoor performances. Just insert the word permit between and outdoor isn't this? Oh do you want to put this? So what do you want to just say will accommodate permitted outdoor performances? Yes, as opposed to this use so she's, taking the second line of the yellow, therefore clause, it would say after will, accommodate permitted outdoor performances and delete the this used piece. Thank you Anisha. Could we start at the top now and go paragraph by paragraph or actually I? Don't start with the title: let's go to the top. Can I give nice? These are just strictly technical stuff, so I think it's just way too much information in the title, I suggest to read. Cb3 supports the NYC console bill, Intro 2068, to facilitate outdoor performance permits for impacted arts and cultural organizations for the title, I agree, and then, if no one has anything else for the next paragraph, should it be intro in the title or yes, yeah intro 206 NYC council bill Intro 2016. for the next paragraph, I would say, whereas proposed legislation, Intro 2068 would facilitate outdoor performing and the rest. So we take out NYC council member Jimmy, Van Bramer has so it would be, whereas proposed legislation Intro 2068 would facilitate outdoor performing I would leave it as art events, because there's a possibility that other types of events- all of them- yes, I- was just saying and everything else would stay. Yeah got it. Everything else would stay. The paragraph below that I would totally take out I. Don't think it adds to what you want, not that one Joe the third on now, it's like the fourth, whereas and it's been a great loss to the city, I mean I. Don't see why that's a problem? What is the argument? Susan do? What do you want to say about it? I would just take out where's it been in great loss to the city I that it was banned. Oh I'm, sorry, so the only problem I think is where it says the focus was only on existing restaurant industry. I think it's the kind of putting them in conflict, so I think just taking out, and the focus was only on assisting restaurant. You know, in other words, say what you want without kind of being negative about something else. You know it is part of the debate at the office of Nightlife and the arts and culture of DCLA because they have been put down. Obviously, but this is a community board resolution, so you have, whereas great loss to the city as a whole during the warm summer and fall months of the 2020 outdoor arts and cultural program yeah that we can take away the and the focus right. I agree with that. I think it detracts from this section talking about why we want to support arts and culture so just delete what I have highlighted. I had no suggestions for the next paragraph should is that I mean this is a minor technical thing, but we have a kind of open parenthesis and then a title capitalize the should we either end a sentence, or is that usually how it is in resolutions yeah? How do we normally include something like that? Yeah parentheses right I mean you could take out the parentheses and just leave the reference there. Yeah, okay, the next paragraph I, had no suggestions. I, don't know if anyone else had comments, I would maybe delete the as a whole, but I don't feel strongly about it. I agree with you I think it's better. It just reads better: okay, the next paragraph. We still have that I would suggest to say. Therefore we urge amending executive order take out mayor. It may have been done already take out mayor, De Blasio, therefore, okay, so that's already done and then in the last paragraph just hold on one second I need to plug in my computer baby. Okay, the only sorry, the only thing that seemed awkward as I was reading. It is to go back to work and funnel funds, I guess to support to the support economies that supply performances, I, don't quite know what that means. The chain I think it's the chain of you know people that, maybe you know, make things that the theater has to buy and that kind of things you know like if a theater works, it's also the costume designer the graphic designer or whoever else that gets jobs. This electronic equipment doesn't have a fabric for the economic ecosystem or something yeah local bodega right, everyone gets lives off the theater. Is it like support businesses or support, or is it a good way to do it? Organizations I think to business performance, businesses and suppliers of the performing arts? Maybe use your ecosystem suggestion, because it's not only suppliers, it may be something different than you know. That's right! Yeah, okay, tell me when you tell me when you finish: yep, sorry, one Sec, sure and I. Don't think you need economy, I'm not sure it could be economic ecosystem or I. Think just ecosystem yeah. Is that better yeah? Okay, sorry, Susan? Okay! So for the last paragraph, I would just revert to our standard language, which would be therefore community board. 3 supports Intro 2068, which would benefit community district, 3, arts and cultural communities and the overall economy and the overall local economy me read it again, I think so. Yes that'd be helpful. Therefore, community Board three yep supports Intro 2068 yep, which would benefit community district, 3 arts and cultural communities and the overall local economy. So could you just go back up to that odd ecosystem thing? Yes, because it's not the broader ecosystem right, we're not talking about turtles and frogs, it's to support the broader cultural or performing arts or whatever we, whatever we've been consistently, preferring I. Think it's cultural I mean I think, but what they meant was more businesses. So basically there is actually so then it's the economic ecosystem. So then, yes, let's live in the economic yeah, then I think our choice of words of economic ecosystem is better okay, so just a broader economic ecosystem, yep, that's fine and you can I think you can just eliminate all the yellow things now. Are there any final thoughts? Do we want to read this once through again? What do we want to do? I'm proud of us, you guys I, was very worried about this and how we were suggesting, if you don't mind sure, go ahead. If you could go back down and I just took it out, sorry what was for which part of the paragraph that says, therefore, given that CB3 is concerned, yep I was going to suggest saying therefore CB3, then the last part says exhorts the city to establish clear guidelines and parameters for and then putting the current open streets program to accommodate permitted outdoor performances. I just think it would be a little more clearer just saying that we're exhorting the city to allow the permit permitted outdoor performances. It's the same thing. I just think it'll flow a little bit easier because we obviously are concerned about it. That's why we're putting it as a therefore you're saying essentially just use parallel language structure and like this part that I've highlighted copy it and put it here, yeah, and I'm just saying like just being directly saying that CB3 exhorts the city to establish care, glide lines. And then you know we're saying what we mean by saying: the open streets program will accommodate permanent outdoor performances, but then maybe you don't even need the first line because you say it more exhaustively in the second part. Otherwise, it's a bit repetitive, no yeah I agree with that. So essentially just cut out the given piece. That's what I suggested? Initially. Oh okay, so therefore just exhorts the city to establish clear guidelines and parameters for open for outdoor performances and its enforcement, because it's in the enforcement of the performances now their enforcement of a local state city, our local state and federal guidelines. Oh the guidelines got it: okay, yes, okay! So do you want me to read it one more time? Let's read it one more time and then we'll go ahead and vote on it. Okay, title CB3 supports the NYC council bill, Intro, 2068 2020, to facilitate outdoor performance permits for impacted arts and cultural organizations, whereas proposed legislation, Intro 2068 2020 would facilitate outdoor art events and performances produced by established organizations impacted by Covid-19 and whereas CB3 understands. This proposal will first be limited to the city open streets program and, whereas CB3 recognizes the city has as yet failed to contemplate the possibility of cultural institutions, utilizing open streets or any public space while permitting open restaurants and dining and expanded pedestrian use, and whereas it has been a great loss to the city. Yes, as a whole that in the warm summer and fall months of 2020, art, outdoor arts and cultural programming was banned, and whereas arts, cultural work, arts, cultural workers and arts and cultural organizations of all sizes, including many located in Cd3, have been impacted to a devastating degree. By Covid-19. The sector lost 69.2 percent of its total job since February 2020 according to the center for an urban future. I'm just going to skip reading that full title. Although I guess it needs to close quotation marks and whereas the impact of the loss of accessibility, the performing arts has also had a detrimental effect on the emotional health of our community and therefore we urge the city to allow established arts and cultural organizations to hold outdoor performances accessible to the general public, as this would allow performers to go back to work and funnel funds to the broader economic ecosystem and therefore, CB3 further recommends amending city emergency executive order. 148 to allow amplified sound for outdoor performances, which will be regulated by existing local state and federal guidelines, and therefore Cv3 exhorts, the city, to establish clear guidelines and parameters for its open streets program that will accommodate for permitted outdoor performances and their enforcement, and therefore CB3 supports Intro, 2068 2020, which would benefit Cd3 arts and cultural communities and the overall local economy. Oh, that sounds great Madame cheer. I'd like to ask one question sure: go ahead: it keeps referring to arts and cultural organization, but you are individual artists that are not established cultural organizations and there's only one portion of the, whereas that referred to artists there, but I understand that most of the people who would probably benefit from these are individual artists. Is that structured anywhere in this I think you're right? This also would include individual artists. I, don't know if we should go ahead and list them. In addition to arts and culture organizations, it seems if I show up with my guitar yeah, but from what I understood in the presentation you actually have to get money. You have to have received money from the New York City Department of Cultural affairs to benefit from this. That doesn't mean individual artists can't because an individual artist can receive a grant from the New York City Department of Cultural Affairs, so but Herman, it's not just anybody can show up and apply for a permit. You have to meet the criteria of being funded by the New York City Department of Cultural Affairs. Okay, I'm not suggesting we add that to the resolution. Okay, if I take that into consideration, then there's a lot of people. Yeah. No individuals in theory could qualify for this because they do qualify for a department of C City Department of Cultural Affairs grants. Would you say, could we say qualified artists? No and my understanding, you have to be a non-profit in order to apply for the department of Cultural affairs or have a fiscal sponsor in order to apply. They do not fund individual artists. There are other local organizations that do I mean lower Manhattan cultural council can fund an individual artist. Caroline I stand corrected, you're right, that's what I was thinking of. My apologies right. Dcla does not fund individual artists. Okay I still hold to my premise that a lot of people will get sidelined because, as usual, you know there there's an hierarchy there, where it doesn't allow some people who are not qualified artists, but are true artists, because a lot of them is in the in this neighborhood, but the legends not asking to change anything. I'm just making a point right. Yeah I, agree with that. There is a significant barrier to entry to get DC money and be a qualified arts organization, but I guess those are the parameters that they've put into this legislation, as it is I think that those are parameters that evolved out of their discussions with the mayor's office, because the way that, when you looked at the legislation, the way that it was originally drafted, it wasn't like that. This is the whole thing about that. You have to be funded. You know have to have received funding from DCLA in order to apply for a sappo. Permit I mean that's a whole new ballgame, it's okay. So, are we ready to move forward with this I'd like to make a motion that we support this revised? Crafted Andrew, exhausted I really did not expect it so we'll go ahead and do a roll call vote and I will do economic development and arts and culture. Also, if that's okay with you Karen, so Anisha Stefan, yes, Megan, Joy, absent, Aleister Conomecus, I'm not sure if he's still on I got exhausted either he's on, but he's not at his computer Andrea Gordillo. Yes, Herman Hewitt, yes, Joe Kearns, yes, David Louis, yes, Alex Militano, yes, Richard Robiak, yes, Rodney Washington, yes, Andrew Comey! Yes, I'll! Go back Alistair! You there crystal field, okay, what happened to her we're still going hi? It's Aleister, I'm here! Okay! So are you a? How are you voting for this resolution? Yes, great? Okay, so we'll go to arts and culture. Carolyn Ratcliffe! Yes, Tatiana Giorio, yes, Olympia Kazi, yes, Wendy Lee, yes, Tariq, Ramos, Tariq, I, know that you are maybe he's not on anymore Thomas, Rosa, yes, and crystal field yeah great. So we have more things to do tonight. So there are two things for arts and culture, but next on the agenda is talking about the special district which has been on our agenda for a really long time, so I feel like we should do it and then, after that we can close the economic development meeting and then arts and culture can continue. So, let's try to be time sensitive to the arts and culture, folks that are on this and have to listen to the special district also, so we had paused our special district discussions because of the pandemic. We approved a resolution about the special district in February in March the pandemic happened. We had been planning to do outreach between March and through the summer and into the fall and I pulled up our very limited outreach proposal, which were which was to speak with a presentation at an Evema meeting. We were going to schedule a couple block association meetings and then tenant association meetings and then also have a formal town hall. So that's what had been mapped out for us I think with the new landscape of you know the world we live in right now. How do we want to proceed doing outreach for with those specific groups that we had? Does that has that changed and how would we like to move forward? Does anybody have any yup so I don't see anybody from Avima on our call this month, but they had been the two previous months and I. Don't know that we can speak for them, but I, remember very clearly, I don't know if Laura has any insight that they had volunteered to host you know and obviously it would have to be done via zoom, but I believe they had agreed to host a zoom outreach meeting, so I would suggest if we can confirm with them that they're still willing to do it. That would be at least a good place to start, and then certainly I'm sure there are black associations that would be willing to do the same, but we'd obviously have to contact figure out who they are and ask them if they would be willing to facilitate one I guess the bigger question: if we want to stick to the avema block associations, tenant associations and then have a town hall is really what is the timeline for doing that, and how do we logistically want to do it I think there are. You know we had thought about inviting people to our meeting time. We had thought about set, you know going to their specific meetings. I think I also want to make sure that everybody understands the bandwidth of the committee and the office to facilitate these things. So I will also. You know, hope that you know. Members of the committee would want to attend these in order to do some of these presentations, because I know that the office is particularly overwhelmed right now with a lot of things, so it will really be on the committee to do a lot of this outreach. So I guess would we want to start to see if we can do something starting in January or February, and then we could tee these up over the winter spring and into the summer, and maybe try to do I, don't know target a town hall for like late summer, depending on how things end up evolving and accepting that things might have to deviate. Susan right, you didn't mention NYCHA or any of the any groups on Avenue D before the town hall. That was transportation was that was as part of associations right of what tenants, associations I think we were contemplating those buildings as part of tenants, associations, attendance meetings, I think there's going to be some real challenges in getting people engaged on this frankly. I think that, like certainly Vemma will probably be interested, but in terms of tenants associations and the ability to connect and reach a lot of people I'm concerned about, but I don't know we press on. If we need to no anisha I would agree with you on the tenants associations but again I think we have an active small business association that has been interested in this. For quite some time, so I don't see any harm in asking starting by asking them if they could host something and when they would like to do that, they may say no. This is the holiday season. You know we need to concentrate on our businesses or rescind the offer, but I think that would be a place to start and I. Think there are black associations that I'm sure would be interested. I think that the challenge doing anything in the next couple of months will be the tenant associations. Okay, so maybe we start with the business groups and then, as things evolve, we figure out how to engage the tenants association. This is Laura. I have some information that may be helpful if it's appropriate for me to speak, go ahead. We've lost everyone who was on the call. We did have some tenants on the call, and we also had some vemma members on the call, so they regularly meet tuesdays at 10, usually once a month, so I think a goal of being on a meeting hosted by them at their normal time that they normally do it in January or February would be they'll. Have the bandwidth then and I think that would be you'd get a best better turnout than you will at your normal meeting time. So I think and they're very they're eager to hear from you and give you and to give you their feedback. Okay, thanks, I think January February is too close, coming off the holidays, so I think it should be pushed back using Andrew's suggestion for something later after April, at least after eight no I wasn't suggesting that for a vemma, I was suggesting that we defer to them as to when they would like to know what I'm saying. Yeah I was saying: NYCHA and the tenants association is probably going to be utopian. Yeah down the road. Okay, so I'll go ahead and work with Susan I feel like Susan is I, don't know, Susan I, hope you want to help me with this and start reaching out to folks and see what we can get calendared for this, but I will then either in the next meeting update everybody with the schedule, but also who is going to attend. Who has the ability to attend these meetings and ask for volunteers for a lot of that stuff, because I really do think everybody has a lot to do right now, so I want to make sure that the committee knows that they need to be plugged into this also, and it's not just going to be able to be me and Susan running around so I'm happy to reach out to Vemma, but who else I don't know anyone else to reach out to? There are community-based organizations that you could I thought we said we're business groups, Susan I was simply suggesting what I thought was an easy way to get the ball rolling. The theme is very easy, which is, let's just simply start by reaching out to Avima. You know them Laura's. On the call any one of us could reach out to them and ask them if they're offered to host a forum to have this conversation still stands and what is the most convenient one and time it's the first Tuesday in February or the first Tuesday in March, so be it I'm happy to outsmart something okay great. So, let's plan on that Susan I'll work with you on it and then we'll go from there and then plan to continue doing outreach to the tenants associations and figure out the right timing for those things and I think the ultimate goal is eventually to have a town hall when it seems right and again, this is supposed to be a very. This has always been contemplated as a very long process to get this zoning change so happy to keep on working on it, but just so that everybody understands the this is a multi-year engagement. What are we going to use for presentation materials? Do we have existing materials that are I, think we need to look and see what we have and then I? Might you know reach out to some committee members to help work on it? I think this is really kind of technical around zoning and we need to make sure that especially those who are going to be able to go attend. Those meetings like have a pretty good understanding of what we're actually talking about. Okay, great. Are there any final comments or questions about this motion to adjourn so economic development will adjourn and Carolyn can continue. Her meeting Joe I want to make sure before you log off that you give the hosting to Clint. Yes, you have to take attendance. I'm gonna go ahead and do that, but before Joe jumps, I wanna make sure that happens. Yep I will do that cool, so I'll go ahead and do the roll call for economic development so Anisha Stephen, yes, Megan, Joy, absent, Aleister, Conomecus, Alistair, hi, hello, Andrea, Gardio, yes, Herman! Yes, thank you Joe, yes, David Louie, yes, Milotano! Yes, Richard Ropiak, yes, Rodney, Washington, yeah and Andrew Comey! Yes, awesome! Thank you guys so much, I'm glad that we were able to come to an agreement on this resolution. I was very worried after last month and I appreciate you all working on this and you know agreeing on something. Thank you. Did you see in the chat that Tariq was I dropped out? Great? Yes, thank you guys. Thank you, okay, so we're on for arts and culture now is okay. Who is the closed meeting now, not just the arts and culture affair. All arts and cultural affairs meeting on the agenda was to discuss the upcoming town hall. You Susan still on. She hasn't signed off, but she's not in front of her machine. So I don't know if she's gonna stay or not. Okay, because the last Susan had reached out to both the electives and Carlina is we're waiting for Carlina to get back with the date on the town hall that she would be available and stuff. So she's also reached out to Jose Serrano's office and I haven't had an update that he's been back in touch so I guess what we should do is go ahead and open. This meeting is Anisha still here. Are she off also I? Think Aneesa is not here: yeah Anisha signed off, okay and I. Think since we have a couple of members of the public that are actually theater people, you should maybe explain what is the town hall because it may be of interest yeah. It just is the Clint. Can you post the agenda, please sure hold on one. Second, I didn't get an email, but I will just copy it from the website hold on. So you have it yep. Okay, sorry about the delay on that, I'm just switching over the screen. Now, okay, there we go so we are on the second portion, which is the arts and culture subcommittee agenda. Right so is Amanda present arts on site. Are you here, I thought I was just looking at the participants to see if she was still I do not see her. No I, don't see her listed all right, so I suggest that we go on to the planning for the town hall on arts reopening okay. So, at any rate, what we had talked about at the previous meeting in November was organizing a town hall and people had requested that it possibly be in December I spoke with the office and it was not considered a good idea to do December, because so many city offices are closed, are don't operate at full speed ahead during the holiday season, so at any rate, Susan has reached out, as I said, to Carlina's office and to Jose Serrano's office and we're waiting to get back a possible date for January and everything to go forward with the town hall. Then I think what we would need is for the committee members that are here. If you have suggestions as to the agenda for this town hall and go with that just so you know, Anisha is back. She was in the waiting room, I missed the notification. Apparently when I was copying the agenda, but she is back now: okay, great so, okay, we're open for discussion on the town hall and the agenda for the town hall. Are there any comments from committee members? First Olympia, I didn't raise my hand. No I asked if you had comments about the agenda. I mean my understanding is that in the last meeting we just decided that we want you to have a town hall meeting with the electives to understand what are they doing in general for supporting artists and arts organizations not just about reopening. This is an edit that maybe you as the chair is suggesting, or it came back through discussion with other entities. Do you want to explain this that I thought that what we were doing is asking one? First and foremost, if the council person wanted to co-host the town hall okay, so my understanding is that we're waiting to hear back from Carlina's office on that with a date that would be convenient for them to do that. Carolyn I need to have her hand up as well I, just whatever you're writing me. Anesha I, believe we I don't know if you saw Susan's email, we heard back from Carlina's office right, so I think that she had availability. Did you already? Maybe you already said this I think it's in January my understanding. The date was not firm yet from Pedro I. Believe I think she offered two dates and I believe it was in the it was in the early part of the year just to say that like she's, not pushing it off until like May or something that I can see, if I can find the email but okay yeah, because no I didn't see an email with Dave's. Let me see that so she offered January 19th in the evening, 6-7 or February 3rd, so I think it's figuring out. Besides Carlina, you know who else I think who else should be invited? Well, the other part of the question was: is Dirk. Did Carlino respond into the request that she co-sponsored the town hall I, don't know if she's the request was to co-sponsor, but that's the date that she's available and I. Think if you have, if you want her to co-sponsor, you should just ask no. That had been the original request, because when, in fact, when I had asked about it, we had gone over that and Susan said that she would do the outreach and then have them contact me. Okay, so Olympia has her hand up as well. Okay, so Olympia! Yes, so I wanted to reiterate what I said earlier, because I'm not sure your answer to what I said right now. The agenda we see in the screen says planning for town hall on archery opening. Instead in the previous subcommittee meeting last month, what we discussed was a downhaul that would address the you know what is happening at our artist and arts organization right away in terms both of intermediate support and long-term reopening agenda, and we were discussing about elected officials. That would have a say in terms of how the federal aid that we all know eventually will have to pass will be distributed among agencies and thus at the arts and culture DCLA, mom, etc. So you know, the most important thing for us is to clarify. The agenda is still that or it has changed to archery opening only and then who are the key elected officials because Carlina, even though she represents us, it doesn't really have a lot of say on these issues, as opposed to other elected officials right well. That was the whole reason for contacting Jose Serrano's office because he's the chair of the arts and culture for the state assembly and as to what the state assembly is doing. It is something that he's spoken about in a meeting that he is actively working on and is concerned about, but my understanding from the last time that I spoke with Susan is she has not gotten a response from his office yet so she was supposed to refer his contact to me as soon as she receives an answer. So at any rate, how is the 19th looking for the rest of you guys if we want to confirm with Carlino? That would be a good date. What day is the 19th? Oh January, the 19th would be January the 19th. What day of the week just a minute January the 19th is a Tuesday that, and perhaps the other thing in February third was the other date that she floated. So the other option is to contact Jose, Serrano's office and say these are the due dates that our council person is available. Would he be available or someone from his office on either of those dates to update us about what actions the state is going to take in regards to arts and culture and perhaps answer that question about how funding would be allocated to address the issues that are existing with arts and culture organizations? January 19th is the 21st Mm-Hmm and that's illegal holiday? No, it's Biden's inauguration. You know. Russian people is all right, yeah, so I don't know if it's such a good I, don't think it's a good day. Okay, so February 3rd the day before yeah the 20th is the inauguration. 21St is when he's in Olympia has raised her hand as well again: okay, fine Olympia, so I just want to ask one more time. The same question just to be to understand, so is the archery opening the only subject of this town hall, or is it still what we suggested at the last meeting, that is general support, meeting and general support and state organ? You know, and what type of right that we can expect? So my recommendation then Carolyn is the January. 19Th is a little bit arbitrary because of Carlina, and maybe the kind of people who actually you want in a town hall and the arts and cultural organizations that hopefully will attend. One of my questions will desire would be the Serrano for sure from the state, but also Jimmy, Van, Bramer, and also the commissioners, DCLA and mom, because those are ultimately the people who will have sway and insight on the issues that the arts and cultural organizations and artists will want to. You know hear at the town hall, so maybe I would prioritize those people than you know. Our local council member well I think that we have to coordinate the dates with all of them. That has always been. The issue in the past was getting dates that everybody could agree to. So we'll continue to outreach to Serrano's office and see when he's available and our if his representative can come and to address the issues of funding and I think he can also take that up with Carlina and reach out to DCLA and Jimmy Von Bramer's office. Now that we have established a contact, I have my hand up. Okay crystal: what about the senator oilman, you know, don't you think he'd be good to get involved. Well, we can ask him. Oh I'm sure he'll say yes, but it's just. The reason we want Serrano is because he chairs the arts and culture committee in the state assembly. Oh, we can't have them both. No I, don't know, I have no opinion. I'm just asking right, no I know: I Anisha has her hand up as well. Whenever you're done, Carol Anisha I was just gonna, ask. Is there like? Does the committee have a particular person that they know has to be there in person or not in person, but like that? They don't want a representative from that office to come so that you could, you know, find the date that works for that person, because you know you probably aren't going to find one day where Gonzalo and Carlina and Jose Serrano, like that everybody themselves. The last time we did this. It took from March to the end of June together to confirm the dates, but that were convenient for all of the elected officials. So is it like? Is there someone that's like most important for you to have that person? Be there I, don't know you know, it's I think it's important to have serrano, because I feel, like everybody, can find some someone on their staff to send no I know, but I do think that we need to know what the state is taking. You know what actions they're taking in order to support and arts and cultural organizations in this difficult time, as well as the city, so I mean DCLA, Jimmy, Von, Bramer, that all we can do is reach out and say these are possible dates. What is good for you, and would you be interested in presenting? Does anybody else? Have suggestions for format? I have my hand up well crystal. We can't see it on the screen because you're on the phone, that's why I'm saying I have my hand up. Okay, what's up I, think you need your council person and he has February 3rd I. Think that's the date we should take, because we I wouldn't go past I wouldn't bypass her she's, I'm not suggesting that you do anyway. That's my opinion. Okay, all right Olympia has her hand up as well: okay, Olympia! Thank you, so I want you to say that at the assembly, so we have New York, State, Senate and Assembly at the assembly, the Arts Committee Chair is Danny O'donnell, with whom I worked in a lot of issues around small business and culture, and so he could also be a good candidate to invite and to Anissa's point about which are the people that should be there. I think if the focus of this town hall is to bring architectural organizations of our district and artists of our district in a town hall in a forum where they can ask decision, makers, questions and I just make statements and tell them what are our needs? I think that, in terms of you know, support and programs and policies, the people who need to hear that would be more. You know the chairs at city and state so City, Council, Senate and Assembly, and the commissioners and our council woman, the reason for which it was suggested that the last meeting reached out to her was because, if she becomes a co-sponsor and the outreach comes from her office is going to be more effective in getting quick dates because elected officials, they can make themselves available in a second for various rallies and things so I believe that was the spirit of reaching out to Carolina. But definitely we all understand that those chairs of those legislative bodies and the commissioners are really the people who are decision makers and our you know. Constituents would like to be in the same room right. So basically it would be Carlina you're, saying Daniel Donaldson for the assembly. The chair is called Danny, Daniel O'donnell, oh Donald, okay, but I don't understand. Do you want us to help you? As the committee members Tariq had offered to reach out to some people? Tati me or you are doing this with the office and I, see Tariq, writes things in the chat. I, don't know Tariq. If you have microphone, you wanna talk yeah, just a minute: okay, look. We went through this that exec okay. That was the reason that one of the main reasons, because in the past, what I had been told is that the office wants to do the initial reach out to the elected officials. It's not a matter of that. I can say that oh I can pick up the phone and call so and so that she wanted to do the initial outreach and then give me the contact, and then we can call so that was where it was left at that and so far what I've heard back is from Anisha is the date that Carlene is available and that we can now contact Jimmy Van Bramer's office directly. So she told me that she would get back. Susan told me that she would get back to me when Serrano's office got back to her and give me that contact so yeah. We need to get the committee involved about how we want to structure this and present it. We need to firm up is to I mean the whole reason, also too, according to Michael. To ask if the council person would be interested in co-hosting this event would be that they would help to organize it and set up the zoom. So that's something that needs to be clarified with Carlino's office, because so far that seems not to have been the question that was put forward. It was put forward as to what date she was available. Do you want me to call the office and find out? No I, don't want you to call the office of function. I think that she likely co-sponsor I, think that was in there and the response was. These are the days that were available. I, think that if you would look like, if you want to go through or continue working with Susan on it, I think we just ask I think she needs a complete list of the people you need outreach to I did give her a list, and I can add the other people that we need outreach too. You know to contact our permission to contact. Let's put it that way. It's that has been an issue in the past. That is why I am dealing with it in this manner because it's just been sticky, so the request that was put out to the office at exec was you know what is the format we can decide what date that we want to do it? What the subject is and stuff like that, but okay Clint you have so two things are Erez, has raised his hand and so has Tatiana and also I. Think Tariq is still having some audio issues. So in the chat he's asked Carolyn, may you please reach out to Susan and have her contact, Gonzalo, Jose, Daniel and James, with the dates that Carolina proposed for this town hall this upcoming week? We understand the issues that you've experienced in the past. Thank you that so at any rate, going forward. That would be the date that we would reach out for and I get the consent to go ahead so that we can actually contact people and set this up. So at any rate, I think the other thing is like who's gonna. Do the zoom is Carlino's office going to set this up? Are we setting it up? You know we can ask Pedro if they're doing the invitations to the electeds to assist us with this with the community Anisha there's some other hands up. Yes, yeah Aurez and Tatiana both had their hands up. Okay, Tatiana we're going to call on committee members. First yeah, hi, everyone, yeah, I, think I, agree. I, think we should reach out to all of these council members and relevant elected officials. I. Think that, echoing what people have said, I agree, I think we should prioritize Van, Bramer and Serrano in terms of the format. If that's the question that we should be moving forward to I guess this question is: are we giving the larger platform here to you know? Are we having it as the elected officials? You know with the resources coming and speaking and then having all of our public members, you know being asked being you know able to ask questions and give you know testimonies, two-minute questions. Maybe we set up like a google form for folks to sign up beforehand or yeah I, can't think of any other format than that, but and then I guess the logistical question about who run, who will run the zoom that Carolyn you're asking I think that we can maybe ask any of these elected officials if they can help us with that, but also I. Think, if not I think that the committee could take on running the zoom I. Don't think I think it would just it's more about like setting times for folks to speak, and you know making sure things aren't super like long, I guess but yeah. Those are my thoughts. Let me know if anybody can think of a more creative format, but that's the only format that I can think of. Unless you know we want to start with. You know: arts, artists and our organizations giving testimonies and then going to the elected officials, but I think this might be the best use of everyone's time. But those are my thoughts. Okay, any other arrests, crystal mentioned, Bob Hoyleman before and I wanted to. Second, that he's been around a lot on to a few theater meetings and he would get behind this he's not the arts chair, but he is a chair, I, think, judiciary or something I think it would be good to have someone from that level of government represented and he would listen to what we have to say. No he's really great and receptive and he's always been very supportive of arts organizations that I know of in the neighborhood and shows up at demonstrations, performances, and he always gives a good report, but at any rate, going forward. Are there any other suggestions for formatting the meeting committee members First Thomas? Do you have any comments? Tariq, so I will speak for Tariq he's having the audio, so he says he thinks we should allow arts and culture organizations to provide testimonials at the beginning and then allow elected officials to address their testimonials through presentations then allow for a question to answer at the end. Okay, that is the other way, is that perhaps we could come up with a way for arts and culture organizations artists to submit questions beforehand. You know I, think that what's complicated is trying to manage something like this on a zoom without having some format in mind, because in the past, when we've done it in person, we've done it at theater for the new city with an audience we've done panels where we had DCLA Niska, lower Manhattan cultural council DCLA, and that I think it's really critical as to who's going to be the moderator for the meeting, because that turned out to be like a monologue from the moderator it very allowed very little time for the participant panelists to speak about what it is that they did and what they had to offer to the arts community. So, at any rate, any more suggestions, comments, Tati I, see your hand, Olivia and Erez all have their hands up again. Okay, you know who came first I, think Olympia actually had hers up. First, okay, Olympia! Thank you. So I wanted to say about arrest point about Brad Holman that he also participated in the forum of arts and culture at the Senate and he's definitely, as you say, Stewart and he's a local official I believe all our local Cbc officials will be invited. You know they will probably come even Margaret and the harvesting, all of them I think will come, but the question for the town hall was more. Who do we want to invite? That will be able to be? You know, kind of pressured and give answers, and that's why we were going for the commissioners and the chairs of the committees, and with that in mind, what I recommend for the format would be we, as a committee, we can work on some questions that they come out from. You know previous resolutions, for instance, you know outdoor performance. We also talked about funding for these. We talked about WPA style programs, so I think we as a committee. We could have some opening remarks and maybe place the first questions and then I believe that it is always better when we invite the wider community to offer to everybody the possibility to submit questions. So we could have the webinar feature that allows for Q&A and some of the committee members can be reading. You know the questions submitted and reading them out. This way you screen out things that are impertinent, but you also give the opportunity to each and every member of the community to ask their question right now. I know I think that that's what my concern is how we would manage this as a zoom, because before when we've done it in person, we've had people write on a slip. What their questions are so Tariq actually Tariq said if CB3 is running, the Zoom Carolyn is chair of arts and culture subcommittee can set the rules for the meeting we could have. We can allow the arts and culture organizations to submit questions in advance committee. Members can be the individuals who ask the questions during the question and answer on behalf of our arts and culture organization, but it's crucial that we allow them to provide testimonials at the beginning of the town hall meeting, because we can't speak for all of our arts and culture organizations. They have different needs and wants he volunteers to moderate and manage the meeting that okay. Well, we have to you know, also get an agreement from Carlina's office that that's you know if she's going to co-host this thing and then there are Orez has his hand up. Anisha has her hand up and Tati has her hand up. Okay, all right, Orez isn't on. Let's do the committee members first so who came first Anisha, Otati I think they were about at the same time, honestly. Okay, all right so Anisha I was gonna, say that I think it's just a question of figuring out some more of the zoom features, because I have been on webinars or other meetings where you know just like our full board meeting right, where you can ask, there's a way to ask questions to compile questions so I think we just I think there are ways to do it over zoom and I think we can figure out that logistically as we move forward, okay, yeah, because that's a concern of mine that it's effective and that people have a chance to express I like Tariq's idea of having if there was some way of getting arts and culture organizations to submit testimony to begin with. And then we could say you know a brief, a set period of time that these people can speak to address these issues. So at any rate more to be revealed. Okay, Tati, yeah I was just going to agree with Anisha I think that we can do and Olympia the Q&A format and zoom would really help us in this aspect and I think we could create a sign up that. So as to not eliminate anybody who shows up at the meeting and doesn't sign up before, we just circulate and sign up in the chat of the zoom, which could be like a google form sign up for the organization, the name of who's speaking- and we could also send this out before to folks so that they can sign up in advance. But if there's any other people who show up at the meeting who haven't signed up, they can sign up there up until a certain time like we do when we meet in person and then read out those names, yeah I think I agree with Anisha I think that we can figure this out, and it's just some logistical like giving those assignments to folks like everyone can take an assignment on. You know, who's running the Q&A who's running the spotlighting who's muting folks, things like that and I think it could be effective and I also just want to highlight that Tariq is mentioning that Erez. You know we should allow Erez the chance to speak and I'd be curious to hear what they have to say as well. Right I think you know also too, we would have to set a limit for time and stuff like that and structure. You know there has to be a structure in place that we're going into that. We know how the game is going to be. We would played yeah presentations being present presented, while folks are speaking, probably right, yeah, but in the past what we've also done is have we've developed a flyer to advertise the event and one of the other issues that came up with the last town hall that we did, that was a major nightmare, was the fact that the office has the fire has to go out on the office letterhead and it has to be approved by the office and when we had sent the draft around the draft was sent out and Evie Grieve was notably annoyed that he hadn't been personally contacted with the press release and basically made some very pointed comments in social media which did not make the office terribly happy. So, at any rate, in order to avoid something like that happening this time you know we do need some type of advertisement for the town hall once we have the date, and the speakers confirmed. So is anybody on the committee wanting to organize or develop a flyer or the basic outline for a flyer that we can fill in Well Tariq says he can work on the flyer? Okay, great? That would be wonderful, okay, so eras. The way we've done these sometimes before is maybe with a smaller zoom room and then from there on to Facebook and people can put questions in the comments. But a lot of the features that you think of with zoom sometimes are from the like very expensive version and I. Don't know if you have that available unless Carlina's office does it, maybe they have it, they have a what they're sorry pictures there's features in zoom that you've seen on things that are not available with a free or a cheap account. They have to. They only come from a very expensive account. We have a licensed version. We have a full yeah. The city has provided all the community boards with the full premium package. I guess you would say: okay, great, that's nice to go so Olympia had hurry enough as well: okay, Olympia, yes, so I wanted to talk about Tariq's suggestion of having testimonials at the beginning and my suggestion to have opening remarks from the committee and the past resolutions. So, if I think about the technical stuff once we know whether it is Cardinal's office that is hosting it or we are hosting it, we can resolve it also via email. But it's more important that today we agree on the format and the invitation. So, for instance, I think that testimonials is a great idea, but it would make sense to understand how many because of time and also which organizations are we having in mind because the district is vast and we do have a big diversity. So if people have ideas of how we could select these testimonials so that it doesn't, you know, alienate anyone or I mean I, don't know what is the history of selecting this, but definitely we would try. We should have maybe like a theater versus a gallery vest as an artist, because they have different issues right and also making sure that it is both from the Margaret Chin and the Cardinal Rivera, and that it is diverse in age, gender, race. Whatever so I mean I'm starting to wonder I, you know. If people have ideas about how we choose those testimonials and how many they should be right. So are we envisioning this as being a one hour or two hour event? I mean generally, you want to have more than an hour for you know, especially if you're planning to have opening remarks. What is it called testimonials elected in Q&A I think you need to have at least an hour and a half, and then I think we do need to understand. If we do testimonials, is it like maximum four and this one is given two minutes or are we talking about something more sub substantive or do we want to go a Pecha, kucha style where I mean I, don't think it's the right format for something so serious as what we will be discussing? Okay, I have my hand up okay crystal: what's up I think it should be two hours if you want to get people's real feelings out and you want to have an introduction. You know, and then you want some of the politicians to speak and you and then you want. You know the artist speak you're going to need two hours. Okay, all right! So in a breakdown you want an intro and then testimonials from arts orgs, artists. Okay, how long do you think the testimonial should be testimonials from who it depends? We're talking about having testimonials I mean nobody could speak more than two minutes. Okay, that's normally what we have at the thing, but okay and the other thing is: how would we pick from the diverse community that we have as to who is going to present their testimony of the testimonial I mean we don't need the I. Don't know the answer to that right now, I think some of it depends on who responds to our request. You know, and you certainly want a diverse bunch of people right or organizations. You know right one of the things that happened in the past at one of the town halls is the individual artist got up and left because they said this is all geared towards arts organizations. Doesn't it well I think individual artists should be encouraged to think no I mean that's. What I'm saying is that if we want, you know, I think Olympia's point was very good, that we need a broad spectrum of the arts community in the neighborhood and how do we go about achieving that? And what are we looking for in terms of ethnicity? You know culture. Individual artists is compared to arts organizations. Community served yeah all of that. Okay to review me on the wall. We will see who responds and then we will make a diverse choice depending on what you know, but we don't tell the world that that's what we're doing so. Tariq is suggesting 30 minutes for elected official presentations. One hour for question answer: he said arts and culture should have the option to choose either written or spoken testimonials. We should have them all present written testimonials. As a committee we choose who we want to vocalize their written testimonials at the town, Hall and Olympia is now having headphone problems as well. She says: oh, okay, all right, so any other further suggestions for this discussion. I have my hand up okay crystal. What's that a lot of times, if you want to speak, you have to write something in the beginning. You know before the meeting comes and yeah and I certainly don't like reading other people's work. People I mean you can submit an essay if you want, but when it comes to speaking, you only have two minutes. You know what I mean, but I know you're often encouraged to write a thing which that which we would have to look at and read, and you know, but not at the meeting. We would take those things. You know what I'm saying yeah that that's the way it's usually done. Okay, you write your essay and you give it to all of the committee people a copy. You know I mean that's one, but that doesn't mean that you're gonna read that you're gonna speak, and you know on that with those with. That is maybe a scenario for yourself. But do you think it would be worthwhile asking arts organizations to submit a written statement? They will yeah if they wish I mean that we could do the outreach through the list that we have okay and ask people that you know if they wish to comment about what the situation is with their arts organization at this point in time and how it's been impacted by Covid-19 and what would they hope that the city state officials could do to help yeah I think that's very exciting, and maybe we could say that we will take these written statements and give them to the elected officials. That's what I was thinking. Is that way that we could have you know if we have a written copy on hand and then it could be submitted to the local electives or the electives that are present for the meeting, that they would have a record of what it is that artists are expressing in arts organizations in regards to their needs. Clint Tariq is suggesting that you would create a flyer and then ask the arts and culture organizations to provide written testimonies before your arts and culture meeting in January. So you could review at your committee meeting. The town hall should then be scheduled for the February date, which is after the inauguration of Biden right. Then we also have Olympia and Thomas goes: have their hands up. Okay, Thomas, hey good evening: everybody! It's been a long night, but a very interesting learning curve. One thing I want to mention: I'm an educator and I'm also an artist and I, keep things very lively when I'm doing presentations. Maybe we can do something along the lines I mean these are artists, and a lot of them have been tucked away for so long I, don't know if it would be worthwhile, but I thought I think it would be fun to have some of them if, instead of necessarily speaking, if they can send a video clip, you know they can do a 30. Second promo or 60 second thing identifying what they faced and it could reflect some of what they do in that art form. I think it would keep the meaning a little bit more lively and as an in addition to a written testimony given to the electeds, obviously but I think it'd be a fun way to keep the meeting a little more interactive and letting the artist shine a little bit. That's an interesting thought, and how would we collect the videos prior to the meeting? That's the other thing is that if we're asking people to email, testimony or and or video clips, so I think that's something that we would have to figure out how it's going to come to us whether it goes through the office. Does it come to somebody's email? You know I mean I'm pretty good at sifting through information like that. So maybe we could discuss certain formats or even links like if, let's say, if something was sent in an email form, I could convert it into a link that whoever's moderating or hosting the meeting can just press play and it'll pop up kind of seamlessly just a thought. You know, but I know some of the artists like myself. If I was presenting, I would love to like show what I do and how valuable it really is to me I think it would come across yeah, no I think it would make it really interesting to have something like that. It would certainly be a switch from the normal front of the Mil zoo for sure, and then I mean just like setting a deadline. The same way, you would set a deadline for a written statement. You could say all videos and or written statements should be in by such and such a date, and that will give us time at the committee or whoever's in charge of that portion to sift through the videos and prep them, okay and decide which ones we want and which ones we don't yeah. We could say not everyone's video is gonna be shown, but at least they'll have the opportunity to you know, or maybe we could, like wink wing say, but Mr Serrano will get your video anyways. Even if it's not shown at the event, you know yeah, if you're only long videos be the same thing like under two minutes: oh yeah, one minute, I didn't even say 30 seconds to 60 like yeah, keep it lively, you know or 30 to 45 seconds. That way, right buddy has a lot to say. 45 seconds is more than enough. Okay, a 30 might be better I, don't know you can ask the other artists in the group and see what they think. Okay, that and anybody else have comments Olympia. Yes, so I had a few comments, so one is in terms of collecting. You know ahead of time, written statements. It says that I just wanted to remind the committee members that the reason for which we decided to do it animal was because on when we did outreach. We didn't get a lot of responses and that you know was commenting on that, because the reality is that people are overwhelmed depressed, just moved out of the city already or I mean it is a little bit of an extreme situation that we're facing so I. Think that's why we had discussed about creating urgently a town hall and the reason for which we say urgently is once the relief funds arrive. There is going to be a huge fight among the various. You know: legislators, bills, constituencies. You know education versus small businesses versus health or whatever, and so I think the earlier. Our community voice has been heard from the decision makers, the better chance we have of influencing something. If we come out with our town hall after the funds have been received and earmarked, it's gonna be a little bit of an echo chamber. It's not gonna serve. You know the purpose of influencing the decision-making and then in terms, so that's why I think you know understanding the date and we who we want. There is going to be important and all may be clarified if we understand whether we are hosting it. Carlina is hosting it with us, etc. I agree that if we do videos, it should be 30 seconds to 60, because when people speak they can say much more stuff, but I think we should also create parameters about what these 30 seconds people should say. So we should have specific questions about. How did the pandemic? You know impacted you? Were you able to access unemployment? Is this sufficient for what rent costs in this neighborhood? You know things that are concrete, that the legislators, you know can help with you know and then, in terms of how we do I mean if you know how to compile these videos to one. So if we get, let's say 20 30 seconds video and you can make it one- we can play it all together, even if somebody's 30 seconds are less. You know to the point, but it's still, you know representing a point of view, but if you can not do that, we could actually reach out to local organizations that, in the past, had helped with video editing. Fab had done a project with the New York City, artists coalition and others. So if we decide as a committee that this is something we desire, I think we can easily Andrea, probably with Clemente or others, you know they could find. Maybe somebody who would help us with the video editing if this is what the committee decides is the best way they have had. The Chinatown art brigade do a residency and they did the whole thing on video and editing that so we can reach out to them to find out if they would be willing to do that or Thomas. Do you want to do that as well? Yeah, that's excellent! If you've got some professionals that can do it, I'm also proficient at putting stuff together. So whatever you know, I know if you're interested in doing it in your commitment, yeah I'd love to put it together. If that's the route, we want to go sure yeah. That sounds great. So, okay, Tariq has a comment that says, as a committee we're having trouble coming to a consensus on organizing I think it should be car. We should ask Carlina's office to host this town holidays. The understanding was that was the original request that went out and as that's what needs to be confirmed as to whether or not if she's co-hosting it so I, don't think it would happen consensus. Does the student center have to ask her? Is that the protocol was is that the district office makes the initial outreach to the elected officials? So, let's ask the district office to do that. The district office did do that and Carlina has gotten back to them with two possible dates: the 19th or the third of January or the third of February. So now we have to add so I didn't get an answer. No I requested at the exec that we were asking the council person to co-host the meeting. Okay I have not gotten an answer to that section of my question. What I got was from Anisha was two dates that had been responded, which was the 19th and the third and I will follow up and see what has happened with the request for them to co-sponsor the meeting. So at any rate, normally our next meeting would be the second Monday of January I. Think that there is some discussion at the district office in regards to trying to adjust our meetings so that we meet before our economic development, so that anything that we vote on can be voted on at the economic development, but I, don't know how that discussion has gone in Asia, oh yeah I think we need to just follow up and make those changes. It really is, though, about resolutions I, think if you vote I, guess if there's nothing else that you really are voting on. Maybe besides a resolution, it would only impact resolutions to say so. If there are no resolutions that you are anticipating for January, let's say or February it shouldn't impact, it either way, but we are working on it yeah, okay, so when do you think that we will have a definitive answer? I can talk to Susan about it later this week. I. Don't think that she's gotten to doing the calendar for January, yet okay, Derek has his hand up, and he said in the text that his he thinks his audio is thick. So go ahead. Tariq do we all do we agree on the February third date? We will yes, this is. The opinion seems to be that February third would be the most reasonable dates and I think we all agree. I think we all agree that Kurt we want Carlina to be there. So I do think that if that is the date that we agree on, we should then have Susan reach out to Jamie Daniel Gonzalo and provide them the February third date. Tati and I can meet this week, create a flyer for the February third date so that we can get that approved by the office then provide that to the arts and culture awards, so that we can let them know with an email to provide either provide a written testimonial or a video testimonial to Thomas's point which I love. That idea to provide that before our arts and culture meeting on the second week of January, so that we can review those written testimonials, video testimonials, get those prepared. We can approve what we want as vocal testimonials for the town hall as a committee and I think from there. We are then prepared for this town hall. Carolyn I understand all of the sentiments that you do have from the last town halls that you have done, but I do think that it is 10:19 at night and I. Don't think that this is much of a big thing that it needs to be, as it has been right now. I think we have the structure in place right now that we need yes, I think we do and I think it's come through. The discussion and I do appreciate your offer to draft the fire with Tati and I would appreciate it if you would share that with me prior to sharing it with the office, you got it. Thank you. I appreciate that I have my hand up. Yes, crystal can I ask questions. How is this going to be done? Is everyone in their own home? Is that how resume I mean? Is that how we're doing it? That's how we have no other option at this point in time. Okay, so at any rate, I will follow through I'm contacting the office. Okay. In regards to the questions that were asked about contacting the electeds, okay and the response and Carlina's office and get back to everybody so Tariq when you and Tati have finished the flyer, if you could post that- and we can I think send the flyer to the committee members. So they can review it so that we have Thomas who has volunteered to edit the videos that are being sent, and the flyer will be asking for submissions to be sent to the committee and I think we need to clarify with the office as to how we will receive those. So as to another question, what crystal? How are we going to get people to come to this meeting I mean? Do we have lists of fire? No I mean we have lists of organizations. Do we have lists of artists? Do we right? Who are we sending this flyer to all of the people on that resource list that we have and any other people, oh, would be interested in it right? Okay, that's great! Are there other individual artists on that list? Are they what individual artists? Yes, they are individual artists, their galleries, their community, centers, okay, okey-doke! So are there any other comments at this point in time? Is there a motion to actually wait? Tatiana has her hand up Barry I, didn't see it, no you're good. Sorry, this will be quick. I was just I know. The list was created last year now, I guess before we had some of our newer committee members and before we had, you know, Andrea on the board and Tariq and I was yeah. I was just hoping that maybe we could send you know Olympia brought up a good point. We didn't get a great response rate from the last emails that we sent out so either. We need to you, know, go through that list and make sure we have the updated information and also I would like to see if the newer committee members can maybe add some organizations. That would be great if you know the list is available on the website. If all of the committee members could access the list on the website and send in any edits that needed to be made to it prior to the next meeting, that would be really helpful. Olympia has her hand up and arrest also put in chat. You can let the league of independent theaters knows and they can distribute to their list. Okay, yes, that's. What I would also say is that once we have the flyer and something like a president or whatever it is that we like I, mean we're all gonna post it on our social media, pass it through all the local organizations that will blast it out. We're gonna try to get you know, yeah they etc to publish about it. I mean I. Think if we do a real town hall, where all these decision makers are there, I'm pretty sure we're gonna have turnout. The important thing is to get the important people there and to have an agreement on the round of show yeah the thing about it is. We need to confirm the electeds that are going to be there we'll confirm the date, we'll ask Carlina's office and she will reach out to them as well. So, at any rate, as soon as we have a copy of the proposed flyer- and we can look at that and make suggestions, okay and get the dates lined up for sure and the participants and in the meantime, if each committee member could check the arts and culture list that is on the website and make any edits that you feel need to be done. If you could, please send me the edits, it would be most appreciated. So I think. Are we allowed to approach elected officials and asked them if they would attend, or do we have to wait until the district office? Does that my understanding from what I have been told previously is the district office needs to make the initial outreach, which Susan has said? We can't really do anything until they well. She gets back to us with the contact and that that's affirmed that we can do that. Then now we can't do it, but until we've gotten permission to do it so I mean I. Think if you're talking to them, perhaps as an individual, that you might mention it and say that this is what is in the hopper and we hope that you'll be able to do it. Oh okay, so we can do that technical conversation, not as an official invitation. The official invitation has to do with it. I got it okay, I understand. Susan has been pretty fast on the others, though, what she reached Susan has been very fast on the other she reached out to Carlina's office. The day you asked her. No I'm not saying that she didn't I know she did and she's gotten back to me to who she's reached out to and who she's had a response from yeah and say that I think it could happen like sending that email out to the various electeds I. Don't think that's going to take time, it's just waiting for the responses right now, I know, but as Olympia and I think someone else pointed out that, if Carlini reached out to the electeds that we might get a faster response, but at any rate more to be revealed, are there any other questions comments. I move to a journey. Is there a second okay, good night? Everybody? Thank you. So much do you need to take presents. Do you need to take presents? It should be present. I didn't realize that we had to do a roll call since I know all of you that are here, but if we want to do a roll call, let's do a roll call so Olympia here. Yes, okay, Tati, yep, yes, what yes, Tariq, yeah, okay, crystal yeah, okay and I'm here. So all those in favor of closing the meeting. Okay I hope you have a good evening. Take care! Thank you! So much Clint. Thank you sure. All right! No problem! Okay, have a good night. Everyone good night, bye, stay safe.",
            "summary": "Are you good, okay, great I, think we have most folks here, so we can go ahead and get started just a couple of ground rules for this, since this is probably going to be a more active discussion than we usually have in economic development.\nBe limiting comments to two minutes per person from the public and the way that it'll be structured is that all committee members will have a chance to ask questions.\nCould we better support cultural institutions during cover than this pandemic and help turn the city into a stage and figure out ways to work with them to create additional opportunities for income and to share their work during this time when venues and spaces are closed, theaters are closed and there's limited capacity for work.\nThe spring we've been working on this program called open, culture, You've probably heard of open restaurants and open streets and the idea of taking our public spaces and using them for things we usually do inside, but bringing them outside.\nThere are a variety of fees forms you need to fill out and different agencies approving different steps to getting a permit, and through this bill, and through this program, we'd, be turning into one application: One portal for free or low cost for organizations, arts, institutions and artists to do that programming and bring their work out into the city.\nThe, specifics of it would be it'd, be starting in March or the idea is to start in March and go until Halloween of next year, allowing for 2021 the nicer months to for these outdoor programs and events, while we're still figuring out what's going on with Covid-19 and the city is still responding to that, and for this it would allow for rehearsals and performances.\nIt would be administered through SAPO street activities permitting office and eligible organizations would be cultural institutions that have received previous department of Cultural.\nIt would be open to open streets as of right now, but we're exploring further options, so more spaces might be added later on, but the beginning would be open streets and for the program we are still negotiating final details, but for participation it will likely be a small fee of about 20 for a permit in order to engage in this program and get a permit for outdoor activity, And I'm open to other questions as well.\nIt's, a nice relief to hear that the city is working on making the permanent process in any capacity simpler and cut in a lot of the red tape, because I think that's a big hindrance with businesses and institutions being able to conduct business and stay in business.\nClosed stages, are closed and most work for artists is very limited and we want to kind of turn the city into a stage into a theater into a performance hall and allow for ticketed and donation-based events to allow these artists to make a little extra income at this time and continue some of these traditional programs and for ticketing, cultural institutions, and these artists are great at figuring out ways to charge.\nHow that would realistically look like being able speaking with cultural institutions, folks have passed the hat done, So it's like similar traditional, like busking methods, or they just put on a QR code and have people scan to sign or ticket or pay for a ticket on their phone or have pay for a ticket in advance, going through their website and attending the event later on.\nRight, now, The, latest version of the legislation that we're working on the language for the specific spaces is up to determination by the department of transportation and in communication with the local council member.\nThey want to stay they'll, Ask them to buy for pay for a ticket, make a donation and like pay for their viewership and help support the artists, but if not they're, welcome to just listen pass by and then continue on with the rest of their day, but if they want to stand on their street, if we have an open street and people want to stand on their open street without buying a ticket they'll be able to right.\nDon't know the specifics of how long they would all be, because it's case by case and what people are applying for and what's permitted through street activities permitting office, So they would need to receive a permit in order to rehearse for the set amount of time that they apply for so right, now, SAPO doesn't have any criteria.\nWe've heard from organizations applying for Zappo, permits, pre-covet and middle of this pandemic, that they didn't get approval until the day of an event or the night before, and that's not a condition that we want to keep happening with this.\nWhat kind of feedback, have you received comments or criticisms or objections to the pending legislation, just to clarify the question just like their response from the mayor's administration and his office.\nIt's a cultural community within New, York, City and helping them out during this time when their spaces are closed, they're unable to do performances, Our city was able to respond for small businesses and our restaurants and bars through open restaurants and open storefronts, but still have minimal efforts and resources for cultural institutions, The second largest economic driver in our city.\nBut it's taken a lot of work to clarify a lot of what how the current processes that exist for permitting and supporting cultural institutions could be barriers for participation as well and get in the way of them doing their work so trying to find ways to create a program.\nWith this program it would be trying to get rid of those issues and those discrepancies and allowing for those sorts of programs to happen at the same time as outdoor dining on those open, streets.\nAsk Alex, I, think a lot of maybe the salient issues of concern, because certainly you know, the argument in favor is that we should try everything we can to support a decimated industry in any way.\nWhat is private, what is public but where the Astra place, or even Cooper, Square Park, you know places where there's much more space, especially if you're going to permit ticketed events without restriction, which to me has the potential for inviting a lot more people to an area, and there are some open streets programs that just can't accommodate.\nI, hear that the idea with this legislation and what we really wanted was to allow cultural institutions and artists to permit on pretty much any open space in the city that includes parks.\nMake sure to find some way to make that accessible for permit artists are so creative in how they could use space, and we want to make that available to them, But in working with the mayor's administration and the city on this and furthering this bill, we have found legal limitations to some of those spaces and with open streets as a starting point.\nWe want to test this out a little bit as well, and we know these cultural institutions will be able to actively use these spaces.\nSo I understand the concern and we're looking to expand it and get more spaces added in, and we are just looking for an opportunity for these cultural institutions and artists to share their art with the communities and make a little money.\nI have a couple of questions and then a comment will like open streets where restaurants are allowed to create.\nWill, art institutions and cultural institutions be allowed to create structures, because right, now, I would say, Every structure created by a restaurant is illegal and does not meet the department of buildings requirements that we heard about last week.\nWhat footprint would a place like that be allowed to have I mean theater for the new city also has an issue right in front of them, which is why, when they do their big events, They do it on 10th street and basically the street gets closed off for the duration, which is fine.\nAll organ, all these organizations are eligible to apply to permit on open street, so not necessarily right in front of their establishment, but any space within the open streets like catalog of streets, available, okay.\nWe heard from several residents last week and being a resident myself that between right, now, the restaurants, the open streets program with the restaurants is not well managed and makes it very difficult on any given day to just get from point a to point b, if you're just trying to get groceries or get home from work.\nWhile it makes perfect sense that we need to do something, It almost feels like it's a shame that our arts and culture institutions weren't considered before the restaurants, because the restaurants have now occupied so much real estate.\nIt's, not every cultural institution, has a brick and mortar space, and we want to make this available to all the organizations and artists out there from like a random quartet to a visual arts gallery to a dance studio to a local theater.\nYou know the lower east side has been identified as having more performing arts organizations than any other neighborhood outside the Broadway area, So the closures are really significant to what is happening to our theaters and the fact that they've never been part of any plan for reopening.\nI'm I want to say that it is important for local cultural organizations to be able to continue to be present to their communities, many of whom are here.\nYou know access to the open streets program to the opportunities to perform for folks in their own neighborhoods.\nThey want to share their art with their neighbors because they're the people like they live in that neighborhood for a reason.\nIf I can just follow up Jack, I'm wondering because the legislation has developed quite a bit since when it was originally written, I think it would be great if I could do an update with our membership about where things are now and what the what you're working on, or even the obstacles, you're running into, and I'm, wondering if I can follow up with you to see.\nWe want to make sure they are thinking about Covid-19 in this, If they're going to have a more structured, stage, event cast crew and audience, We want to make sure that they're thinking and acting appropriately and for enforcement, the institutions will be helping with that and making sure people aren't gathering if they are asking them if they want to donate things like that on getting people to cross through the street, but they'll be similar enforcement and regulation for open streets and open restaurants as well.\nI would want to ensure that this, the people who benefited from this were our local cultural institutions and that not random cultural institutions or arts organizations could just get a permit to perform in the lower east.\nI. Think everybody here has agreed that they would want to be supporting local nonprofits for the permits.\nThat's a further conversation with the mayor's office of special enforcement, the local NYPD precinct and that community and finding a solution that works for that neighborhood, because it's going to look different in every part of the city and how these streets work.\nThe office of special enforcement is too overwhelmed and really is not spending their time on this kind of thing, So I just want people to be realistic.\nOne of the people who put forward this resolution and first of all, I, want to thank you and your boss, council, member Jimmy, Van Bramer, For that you know working tirelessly for arts and culture for the city and also for understanding that it is not just about industry.\nEven though I understand the need for priority for local organizations, I would think twice about legislating.\nYou know not just CB3, but all arts and culture of the city, thanks Olivia and with the local preference.\nI think the idea worth exploring finding it based off zip code or within that community, district or neighboring that street, and we don't want to necessarily segregate folks.\nI think you should definitely considered all of what the council members have told you I do want to mention that I was in a video conference, call organized by the Department of Cultural, Affairs, Commissioner, Mr Casals and the street activity.\nPermits office a couple of months ago, and they wanted to update us specifically cultural organizations that you know have a relationship, a long-standing relationship with both of these organic institutions, and they were very clear about the new restrictions.\nIt's a good intent, I think it's hard for us for city agencies to coordinate, and it looks D.O.T and Zappo, and the major's office still trying to figure stuff out, and it's very important that you reach out to the right.\nAnd we're at a point where we might see this start next spring and make spaces more available and the permitting process more accessible for cultural institutions and artists of all sizes and profits and wallet sizes, And what have you to be able to bring their art to the street and make a little bit money off of it.\nWe, don't know what the whole cultural ecosystem is going to look like next year after the summer, and so it is open.\nMy question is actually something that Susan said: I just wanted to clarify, and it was about the concern over having permanent and unpermitted events and in open cultural spaces.\nYou know all of our cultural institutions are non-profits and are subject to the same kind of registration and certification of our safety plans, so I that is in place, even if you have just like one person coming into your office, so I'm just trying to understand why that would be a concern, particularly given in the past.\nI view this resolution that we are going to be working on as our opportunity to say that we do have some concerns that we are supportive of this legislation, in the sense that we are supportive of a program for arts and culture to be able to have something in this pandemic.\nYes, I think it's really important to pass the resolution in support of the legislation and saying that we want to support something being done to support arts and cultural organizations.\nBut I do think it is important to show support for the legislation for the impact that it has on the arts and culture community in our neighborhood.\nGuess, it's a matter of opinion, because I do feel like it's important that we craft resolution and that it's passed that because I think that it shows support for a section of our community that is suffering right now and is undergoing terrific.\nOkay CB3 supports the New York City Council Bill Intro 2068-22, proposed by New York City Council member Jimmy, Van Bramer, chair of the City Council Committee on Cultural Affairs, Libraries, International, Group, Intergroup relations to facilitate outdoor performance permits for impacted arts and cultural organizations and recommends amending Mayor De Blasio's emergency executive order.\nTo allow amplified sound for outdoor performances as regulated by local state and federal guidelines, with enforcement by local precincts, whereas New York, City Council member Jimmy, Van Gramer has proposed legislation, Intro 2068-2020 to facilitate outdoor performing for art events and performances produced by established organizations impacted by Covid-19 and whereas it has been a great loss to the city as a whole that in the warm summer and fall months of 2020, outdoor arts and cultural programming was banned and the focus was only on assisting the restaurant, industry.\nBy Covid-19, The sector lost 69.2 percent of its total jobs since February 2020 according to the center for an urban future art in the time of Coronavirus New York City, small arts organizations fighting for survival and whereas the impact of the loss of accessibility to the performing arts has also had a detrimental effect on the emotional health of our community.\nTherefore, we urge mayor De Blasio to amend executive order 148 by banning all amplified sound so that outdoor performances, which would be regulated by local state and federal guidelines and enforced by local precincts, would allow established arts and cultural organizations to be accommodated and make performances accessible to the general public, As this would allow performers to go back to work and funnel funds to the support of economies that support that supply.\nSo, as opposed to a band which I appreciate the difference between the band and the allowing the amplified sound, again, So, I, don't even know if it's speaking to what the information was that we got tonight, but I think we should amend it to be consistent with whatever the up-to-date discussion is because it seems a little different.\nOther thing is I think we should comment on the fact that, although we support this, that there I don't believe that there has been anything worked out.\nIt doesn't sound to me like there's, been anything worked out about the anticipated consequences of grouping all the grouping and the cultural organizations, Together with the outdoor dining and the people in the street.\nAt the same time, there should have been open streets and what to do about shut down cultural institutions and performance spaces and open dining, but they didn't do that right, so.\nHowever, basically, What I wanted to say is that currently, if somebody abides by the law, there is not a way to get illegal permit to host outdoor arts.\nBut yes, So what I wanted to say is that actually what Susan is talking about is a little bit more nuanced, because, given the fact that there are legislation and that there are executive orders and state and city orders.\nSo I believe that this resolution needs to focus on the arts and culture and what this legislation is working.\nEven if the translation passes an outdoor performance, theater or whatever, they would need to have amplified sound, so we're trying to say that once they will have a permit, they will also need to be allowed to use, amplified sound and that's why we wanted to address that.\nOther thing is that you at this time they may be allowing off the record roving bands to play, but actually legally, you can not perform in the street without a permit period.\nThis resolution is addressed towards arts and culture organizations, doing a legally permitted process and have to you know, accommodate arts organizations that haven't been able to perform or work all right.\nOther thing that you have to look at this, the new wrinkle and the legislation, is now asking the arts organizations to pay twenty dollars a pop for, if they want to rehearse and that they would have to apply for a separate permit for every one of those events that they do on the street, whether it's a rehearsal or a performance.\nOkay, It's just like there seem to be a lot of things being written into the legislation and negotiation with the mayor's office.\nThe resolution is about trying to support an industry that is suffering greatly right now and allowing them a legal process by which they could perform and by which they could ask for donations or sell tickets, at least not meant to address people who are roaming, the streets doing whatever they want to.\nWe have more comments, I'm going to keep it to committee members for the time being, since there are still a number of them, but please be thinking about how this resolution is going to reflect all of the things that we have all been talking about, because we do need to get there.\nThis permitting process, But this resolutions also appears to be asking us to support the overturn the adjustment to an executive order banning amplified sound, There's a lot of background noise.\nIt's like it states very clearly that the outdoor performances would be regulated by local state and federal guidelines and enforced by local precincts would allow established arts and cultural organizations to be accommodated and make performances.\nIt's saying that if the executive order could be amended to allow the use of amplified sound to go along with those permits to me, That's what the interpretation is.\nThey just go on a binder, while arts and culture committee members and the constituencies that we represent feel really like.\nThis resolution, I want to remind everybody, is from the arts and Cultural Committee, and it is subcommitting.\nWe wouldn't be discussing many other things, but basically it is about arts and culture, and the legislation is drafted, That way, because.\nAnd I believe it is our duty at CB3 to also you know, reflect that in a resolution and all these other concerns I believe they're, very valid concerns, but actually are part of that downhole that we're going to do and the resolution about quality of life, but has nothing to do with the legislation designed for the needs of arts and cultural organizations.\nI know that there are other hands up, but I think we're going to keep it to only committee members for the time being, because we need to finish drafting this.\nBoth committees decide that they want to include, It seems like maybe asking to amend this executive order.\nThis concept of amplified, sound, so I wonder if there's a way to reference it without saying amendment of this executive order, because whether it should be a separate resolution or not I think maybe it's something around again that we have a lot of noise in this neighborhood, and you know we want to make sure that considerations around ample time sound or sound permitting is included.\nWhat I would say is that there should be awareness clause first of all, maybe like in this at the top, maybe after the second, whereas first, whereas clause that the CB3 understands that now this proposal will at first because I, understand they're trying to have it in more places will at first be limited to the city open streets program and whereas CB3 recognizes that the city has failed to contemplate the possibility of cultural institutions, utilizing open streets or any public space, while also permitting open dining, as well as continued pedestrian, use.\nThat if it's included in the resolution, as whereas that arts and performing arts organizations would need to have access to amplified sound for street performances, I.\nThe legislation is for any kind of outdoor arts and culture organization, activity.\nI. Think Alex to your point, there's probably a better place for the third one, But let me just do it in the surface of reading it, which is all right, so the three new clauses, whereas CB3 now understand now under right, that this proposal will at first be limited to the city, open streets program and, whereas CB3 recognizes the city has as yet failed to contemplate the possibility of cultural institutions, utilizing open streets or any public space while permitting open restaurants and dining and expanded pedestrian use, and whereas CB3 is concerned, The city has not yet adequately addressed how the current open streets program will accommodate this use in its discussion of this legislation, so that exhorts the city to establish clear guidelines and parameters for this added use and its enforcement.\nGo up some more so this opening bold statement in my opinion would end at outdoor performance permits for impacted arts and cultural organizations.\nOlympia is the impact of just of amplified sound in an order already noisy over saturated, So I want this to clearly be put in the context of supporting the ability for art and cultural institutions to perform in a way that is, you know, conducive to what they need to do.\nWe then maybe we should move that particular phrase further down and construct it like this, whereas Cv3 recommends further recommends that the city executive, order, 148, amended to allow amplified sound for outdoor performances, which would be regulated by existing local state and federal law or federal, guidelines, I, agree and also Joe, I.\nTherefore, We urge the city to allow established arts and cultural organizations to be I, think it might change.\nWe urge the city to allow established arts and cultural organizations.\nI would either to be accommodated by allowing them out to perform outside you, know, or in the open streets program or I, would say to host outdoor performance.\nAnd I, want to have a performance on the street, I need to apply for a permit, and that goes through Sappo.\nAnd whereas CB3 is concerned, the city has not yet adequately addressed how the current open streets program will accommodate this use, open brackets, which would include the ability to have amplified sound in its discussions of this legislation, so exhorts the city to establish clear guidelines and parameters for this added use and its informa and its enforcement, and therefore we urge the city to allow established arts and cultural organizations to hold outdoor performances accessible to the general public, as this would allow performers to go back to work and funnel funds to support to the support economies that supply performances, maybe a tweak there and therefore CB3 further recommends amending city emergency executive, order, 148 to allow amplified sound for outdoor performances, which would be regulated by existing local state and federal guidelines.\nCb3 supports the NYC console bill, Intro 2068, to facilitate outdoor performance permits for impacted arts and cultural organizations for the title, I, agree, and then, If no one has anything else for the next paragraph, should it be intro in the title or.\nI think it detracts from this section talking about why we want to support arts and culture so just delete what I have highlighted.\nWhat was for which part of the paragraph that says, therefore, given that CB3 is concerned, yep I was going to suggest saying therefore CB3, then the last part says exhorts the city to establish clear guidelines and parameters for and then putting the current open streets program to accommodate permitted outdoor performances.\nI. Just think it would be a little more clearer just saying that we're exhorting the city to allow the permit permitted outdoor performances.\nAnd, then you know we're saying what we mean by saying: The open streets program will accommodate permanent outdoor performances, but then maybe you don't even need the first line because you say it more exhaustively in the second part.\nOkay, title CB3 supports the NYC council, bill, Intro, 2068 2020, to facilitate outdoor performance permits for impacted arts and cultural organizations, whereas proposed legislation, Intro 2068 2020 would facilitate outdoor art events and performances produced by established organizations impacted by Covid-19 and whereas CB3 understands.\nTherefore, we urge the city to allow established arts and cultural organizations to hold outdoor performances accessible to the general public, as this would allow performers to go back to work and funnel funds to the broader economic ecosystem and therefore, Cb3 further recommends amending city emergency executive, order.\nTo, allow amplified sound for outdoor performances, which will be regulated by existing local state and federal guidelines, and therefore Cv3 exhorts, the city, to establish clear guidelines and parameters for its open streets program that will accommodate for permitted outdoor performances and their enforcement, and therefore CB3 supports Intro, 2068 2020, which would benefit Cd3 arts and cultural communities and the overall local economy.\nI'd like to ask one question: sure: go ahead: It keeps referring to arts and cultural organization, but you are individual artists that are not established cultural organizations and there's only one portion of the, whereas that referred to artists, there, but I understand that most of the people who would probably benefit from these are individual, artists, I, think you're, right.\nI think that those are parameters that evolved out of their discussions with the mayor's office, because the way that, when you looked at the legislation, the way that it was originally drafted, it wasn't like that.\nI, think I also want to make sure that everybody understands the bandwidth of the committee and the office to facilitate these things.\nNow, so I want to make sure that the committee knows that they need to be plugged into this also, and it's not just going to be able to be me and Susan running around.\nWe're waiting to get back a possible date for January and everything to go forward with the town, hall, Then, I think what we would need is for the committee members that are here.\nI mean my understanding is that in the last meeting we just decided that we want you to have a town hall meeting with the electives to understand what are they doing in general for supporting artists and arts organizations, not just about reopening.\nI, don't know if you saw Susan's email, we heard back from Carlina's office right, so I think that she had availability.\nInstead in the previous subcommittee meeting last month, What we discussed was a downhaul that would address the you know what is happening at our artist and arts organization right away in terms both of intermediate support and long-term reopening agenda, and we were discussing about elected officials.\n19Th is a little bit arbitrary because of Carlina, and maybe the kind of people who actually you want in a town hall and the arts and cultural organizations that hopefully will attend.\nOne of my questions will desire would be the Serrano for sure from the state, but also Jimmy, Van, Bramer, and also the commissioners, DCLA and mom, because those are ultimately the people who will have sway and insight on the issues that the arts and cultural organizations and artists will want.\nThe reason we want Serrano is because he chairs the arts and culture committee in the state.\nYou know what actions they're taking in order to support and arts and cultural organizations in this difficult time, As well as the city.\nI want you to say that at the assembly, so we have New York, State, Senate and Assembly at the assembly, The Arts Committee Chair is Danny O'donnell, with whom I worked in a lot of issues around small business and culture, and so he could also be a good candidate to invite and to Anissa's point about which.\nThink that, in terms of you know, support and programs and policies, the people who need to hear that would be more.\nSo, City, Council, Senate and Assembly, and the commissioners and our council woman, the reason for which it was suggested that the last meeting reached out to her was because, If she becomes a co-sponsor and the outreach comes from her office is going to be more effective in getting quick dates because elected officials, they can make themselves available in a second for various rallies and things.\nI, think that if you would look like, if you want to go through or continue working with, Susan on it, I think we just ask I think she needs a complete list of the people.\nAnd he's always been very supportive of arts organizations that I know of in the neighborhood and shows up at demonstrations, performances, and he always gives a good report, but at any rate, going forward.\nSo he says he thinks we should allow arts and culture organizations to provide testimonials at the beginning and then allow elected officials to address their testimonials through presentations then allow for a question to answer at the end.\nOkay, That is the other way, is that perhaps we could come up with a way for arts and culture organizations.\nYou know, I, think that what's complicated is trying to manage something like this on a zoom without having some format in mind, because in the past, when we've done it in person, we've done it at theater.\nOkay, all right so Anisha I was gonna, say that I think it's just a question of figuring out some more of the zoom features, because I have been on webinars or other meetings where you know just like our full board, meeting.\nRight I think you know also too, We would have to set a limit for time and stuff like that and structure.\nYou know, and you certainly want a diverse bunch of people right or organizations.\nWhat I'm saying is that if we want, you know, I, think Olympia's point was very good, that we need a broad spectrum of the arts community in the neighborhood.\nAnd ask people that you know if they wish to comment about what the situation is with their arts organization at this point in time and how it's been impacted by Covid-19 and what would they hope that the city state officials could do to help.\nIs that, if we're asking people to email, testimony or and or video clips, so I think that's something that we would have to figure out how it's going to come to us whether it goes through the office.\nThe participants and in the meantime, If each committee member could check the arts and culture list that is on the website and make any edits that you feel need to be done, So, I, think."
        }
    }
}