{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UChIEhm-DpDtCj0aEKKe_O9A",
            "title": "Top chat replay",
            "publishDate": "2020-09-03",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 366,
            "um": 446
        },
        "wordCountFullTranscript": {
            "people": 110,
            "community": 108,
            "committee": 89,
            "board": 72,
            "housing": 63,
            "building": 57,
            "year": 56,
            "things": 49,
            "time": 46,
            "items": 45
        },
        "wordCountSummary": {
            "people": 26,
            "community": 25,
            "committee": 20,
            "board": 15,
            "years": 12,
            "housing": 10,
            "time": 8,
            "building": 8,
            "resolution": 8,
            "services": 7
        },
        "fullTranscript": "Time since we last got to speak all together, you know just to try and break things down. You know I had mentioned in an email to the committee members already. I wanted to do things a bit different with the start of this. I guess you call community board year, because I want to focus us on trying to establish goals for this coming year. I think that right now, we've you know, definitely stepped into something. That's a lot more different than what we've been used to the last few months before we went to break we kind of had to deal with just a lot of things going on in the community. We were trying to push. You know trying to get as much resolutions do as possible, and you know I want to make sure that you know, while things are still very, you know, uncertain right now for the community, the city at large, what's going to be happening with regards to many of the services that we depend on throughout our community, we're having a bit more of a kind of a broader discussion than what we've already had these past few months between March to June. I will just say that you know I'm very thankful that we have a number of new members that have joined you know it's not enough to say thank you to just you know our membership that has been with us for years, but it's, I think, another level now to say thank you to the new members who have decided to join throughout. All that's been going on and find ways to try and be even more active in the community in ways in which they have already been previously. I think that with us having this new composition, I want to try and make sure that we're you know one familiarizing ourselves right. We're still a community board. I still want to develop that sense of community amongst us, even in committee, and I want us to all be able to go around just you know for the next few minutes introducing ourselves to one another. You know I'll gladly start off. I hope that everyone else can join in. You know talk a little bit about yourselves what you find of interest. What is your background? What brought you really to the housing and human services committee? You know I'll just say that you know I was born and based here inward specifically pretty much raised here, my entire life. I went to every single public school, that's throughout inwood, and the reason why I've chosen to be on this committee is because housing to me is more important than pretty much any single other facet of work. That's really done throughout government. You know I I've said this before when I previously joined that I was originally evicted from my household as a child. I live right there on 211, right off broadway and I know the impact that it has on families. I know that this is still a reoccurring issue that goes really throughout the past few generations of my life, where people have been being displaced where people have found it difficult to find the resources so as to maintain you know, stability within the neighborhood, and it's one of the reasons why I continue to do this work when it came out of undergrad. Still, you know much more hopeful. Much more positive can do attitude right away. That did not have any question of thought or barrier. What is going to happen here? I immediately began starting work in city government under the mayor's public engagement unit. I did work for three years here in inwood, as well as east, harlem, specifically working alongside the elected officials as well as a number of tenants throughout the neighborhood trying to ensure that they could stay in their homes, help them get connected with legal services, social services. You know all. I can't even go on to say the number of services that we try to work with throughout the city, but it was, you know, definitely a difficult challenge. I'm sure that these times are making it a lot more difficult now, and I think that that's one of the reasons why I continue to stay involved even past this. You know even past that previous experience of three years working here in the community, with the tenants and with that I want to pass along to oc. Can you please tell us a little bit about yourself, hi guys I actually moved to inwood about 20 years ago. I think, and I joined the community board. Probably six years ago I was on land use committee for since the beginning, until this month, when I was kicked out of the committee for unknown reason- and I also was on the parks and cultural affairs committee- I was in housing. Actually when I first joined the community board. I was on housing committee for six months and at some point I moved to licensing which I was kicked out from last month like a few months ago. I'm urban planning planner by training and one would think that housing will be my thing, but I think that it's very complicated I have I mean, like all the rent regulations, that it seems to be very complicated and I live in a co-op. So I'm not fully familiar with everything, and although I was a renter before I was living in a co-op, but it's a completely different thing. So and that's my thing, thank you and can I pass along to bruce good evening? Everybody hope you had a great summer. It's great to be back. Wow went quickly, so I probably moved to washington heights about the same time that oc moved to inwood about 20 years ago from the other side of town didn't really know much about washington. Heights ended up in audubon park and a great co-op and then was lucky to do that and have since gotten involved with various organizations, including community league of the heights, where I've been working with the food pantry. Lately, volunteering trying to set up a business improvement district couple years ago with the vaughn senate, which didn't pan out I'm a real estate, residential, real estate broker by trade and I'm involved in a lot of the rental issues that oc is talking about, plus mostly resales and in this area, in harlem upper west side and so forth. So I was on business development and asked to join housing and I'm very happy to be there, and I hope I can contribute as best I can. Thank you very much and thank you bruce. Can we have aisha? Are you there, hello everyone? My name is aisha oglevy. It was my intention to say this anyway, oc kind of took the lead, but I am a member of community board 12 for almost eight years now I served as the chair of housing and human services for about three years. If I remember correctly, I also was unfairly targeted on this board removed, replaced back on this committee. There are many ways that I think that this board definitely needs to improve, especially with fairness and equity. That is the reason why I remain on this board so that work can be done, but I have done advocacy in this community for over a decade, probably two decades in the areas of housing, human services, education, criminal justice. I have an interest also in land use because of the connection to housing. I was a part of the rezoning effort to fight against that effort. I also was a part of the effort to get the new rent laws implemented, going back and forth to albany. I advocate for individuals in our community on a regular basis, preventing evictions and helping them keep their benefits in place and informing them of new developments in all those areas, as well as in education as well. Even though I'm not on the education committee at the moment, I love the opportunity to be able to support and represent those that are constituents in our district, but over the last year or two. It has become incredibly difficult because of the dynamics within this board. I hope to see that it changes. Thank you, aisha and I will open up. Oh I'm saying ada are you there? Can you give me a? Can you come back to me? I'm sorry, I'm walking right now! So just give me a second got it. Okay. Do we have marielle hi? Yes, can you see me there? You go okay, hi! Sorry, I've been having some issues with my computer, so my audio is coming in and out so I understand we're introducing ourselves and just talking a little bit what exactly, because I think I missed some of that a bit yeah, so I had just been asking if you can tell us a little bit about yourself pretty much. What brought you to this board, what kind of passions you have, maybe even outside you know things so we're also trying to familiarize ourselves with you as well, and some of the other sounds good, so hi everyone good evening, so I am new to the community board. I work for the uk government at the un, so my background is very much international affairs but very much from a social justice lens. So I'm really looking to bring a lot of that international work more to more so to work in my own community. So I'm actually born and raised in washington heights. I've lived in the community, my whole life. My grandfather moved to washington heights. I believe it was in the late or early mid 70s. So you know we have a lot of a family history in the neighborhood, I'm still living in the same apartment that he first lived in and I'm new to some of the housing work. But I do understand that it's very central and key and it's a right that people have it's a right: a right to housing and quality housing, affordable housing and also decent housing, really making sure that people who have housing are living in decent conditions and so again from that lens of my international work. I do look forward to working with all of you and you know, making our community better and making housing in our community, affordable and decent for all glad to have you here and can I have leo jimenez good evening, everyone, I'm sorry, I'm also having issues with my cam. At the moment my name is leo. Jimenez I've lived in washington heights, my whole life so 30 years, exactly I'm a community collection liaison on behalf of the department of design and construction. So I don't necessarily deal with housing, but I have vast experience in infrastructure. I joined the committee because I think housing is essential to promote better quality for low-income families. I also believe that affordable housing decreases crime and decreases segregation, so I hope to learn from each one of you and contribute to the decisions for the betterment of our community. Thank you. Thank you leo. It's a pleasure to meet you and I've. If perhaps that this would be a good time aydah. Are you in a better place right now or yes, I am. I just got home. Excuse me sorry about that guys. I thought I'd be home by now, hi everyone. I am very excited to be part of this committee. Sorry, my elevator's, not working, so I just ran up six flights of stairs, so I'm a little out of breath. Why did I choose housing? I am a tenant, a defense attorney at the legal aid society. So right now representing low income, tenants in Manhattan who are facing eviction. Obviously this is a very, very difficult time for our practice area and obviously for our communities with the pandemic, with a significant number of unemployed people and just kind of figuring out what the situation is. Even with all the eviction moratoriums, you know there's a lot of temporary relief, but nothing permanent, a lot of uncertainty in our community. So that's what I've been doing at the legal aid society outside of that. I also excuse me for a second outside of that. I volunteer with the upper Manhattan mutual aid, and I do I help them with their homeless outreach efforts where we we go out to the streets, meet people who are unhoused and just try to figure out what their needs are and try to help them with their immediate needs. Obviously, it's not fixing the structural issues, so I'm hoping that my involvement with the community board. It sounds like a lot of you have a variety of experiences that you bring to the table. So I'm looking forward to learning from you to also hearing from our community members. What the needs are, how we can help them and just work together, so I'm very excited to be part of this co, this committee. So thank you thank you and I also want to want to have our extraordinary public member marshall. Can you hear me? Yes, gee, that's a big build up extraordinary. It only matches all right. Well, my name is marshall vanderpool, I'm the first vice president of the indictment resident association, duly elected representatives to NYCHA, for the residents of dyckman houses, brought me to the committee is to bring the the voice the perspective of how NYCHA residents professionally I'm a tax supervisory tax compliance agent from new york state. Basically, that's a collection function, so one of my subordinates might be going to knocking on your door coming to the store and trying to resolve your tax issue and welcome everybody and glad to see that everybody's back and healthy and let's have a productive, dr beer. Thank you, marshall and sally. If we can have you also, you know introduce yourself as well. I'm sure you'll probably meet some of the members here as well. Hi. Can you hear me? Yes, very good, my name is sally fisher. I've been a member of the community board. I think four years, maybe three natalie. You can correct me if I'm wrong, I spend most of you who know me from uptown. I've been in inwood for seven or eight years or six, maybe seven- I don't know. I spent a lot of time outside so I co-founded friends of inwood hill park, which represents manhattan's last forest and does a lot of forest restoration, cleanup et cetera, et cetera, in inwood hill park. I also was a founding member of the washington heights inwood food council and basically our mission is to get healthy food to our community. I work with react. I do I test water for river keeper, although the testing is paused for this year to look at water quality to basically look at how much we're dumping in the water when we flush our toilets, which you should not do if you can help it during a rainstorm in my professional life. My background was a couple decades in health care policy and research. I was also a stock analyst covering health care stocks for five or six years. My interest in this committee, particularly, is in the issue of homelessness and how to address homelessness from an interdisciplinary perspective. It's become. I joined this meeting specifically tonight because of two two things going on in different on the upper west side in harlem, where their responses to the homelessness crisis are very different. So I wanted to address that at some point in the meeting and my proudest accomplishment ever in my life was receiving the ob being legacy award which, for those of you who don't know who did know ob or don't know his history he's worth looking up, he was a long time community board, member who community was always number one. I mean I used to joke that if we only had one person on the community board, that person would be ob, but that's my proudest honor and that's it well. Thank you. Everyone, I'm glad to have us all together. After a long summer, I'm sure everyone had their own fun whether it was a staycation or perhaps just hiding away in the woods away from everyone just getting some peace. That's what I did actually about a week back in may and and actually so sorry. Let me also just give this moment for janet. Do you want to perhaps introduce yourself as well? Yes, I would love to because I don't want you to feel. Like I'm spying on you, I am curious to meet you all and I'm not a member of any committee or the board, but I am the president of the edgecombe park. Condo association edgecombe park is the building is at 456, west 167th street and the building was built six years ago. It has 49 apartments in it plus two commercial spaces. On the first floor and my husband and I have owned that unit for six years ever since it was first built right now, there's every unit is owned by someone, but quite a few of the units are rented out. So there's a lot of renters in there and the reason I'm interested in this meeting and housing etc is because we have a pretty unique situation in our building, which is that, ever since the building was first sold, the units were sold. There's been two group homes that exist in two of the units. Two bedroom units are operated and owned by a an organization called community options and, unfortunately, community options doesn't have any sense of community any sense of responsibility to any community, including the residents who are there and the, in other words the people they supervise people who live there. They don't have responsibility to their staff. The staff are not capable of handling the residence and the people who otherwise live in the building are absolutely going nuts, because these group homes have shown that they can't operate according to apartment living and the pandemic has just brought everything to a crisis point and the reason it's one main reason. I think it's a community issue is because, since the workers are not able to control the aggressive and violent behavior of the residents in our building, the residents seem to have really serious mental health issues. You know they're not handicapped in wheelchairs or just chronic diseases or anything, but they have what seem to be mental health issues, and so often the supervisors cannot control them, they're all men, they happen to be youngish, men, I'd, say 25 to 30s the age of the residents and they so the resident. So the supervisors called the police constantly and it we have on our street. It's a small little street just is bounded by edgecombe park on one side, and you know amsterdam avenue on the other, and we have like eight police cars, fire emergency and a lot of times. They don't you know they just they do de-escalate the situation. Sometimes they take a resident to a psychiatric ward and then he's dismissed the next day. Anyway, we have tried to be as friendly and welcoming as possible and work things out with this community organization. Community options, it's called, but we've been totally unsuccessful and so janet sorry, I definitely want to open this up. I was actually planning- and I emailed bruce last night- actually as well we're gonna, try and set this so that we can, you know, discuss the entire situation in the new business section: okay, but I yeah so sorry. I should have been looking forward to just make sure you got to introduce yourself: that's okay, no open up, but yes that will definitely come back to this. Okay. I didn't want to take too much time right now and just I also want to give a quick moment for philia perhaps has joined us. So I'm I'll just answer you cynthia. Yes, anything that perhaps is of concern. Definitely the rezoning is one of the areas that has been brought up. You know that that's always going to be an issue, and you know again anything that the public wants to always bring up for discussion. Please do feel free to have it brought up once I open up everything for new business at the end and yeah, we'll, of course, you know get back to this and yeah so I'll come back, but thank you, though, so to start off our meeting tonight. I want to kind of open it up really to our committee first and just following, along with the typical rules of how we do things with the board, we'll open it, then back up to the public. The public can give us feedback. Of course we always love to have that kind of interaction back and forth. We tend to do to do it a little bit more often here in the housing human services committee. It's one of the things I actually really love, because I like that interaction with everyone, but yeah I'll just I just want to start off by just bringing up community. What really is the committee goals for the year? You know, as I think we mentioned previously- we've wanted to try and set up an agenda for every single year, right, of course, we're in a bit of a different time period. Things definitely might have changed previously. We maybe might have gone to a huge discussion, for instance, let's just say 2019 when we tried to get the tenant protection act passed. That was one of the big focuses. We brought it up a few times we discussed it spoke about what other organizations were doing. What was the tenants bill of rights that was being spoken about by a few organizations? We had the coalition to what was the coalition on or council to? I think it was the coalition on council for tenants correct me if I had the name wrong anyone, but, yes, we had a few different organizations that stopped by really spoke to us about some of the concerns that they had felt was really of just importance at that time. Of course, I want to make sure that we're getting in contact now, on my own end with some of the folks that work with the population that are without a home at this point. You know I've mentioned previously that for this year, I'm going to be reaching out to one of the policy advisors that I previously had connected with. Through my time at the council- and I specifically want to see what work they're doing now, what the research they've been finding is showing about really the rate of homelessness throughout new york city, and you know, I think, that for my own goals this year, I want to ensure that we have the opportunity to really actually interact with some of the homeless service, homeless, shelter providers, because they are probably dealing with really just a huge influx of families either, because some of the very recent I'll call them loopholes that exist that have caused families to get vacated, whether it be because I'm not sure if people have been following new york, one they've been talking about vacate orders just from landlords refusing to actually make repairs throughout this time period that you know it's an unfortunate circumstance that that's a kind of way in which landlords are essentially forcing families out, and you know. I hope that we can do a bit more work to try and ensure that families are not being displaced specifically during this time. You know the pandemic and we're being a little bit more responsive to the needs of those that particularly are in these kind of home housing situations that really are just not decent and are not livable circumstances and with that I'll pass along. I don't want to take too much from everyone else, hi everyone. This is aisha, so I think that in the past what I've tried to do when I was serving as chair is to focus not only on things within our purview, but also things that could help the board work more efficiently for us in the areas related to our purview and to support business across the board throughout the board. So one of the things that I I'd like to see happen is in that area is that there be a systematic way that we are keeping track of the work that we're doing the outcomes of that work, as well as where the office is on those tasks. The reason being is that, oh, and also for there to be credit given to the people who are doing the work many times I've seen people propose work within this board and sometimes other people take the credit for it. I myself have been. I have put a lot of effort into doing certain things within this board and seeing that those things not even be followed through on, even though they're voted on by the full board. All of the resolutions that I have put forward in front of this board have passed and most past near unanimous, if not unanimously, and for that kind of work to be left on the wayside and not forwarded by the office. The way that it should be is unacceptable and it's a slight on the community. Furthermore, as a part of what took place last year, where I'm concerned there was inappropriate record keeping, there were claims that were made that were not accurate and then it's like the responsibility is all on me when, ultimately, I did demonstrate that and that went you know in one ear and out the other four people that to me it's a toxic environment and should not be happening. But again, more importantly, it's a slight on the community when work like that is not done. One example of that is a resolution that we in this committee reviewed to have a safety net fund put forward by the elected officials and for a coalition to be built for people who are undocumented asylum seekers, etc in the event that they are released from whether it be being detained or whether they enter the country and have nowhere to go that there would be supports for them to prevent harm to themselves or others, and that resolution passed the only one person voted against it, and yet the office never put it in black and white and forwarded it to the elected officials. That is something that could have work that could have been done to prevent the impact on some of those very people during this pandemic. That's the that's the weight and the importance of having a track record for what we're doing and to make sure that everything is being done. The office should be basically mission control for all things on this board and most of the time they have no clue what's going on. Not only do they have no clue about what's going on within our committees, they're not doing their work, they're not doing their work, and it can be left where the weight of that and the responsibility that the culpability of that is passed on to other people when it's not their fault, that's not appropriate. That being said, there are other things that I put forward that were in motion as all of this began to roll out. For instance, the committee had the intention on reviewing what was happening with dhcr, to bring dhcr to a point, to put forward a resolution to make dhcr more accountable to the community to tenants so that there would be visibility about information related to when people's tenants rights right most of what is happening in dhcr is weighted on the side of the landlord. There are many ways that we already discussed that we can change those dynamics by either asking the agency itself to move on those matters and change the way that they function or ask the elect elected officials to patch legislation where that's concerned, nothing has been done with that, and I know that we've had a pandemic, but this began way before the pandemic. That being said, I'm sorry sally. Do you have something that you want to offer? No one else responded when I when I spoke, so I think if I have things to offer, I shouldn't be getting a cutthroat from you. Thank you, though. I can't hear you by the way. The other thing that I wanted to proceed to that I wanted to try out the emmy. I put forward, as this was coming down the pipeline, that this administration on the federal level, what had the intentions of changing a lot of the immigration policy, specifically by increasing the application fees and the asylum of entry fees, which would make it unaffordable. We are a community of many immigrants. This is something that impacts our community directly. I think that we should have had a primary voice in that matter. Nothing was done where that's concerned. What ended up happening is that, for instance, one of the application fees was increased from six hundred and forty dollars for the naturalization application to one thousand one hundred and sixty dollars. There wasn't an asylum fee previously now it's 50 for people who are fleeing their countries to come here so and what I was told by the chair of the board was can't the elected officials handle that. So again, those are some of the ideas that I have, but I think that also what we need to be working on is the structure within this board so that the work that we do is not in vain and so that we are taking the positions on behalf of our community, that we should be. Thank you and sorry before I pass it along to whoever else might want to know. One of the things that I want to focus on in housing. Human services is ensuring that we are giving space to those you know. Of course. I do want to make sure that you know what whether we have a concern disagreement. You know perhaps maybe a thought that even just comes to maybe aid someone's. You know other point. I just ask that folks wait until after the person is finished and I'd be happy, of course you know always to pass it along if there are multiple individuals that do want to speak at the same time, you know I am trying to keep stacks. You know just following along with really the rules bylaws of the you know the board. But yes, please do. Let me know whether it's the raising hand function or perhaps even just the q a either was fine but yeah I do. I do want to just make sure that we keep that you know as much as possible in this committee. Okay and I'm so sorry did. Did anyone want to speak following aisha, okay, well sally? I think I saw your hand first. All I want to say is there are parliamentary procedures in terms of how long I'm not questioning the truth or need to be heard of what you said aisha? I just think that we need to limit it. Otherwise this meeting is going to last forever. So I think it's five minutes or three minutes, and then you defer to the next person. I think ariel runs this meeting. Thank you, though sally there's a bylaws at the community board. So anyone else have something to say. No one spoke before I did and I had. I don't think that I was rambling or repetitive. I had suggestions and I made them. I'm not sure why you're offended okay, so I'm gonna pass it along now to oc yeah. That's a question to aisha in terms of the resolutions that passed and the office never send a forward to the to the officials. Did you file a complaint about that with the borough president? Did you do anything else and not sure? What's the process for that, but I'm kind of questioning: how is it possible that the office doesn't forward resolutions to the government officials, as they should well see that that issue is one in a stack of many, not only my own personal experience, but also people in the community have come to me to express certain concerns they have when they make requests to the office that the office is responsible to do also having been a member of the executive committee, there are things like that have taken in executive that the office has dropped the ball on as well as far as making a complaint. It's something that I'm definitely considering, but what I did do first was make sure that work was finally done, but it ended even when I finally said what's going on with this resolution, and I had acts a couple of times this began before richard lewis passed. I don't believe that it was even done until June of this of this past year, and that was an entire year. That resolution had not nothing was done with it. Despite my asking questions about it and what one of the primary things the primary responses was to send it back to committee and we almost redeliberated it and I had to clarify and like no, this is not. This is supposed to just be forwarded to the elections. It was already voted on so, and I have all of that on email. Okay, so you know not to again cut off the concerns. Of course, they're still part of the function of the board, but I do want to just try and make sure that we're sticking to the agenda item in the capacity just to bring up many of these concerns, because I do again, I want to plan this out for the entire year. You know I can imagine that there's a few different issues that, whether the board members the public committee want to raise, I just want to make sure that I'm finding it out for the year. Is there anyone else that? Okay, just my one point that I would like to raise and is the I would like to pass a resolution at some point, after speaking to a professional in the field about the 100 000 apartments. I know we spoke about a number of times, so I'm not going to repeat myself, but I just don't think that the shelter system is a solution. It's a temporary something and after that there is a void. There is nothing that comes after that, and I think that program, the 100 000 apartment, is actually a good one. So, as long as I am on the housing committee, this is my goal to pass a resolution in support of such initiative and actually that that's that's actually great to bring up. But I think just because some of the members might not have perhaps heard about or are as aware as much as you are about it. Could you actually give a little bit more detail about really what this program focuses on, so this program is focused on giving a homeless people an apartment and pay for the rent and give them an opportunity to live in a house in a home that and then that program is also attached to some social services like helping them. If some of them have some health issues if they need to find a job. All of that is like an umbrella. It's like a it's a program that include different things: to lift people up from the street to become you know, to have a house to feel like you know, most of all of us so, and I feel from what I heard and what I read that it's a very successful program, and I think this is something that we should push to have here in new york city, which we don't have. I think the shelter system is a good system to have as a temporary solution when things happen suddenly, and you find yourself without a home- that's a great place to be as great as it could be, but it's a good temporary solution, but it's not as a long-term solution. It's just not yeah and it's also cheaper to find, I mean, like by their study, it's cheaper, to find to pay people to pay rent as opposed to running a shelter system. That is it just doesn't get you anywhere. You there's no like it's a circle. So it's a combination of positive things about this program. Thank you, olson sally. You have your hand raised yes related to that. I think just the whole issue of the homeless- and I mean our shelter system- is not a good alternative, because there we too lack the wrap around services. So I think that we need to take a very structured approach. There are programs that can partner with basically what our shelter system is doing and what this is doing, which is giving people a place to live, but in terms of giving them tools to survive. I don't, I think, they're inadequate and even the woman who brought up earlier addressing you know calling the police when there's an issue incident police generally will escalate not de-escalate a situation, which is what you need is someone who's suffering a mental health crisis. So I would like to look at the homeless population as it affects both the work in this committee, but also throughout all committees, like this. The number of students increasing number of students that are living in shelters, but we need to look at not just the shelter systems alternative, but how to improve the shelter system. How, when we have programs, like you, know giving people an actual home to live in that they're, providing the supportive services? How, when we're using hotels temporarily that we're providing supportive services? So that's sort of my issue and, as I said before, I jumped on the call because of two very different approaches: I've seen in new york city, one on the upper west side and the second in harlem, which had a very responsible approach. I thought to identifying hot spots and trying to deal with the problem areas versus basically saying we don't want you in our hotels leave town. So, although we're compassionate but just leave our neighborhood, so that's my two cents and I'll actually just add. In with regards to the hotels, I think it's actually a good discussion, we're having right, there's really just the sense of divisiveness that I think people are hearing in the news now. You know whether you are talking about all of a sudden opening up these hotels for the purpose of shelter services allowing for individuals to essentially social distance. It is you know, I think, one of these kind of conversations that goes further within government. You know I just say this because the things that I've dealt with, whether we're talking about it's, you know the discussion of fair fares or even you're talking about programs that are focused on fair planning, where perhaps you will focus on where do you cite a location for a city agency office oftentimes, you know even going back to what we talk about is the 60s and 70s. This is one of the biggest discussions that we had because often times we found that there was disproportionate impact from let's say, having sanitation, warehouses facilities being kept in certain areas of the Bronx right, and that's something that is not. You know just going to effect. Of course, the housing situation is going to affect the very environment, the air we're breathing. You know the very water that perhaps is you know going in through the pipes and so yeah. It's just one of the things that I'm thinking of right now. The concern that I think has been raised in regards to this kind of fair sighting of where we put agency buildings that really serves the public. It can also be yes, you know that kind of divisive issue, because oftentimes we do find. Historically, you have these in predominantly low income and also colored communities where we have this influx right. So we want to be a just city that really regards the concerns of some of the most vulnerable, and you have individuals that also focus on what has been in their community. What has rather, what has not been in their own community for some time, so you know, I think that that's one of the areas that in which we do even within housing human services, we do need to discuss a bit more. How do we cite locations throughout all parts of the city? To really, you know address some of the concerns that we have here for those that really are vulnerable and do not have the opportunity to essentially afford what was the rent or you know what is going to be the written future and, oh, I'm so sorry sally. Are you still raising your hand or no sorry? Okay, can I ask bruce: do you have any thoughts you like to share with us? I'm not sure where we are right now I thought we were going to put together kind of a road map of our upcoming year topics and issues, and obviously homelessness is one of them. But can we get back to kind of what the agenda that you laid out looking at the fiscal priorities and what we want to take on right? So maybe it wasn't clear from the agenda. So this portion, I specifically laid out for us to discuss individual goals so, for instance, you know on let's say the next meeting we are going to invite a service to rider that focuses on the shelters that are within the community board or a community district right. Let's just say that that could be something that we are trying to plan out, but we're trying to really get out the ideas of what are the things that we want to focus on the fiscal year. You know individual items that we want to put in source to prioritize that that's, of course, going to be brought up, but I just wanted to take this time to focus in on those individual goals that we, as a committee, are going to focus on throughout the year, got it. Thank you yeah ariel. If no one else has anything to add, I found my notes that I had submitted. I believe it was in either december or actually it was in January I'll just I'll just say so sorry that I will come back to you had just turned it on like right. After did I understand you correctly, you said you were going to come back to me right. Oh no, sorry, I was saying to ada because you would yeah you had both like just started at the same time, but I'll let eta go. I went already. I can wait. Okay, thank you aisha. So you know I'm new to this, so I don't know if this is the proper format or anything, but these are just some goals or ideas that I that I had in mind. One of them is very simple: it's just supporting some legislation. That's been introduced in the city council to expand the right to counsel, and I think this is something that the committee had discussed previously, but now that mark levine and city councilwoman gibson have introduced it to expand and expedite the right to counsel. So, basically, we know there's a right to counsel if you're facing eviction and it was rolled out based on zip code and income. This legislation would expedite it, meaning that the zip codes would be all covered basically by the end of the year. This is in response, of course, to the looming eviction crisis that we're facing because of the pandemic and just the greater need for people to be represented during these proceedings. So that's something that I would like this committee, if we haven't already done so in the past and again, I'm new, so I don't know if there's already some sort of resolution in the pipeline. Another thing I would like I've seen other community boards set up forums or panels where they invite people from- and I think ariel mentioned this about having speakers- and I know that- there's a great need in our community right now for clarity about where we stand on all the laws pertaining to tenant rights. Again, I'm a tenant, defense attorney and the laws keep changing. You know there's a difference between the state, the city, the federal now as well, getting into like what an eviction moratorium is who's cover who's not covered. This is pretty time sensitive. So if we wanted to move forward with this, we would probably have to put something together pretty quickly so people just. I see the community board adding value to our community and kind of clarifying like these are. This is everything that's going on and we're going to put it very succinctly in one place and one event invite maybe four maybe five speakers at most, because otherwise it gets too long. Just so, people know okay. This is the information. If I need to follow up. Who can I follow up with, because I do see that there's just a lot of misunderstandings about what's going on and also a lot of anxiety surrounding that, just a few other, very quick ideas, community, land trusts and again. This is something that the committee might have already addressed in the past year or two, but I am sort of involved with the northern Manhattan community land trust- and this is not just to plug them, but it's to plug the idea. But let's think creatively right now, as far as like, affordable housing and thinking of long-term solutions and bringing that conversation, especially as we're now facing the the 2021 elections, are right around the corner, we're going to see major changes as who's representing us at all levels of government here in new york city-wide. So we want to make sure that if this is something that our committee feels strongly about, that wants to propose that we that we're kind of like that we have something solidified and in writing, because then we can maybe put that out there and just get that conversation. And then I don't know a few other ideas, something more long-term, and I know this. So, although I'm all about representing tenants and you know renters rights, I do believe that we need to have a conversation about supporting people becoming first-time homebuyers. My father himself he's low income, he's lived in new york city for since he was 17 years old. He just finally bought a co-op. It was a studio, it's something small, but the pride that he felt like having his own place. Finally was something that he never had. As a renter- and I think sometimes we feel that we could either have an either or conversation we shouldn't. We should certainly protect renters, but also have a conversation about how do we build wealth in our own communities and that's where the community land trust comes in too, but I'm also thinking of people actually owning being becoming homeowners and demystifying like that process for people. So those are just some of the ideas I wanted to share with the committee and I'm so sorry, I didn't want to cut you off here. I wanted to ask: do you happen to know what the bill number is for the expansion of the right to council? I know curtis shared it earlier, but just so I'm not switching back and forth through email. Yes, yes, correct, I'm looking at curtis's email right now. Let me see it's number 2050, okay, perfect yeah and it's to amend exactly his number 2015 is to amend the administrator code of the city of new york that pertains to the right to council and again it's not necessarily changing the law by just kind of expediting it and rolling it out. On a on a quicker basis, so people have coverage as they're facing potential eviction right. I think by this point it would pretty much amend the administrative code to bring it down by about a year and a half. So it's more present right and we would obviously need funding for that. Yeah. Okay, thank you! So much aisha, you think you were next. Yes can I share my screen because I have the list on my desktop. I don't know how to unless you should be able to already. No, I don't think it will. Let me I think it posts yeah, it's disabled, okay, so I'll just run it off. So the guarantee I'm interested to see what the status is of that, but I don't know that we put forward a resolution looking at what is being proposed there, making it specific to our community or making other suggestions, as we see necessary. Also, I think you've been made coho, so I think you should be able to now. Okay, let's see yeah okay, it should oh there we go great, okay, so, okay, so the homes guarantee the fact that housing overlooks applications for eligible applicants. There was a story that I believe was put out in regards to that where that was found to be true- and I think for many years we've known and heard from people in our communities about applying for affordable housing, how difficult it is, how many years they spend on the list. How sometimes people who seem to have just applied, maybe the previous month get you know an apartment before someone else, that's been on the list for many years I mean, I know that there are priority levels, and sometimes that may be the reason, but there's also seemingly internally within housing, but also within the shelter system, where preference is given to some and not others, and I think that that's something that we should be looking at, so that there's equity in that regard and so that we're serving people properly NYCHA, rent overcharges, specifically for those whose income has changed, is another issue. I don't think I have it on my list, but also the fact that sometimes, when people's family size reduce or someone moves out, that tenant is required to move out into a smaller unit, sometimes that creates hardship. I want to make sure that we are looking at that and having an understanding of how that's manifesting, how effective that is, making sure that there's no hardship in that area and what the necessity is for that. Let's see the census we're already deep into the census, which is almost done, but I wanted to look at the digital divide and the concerns that I spoke to people at the new school. I forget the name of the think lab there. That was looking at the concerns regarding how the census could actually be put assessed after the fact, because of the fact that it's digital and not as it used to be done. But we are we're already past that at this point, new york presbyterian tenants. It's something that I've worked on for many years when the housing act was passed last year. It's something that this committee was entertaining. I spoke to many elected officials about the issue I emailed them. One of the concerns is that, for instance, in the building that I live in according to the city, a hundred percent of the apartments are affordable housing. The problem with that is that most of the people that live in this building I'd say probably 90 percent of the people, if that are not affordable housing recipients, because they have a license because they are tenants of the nonprofit and not least tenants. So, first of all, I think we need, as a city, to have clarity about the difference between a licensed tenant and an affordable housing tenant so that we're not reporting inaccurate numbers about who is a recipient of affordable housing. I would say that what we're looking at in this situation is the opposite of affordable housing. Some people are having their rent raise 9 to 11 percent per year. I've done the work to demonstrate that but received tremendous pushback in that concern, and I think that that's a ball that definitely needs to be moved. The impact of real estate tax programs on the housing stock where affordable housing is concerned, we've talked about 421a previously in the past, and other programs like it, but there's still issues that exist in those areas that I think this committee should be looking at. Let's see dv human services- that's I talked with curtis about that, because some of it falls on the side of hra and some of it falls on the side of the NYPD how services are being administered for domestic violence, victims, I've seen. Unfortunately, people come to harm. There was one woman last year who she used to live in our district. She actually worked around the corner from me at university. She was decapitated by her partner and she was attempting to seek services, but because of the way the system is structured was not able to get them in a timely fashion. I would not like to see that continue incarceration reentry for those who are leaving the jail system. I won't go too deep into that credit, breach settlement program and credit for renters. This is something that scott stringer spoke about. Previously his office came to speak to the committee. When I was the chair, I would like to see that move forward. It's basically so that people who have been renters for decades would be able to get credits for the fact that they have paid their rent on time, just as people who own a house do and are able to have that put on their credit so that those people can be home owners and it probably can be handled in the same vein of what edda is talking about. Allowing people to you know basically build wealth, but also to change their status from tenants to homeowners. I think that's part of the issue, the obstacle that exists in that area. Dhcr DOB HPD changes. They should all work in conjunction with making sure that everyone is accountable to the tenants in their housing, as well as those who may be business owners and anyone in our buildings, the immigration coalition, which that was the that was the resolution that I spoke about, that I worked with the sanctuary coalition. I'm probably going to draw a blank on accurate naming right now at this moment, but the intention there now that the resolution has gone forward to the elected officials was to build a coalition of the institutions in our community who serve the those who are immigrants to make sure that there's a across-the-board cohesive plan ideas and supports for that community, and it goes also hand in hand with the work that you did last year or before we left session ariel in regards to the impact on immigrants as well, the DHS, the armory issue, which is the main issue. Why I got targeted by this board by members of this board. That still has nothing has moved where that's concerned. The last that we left it at was that there were a list of questions sent to dhcs to be answered in regards to that matter and, of course we we're in the pandemic. So I don't know what the operation of that building is, but it remains a building that is owned by the city of new york. That has historically not functioned according to what the contract says, and I know that, because I reviewed it in depth. Others on this board have also taken a look at that as well, and so that's work that is left open to be done for almost probably more than a year. At this point the so where homeless is concerned, I feel like we talk about homeless wholesome, but I think that we need to kind of drill down and look at the different ways that homelessness manifests. I did speak to dhe at DHS about coming to speak to us about the different programs that exist where that's concerned: subway, homelessness, school homelessness, re-entry from jail homelessness. Obviously, that's repetitive with jail so that we can understand the differing issues in those different populations and what the impact is and then we can figure out. What do we think needs to be done? What is the rate that it exists within our community? When I was on the education committee, I had gone to a a conference at the new school where they spoke about school homelessness and, at the time, the committee, the ed committee for this board, thought that there it didn't exist in our district and in fact, when I pushed for more inquiry where that's concerned, we found that to not be true, I'm interested to know what is the status of that right now, because for at least one school in our city, there was like 50 of the kids in the one school were homeless, and it also goes into the area of the gerrymandering that happens where education is concerned. The connection to how to housing is that it they do it based on where kids live, and sometimes they draw the lines intentionally so that some kids will be able to go to certain schools, while other kids cannot. So to me, that's a slight on people that live in certain parts and I've seen it in our district. Like 187, you could only go to that school if you lived in whatever it was, but you know that borders into the education area of it, but the homelessness is the major concern there. The citizenship I already talked about that. I think that we still should pass something saying that this is not acceptable to have an immigration application fee double. I also learned from a gentleman from africa that when you do certain application fees, if, for whatever reason it is not accepted, you have to pay all those over again and people are paying thousands of dollars into that system. That's something that I think that we should also look at the housing code in relation to fires. I live in a pre-war building that was built in 1920. I at one point really had like some rooms had no outlets. Some rooms only had one outlets. It's 20 people have elec electronics. I learned of a building in our district that did have a fire because of daisy chaining of extension cords. So I think that the code needs to be changed in regards to what the law says about those outlets. I spoke to fdmy and I also spoke to DOB about what the rules are in regards to that and basically there's no requirement if it's an old building for any upgrades to be done. I think that needs to be changed, so the vacancy count for buildings in our district is outstanding, so that needs to be updated. It's work that this the committee started doing a couple years ago. We were supposed to continue that this past year the 15 wage, how that impacts, people's eligibility for hra programs, because it's great that people can have more income, but it's putting some people into a situation of hardship because they may have been receiving food stamps cash assistance, rent assistance and now that 15 wage increase makes them ineligible, and so it's leaving it's leaving them in the lurch. Because of that, and I think that we maybe need to address how hra's qualifying them for those benefits the community land trust. I don't even remember the exact year that this board passed it near you unanimously, except for one vote. Etta spoke about that as well. I think, just because of the fact that this board passed it overwhelmingly, it's work that we need to follow up on and make sure that our chair is doing the chair's job of advocating for the work that this board does to see. Things come to fruition, which lends to the same thing that I said in the beginning of the meeting about tracking, because we have work that is being done. That then it's just like a may, as well put a paper weight on it. The last thing on the list is in regards to the city pheps voucher. There was there was concern that the program may be going defunct or being eliminated. So I want to know, what's happening with vouchers and then also, I should add, the status of what's happening with newark suing the city for the soap voucher and sending people out of this, the city, because they can't afford to house them here, but then they're being sent to other states where, once that year is up, they no longer are responsible for them, and new work for newark, for instance, is not having any of it. And I think that we need to rethink that. Thank you for your time. Thank you gave us a whole year's worth of, I think more than up there. Yes, I'm trying. Is it possible to switch from the sharing of the content? Oh okay, that's what it is here. Thank you. Thank you for saying that I was like how do I get back to the screen? I had to stop sharing. Thank you so much thank you. Does anyone else perhaps have some goals that perhaps they want to raise tonight? I'm sorry, aisha. Do you mind sharing that via email? Maybe no problem, thank you. So I saw both sally and maria. I will. I will defer to the both of you to choose between you. Actually both raise your hands. At the very same time, maria you go first, okay, thank you, sally hi, everybody. I am maria luna. I've been a member of this particular community world for 35 years, so everything that I've been listening to I have heard many times, but anyway welcome, and I hope that you will contribute a lot to our community to our community world mike. You know, what's the point of information, I would like to know if there is an issue on the new business that we like to discuss as part of our the lower part of washington heights, a new construction, a new proposed building on a57 riverside drive. I saw that was part of the agenda. I don't see it here, otherwise, I have to move on to something else, but if you give me the opportunity at the very end, I would like to address the new members of the this community board to give them a little history about not only a community board but also our community. Since I listened to some people have been very new in our communities and probably do not know the the works within our community planning board. So thank you. So much aria is that if you tell me about the building 857 riverside drive, I think that you are aware of the issue. Is that going to be on the the agenda tonight or maybe in the future yeah? So just this might have been right before you probably hopped on. So there are two groups. Definitely one of the groups is focusing on 857 there. I was just talking about it last night with bruce as well yeah we're both allowing for you know each individual group to speak to us towards the end in the new business. It was just that because I didn't know beforehand it wasn't previously on the agenda, but yes, anything that the you know board wants to discuss, or perhaps the public always just you know ask that perhaps let me know in advance see what else I can pull up on my end to possibly help but yeah we'll be discussing it at the end, and I did actually already look at the property so I'll pull that up I'll try to share off my ipad, the information online. Hopefully it's helpful but yeah. If perhaps there's any goals that you might have thought might be of interest for the board or committee. Definitely let me know, but no I just want you. I just want you to finish with your agenda and then at the you know, at the end of the new business. Maybe you will give me a few minutes. Absolutely, thank god. Hi, charlie hi really quickly, I think, both with etta and aisha's list. The need for us to take a really interdisciplinary approach to a lot of these issues is important. Just to let other of your committee members know, I'm also on the health and environment committee and that's one where there's incredibly significant overlap, because housing is healthcare is housing anyway. So I just want to offer that, and you know, unfortunately, both meetings happen on the same night generally. It won't happen this month. It would be great if it's one point in the future. We could not have both health and environment and housing and human services on the same night, but that's a dream that I don't know will ever come true. The other thing just to raise is just this summer. I've been working with. We act on the heat initiative, cooling, centers et cetera, and I just want to make sure that, when we're talking housing, we're also talking about we're, also getting information out to people and the real notices, because we were dressed in the housing committee, I mean in the aging committee, but getting air conditioners out to people who deserve them that kind of stuff, so that we have the flow of information to not only get people housing but to make sure their houses are livable, so just keeping an eye on those ancillary programs. Thank you, and so sorry, I'm just typing this all in together, because those are great ideas. I was actually thinking as well, definitely doing something with both health and also housing. At one point, I think, specifically during this time period, it makes a lot more sense to do so and perhaps even having folks from the healthcare centers talking to us about the concerns that they've also been raising. Previously. Last year I had shared what was a letter that was directed from, I want to say, a few hundred healthcare professionals to the state focusing on trying to ensure that we continued what was the eviction moratorium because of the concerns of having people become homeless? You know throughout the spandemic and perhaps being further exposed to what is the virus, so you know, and also any cases or health care facilities like isabella. Those are people's homes yeah, and it was that you know we had particular issues there with cobin as everyone's aware. Absolutely thank you. So if perhaps oh wait, I'm seeing ada, I just want to you mentioned we're talking about the overlap between health and housing and, obviously housing being a health issue. I just wanted to encourage people to read the CDC guidelines. It's amazing because this administration, it's hilarious, because the administration says there's no health crisis. Covid-19 doesn't exist. Yet when you read the CDC guidance regarding the federal eviction moratorium, it really outlines very nicely what a huge public health crisis this is and why the eviction we have to make sure that people stay in their homes. To avoid you know, getting infected ending in shelters, communal like combining in smaller apartments. So aria, you mentioned some of that language and I just want to encourage people to read it, because it's actually really good argument for that era. Can you forward both of those to us? Yes, I could definitely do that. Thank you. Okay, the other just one other report to take a look at just because it's people in our community, but our community board district is number four in terms of number of essential workers housed in our community. Scott stringer did a report. It has all the detail, it has it by community board district, but that also with the pandemic and everything else. That's you know many of the effects that we're seeing are magnified in our community because of the high percentage of essential workers. So I would look for scott stringer's report to an area. I can forward that to you, so you can send it to the committee. Yes, I think that was actually one of the reports I shared last year. If it's the same one, because I did- I do think that was one of the articles- we were looking over- sorry, the port. But yes, please do send me it just in case I might be speaking a different one. Okay, oh I'm, seeing I'm seeing hands being raised, let's see, okay, so hey though natalie hi. So first of all, I just wanted to say thank you and welcome again to the new board members. We've spoken on the phone but have not had yet the opportunity to chat in one space so inshallah soon we will all be meeting some place where we can chat with each other. I love coming to the committee meetings. You know I'm the board coordinator for the Manhattan borough president's office, but also a former member of this wonderful board. So a member of this community. I wanted to just point out a little detail on your housekeeping. The resolution of a right to counsel was passed by this board in April of 2016.. So if you want to do a new one on the expansion you're going to want to refer to that, so just to save you the time of searching for it, that's the one you have to request, and just as always, we are here to provide coordination and technical support to you guys on the board. I remind you that we have a housing policy analyst that has presented at this board before she is brilliant, and I do not just say that, because she and I share an alma mater, but she is a wonderful resource. So please do avail yourselves of that and I'm happy to connect you. What's your name natalie, I was just about to say it. Holly chu h-a-l-l-y is the first name. Shu hu is the last name. She is our deputy director for our policy unit, as well as our housing and environmental policy analysts. She runs our solid waste advisory board and she was just named one of the top 40 under 40 in food policy in the city. Another shout out there. Congratulations to well actually either way. I will say: congratulations, if not here yeah I will. I will let her hear the the playback, but please, as always, I know that some of you are new, or some of you are new to this committee. Even if you've been on the board so remember that our office is there as a as a resource. You guys are volunteers, you have full-time lives. So if there's something we can do some of the footwork on for you, please let us know. Thank you natalie. So I have here. Oh sorry, I'm so I'm gonna, I'm gonna. Let you go. I wanna try and close it off so that we can also get cynthia she's had her her hand raised, and I think she's asked a few questions, so that will be the last for the committee tonight before we switch on over to the next section. So this is quick. I just wanted sally ray's health and so did edda on the health committee. In a meeting that I was at, there was a review done about the status of pollution in the district because of the oils that are being burnt right, and we in this district seem to be kind of like behind the rest of the city. In regards to the reduction of that pollution, I'm interested to know how that may, if there is any commingling, that's happening in regards to Covid-19. I wonder if that pollution exacerbates what we may be experiencing, but also one of the things that I asked at the health committee was for the institutions to be looked at. We talk about the use of oil in regards to the private buildings in the district, but what about columbia university? What about new york presbyterian hospital? What about the armory? What are they burning? The building down the block from where I live, is very regularly burning, something where you see a large puff of black smoke coming out of the top of the building. They usually do it at night. Those of us that live in the area feel like they do it at night, so that you won't see it as much as you would in the daytime. So I think that those are things that need to be looked at, but also that impacts those people in their housing as well. So we need to update on what the status of the oil burning in the district for everyone in the district. Thank you so much, and I will, if actually chanel, can you I guess, promote, so that cynthia can also speak now. Hi. Can you hear me? Yes, okay, I'm very concerned about what's going to happen once these high-rise buildings get built and the landlords get 3 500 4 000 a month in rent and other landlords in the neighborhood figure out that they could be getting the same amount of money in rent and start paying people to move out of their rental units or harass them out, and I'm wondering if the committee has any plans for how to go about addressing those situations when they arise. It's not an if it's a when they arise, and the other comment that I want to make is that the community, washington, heights and inwood has been besieged by noise levels that have been unprecedented in the history of washington, heights and inwood, which have always had have always really struggled with noise levels in the summer, but this summer has been unprecedented and those parties are going to move indoors once the weather gets colder, and I'm wondering if the committee has any plans on how they're going to go about addressing that situation when it occurs. Thank you thanks cynthia. So I'll just note- and this is this- is I swear not me trying to pass the buck here, as people will say, I think that so just to point out the concern with noise- that's usually what's considered health and also environment committee. They have, I think I think they were the ones correct me from committee folk that had put together a town hall previously, and I think they have been trying to find ways to discuss it further. Perhaps you'd like to reach out to someone specifically, I would definitely say steve simon. He is the chair of the committee yeah. I was on that meeting. I was part of that meeting. Okay, so yeah so I mean they're specifically, you know, gonna be the ones that are pretty much reaching out to both the folks that are supposed to monitor it, which is kind of a dual relationship between both NYPD, as well as the department of environmental protection. You know, I definitely would say like raise that concern there, because perhaps they might be having that I'm sure, probably steve might be bringing it up too. He probably wants to invite deps to you, know potentially come to one of the meetings and discuss what they've been doing thus far. Yeah it's on our agenda for next week. The next time. Okay, I can't read minds, but I just I just thought that was gonna, be it great thanks, charlie all right. So with that said, I do want us to move on over to the fiscal year 2020 items for those who have not gone through this sort of process. Before I swear it's fun, it depends on how you look at things if you're very vocal you care about certain concerns, it's really looking at these items that are on that excel sheet that perhaps you should have seen before I sent it out in the email. It was only focusing in on individual committees, priority items and on the document you'll see that there are two sheets it gets broken up into what is capital as well as expenses, and I guess the best way I try to always you know, break it down for folks. Is that if you're talking about the capital you're talking about big long-term sorts of projects, and if you want to look at things such as expenses in a certain sense- and it always depends for every agency that I will say it depends on every agency- but depending on the item that you are prioritizing, let's say for an expense item- I really cared about. Let's just say getting, our seniors rides from, let's just say the nursing homes over to the individual. You know different senior centers that they might want to go to, or perhaps their houses of worship. If I want to want to really raise that item, that would go there for expenses and, of course this can differ depending on you know. What kind of things you might be thinking of at the time is really important to you. I know that we we've pretty much stuck to the same way in which we discuss this very item every year, where we pretty much leave it open right. So, for instance, I raise that item right now and I said I want this on our expense budget for this fiscal year 2020.. What typically might happen is that we can either say just to begin the meeting that we're going to put all items for everyone to look at and vote on, or perhaps in this committee right here we can choose to vote on each individual item so that it's on a sheet at the end of this meeting, and then we individually go back with that sheet. Whatever was voted on, or you know and passed by this committee right here- will take back with us and we'll individually rank those items until we get to a certain number previous years. You know this can really vary. I think, looking at that sheet, you'll see it wasn't it wasn't too many we put down in the previous year, but you'll see it has a breakdown for our committee specifically and actually, if you'll get give me a quick moment, I'll pull up the excel sheet and I'll try and see how I can maybe share the content on my end. So just give me one moment: actually, okay, so I'm going to try and set it up so that I can share my screen as well. Okay, can everyone see my screen right now? Oh, I actually think my camera went off. That's odd hello. Can everyone? Can anyone here yeah? We can hear you, we can hear you, okay yeah. It was very odd. I'm trying to figure out how I'm doing it on this all right. So, switching on over so this yeah. This looks like some of the items that we had brought before the entire board last year. For some reason, I don't know why I thought I thought we had some more items, but I can come yeah. I can. I can check back, but this is just to give you an example right. So what you'll see right off the bat? Is that scrolling through this entire sheet, there is a breakdown by individual committees right. What happens in each individual committee is that, like I was mentioning before, is that when these items are essentially suggested by their committee members, the individual committees, they go back and they pretty much vote to find out, which ones will come in a certain ranking, and I think this is kind of bringing back to my good old times of ranked choice. Voting discussions, but essentially yes, the entire committee will essentially vote in a kind of ranked choice, voting format where we try and establish what are our principles as a committee for both capital expenses and perhaps expense capital and expenses, and so you know just for instance, if you were to look at the folks right here on traffic and transportation right they put as their number one item was funding to make the following subway stations, ada compliant they're, talking about line stops around on the one train at 157, 168, so forth and so forth. That's hitting your screen is anyone else? No, I don't we don't. You can't see your screen. I thought we just! Oh I'm sorry, are you just seeing me or is it my screen, we're still getting the gallery huh and even if I put it on speaker view, I see you and not the gallery. That's so odd! Okay, I'm going to try this again. So sorry about that, is it working out? No, so are you? Are you clicking the thumbnail for the tab on your computer when you, after you hit your screen? We can't hear you now. You muted yourself, okay yeah, I don't so. Maybe perhaps aisha would you mind just actually pulling up on your screen and I'm so sorry I know my ipad. So don't worry! Thank you, okay, so this should make it a little bit easier than for everyone, so yeah. So I, if you were looking previously at the excel sheet and I'm on the capitals crystal year, 20 capital sheet specifically you'll, see that there's a few of those items there ranked one through five and then there's at the very bottom of that listing also cs. I always forget the exact abbreviation but essentially meaning that it is continuously essentially trying to be spent on where essentially they're working on that item previously, depending on what's happened with that individual item, let's say that you know the rehabilitation of the subway station at 181st right that took a while, we'll say: ariel yeah. Did you afford this before the meeting or is this? Am I looking for it from last year? So this is in the email that was sent on thursday august 27th at 10, 30 p.m. Okay, let me see directly from you. Yes, okay, it should yes, okay, so that's sorry I'll give I'll give a moment just to make sure we're all on the same page here, but it's also that email, yes, that was shared with the committee. That's not it yep perfect! Thank you. So much no worries so yeah. This is you know the sheet that I was mentioning before. You'll see that there are multiple items, and I was just mentioning how cs is essentially referring to items that are kind of in a continuous process, so it's possible, they could have. You know perhaps already started, and it's taking you know quite some time for it to perhaps you know be completed, and you know previously so, for instance, I'll also specifically mention this and I'll. Thank one of our former committee chairs for his work on this. They had been essentially focused on trying to ensure that two buildings that for different circumstances, had fallen to disrepair so much to the extent that families were essentially forced to move out of their homes. They had been focused on trying to ensure that they got the funding so as to rehabilitate those buildings and so and actually sorry aisha. Can you switch back to the fiscal year? 20 capital? Oh sorry, he's looking at my screen yeah. So that was one of the items that was created by that former chair that he had been advocating for quite a few years to have done, and it was for these two buildings, so you'll see 21, arden and 2110 amsterdam avenue it took a lot of time a lot of really partnership building between. I can't remember all the agencies at this point, but I want to say HPD and then that which was nimik that picked up. Essentially, what was the I guess, the contract to try and help renovate this building, and I think that if it's either 21 arden or 2110 amsterdam, now it's already gotten a good amount of the repairs done. I think our former committee chair would be upset at me for not knowing the full report of us to what's happened there, but they've had a lot of work done. I remember that when we had maria from nimik stopped by, she was speaking to the work that they were doing. They were looking to try and find ways of helping these individual families buy back their homes through a program that they were specifically kind of. I guess piloting for that individual building and a few others, and so I mean it just goes to show you that the work we do with these individual budget capital expense items. It goes a long way and you know perhaps it might take some time, but it just goes to show you that, with the advocacy that's done through this process and it happens once a year so make it. You know a very important event always put on your calendar. It takes a while for some of us, but just know it's something that we definitely look forward to every year. It goes through pretty nice pretty extensive process. One of the reasons why I'll just say right now, just to give you a kind of heads up that you see so many numbers at the very bottom. Underneath you know, item 45 is because what you will do once we as a committee vote on our individual items and we rank them. Is that from let's say that 45 number of items total from all the committees, you will then go through each individual one and rank them in the preference, or I guess the you know the priority level that you feel is appropriate. That matches each item. I will say that I think being in housing human services. I know I will have a very strong opinion that tends to lean a bit more towards housing and human services on some items. Sometimes- and perhaps you know, there's then items that will be right below, and so it's always difficult to try and figure out which one is of more importance right, especially when you have a total. Let's say that 45, so you know I always try to just make sure that I know that make sure you spend some time get it get a nice cup of coffee and sit down with this for a little bit. Thinking through. What's really your preference tonight, thankfully, we only have to deal with our committee, and so I want to just open that on up to everyone now seeing what was previously on both the fiscal year, 20 capital sheet, as well as the fiscal year, 20 expense sheet. If perhaps there's items that you would like to raise again, you know, of course we always you know for I'll, say on the fiscal year expense sheet. I think, there's items that we always want to keep advocating for, or I I'll say I should I want to advocate for- but you know, as the committee discusses this, it tends to kind of push up, maybe some new items every year, or so I know, for instance, if we talk about, let's just say the expense she me and naisha. We had been focused on one of the concerns that was brought up previously with the homeless shelters, particularly not necessarily serving individuals that weren't identifying with a specific gender right and because of the very nuanced way in which DHS might work. Sometimes it creates a barrier for some individuals seeking service, and so one of the items that we suggested last year as an expense was really putting forward more programming within what was the dwdc shelter that had been specifically set up for youth that perhaps might have left their homes recently, given the kind of environment they were in coming either whether it be coming out to their families as part of the lgbtq plus community, or perhaps you know not, you know not necessarily conforming to a certain identity, and I think that was an item that was just a huge concern at the time, for I think myself and aisha, given that there was a report that had come out of one of the committees I apologize. I can't remember it but right now, but that was one of the items that we brought up at that point so yeah, so I do want to leave it open. I don't want to continue to ramble on if there's, perhaps any questions. Of course you know, many of us have been through this process and you know I'm looking forward to hearing from everyone. Thank you. Aisha, would you would you mind, stopping the sharing sure? Are you going around now to the committee? Yes, I I'm done with my rambling and trying to quickly explain every everything going on with the sheets there. So I wanted to in regards to the two buildings 2110 and 21 arden. It was originally performed, put in front of the board by richard lewis. Many I think years before I even started when I became chair of housing and human services. Martin collins he's been a staunch advocate for the those tenants or the people who have the right to tenancy in those buildings. But it's another example of how work that is done by this board is not followed up on, because in fact those people were out of their apartments almost 10 years, with the right of return with nothing being done on those buildings, and it took all this time for anything to even start. And so, while I was chair, there was a tremendous amount of work done to push all of the electeds, as well as other entities like nimik in regards to making sure that they stay on top of that and give us status and reporting. For that. That being said, I think we should be also seeing what the board voted for what the committee proposed as well like what the final vote was for those items, as well as the the city's report when they returned it to us stating what was funded and what wasn't and how the city is going to handle funding of those matters or not. That way, the committee can have a more rounded idea of what things need to be picked up again, as well as what possible new things, but as well as how the city is handling the things that we're proposing. So I think that you know that's definitely something that we can. We can look at it's a pretty giant ginormous book that comes back with responses every year. You know if perhaps folks want to try and quickly look at some of the items. You know definitely say you know, definitely feel free to, but it's standard practice on the committee to do it that way and we just pull out what what's usually the chair, prepares in advance. The original committee proposals as far as ranking, as well as what the board responded and how it ranked and then also compares it to what the city has responded, so that we know the status at this point so that we can either ask for continued funding. Ask for it again if it was denied or propose something different, depending on the reason, depending on the reason for the denial. So the thing is it's online, I'm sorry right, and so the thing is it's online. If folks want to pull through it, we can, but I also want to just keep it open right, because we we've discussed that you know we want to make sure that people can bring in new items too so yeah that doesn't that doesn't prevent people from bringing new items. What I'm? What I'm? What I'm saying is that helps the committee to unders so because, like we have a list of things, we have no idea what the city responded to them specifically right, so we don't know like let's say the 21, 10 and 21 aren't buildings. What if it's underfunded? Still it could be, it could still have a shortfall or something could have been denied for some type of reason. We may need to follow up with this specific agency that the city said well, we're not going to pay for it, but this agency is going to handle it. Then we need to know what is that agency's response? Does that agency need funding in order to carry it forward or what? Whatever, that the standard practice is to look at all three of those items together, so that then we can move forward with new proposals or old ones depending on the need? Okay. So if you want to pull that on up, I mean I'm happy to spend some time. I think that you know I was trying to get some general ideas, but I also just want to be: you know a bit respectful because it is already 9 p.m, and this doesn't need to be. You know a single one night. We're done right. That's the reason why I made sure to keep it as quickly as possible, setting up these goals, but I want to leave it open sally. I see you raise your hand there yeah just really quickly in terms of I hope, I'm not muted, okay, just very quickly a lot of times the city will say, the response will be. We needed more information and I've always been curious. What happens to that? Does it go into the same black hole at the cb12 offices that other things seem to be falling into, or do we actually get back to those agencies? And then the second thing is the you know, there's certain things that they will never fund and yet people you know like a lot of the parks things says: parks doesn't have its own budget. There are certain things that are always off limits to the usefulness of what, especially not as much in this committee, maybe as in other committees, is, if they keep saying. No. Is it because they will never fund it, because it's not within their scope of what they ever fund. Or is it that we need to ask more carefully and more precisely a lot of times in the past? I will actually look at the same things being requested by other community boards, because all this information is actually online and the history of it is and see someone who might ask for it more effectively and get a positive response when what we were going for was the same thing, but we just weren't as clear in stating our needs. So it's useful too for anyone who has time to spend looking at what has been proposed again, not in tonight's meeting but at your leisure, if there's ever such thing as leisure. Looking at what similar things have been proposed by other community boards, so which is all available by the budget office in the past and what they've been successful or we might not have- and that's if I could jump real quick, I think that's a great idea in regards to the other board sally, but in regards to the office. In fact, in 2019, the office received the response from the city and forgot to inform the chairs the timeline to return so that we can respond back to the city and say whatever we needed to say based on their response, and we missed that opportunity to weigh in on the on the budget rankings that came back from the city. So, yes, there's a black hole as usual, so I'm just quickly trying to pull it on up for our district online see I mean it should also be on the cb12 website, so I will check in with the office as well and apologize. Everyone just want to make sure that we can also look at this their own user later, okay, so, unfortunately, right now, I'm only seeing up to 2018. So that won't be too helpful at the moment, but if you just even pull up the 2018 assessment, that's on our website, if you click under the about cb12 tab and it's under district needs statement, you'll see pretty much the responses that come back from the city at the very end. Once it's been essentially, you know reviewed with the borough, presidents, the agencies and the mayor's responses, and so forth. That's where you get that pretty large file. You can also download it in pdf, it's a 191 pages for the 2018 fiscal year, statement of district needs and yeah. So you can review that. I will go back to the office and you know just raise that. We want to try and see the past fiscal year 2020 statement that was already released just so you have a little bit more of an understanding of what the responses were from the agencies. You can also do some of that on city planning, commission website, I know natalie was able to you- can get the most current, for example, for our statement of district needs and priorities for the last three years and actually going back as far as you want so there's ways to find it. It's just. I don't think that the office has posted our most current either the statement district needs or the priorities on our website, which is another continuing issue right, so I'll just go again. I will go back to the office and request that, but you know I just want to raise tonight as just the opportunity to raise some of those items again. This does not need to be done immediately. I always present this as just the time, even with perhaps even the rank guidelines board, meaning I like to try and be a little bit more prepared, not waiting to the last minute with that. So you know review, as I mentioned in the email that document it was shared with you. These are some of the items. If perhaps you want to bring them back up, I can just note it tonight that you know you feel passionate about. Let's say getting that first item the renovation, even though that's technically cs now right or the perhaps funding of long overdue capital repairs for NYCHA buildings. If those are items that you would say, you know you want to be able to vote on as a committee member I'll note it down now, but if perhaps you would want to then wait and review the district needs statement. You're always welcome to I'm hearing the dead silence, so from committee members I'm going to take the sorry marielle. Are you raising your hand? Yes and again, not sure if this is the appropriate way to raise this as a new community board member? I just feel like. I don't have enough information on some of these, and so I mean I know you did explain that you know there's still going to be some time to you know kind of make, take decisions on this as a as a committee, so just wanted to raise that and for those of you who have been doing this for some time if there are any kind of resources or places that I should be looking. That would be really helpful to have that information so that I can make a more informed decision. Thank you. I'm feeling a bit lost right now, that's all yeah and I'll just say you know flat out it's. I think, for I mean my first year doing this. I was confused about it too. You know, perhaps I think, looking over previous items that have been raised, whether it be through that sheet or even the specific district needs a statement. That's on the website. Again, I will be asking the office for the more updated fiscal year 2020 statement. Maybe that will be a little bit more helpful. I would definitely say thinking of those kind of items it can help, but I also just want to point out that you know it, though those items don't necessarily need to be what will happen or what will be proposed in this year's. You know priority items for both capital and expense right. So, for instance, let's just say I want to put forward a brand new item. All I would do is just say that you know in consideration of I really care about making sure the seniors are getting these services to transport them and ensure that they are able to. You know, go to various different facilities or services that they're essential to them. I you know, I think that we should put forward xyz item right, and so that then goes on this similar listing. It wouldn't be exactly like what you're seeing right now with all of these individual committee's items, it's just for us, so it would just pretty much be me at this point saying new sheet on this excel. You know file and then listing out each of the individual items. Ultimately, what happens with you know, you're, seeing those individual priority items on this sheet here, like let's say for the first item, 40 you're, seeing three one, two: zero one that none of us none of us are going to be touching- that that's essentially something that happens within the board's administration. They essentially tabulate those- I forget the exact system. They explained it last time but yeah. We as committee members right here. We don't touch that all right, so you know, I hope that, doesn't you know, keep you away from promoting whatever items that you feel you're passionate about. I just only want to present that sheet, just so that you know you know what has previously been raised as priorities for the committee and again I bring it up, because I know that it is not a necessarily the fastest process ever when we're when we're kind of going back and forth about what we think is more important. It takes time takes time to say the very least. Ariel, I just wanted to jump in the I mean the statement of district needs is, can definitely be a resource, but the document in relation to the budget is actually the fiscal year. 2020 preliminary budget register it was sent out. I can forward it to you so that you can forward it to the rest of the committee, because I don't know what the full committee list is right now, but ebenezer sent it to us february eleven two, oh no! This may not be the right one. This is february 11 2019, but what we're looking for is the fiscal year preliminary budget register so that we can see the responses of the city yeah and that's, but that should contain the same. The same items right because statement of district needs yeah it should it should still have those items on there. No, those are two different documents: yeah, no yeah. I know it's a different document, but on that document there it's just state. What's essentially like the response that comes from the individual agency, so, for instance, where is it there's a lot here so I'll just provide more hiv aids information services right, that's priority, 17 and you'll see that it states the need request. What agency it you know, pretty much corresponds with what category falls into either capital or expense. Okay. That sounds like you're. Looking at the budget register, the statement of district needs is like pros. It's like it's a statement that ebenezer puts together annually about the overall board needs and the overall district needs, but it's not broken up like this yeah but yeah. So it has those items that that's what I'm just trying to get at that oh yeah, because the wording that you use was the confusion. I'm sorry because there's actually a statement of district needs, there's that's the name of a document from the board. So when you said that I thought that you were referencing that document and not the budget register. Well, that was my confusion: okay, yeah, no, so yeah. But of course, yes, you can always review the budget register, there's quite frankly a lot that goes into this process, but yeah that that's yeah. Thank you for raising that as well. So I'm seeing yeah sorry bruce apologize that I'm looking for it for the raise hand button not the the physical raising hand yeah. I know I don't have the button separate subject back in June. Remember that meeting we had and aisha did her wonderful presentation of inclusive language in the human services field and beyond, and we talked about making a presentation to the general meeting in September. Is that still alive? So I would have to go back to naisha. I mean that that's her, you know individual. She was gonna, get back to us you're right. She was gonna, run it by brewer's office and whoever else to see if they had any input and then wrap it up and come back to us. With that. I don't know. If anything's happened, you might know more yeah. No, I can. I can reach back on out to her see how far along she is, because I think that she also wants to coordinate with richard. I can also just stay here separately after the meeting richard had heard about the presentation. He also wanted to connect with her, so I know they have been working together on it, but yeah. I personally haven't followed up with her, so I can check in see where she richard who richard goldman allman. Okay, thank you because he's at least I thought he's still chair for the lgbtq task force, got it yeah, but yeah, so yeah. So I'll follow up and I'll get back to you about that. Yeah! Okay, I'm sorry guys it's 9 16 and I have another commitment, so I'm going to have to punch out okay, thank you so much ocon pretty much! Then the concern people want to see the official register again I'll, get back to the administration for the office. Ask them if they can compile those both the district needs statement, as well as the register get back out to everybody, and we will then revisit the individual items and yeah. Let's with that move on to new business, and yes janet, how are you doing there? I've been waiting very patiently all right, ready, yes and just to know. Yes, I see I see sally, I see bruce once I'm gonna, I'm gonna, let janet start and we'll get back. Okay, all right! Okay, I'm really hoping that this committee and the board can help the people in our building who are really suffering and experiencing a lot of problems because of community options. What I ultimately hope for is that the board would be willing to reconsider the previous resolution that it made six years ago, approving community options to have the two units in our building, because now we have six years of documented experience showing that this has not been a good situation for any of the parties involved, that something really has to be done to change it, and I'm hoping that if we had an opportunity to present to you why it has become such a burden, whether that be in a small meeting next month through this committee, whatever you would recommend that, after we presented that information, that you then would be willing to have an open hearing or something where we could ask for a different resolution to be passed six years after the first one, sorry I'll, let sally go first members. I can't hear you, I think, you're on mute, sally, okay, two things one is, I understand the limitation in terms of not providing wrap, wrap-around services, but I guess, if I were looking to address that and also given the issues I raised at the beginning of the meeting, it's that, where their provision of services to whether, where congregate living facilities are set up or group homes are set up or where we have shelters, where we have hotels, there's alternative, shelters that wrap around services be provided. So what do you mean by that wrap around? In other words, if you have a population that is in need of mental health services right, the services be provided not that, basically, as the shelter system sometimes does, they need to provide more than a bed whether the bed is in a congregate living facility, whether the vet is in the shelter whether the bed is in a hotel that the wrap around services are needed to address the specific needs of right various populations. And then my number two item is, at our last community board meeting, we passed a resolution addressing the need for the establishment of the inward task force, which included membership from each of the various board committees. So I just wanted to drop that into your new business is something this committee needs to decide. I guess as to how they will proceed and designate exactly and that's it. Those are my new business items. Okay. Well, does anyone have any response to where you know we might be able to go within this community board with our problem and we might get a resolution on the issue. Hi janet hi. Out of curiosity, have you reached out to the office of opwdd? I was probably on the committee when we voted for that. So I hear the concerns the opwdd office has purview over that and generally, when we are reviewing that in the community I mean in the community board. It's really a matter of us making sure that they're adhering to what the rules are in that regard and voting yes or no, whether we support it, but really the broader work falls on opwdd for compliance we have been. We have been actively engaged with opwdd. We have an attorney who's, also representing us with them. But what I wanted to point out to you is that, with a little bit of research, I found out that six years ago, in 2014 community board 11, which I believe is just south of ours, was also had a building. I think it's 555 lenox avenue, which, by coincidence, our property manager also manages that is totally coincidence, but we found out that in that building the community options had proposed purchasing two units and having two group homes in those units. There was an organized effort by the people in that building to fight that and the outcome with opwdd as the partner the outcome before community board 11 was a settlement where only one unit was purchased and operated, and that unit has only two developmentally disabled adults living in it, and there are like zero problems in that building. You know they are not calling the police every other minute. They are not overflowing their sink and causing floods in the tenant below they're. Not you know, pulling knives on door, men they're not trying to punch doormen they're, not breaking property. They're, not you know, destroying front doors, they cost ten thousand dollars to fix, so it can work, and that was the spirit in which our building six years ago welcomed. You know two units, and now we have two units. One is particularly outrageous, but we're sort of at a good point with regard to that one unit, because two of the three people are being replaced at community requests because they can't be handled because the wraparound services that sally's talking about there are three shifts of supervisors that come to each unit. Every day there are visiting nurses, there are inspectors. I don't know everybody that comes, but there are many people that come and yet, despite this, the people are not in the right environment there's no place for them to go. They can't loiter in the lobby, there's no courtyard for them to sit in, there's no place where they can play their music loud. The people who live in the apartment next door here screaming and yelling all you know morning, noon and night. So it's just not the right building or environment for them to be living in at least these particular people with their particular problems. And it's not just it's, not the people, it's really more, the environment, plus the total lack of supervision, and I will say that community options has been placed on early alert they own and operate 11 group homes throughout the five boroughs of new york city, but opwd early alert is like probation and basically means they're not doing a good job, but opwdd is not transparent at all. They will receive our letters. They will receive our phone calls. You know from our lawyer, but they will not tell us they don't have any written or published procedure of how or when they might resolve any of this, and so we just are left alone and not making any progress. It's costing our building a fortune in terms of lawyer fees and it's like tape totally taking away the whole building's energy to actually forge a community, and I it's very unfortunate for the people who need the help because they're not getting what they need, but no one is getting what they need. It seems the workers are not able to handle the residents. As I said they, their go-to solution is calling the police and then, of course I mean I'm very sympathetic to everything everybody is saying, because then the police take them to the emergency room, the psychiatric ward, the psychiatric board, treats them overnight and then releases them back to the building. You know so we had. We might have our doorman quitting because he's terrified, since he was, he was almost knifed by one of the residents who was finally, after months and months and months and a video camera capturing. This incident with the knife. Finally, he was removed. You know what happens to him. That's you know like. Where is he gonna? Go? I don't know, but you know- and I think that's a big problem, but right now, the bigger problem for us is that there are about a hundred people in our building, many of whom are first-time home buyers. We have a guy from who grew up in the neighborhood and he is a super in some buildings on the west side he bought a unit and he's like really proud of the fact that he could buy a unit there's another person, who's a renter, also a superintendent somewhere and he's hoping that he can become an owner in the building. So these are people who've like put their heart and soul, and you know substantial savings are only savings into this building and they can't sleep at night. They can't be assured that they're going to be safe. You know dentist, who is a first generation immigrant? You know he's constantly having to run out into the hall and tell them not just to stop shouting because they're disturbing his patients. So it's just not a workable environment and we would really like the community board to back us up and give us the hearing. Let us present the facts and then you know, take a new look at your old resolution or make a new resolution that says: there's really saturation in the neighborhood or saturation in the building and two units with three people. Each is not. You know acceptable in this particular location. That's the outcome we want, but before we get the outcome, we have to have a way to present our situation, a place and a way to say what we need to say. Oh, if I might, I think what the committee should be doing is looking at any status from opwdd, and maybe this is an opportunity to address some of the issues that you're posing in regards to how opd is communicating with the buildings in which some of these organizations are placed and providing services, but yeah, so that so that we can have in black and white what the dynamics are that are manifesting, but also how opt opwdd has responded or not, and also for us to we. I think we need to have an understanding of how we can respond to this. Being that the way that I was informed and trained was that we have a limited purview in regards to how we can weigh in regards to okay. I understand you do, but I understand that you could have some sort of persuasive value if you were able to have a resolution yeah. I agree. What I'm saying is that we may be limited in the types of resolution we can put forward as we are in normal, like when an opwdd is brought to us, we're given a strict window of what we can speak to and what we can't so that that's what I'm saying like what is the room that we have to put a new resolution in regards to this matter is my is a question that I have. Okay, bruce I'm seeing your hand raised. Yeah is community options, the legal owner of owner of the condo. They have the deed to the trump. Yes, they are so have you have you enforced the house rules because you're gonna have, and they currently have over thirty thousand dollars in fines that are outstanding. You can evict. You can evict somebody from the building. It has been done. It's not easy, but you can evict an owner right. Yeah is that is that true in a condo or just a co-op, you know I don't know, I'm not a lawyer so, but your attorney has probably told you I know a co-op shareholder has been evicted for smoking in to build a non-smoking building over the years. It ain't, easy, nothing's, easy but well. This auburn cynthia mentioned that in the comment section right away after I spoke earlier, but I looked it up on my phone and I do. I will ask our lawyer again, but we've been with our lawyer, she's been helping us for months now and that has not been discussed, and so I think the reason is because it's something a co-op can do and not a condo. That's what I think, because we've talked about other ways of proceeding. You know through the courts etc. I may have missed you saying this: where is this located? It's in edgecombe park is the name of the buildings at 456, west 167th street. Okay, because, like aisha is saying we don't have any legal authority. We can just do public opinion, but you seem to be beyond that at this point. Well, no. What do you mean? Why would why would you think we're beyond it? Well is the community going to get involved? Our job is to represent the communities right. Well, I think I think one thing we're looking for from the community, and that really is of the community's concern- is that it's putting a tremendous drain and strain on fire, ambulance and police. They are constantly in our the workers of community options. Don't know what to do with the residents, they can't control them. They can't you know de-escalate situations and they call the police who are right around the corner and it's not just like one policeman shows up or two, but for whatever reasons they send like six, seven eight, they also send the fire department and then the street becomes like a military zone, and this has happened over and over and over again. So I don't think I mean the police. Are they come to the building? They say. We can't believe that these people are here. You know this organization, I shouldn't say these people, it's really the organization that made a miscalculation on where to locate their group home. You know people deserve housing, they deserve a place to live. This is not the right place, I mean. If they want to shout and scream and yell, they should have the ability to do that. I mean if they can't control they're, shouting screaming and yelling. They should have a place where they can do that. A freestanding house or something the place is not in our apartment building. So I I'm hearing the concerns that are being raised. You know what I think is. I think what I think is the overarching concern here is more of a kind of dispute that might be arising between owners sharing property and, whereas, for you know in the purview of the work that we do here, it's supposed to be kind of policy based. It's not necessarily something that we might be able to take up, and I and I you know I do see why. Of course, you want to bring this up, because perhaps maybe there is concerns of how, let's just say, service providers are treating their clients right. If this is perhaps what we're seeing common for many service providers throughout the city, that's something that maybe we might be able to try and raise as a resolution wait say it again. I'm sorry I got interrupted just say what you, if it's a concern of what yeah so in that this is. This is a kind of a dispute. It sounds like between individual owners or property. This seems like, in a very particular case, that kind of you know it falls out of the lines of what we do as a community board right, because- and I also try to raise this too- you know I and just for reference. You know. I said this the same thing to our one of our other fellow members. That's also very active in the community who came by and talked about issues in our building right when there's individual cases like that, we don't like we we're not supposed to weigh in on those kind of issues right, but we weigh on an individual case. It's not to what there's the public policy regarding people with mental health problems. People the community options gets the organization as a whole gets 258 million dollars of government funding throughout the country wisely. I've heard this said in recent years by multiple people. I honestly feel like it started coming up because of the work that I was doing in regards to the armory. The idea that we only do policy is, I don't know where that comes from, but we do things that are beyond policy. An example of that is when we vote on the eulip process in this regard for opwdd, we community boards are a part of that process of when a unit is going to be proposed or a building that is in relation to the rights of people with disabilities to have housing. We have a vote in that right believe. That is why miss wolkoff is here entertaining this, because we put forward a resolution in that regard. My only question is that in that, in those instances we have a restriction on, we can't just be like. Well, we don't want these types of people there. That's a perfume issue. Our purview is okay. This is the institution. That's coming! Here's what their background is. Here's their track record, here's what they're proposing? Is it the dimensions that adhere to the law right like so it's just kind of like oversight, making sure that what that institution is proposing is in compliance with opwdd regulations right and have they followed through and have they have they done their due diligence of checking the boxes for what those needs are and then based on that we vote yes or no right. So I believe that that's why she's here and I make sense- I just don't know on the back end once it's already in place. What that might look like right. Well, one thing I can tell you is that there's a concept called saturation. I have to do more research to really understand exactly what that means, but that is one of the benchmarks that a community board is asked to measure when they are evaluating a group home in the community and so there's some in the archives on the webpage. I found some transcripts from 2014 before this committee, but there was also some other information. That's in the office because of the pandemic, we haven't been able to go to the office and try to see if we can get the backup information, but I really don't know the community options ever really submitted either the information at all or that they correctly submitted it, and it would seem to me that if circumstances have changed since six years ago and that they've shown that these change circumstances are permanent, that there would be a basis for the community for to get involved. I I'd be happy to provide you the answer to the question issue that you're asking you know what is the? What is the? What are the parameters now? Can you do this? I mean there really may not be precedent because there's probably not too many instances where this has ever happened, but but it has happened, and you know, as I said, community board 11 in the beginning there were there were owners, I guess who were savvy enough to to fight having two units in their building and they had a peaceful, amicable settlement having only one unit with the two. So you know if I could find if I could find a way to where some one of us, someone on the community board, could find a way for us to present our situation and have the board vote on it in some way. Like with the resolution, you know that would be really helpful. I mean this would be with notice to community options. They would have the right to come and say whatever they want to say, but you know we really. We really need your help. Does anyone else have to anything to add as well to this discussion? It's a tough call. No, I think what needs to happen is that we need those pieces of information and then to find out what is our ability to weigh in on it? Well, we have, we have quite a bit in writing, that's been documented, you know in terms of what has the damage been to the people and the property in our building? We have dates. We have numbers, we have names all that, so we can submit something in writing. Maybe that would be the place to start and then, if you want to follow up, we can follow up with a well zoom meeting until we can meet in person. That's possible, miss walkoff! Thank you. So much for taking the time to you know to share these these. The situation that you're experiencing personally I'm a little confused as to why we're here, as opposed to this not being a matter. That's just litigated in court, especially as you're talking about damages and like a breach of the expectations and the condo rules. It just feels like that would be a better platform for this, as opposed to a community board, and you have an attorney already too. So, I'm just unclear as to why we're here having this discussion which to me honestly, sounds like a pr, a matter, a dispute. There's a dispute, there's a potential litigation. I assume that's why you have an attorney and you're talking about damages that all gets settled in court. Well, but there's the public. Is we don't just want money damages in fact, that's not the thing we want. Primarily, we primarily don't want to have community options operating a group home in our building, because it's untenable, no matter how much money they could pay us, because we would just be they'd just be racking up violations from here until kingdom come so money damages are not really the issue our lawyer has, I mean we'll, take them because we've incurred them, but our real goal is to try to find a place where people who need housing can get it, but not in the wrong building or type of building apartment building. It's a small. The rooms are small, it's not like a big old. You know old building with big rooms. Everything is pretty cramped. The reason we haven't we do have an attorney. You know just like you're sort of saying. Well, it's a little bit of a hot potato issue, because people hear developmentally disabled people and no one wants to do anything to harm them and we don't either, and so judges often don't like this issue either and they say well, you know okay I'll say they have to pay the violation, but they pay it. And then you come back to court a month later they have a new violation, so it just doesn't really get resolved and we're looking for the community board to at least give us some additional leverage. So if we did have to go to court that we would say you know, we presented this to the community board and we told them what a drain it is on the police and the emergency services. This is a new building that, I think, is a good thing for washington heights, there's a second building right next to it. That was built a few years later and, as I said, people are experiencing first-time home ownership, and you know it's bringing life to the neighborhood, but but this is dragging it all down. I mean you put down flowers on the outside someone from a resident from community options, pulled them out and destroyed them, so it's just become. I think it I mean it: it's not just a private dispute, it's something that affects 100 people living in the building to commercial owners, a dentist which is a good thing for the neighborhood and the spa, which is also a good thing for the neighborhood, and people cannot go about their business because they're being hampered by a very small group of people who are being supervised by people who can't supervise them. So you know it does have a public. I mean the idea of community living for people who are handicapped in some way is a fabulous idea, but it's not working for this organization. Community options they cannot handle what they've tried to do and they've proven that over six years. So I think the community should have a state- and you know one of the things in the resolution that you guys did pass six years ago. It was said that well we'd, like you to consider washington heights residents like people who have a connection to washington heights. Maybe they grew up here. You know their parents still live here. Their friends are family and that would be great to locate them in your building. Well, I have never seen a family member do anything on behalf of any of the residents in our building. So I don't think there is any connection, and you know at the time community options said: oh great, yeah we'll do it no problem, but they do not take people who have some connection to washington heights. So maybe you could say that they haven't enforced. They haven't. You know proceeded according to your original resolution. Bruce, yes, are any other community options, buildings throughout the city, wherever they are having similar problems that you know of well, this is where op I don't know of them, because opwdd is totally untransparent. I mean, if I filed for some freedom in information act requests. I might get some more information but, as I said there, we found out through the opw website that community options is one of like a handful of organizations that is on what they call early alert. That's opw's way of saying you're on probation, and if you don't ship up, you know shape up we're going to ship. You out we're going to revoke your certificate to run these group homes, but they don't only revoke it for like 11 group homes, they might do a piece of meal, they might say, okay, you know you're doing a bad job in this location, but we'll let you keep your certificate in that location, but I did ask someone in their office with an executive function there and I said why do people generally get on early alert and he basically said well they're not doing their job. You know they're running into financial difficulties, and so they don't staff the people correctly. I mean it's basically they're performing subpar. That's why they get on early alert, but then it seems like they get a year or more to try to rectify and we you know, there's no published regulations. There's no published rules customary. We can't find out anything, it's like we're just being stonewalled or something. So that's why we're coming to you and you know we want the situation to be handled, not only diplomatically, but we want it to be handled. Well, you know sensitively. It is a sensitive topic, we're not eager to make it a huge public deal or anything, but but I do think it's a question for the community. You don't just want people who are in need of housing to be housed, no matter what you know. If they need supervision, if they need a hospital, I saw that there was a psychiatric hospital closed further uptown. You know these people, maybe should be in a hospital. Maybe they shouldn't be in any apartment building. I really don't know I'm not a doctor, but I just know they shouldn't be in an apartment building in our. So it's a standard practice and honestly what you're saying is considered like NIMBY, which is not in my backyard right, but we've had it in our backyard for six years and it's you know, I understand and I'm sensitive I'm sensitive to your experience. I just want you to want to let you know what we're looking at. I know it and that's why that's why it's an un it's a little bit of a hot potato, and you know we've tried to not only live with it, but improve the situation. We've reached out to the executive director, you know, we've used the carrot and the stick, and if they've just been inept, they have not been able to perform so I've sell their unit, they can sell their unit and they can buy something in a better in a situation, that's better for their residents. So I did some googling, and actually it brought me to something on the page of community options where community board 10 was objecting to a plan, they had to purchase two apartments on 138th street community board. 10 lost that fight. I also found from our own board- and actually I remember this was the first opwdd that I participated in and in that resolution, something that we stated, which kind of gives a little bit of a opening to what might be possible. It basically says community board. 12 Manhattan calls upon services for the underserved to address the status of all the current and future violations in the apartment and in the building and have them corrected to code and will remind this organization that their performance and commitments will be noted in any future applications to place their clients in our community district. So without reading the entire resolution, which is two pages long, it seems to me that there were concerns about what this organization was doing in relation to their current standing and that we were, we were putting them on notice, so that lends to that there may be an opportunity for us to do something. I just don't know exactly what that is and that's the work that needs to be done. Okay, so you. What would you like me to do a little more research or I think it needs to happen on both sides? I think part of it is definitely getting from you. What anything that opd wdd has given to you as well. As you know, the history of the things that have taken place. We definitely heard your testimony tonight, but on our side it would take us reaching out to opwdd, maybe our electeds, to have an understanding of what our responsibility and capability are. That sounds very fair. So when I address things in writing to whom should I send it should I say I mean where I can send it on email, but who should I address things to I'll, so you can send it to me. It's my first name: ariel a-r-I-e-l, right miranda, m-I-r-a-n-d-a one zero one gmail.com at gmail, yes and I'll, share it as well with the committee and I'll also have our district manager also cc once I send it on over to the committee. So I just want to go back to what I was saying before when we have these kind of bigger cases right where we're talking about it's, not just an individual household, when we have an organization that also not to mention, may very well likely take up contracts right through the city that oversight capacity is there, and so I think that it's helpful to try and get that kind of information, as I usually was just mentioning for a resolution when, if perhaps we're seeing that across you know like with sus, there was multiple cases where these individuals that were supposed to be getting services for xyz. So the reason we can pinpoint that and talk to that in a resolution. I think you know, for the purposes I think kind of going back to what ada was also mentioning as well. Getting something directly focused on your building. It might not necessarily serve in a resolution, those kind of items that are damaged or you know wherever else might be happening in that building. That seems like, then, that's what I was trying to get at that a it's more of an internal dispute. So you know, I do think that it can be helpful for the organization to try and you know, definitely improve upon its services, and I think that's where we come in with really bringing forward a resolution that talks about those issues right. If perhaps these individual staff members are not, you know trained in a certain way to really assist the clients. Perhaps the staff is not necessarily doing their jobs when they arrive. You know to the desk, or perhaps the individual facility, then that's somewhere, where we can really advocate on for changes. Okay. Well, that is what they have told us in writing. That they're gonna make those changes, but they haven't been able to do it. So that may be why they're on early alert, because they cannot provide the correct supervision and also evaluation in the first place, you know which kind of patients do they take. I mean people who are developmentally disabled have a wide range of problems. Not all of them are amenable to living in a group home or an apartment, and that's part of the expertise of the organization to be able to identify who can live. Where okay, well, we will follow up. I really appreciate your time. Thank you all very much. Thank you all and I believe we're supposed to be joined by ophelia. I'm not sure if I saw her or perhaps peter green, so I'm going to on my end just follow up bruce, perhaps if you want to just maybe check in with them as well. You want me to text peter well, I mean I don't I mean you. Can you can message him now, but I don't think we're going to have him join us and you know quite frankly, if anything we can probably have him come to the next meeting and he'll join us, then, is that that okay, yeah sure I mean peter's, talking about the issue that maria brought up? So if I don't mention it, marie will kill me and it has to do with this tower next door to maria, and I sent you an email about it. An update the land use committee is it's more germane to their domain, so they're working on it and they natalie espino and tim anderson and gail brewer's office are working on it with d.o.b and so forth. So it's not urgent, but you know it's something that has attracted a lot of attention and upset in our little corner of the world. Okay, so yeah I'll, follow up then with ophelia and see if perhaps they can participate next meeting but yeah. Thank you so much for bringing to my attention. I think that is everything unless anyone wants to bring up old business. Yes, I forgot on my list. One of the things that I was also attempting to address was the issue of certificates of no harassment once or two specific buildings came to our attention where the landlord was proposing major construction under through that program, and by looking into that, I found that there are many buildings that are on that list where everything, including eliminating some apartments because of the change that's being implemented, can happen. So I was attempting to find out how the program is being run. What the status of the actions that have taken place are. I believe that the community board was supposed to be informed about it. We were not, and just the opportunity for a landlord to be able to remove apartments from a building is something of concern, especially with you know. We need as much affordable housing as we can have, but the emails that I sent out on the mark levine's office was supposed to follow up with it. I know that you also sent an email as well ariel to ebenezer, I'm not sure whether you ever got a response. In regards to that. The last that I spoke to the tenants in that building, they had not received anything, but the pandemic did happen, so maybe things are at a standstill, but that's something that we also need to pick back up. Okay, all right I'll. Add that as well to the priorities listing then for the committee thought the year is that everyone am? I think I've responded to folks here the floor. Sorry, I said, may I have the floor? Yes, sorry, I didn't even see your button I'll try to I'll try to give you the two minute drill chairman russ has now proposed a new proposal for NYCHA, where they're going to be trying in the process of trying to create a public benefit. Trust, and forgive me about the numbers. But a substantial portion of the housing portfolio is supposed to be wrapped into this public trust. It's supposed to be moving the I guess trying to enhance the the funding stream from, I guess into section eight, and I guess the main concern- and we can pick this up later because we're getting late. But a lot of this is being done without tenant input, and I guess one goal I would have for this is maybe a resolution that because, as I understand it, to create this public benefit trust, it would have to be legislation in albany, and I guess it would have to be some. Maybe some trust instrument created. But the idea is that that the 965 964 hud regulations be incorporated into that legislation and into the trust instrument, so that the protections that my residents have will be maintained and I'll leave it like that, because I have a meeting on September 9th where housing is supposed to be having some sort of town hall to discuss it. Further. I've been in other meetings about this and maybe at the later point I'll have better information be able to give you a more coherent statement of what's happening. Okay, thank you actually for raising that. I will just mention actually steve simon did reach out, because I think a few members are becoming a bit more aware of what's happening with the bad program. I think that's also been a concern for some individuals who have not been as familiar or even been informed as much about it, but that's also one of the areas in which people have been talking about they're trying to raise funds as well, while also not necessarily, you know, outlining what are the reasons for public or public entities entering into agreements with private organizations. So it's a better as they're saying, maintain the buildings but yeah. I do want to want to speak a little bit more about the funding streams, particularly those that are being created so to maintain these buildings throughout NYCHA and I'm sorry bruce are you? Are you raising you, yeah marshall? I'm just trying to understand this. What's the bottom line here, it's like arielle's, saying the city wants to put it off on private corporations to maintain NYCHA and you guys are gonna, have to suffer through higher rents. Or what's the downside here, oh okay, just to expand. I apologize if I'm not clear on the acronym, but there's the rad program and units are being lack of a better word sold to developers and they'll. Do the improvements or whatever, but that's only a certain portion of the portfolio report. Part of the portfolio is not being that's not being picked up. Chairman russ wants to create a public benefit trust for those units to enhance the funding stream. I mean, there's, I think it's a misnomer, but under some sort of hardship, there's what they call a tenant protection voucher. Maybe it should be termed a unit protection voucher, because these protection vouchers are supposed to go with to the unit to enhance the renovation rehabilitation of those units. I mean, if that I mean there's two portions in a sense, there's a portion where there's units being sold off, but then there's also this public benefit trust for other units. I don't quite have the numbers on how many units we're talking about in each section, but I hope it gives more contours to your question yeah. I need to. I need to study this a little more because it sounds like they're putting investment pools together for outside developers to buy into and then give you guys. Well, that's part of it. That's part of it. The part that that's why I'm saying this public public benefit trust. As I understand it requires special legislation in albany, and that was something else that maybe I would want some help with if we could get some tracking on any bills that might be in play with that. Are you guys working with senator jackson or al taylor on this well al taylor? I al taylor was at a meeting a wee act meeting. I guess when was this: we had a wee act meeting, maybe tuesday, that's the first yeah on the first and actually carmen is your yeah karma yeah, but you know you gotta go with who came right. I guess he got invited. I don't know what happened with carmen, I'm not reacting. You know that I well. I got my own issues with react anyway, but but al he, you know he you know expressed what he knew, but you know he wasn't. He didn't have all the answers and he's supposed to. I guess circle back with some, but you know I just wanted to at least bring this up on September 9th. I maybe have more understanding as far as what NYCHA is trying to sell us. Thank you and you know I wish that I had been able to get into an earlier town hall. I believe there might have been one on the first or something like that and then I would have maybe a better. You know understanding of the sales pitch that they put into me. Thank you for explaining that. Thank you, marshall and yes, definitely, please, let us know appreciate it. So, if perhaps that is everything for tonight, I'm seeing the smiles already hidden. I will call this meeting to an end all smiles. Second, god all right guys. All right are we doing this good meeting good start off to the next year. Thanks for including me, thank you all have a good night. Thank you.",
        "summary": "You know, uncertain right now for the community, What's going to be happening with regards to many of the services that we depend on throughout our community, we're having a bit more of a kind of a broader discussion than what we've already had these past few months between March to June.\nI did work for three years here in inwood, as well as east, harlem, specifically working alongside the elected officials as well as a number of tenants throughout the neighborhood trying to ensure that they could stay in their homes, help them get connected with legal services.\nYou know even past that previous experience of three years working here in the community, with the tenants and with that I want to pass along to oc.\nWow went quickly, so I probably moved to washington heights about the same time that oc moved to inwood about 20 years ago from the other side of town, Heights ended up in audubon park and a great co-op and then was lucky to do that and have since gotten involved with various organizations, including community league of the heights, where I've been working with the food pantry.\nThat is the reason why I remain on this board so that work can be done, but I have done advocacy in this community for over a decade, probably two decades in the areas of housing, human services, education, criminal justice.\nYou know we have a lot of a family history in the neighborhood , I'm, still living in the same apartment that he first lived in And I'm new to some of the housing work.\nI do look forward to working with all of you And you know, making our community better and making housing in our community, affordable and decent for all glad to have you here , Jimenez I've lived in washington heights, my whole life, so 30 years, Exactly I'm, a community collection liaison on behalf of the department of design and construction.\nThis is a very, very difficult time for our practice area and obviously for our communities with the pandemic, with a significant number of unemployed people and just kind of figuring out what the situation is.\nThe staff are not capable of handling the residence and the people who otherwise live in the building are absolutely going nuts, because these group homes have shown that they can't operate according to apartment living and the pandemic has just brought everything to a crisis point and the reason it's one main reason.\nWe're gonna, try and set this so that we can, you know, discuss the entire situation in the new business section: , that's okay, no open up, but yes, that will definitely come back to this.\nPlease do feel free to have it brought up once I open up everything for new business at the end , I want to kind of open it up really to our committee first and just following, along with the typical rules of how we do things with the board, we'll open it, then back up to the public.\nWhat the research they've been finding is showing about really the rate of homelessness throughout new york city, and you know, I think, that for my own goals, this year, I want to ensure that we have the opportunity to really actually interact with some of the homeless, service, homeless, shelter providers, because they are probably dealing with really just a huge influx of families either, because some of the very recent I'll call them loopholes that exist that have caused families to get vacated, whether it be because I'm not sure if people have been following new york.\nYou know the pandemic and we're being a little bit more responsive to the needs of those that particularly are in these kind of home housing situations that really are just not decent and are not livable circumstances, and This is aisha, so I think that in the past, what I've tried to do when I was serving as chair is to focus not only on things within our purview, but also things that could help the board work more efficiently for us in the areas related to our purview and to support business across the board throughout the board.\nOne example of that is a resolution that we in this committee reviewed to have a safety net fund put forward by the elected officials and for a coalition to be built for people who are undocumented asylum, seekers, etc in the event that they are released from whether it be being detained or whether they enter the country and have nowhere to go that there would be supports for them to prevent harm to themselves or others, and that resolution passed the only one person voted against it, and yet the office never put it in black and white and forwarded it to the elected officials.\nThe committee had the intention on reviewing what was happening with dhcr, to bring dhcr to a point, to put forward a resolution to make dhcr more accountable to the community to tenants so that there would be visibility about information related to when people's tenants rights right most of what is happening in dhcr is weighted on the side of the landlord.\nI'm kind of questioning: How is it possible that the office doesn't forward resolutions to the government officials, as they should well see that that issue is one in a stack of many, not only my own personal experience, but also people in the community have come to me to express certain concerns they have when they make requests to the office that the office is responsible to do also having been a member of the executive committee.\nDespite, my asking questions about it and what one of the primary things the primary responses was to send it back to committee, and we almost redeliberated it Of course, they're, still part of the function of the board, but I do want to just try and make sure that we're sticking to the agenda item in the capacity just to bring up many of these concerns, You know.\nI can imagine that there's a few different issues that, whether the board members, the public committee, want to raise Okay.\nYou actually give a little bit more detail about really what this program focuses on, so this program is focused on giving a homeless people an apartment and pay for the rent and give them an opportunity to live in a house in a home that and then that program is also attached to some social services like helping them.\nIt's, a program that include different things, to lift people up from the street to become you know, to have a house to feel like you know, most of all of us, so, and I feel from what I heard and what I read that it's a very successful, program, and I think this is something that we should push to have here in new york, city, which we don't have.\nHow, when we have programs, like you, know giving people an actual home to live in that they're, providing the supportive services?\nWhere do you cite a location for a city agency office oftentimes, you know even going back to what we talk about This is one of the biggest discussions that we had because often times we found that there was disproportionate impact from let's say, having sanitation, warehouses facilities being kept in certain areas of the Bronx right, and that's something that is not.\nWhat has rather, what has not been in their own community for some time, so You know, I think that that's one of the areas that in which we do even within housing, human services.\nYou know address some of the concerns that we have here for those that really are vulnerable and do not have the opportunity to essentially afford what was the rent or Can we get back to kind of what the agenda that you laid out looking at the fiscal priorities and what we want to take on right?\nBut I just wanted to take this time to focus in on those individual goals that we, as a committee, are going to focus on throughout the year, got it.\nAnother thing, I would like I've seen other community boards set up forums or panels where they invite people from- There's a great need in our community right now for clarity about where we stand on.\nThis is something that the committee might have already addressed in the past year or two, but I am sort of involved with the northern Manhattan community land trust- But, let's think creatively, right now, as far as like, affordable housing and thinking of long-term solutions and bringing that conversation, especially as we're now facing the the 2021 elections, are right around the corner, we're going to see major changes as who's representing us at all levels of government.\nAnd you know, renters rights, I- do believe that we need to have a conversation about supporting people becoming first-time homebuyers.\nJust some of the ideas I wanted to share with the committee Is to amend the administrator code of the city of new york that pertains to the right to council and again it's not necessarily changing the law by just kind of expediting it and rolling it out.\nThink for many years we've known and heard from people in our communities about applying for affordable housing, Sometimes people who seem to have just applied, maybe the previous month get you know an apartment before someone else, that's been on the list for many years.\nThis point the so where homeless is concerned, I feel like we talk about homeless, wholesome, but I think that we need to kind of drill down and look at the different ways that homelessness, manifests.\nIt wasn't previously on the agenda, But Yes, anything that the you know board wants to discuss, or perhaps the public.\nOkay, the other just one other report to take a look at just because it's people in our community, but our community board district is number four in terms of number of essential workers housed in our community.\nSo I think that those are things that need to be looked at, but also that impacts those people in their housing, as well.\nWhat's going to happen once these high-rise buildings get built and the landlords get 3, 500 4 000 a month in rent and other landlords in the neighborhood figure out that they could be getting the same amount of money in rent and start paying people to move out of their rental units or harass them out, and I'm wondering if the committee has any plans for how to go about addressing those situations when they arise.\nWhat typically might happen is that we can either say just to begin the meeting that we're going to put all items for everyone to look at and vote on, or perhaps in this committee right here.\nIs that, like I was mentioning before, is that when these items are essentially suggested by their committee members, the individual committees, they go back and they pretty much vote to find out, which ones will come in a certain ranking, and I think this is kind of bringing back to my good old times of ranked choice.\nAs the committee discusses this, it tends to kind of push up, maybe some new items, every year, If we talk about, let's just say the expense.\nIt's another example of how work that is done by this board is not followed up on, because in fact those people were out of their apartments, almost 10 years, with the right of return with nothing being done on those buildings, and it took all this time for anything to even start.\nI think we should be also seeing what the board voted for what the committee proposed as well like what the final vote was for those items, as well as the the city's report when they returned it to us stating what was funded and what wasn't and how the city is going to handle funding of those matters or not.\nWe can, but I also want to just keep it open right, because we we've discussed that you know we want to make sure that people can bring in new items too That.\nYou know you want to be able to vote on as a committee member I'll note it down now, but if perhaps you would want to then wait and review the district needs statement.\nYou know, perhaps I think, looking over previous items that have been raised, whether it be through that sheet or even the specific district needs.\nHere, like let's say for the first item, 40 We as committee members I just only want to present that sheet, just so that you know you know what has previously been raised as priorities for the committee Ever when we're when we're kind of going back and forth about what we think is more important.\nThis is february 11 2019, but what we're looking for is the fiscal year preliminary budget register so that we can see the responses of the city The same items right, because statement of district needs But on that document there it's just state.\nOkay, I'm, really hoping that this committee and the board can help the people in our building, who are really suffering and experiencing a lot of problems because of community options.\nWhat I, ultimately hope for is that the board would be willing to reconsider the previous resolution that it made six years, ago, approving community options to have the two units in our building, because now we have six years of documented experience showing that this has not been a good situation for any of the parties involved, that something really has to be done to change, it, and I'm, hoping that if we had an opportunity to present to you why it has become such a burden, whether that be in a small meeting next month through this committee, whatever you would recommend that, after we presented that information, that you then would be willing to have an open hearing or something where we could ask for a different resolution to be passed.\nDoes anyone have any response to where you know we might be able to go within this community board with our problem and we might get a resolution on the issue.\nWhat I wanted to point out to you is that, with a little bit of research, I found out that six years, ago, in 2014 community board 11, which I believe is just south of ours, was also had a building.\nIf I might, I think what the committee should be doing is looking at any status from opwdd, and maybe this is an opportunity to address some of the issues that you're posing in regards to how opd is communicating with the buildings in which some of these organizations are placed and providing services, So that so that we can have in black and white what the dynamics are that are manifesting, but also how opt opwdd has responded or not, and also for us to we.\nIf it's a concern of what That kind of you know, it falls out of the lines of what we do as a community board.\nRight, That's also very active in the community who came by and talked about issues in our building right when there's individual cases like That It's not to what there's the public policy regarding people with mental health, problems.\nWe community boards are a part of that process of when a unit is going to be proposed or a building that is in relation to the rights of people with disabilities.\nThe answer to the question issue that you're asking I mean there really may not be precedent because there's probably not too many instances where this has ever happened, But, but it has happened, and you know, as I said, community board 11.\nWe primarily don't want to have community options operating a group home in our building, because it's untenable, no matter how much money they could pay us, because we would just be they'd just be racking up violations from here until kingdom come so money damages are not really the issue our lawyer, I mean we'll, take them because we've incurred them, but our real goal is to try to find a place where people who need housing can get it, but not in the wrong building or type of building apartment.\nThat was built a few years later, and, as I said, people are experiencing first-time home ownership, and you know it's bringing life to the neighborhood.\nSo I think the community should have a state- You know one of the things in the resolution that you guys did pass six years.\nDon't think there is any connection, and you know at the time community options, said, We'll do it no problem, but they do not take people who have some connection to washington, heights.\nDon't just want people who are in need of housing to be housed, no matter what you know.\nThink that's where we come in with really bringing forward a resolution that talks about those issues, right.\nI think that's also been a concern for some individuals who have not been as familiar or even been informed as much about it, but that's also one of the areas in which people have been talking about they're trying to raise funds as well, while also not necessarily, you know, outlining what are the reasons for public or public entities entering into agreements with private organizations."
    }
}