{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCVgO39Bk5sMo66-6o6Spn6Q",
            "title": "MCB4 - Business License \\u0026 Permits Committee",
            "publishDate": "2020-10-14",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "xW5xQEPGdis",
            "fillerWordCount": {
                "uh": 327,
                "um": 207
            },
            "readTimeFullTranscript": "99 min read",
            "readTimeSummary": "10 min read",
            "wordCountFullTranscript": {
                "music": 118,
                "space": 90,
                "restaurant": 62,
                "street": 60,
                "sidewalk": 54,
                "page": 38,
                "cover": 34,
                "roller": 32,
                "license": 31,
                "bar": 31
            },
            "wordCountSummary": {
                "music": 24,
                "space": 22,
                "restaurant": 19,
                "street": 15,
                "sidewalk": 12,
                "dining": 6,
                "bar": 6,
                "noise": 6,
                "license": 5,
                "parking": 5
            },
            "fullTranscript": "This morning, by nelly, it includes for the committee members possible, open dining stips for discussion as an item on our agenda. Hope you've all had chance to look at that. This is a continuation of our meetings by zoom. We have an executive order from the governor of New York order, 202.1. That gives us the ability to have meetings by zoom rather than face to face, which is, I was going to use the word normal circumstances, but who knows what those are? Hopefully, maybe by this time next year, we'll be back to face to face. We have six items on the agenda. Maybe let me take a look: eight plus the open dining, so I'd like to have us introduce ourselves, I'm Bert, Lazarin Co-, chair of the committee, and I called Zubiak, the other co- chair, I'd, say on my left and my right, but I do not know who's on my left and who's, my right. So if Chanco public member, okay, christine Bertay member Mike, Noble member, just a picture of me, Wendy Gonzalez, Member, Gary, Keenan, member Rob, Walker member, so Sabrina and Brian- you want to do the now separately. Rather than simultaneously sabrina Brian, it's okay, Sabrina, okay, Brian, socal, member, okay, welcome everybody and I see faces of our applicants, hello. So, on the agenda we have the items grouped. We have the first grouping application alterations. Number one is 401: West 53rd street changes to hours of operation. I guess that's about it. Do we have the applicant here just Bert before we start, I wanted to remind everyone that, as with all the Community board meetings, this is being recorded and will be up on the Community Board website on Youtube. It's also being streamed, live on youtube, and second, is anyone who's been with us before knows what this committee will do will make a recommendation on whether to grant or deny a liquor license to the full board, which will hear these applications and vote on them again on November 4.. The full board will then make a recommendation to the state liquor authority, but again what we do and what the full board does is only a recommendation. We do not have power to grant or deny liquor licenses. Yes, okay number one number one 401 West 53Rd street. I have a question: there are no hours of operation on the forum. Look on the agenda. We have 11 am to 11 P.M yeah. The form is nothing yeah, so the they have it on the first page, where they say what alteration they're seeking to do, but yes correct. They did not fill out. The second page correctly is the applicant here, a lawyer, any representative of the applicant they're typing in the chat that they're here they wrote they're here. Okay, let me move them over. Give me one. Second, thank you nelly bye, hello, they're listed under panelists, but I do not know why we can't hear him because they are mute. Probably no, then he's fixing it he's, fixing it he's having audio issues. This is funny. Why do not we move ahead to item number two and then we'll come back to one and number. Two is 351 West 38Th street Quadrant 38.. This is also a change in method of operation and alteration to add an interior restrooms to the rooftop area. Yes, thanks Bert, can you hear me we could hear you Donald, okay, hi everybody, Donald Bernstein on behalf of the applicant you'll, probably remember this from December of last year, when we appeared before you for this hotel license application that we reviewed at great length back then and which you recommended approval of. We then filed the hotel liquor license application with the state Liquor Authority, and we have the approval of the state liquor Authority. There has been a change since then, and the change really was Covid-19 that hit us and affected us in so many ways and with respect to the hotel. What it did is make us realize that we've got this outdoor space on the 26th floor, Roof terrace, which is on a floor. That also has a number of guest rooms and when we first planned the use of that space, it was intended to be amenity space to be used. The outdoor portion of the 26th floor amenity space for use by the guest room on that floor. It was not open to the public. You would have to be an occupant of that guest room to use that space. Now we're realizing the importance of having outdoor space that is open to the public, it's important not only for us, but we believe for the public, not knowing how long this may continue, and also just an appreciation of the importance of having some outdoor restaurant space. The other restaurant space in this hotel is all indoors, so the application that we have before you this evening is for two things. One is a change in method of operation to allow us to use that not just as amenity space but as a regular restaurant, that's serving meals, full meals, full menu with a service bar that will be open to the public and because we're putting in a service bar. It also is going to be an alteration. None of the other operational issues relating to the hotel are changed. The hours remain the same. All of the stipulations that we negotiated with you and all of the aspects of operation that we presented back last December remain in place. The only change is converting it from amenity space to public space. In fact, the I think the seating for that outdoor area, which did originally have 57 seats, is now going to be reduced. I'm sorry it was originally 68 66 seats on the outdoor portion and now it's being reduced to 58 seats. So it's actually the occupancy will be a little less. This cert, the bar, as I said, is not a stand- up bar patrons can not go up to it, sit at it or drink. It's a service bar only allowing the wait staff to go and get a beverage and be able to bring up people sitting at tables. We did have Al Firestein come back. You may recall that he did an acoustic study back last year that we gave to you relating to that outdoor space. He came back and issued a report on September 18th. We supplemented his October 2019 report and he found that the conversion that we are seeking has no change in acoustic factors. So all the acoustic elements that were in place before will remain in place and his recommendations will continue to be followed. We did do some outreach to neighbors. We spoke to Frank and christine about this. We spoke to the hudson yards held Kit Hell's Kitchen Alliance have a letter from them. The hell's Kitchen Neighborhood Association, the garment center bid we're all advised of this and are supportive and that's the application Donald. I take it the revised hour sheet that you sent to me this afternoon, your clients, okay, with that, yes, okay, so the hours that we had presented to you, I think, with the 2 A.M closing for those spaces unchanged some of the hours on the sheet that breaks out the various spaces did not conform with what we agreed to last time, but that was a technical mistake, so that'll be corrected. So the only changes as Donald said, is relates to the roof, how it's used and the bar up there. Are there any questions from committee members any comments. Yeah? Can I ask how so it had a capacity of 66? How often was it at maximum capacity? Never it has not been open. The hotel has not been opened yet yeah. We have approval of the license application by the state liquor authority, but we have not pulled it because the hotel's not opening right spring of next year. Okay, so we do not even know whether the whether it will be packed all the time, whether because when guests only have use, things are usually quieter. I do not know what's surrounding, because I never did a site visit on this. I do not know what's around there. I do not know I'd have to defer to christine and frank. If they s did the side visit, I'm not quite sure yeah we did. Where am I yeah? We did the side visit and we know that location pretty well and the at that level of elevation. There is really no neighbor whatsoever. Okay, I'm going to defer to you guys so yeah, and just also so you know there are no standees where they're at the bar elsewhere. This is just service and at its maximum you're talking about 58 people, that's if it's full to them. Okay, any other questions comments. Any members of the public signed up to speak nelly on this. No, I have no one with any raised hands. Okay motion to approve take a second okay on favor hi. Okay, let's go back to item number one thanks! Everyone! Thank you. Good luck! Good night have a good night. You too hi. Can you hear me? Yes, we can now yeah hi. Sorry, I need to fix my microphone earlier. So would you like to say something about the change of the year hours? Yes, so we decided to open, sometimes seven days a week, because we took a huge hit from the Covid-19. We have not opened since March. So that's like almost a half year delay, so we would like to make the liquor license more flexible for us so seven days a week, so we can decide like which day can close. We can have more freedom on the schedule and also we would like to add some day time for the liquor license, because we do have a launch hour from 11 30 to 2 30. So we would like to add some time during for launch. That's why I proposal from 11 A.M to 11, P.M and so far neighborhood really love our restaurant. So I think the if we can bring the liquor for the day time we can attract some more customers to come to our restaurant. Yes, thank you. Have you so you have been open already yeah. We opened, I think, with July first, so we are open now, okay, so what they're doing is they're not. We already approved the 11 P.M closing time which they're not seeking to change. They really just want to open earlier in the day so that their liquor license covers lunch. So it's not maybe later, yes, we actually opened launch like from July 1st, but we did not steal any liquor this whole time for the daytime. So we start the liquor at 5 30 to 11., so that time did not change at all. Okay, on your on the form you submitted, there are a couple of things you need to correct on page two, there's a chart where you're supposed to put in the hours you're going to be open and the kitchen's open. Your form just had check marks. You need to put in every block the hours that are supposed to be in there 11 to 11.. Oh, I will correct that tonight and send it again to nelly yeah. Okay. I will do that Asap and the other thing that I think is a mistake because you answered the question differently this time than last time. There's a question that asks if you're going to use outside promoters- and you said yes on this form- but you said no the prior time, so I think you mean no yeah. That's the mistake! Yes, okay! So that's the page, that's on page two as well! So if you could correct that, okay, I will correct and the last thing the bar, the bar that you have. There is only a service bar, correct yeah, that's all, and no one can go there to buy drinks right. No, that's just a sushi bar, that's a workstation! Just for so like our customers can see our chef make sushi. That's it that's not a liquor bar okay! That's all! I have Bert. Okay, any questions comments from committee members yeah. I have a question: are you currently using the street to help your business? Have you set up in the street and the sidewalk? Yes, we do. We do have streets, we set up a tent on the parking space street, but we do not have any street so the work site we did not set up any table on the wall on the walk, so you've kept the walkway free. That's very nice. Thank you yeah, because we have a huge, a big stairs in front of our store. So there's really not enough space for for six feet, so we can't put any table and maintain six feet away from the storage. Thank you. Some people are doing it anyway. We really appreciate it. Yes, I'm happy with this application. Thank you. Thank you. I'm just going to follow up. Thank you for reminding me here. Do you have you do not have any music outside right so far, no music, so it would be good to keep it that way, because it's normally it's not it's not permitted and it's very disruptive to other operations. Okay, yeah, we can yeah. We will not play any music outside yeah. Okay, do anybody have a hand raise from christine you Wanna? Do you Wanna add a stipulation about that? Yeah that'd be good, okay, so Sir. Would you agree that there'll be no music in the in any outdoor space yeah? I agree. Okay, so we're going to add that as an additional stipulation on the form? Okay, that's fine! Thank you. Thank you. Nelly. Anybody have their hands up to speak, no one! Okay! Do I hear a motion I'd like to make a motion? Second, all that's in favor aye opposed abstaining president non- eligible okay. Moving on to category number, two good luck! Thank you. Thank you. New wine, beer and cider license applications. 366 West 52nd street, tory Bro ramen is the applicant here, a representative of the applicant Nellie. Do we see anybody hi here hold kim? Yes? Why and then the anthony is like Ju is here, but I think his microphone is now working here now so do we? Can you go ahead or do you want us to wait and see if you can get him on the line as well yeah? I want to wait to him a little bit now. Okay, so why do not you we'll move ahead when you're both on just put it in the chat and we'll come back to you? Can you hear me yeah? You know, okay, this is Jay. Ah, here's, the second one: okay, oh you're, both here now, yes, okay, so go ahead, guys! Okay, we we are applying for the restaurant y license for the transfer. It's been licensed to sell beer and wine at the location at 366, West 52nd street. It is a japanese restaurant. The operation hour operating hours are 12 P.M to 11 P.M, seven days a week. We have about five tables with the ten sittings and we also have a food counter with the ten sittings and the premises is about hundred square feet. That's all I have and then you know I'll answer. If you have any questions regarding so do you have any connection to the prior operator toto ramen? Are you completely new Mr King? Can you answer yeah? This is like two. We took out two over the place. I'm sorry yeah. We took over that place, okay, but are you in it? Are you a new operator, or did you have any connection with them? No, okay! So one thing we got some letters from the community and actually we've been hearing about this for years that when toto ramen was there, the crowds were so bad that they hung around on the sidewalk. They sat on the stoops of the neighboring buildings and the sidewalks were basically impassable and that operator kept saying they would do something about it and they never did so. I guess I'm asking you sort of what your plans are. If you are as successful as we all hope you are and you get those kind of crowds waiting. Oh Mr Kim, do you have an answer for it? Yeah? Actually, though, that place was really noisy and then everything is messed up before, but we changed the name and then it's everything it's new, and then I used to work it there like three years ago and then all ads are like just kitchen guy, but now we just opened like two months. Everything is really quiet and everything new and then they have like location nearby like just two blocks away totally another one, and then we do not have any connection with them and then we have just new ram and then people is going to be new people coming means. We are clear everything for the new like generation and the new everything I think, okay. But what do you do if you're full and there are people waiting to eat there? Well, we do not have any waiting now and then, but what, if you're as successful as your president? Hopefully you will be that successful, we're going to try to we're going to try to only just for the reservation and then walk Queen is usually we do, but we're going to take the reservation for future because yeah, just I do not want to people want to get. I want to people want to wait outside because really it's kind of we can not handle and we can not control them. That's why I knew it is. Let me happen again. It makes me like really no good for everybody like coming forward and then the customer and then for us saying that's why I want to make a reservation way and then yeah just think about it way too. I think it would be important if you met with the block alliance right. You've requested and they've invited you to come to them and, as far as I know, you have not and they would like to have sit down and discuss this issue. Okay, because you know the as your advice we contact all of them on the list and then some people about a couple of people asking me more information about it, and then I answer all the information, what they ask for it, but we were never invited any kind of meeting or any kind of discussions. Well that maybe is in the past, but there's an invitation to come speak at the Hk 49 54 block alliance meet with them. Okay, I'll try to meet with them. I tried to contact them hk. What was it hk, 4954, Block, Alliance, Steve Lolita is the chair and ally. Can you get them the contact information? Yes, I will send it over to you. Okay, appreciate that thanks right now the place is really tiny. We have only 20 settings and I did not know there was a problem. You know the customer sitting outside whatever nobody. Actually, we did not know that and then that's why I could not answer you your specific questions, but I will get back to you with more. You know, you know security plans and then you know more better answers for that questions. But as far as I understand that we do not want to have that kind of problems in the future, and if you know if it become a problem and then you know I'm going to try to I'm going to put somebody one of my employee stand outside and then, if you know those things are happening and then we're going to ask them to you know you know come into the store or there's a little outside it's like a half basement, and then we have a little space right in front of the store and then we're going to make some kind of a sitting area. I'm going to make them to wait there. Okay, I see christine and Inga want to have speak yeah. When I look at your plan talking about this issue of the queue and the line on the sidewalk, I look at your plan, the map of your restaurant, and it seems that your counter is going all the way to the entrance and I think if you would cut that last two two stools and reduce your counter a little bit so that you would have a vestibule there and you could have people much more people waiting there. So that would be my suggestion, so you can have more waiting space because we want to okay. If it says we want you to be successful, but you know so. If you had two less seats at the counter and the counter would be a little bit shorter, then you would have a waiting space. I see okay I'll, take your advice and then we're going to think about those things. Right. Okay- and I just have a question- so are you going to be using the street space a parking space for the restaurant, the outdoor dining? Are you going to use space outdoors Mr Kim? Can you answer it? Yeah we're going to use the street yeah on the north side and the only street air road, roadside, yeah, broadway, okay, so you're going to use the open the street space for extra tables, but not the sidewalk yeah, not sidewalk, yeah! Okay, you are not going to put any music outside right. No music, okay, so you'll agree to a stipulation that the you'll have no music in the out any outdoor space. Is that right and nothing on the sidewalk and nothing on the sidewalk? That's why I keep asking this because I think that's important. I've encountered a lot of bad street combo sidewalk restaurants. Lately, yes, no sights! No music! Yes, I mean, if you're going to use the street, I think the sidewalk, especially in those streets, should be kept open. Okay, thank you. Just so we're clear to you and your attorney we're going to put this in as a stipulation as one of the terms that you're agreeing with us. Okay, no music and outdoor dining is only on the street, not the sidewalk, yes, you're. Okay with that, yes, okay, thank you and before the full board is meeting on November 4th the first Wednesday of the month of November, and so when the full board will be reviewing our recommendation that we make tonight. It would be good by that time. You have met with the block alliance and maybe have an answer to christine's question what has suggested change of seating? Okay, yes right, that may depend on when they meet yes, because they only meet once a month. I do not know when, in the month they meet right. I do not know what this schedule is, but at least reach out to them. As soon as you can I will. I will try to do it tomorrow. Any other additional questions comments. Yes, I did the raise hand function. This is twee. I did the raised hand function. May I speak yeah? Okay, thank you just to go back to the reservation and the crowd control. What I see people doing now, especially since restaurants, are now at only 25% capacity indoors is maybe you could have a reservation system where you have people only use open table and that way people know that they really can't congregate. So to speak, so they know it's by reservation, only guess what he said is not it response. What are you? Are you asking a question that was a suggestion in terms of the as an alternative or in addition to the removal of the two stools, as had been previously suggested in terms of in terms of prevention of any crowding. If people know it's by reservation only, then there won't be people standing around as walk- ins, and so you would reduce potential stoop sitting and yeah okay. I also take a consideration of your recommendations anyway, yeah this is a really tiny place. It's a maximum. We have about 20 seatings and then 400 square feet, and then you know we tried to push it to. You know the most of the cell to go, but there are people, you know during the weekends and they want to sit down and have it, but you we will also like right now. During the pandemics you only can put 25 percent of total capacity, which is not a lot of people in there and then, meanwhile, you know the community's concerns. We also have to concern about survivability of business too. So right now we are more pushing it as far as the online sales for takeout, and you know, try to minimize the sittings at these days. But, yes, I will take a full consideration of your recommendations. Also thanks for that suggestion. Tweet anybody else on the committee wants to say anything. Anybody from the community has to raise hand nelly no one, no abstaining, present, not eligible. Okay. Good luck! All right! Thank you. Very much have a good night, we'll see you all November 4th all right section: three, we're onto the new liquor, license wine, beer, etc. Item 4 on the agenda: 142 west 24th street. Yes, excuse me good evening, members good to see everyone again. Thank you for the opportunity to speak here. My name is Mastin Sansom, I'm the attorney representing the applicant I'm joined here this evening by Gary Meda who's, the general manager. I can't see him on my screen, but you may be able to see him or at least see that he's present. I do not. I do not exactly know, but I'm also joined by Al Firestein. The sound consultant, who did a sound study involving a roll of cover for a second floor. Terrace Al should be on as well. Again, I can't see Al. I do not know if it's because there's too many people or whatnot, but I will talk a little bit about the general parameters of the proposed application and then certainly answer any questions throughout this discussion, but also I'd like to turn it over to aldi, because, as I mentioned, he did perform a sound study hold on one second nelly: can you move Al? I just moved out. Who is the other person Gary Mado? Okay, I'm going to move him over. Thank you great. So, as mentioned this is this is an application for a full liquor license for a hotel there. On the on the first floor, there's a dining area in that dining area. Well, let me back up there's a first floor, dining area, but then there's also a second floor. Dining area where there'll be one bar will be located. It's the only stand- up bar that will be 19 seats at the bar. There are no service bars and also on that second floor, there's a second floor. Terrace that will be fully enclosed by a roll of cover. That's a polycarbonate roll of cover there will be the music will be recorded music, only no jukebox or dj, or anything like that. The hours of operation for the service of alcohol inside and now I get a little a little confusing because the roll of cover is kind of inside but the area, that's not the roll of cover we are hoping to serve alcohol from noon to 1 am and but the outside or underneath the roller would be only till 10 P.M. The number of seats out under the roller cover would be 76 seats. 20 tables now I know on the application. It says Tbd no less than 76 seats. Well, that was what was tested. That's what we would agree to and stipulate too. I think I could not find it, but I thought I read somewhere that there was a maximum capacity of 90 out there, but you know we understand that the test was for 76, so we would limit it to that. As I said, it's recorded music only and I'd like to turn it over to Al. I think if you would allow so Al could discuss a little bit about the study and the results so Al you may be talking. We can't. I can't see you but you're, muted, just Fyi. Now you do that now: okay, I'm here, can you hear me? Yes, okay, good all right, so I did a study in August. I did my usual background late night survey to see what the background noise was remember. We're in a pandemic thing is a little bit quieter than normal. Do you guys all have copies of my report? Yes, you do okay. So basically, I look at the minimum noise level which I'll move my phone for a second sorry, and can you see that graph so that graph shows the level from 11 P.M to 11, 20 p.m and there's two curves a black curve and a red curve? Oh Al, I do not think your camera's on. We can't. We do not even have a photo of you, let alone any graphs or anything. Oh good. All right start, video. There we go. Is that better? No video? Yes, I'm hearing, yes, yeah, okay, so this shows the the sound levels of the bass, which is the red line and the mid- range, which is like voices and that's the black line and they're roughly about the same- and this is you know, occasionally a truck goes by or there's a siren, but generally the sound level is around 55 decibels. 55. Can you all see that so what I do is when I look at these types of data, then I put them into a spreadsheet. The spreadsheet calculates a number of factors. I do not usually show this to people, but I'm going to show it to you now. Can you see this spreadsheet, I'm showing you now guys yeah. So what we've got here is you're mute again. Now you muted yourself out. We can't hear you am I complicating things too much. I did not hear you were muted, I'm muted you were you're on. Are you good? Do not touch anything now, yeah, just to say what you did and point again, okay, interrupt me I'll break every few seconds. Interrupt me if I lose something, but basically I show that compared to a three foot distance where these measurements are made inside the roller cover we're going to be 50 feet away from the nearest residences, which is on the north side of the street. Okay, everyone hear me so far. Yes, okay, so based on that the sound level drops, of course, sound level gets quieter with distance. So after the music noise travels it's down to 59 the voice levels after travel are 53.. However, the ambient sound level is 56. going inside an open window. Believe it or not. The sound level drops another 11 dba when you open a window all the way. Now the roller cover. That's the key thing here. This is going to give us an average of 17 decibels of reduction. Everyone hearing me continuing so far. Yes, okay! So when you subtract all these things, the music final level inside the apartment is 30.. The voice final level inside the apartment is 24.. I realize there's lots of apartments across the street. There's three- story, buildings, there's four, five, six, even a seven- story building across the street, but these noise levels are actually lower than the ambient sound level inside the apartment, which is basically this 56 minus the 11, which is about 45.. Now New York City has a number of codes, one of them. It says that in the dba level the maximum you can have is 42. well, the ambient sound will be louder than that. But that's not the key thing. The key thing is that our music will be below that 42, so 30 is lower than 42 within code, but also on this graph, you can see there's all these different frequencies. That's bass, mid- range, treble think of it like a piano keyboard, there's the bass, the mid- range and the treble, and I have a line here that says: music. Okay, can you all see that music, okay yeah? If it was not okay, there would be the letters ng in that line. There's no ng, and when I graph this all out, you can see that with the voices the voices are going to be down here in all the different frequencies and as well as the Dba level, which I stuck on the right at 24 dba way lower than the ambient way lower, not half as loud, because you guys have heard me talk before 10 decibel reduction, a 10 decibel subtraction means it's half as loud to the average person, so 35 is half as loud as 45 and 25 is half again as loud. So this is more than four times loud. This is one quarter as low as the ambient and that's for the voice and for the music again we have to be below not only the 42 dba limit for music and we are, but we also have to be below all of these base and mid- range limits which were put in 1992. What was where they? Finally thank God added base to the regulation and all of our music is going to be considerably below that. So it's all in the report, these charts that I'm showing you now are in the report. Let me stick my phone there and if I can answer any questions for you Al, so we've been, you know getting a lot of roller covers presented to us, but we have not actually have any experience with one that's been installed. Have you sort of worked with any that have been installed such that? You know, you know whether they work okay? Well, let me tell you about roller covers, let's see, no, I know I've read all about roller covers. I guess my question to you is: are you basing it on abstract projections of what roller covers say they can do or have you actually seen one? You know enclosing a space and confirmed whether it behaves the way your reports suggest they will behave. Thank you for asking that question I'll. Send you your ten bucks later the the pictures on page 11 of my report show the empire hotel my clients who live in this building at 61, West 62Nd street sued, the empire hotel was a whole big case, a nice appeal. We won the appeal because they were making too much noise when they opened their roller cover. They I did not make them put a roller cover in they had one, and you can see pictures of the roller cover open and closed. So, finally, when they lost, they were forced to deal with us and I actually measured the standard roller cover open and closed and then on page 13 of my report, you'll see a chart that says sound level reduction and you can see well, it does not do a great job in reducing base the roller cover, because after all, it's like it's lexan, it's like bulletproof plastic. It does do a very good job at reducing mid- range and treble noise. So I always base that on the actual measurements I made, because that's what I like to do, it's the real world. It's not just some manufacturer's okay. So since they've kept, the roller cover closed at the empire, have any of the your clients or any of the neighbors, had any complaints? Yes, but not because of the roller cover the empire. Hotel has a let's say this. Roller cover is on the West side, closer to New Jersey, and they have this. Also, this open area that does not have a roll of cover, which is a great contrast by the way on the east side closer to France, and so that's where people have still been congregating and they have a smoking area and people have complained, but the lawsuit ended. As far as I know, I was dealing with Chris Cobb of Wolf Holdenstein law firm, and so we basically got that solved Madison. I guess I'm confused about a couple things when you filled out our the stipulation sheet for the roller cover terrorists there's a question that said: well, you have any music out there and you said: will there be no amplified music? And you said you said yes to that was that? Are you saying you're going to have music out there? Now? I'm sorry where's that the outer items page page five of the stip formers, one of the ones you sent us a revised version of yeah, okay and so oh will there be no amplified music? And we said yes Gary correct me if I'm wrong, but my understanding is that the only music would actually be inside at this point. So you that the only music that you'd hear would be when someone walks out the door to go outside out into the roller cover area, but I do not think there are any plans for any speakers or televisions, or at least speakers in that area at this time so Gary, and will you stipulate that there won't be any you know, speakers out in the roller cover area? Yes, to my knowledge, there will be no speakers. As Madison said, there are speakers inside the bar area, so when people exit the and oh and that door is open, you will hear some music, but it will be very low and it's very easy. Listening music. I, however, what I will say is that if it's an issue, if the plan calls for speakers outside, we are happy to not install speakers outside that'd be great, the only music would be coming spilling over from inside when the doors open or something that is correct. Can I interject guys? I did my whole report based upon the idea that there would indeed be speakers in the roller cover area, and I that that's what I put in there, not that they would just be inside and would leak out when there would be basically hardly any sound from music going outside, and I have the levels at a relatively low 88 decibels. 88 dbc, measured three feet from the speaker now three feet, as we all know from Covid-19, is basically like one arm's length away. So imagine you get next to a loudspeaker. You know a small loudspeaker with like a six inch woofer and you touch it you're that close to the speaker and it's only 88 slightly louder than the voices that are going to be all around you of 77 and I think that's quite reasonable. It's going to stop that noise and all the charts. Everything in my report is based on that do with it. What you want. That's great Al just needed to be even more quiet and, as we've discussed in earlier meetings with the applicant every time we've had a roller cover. People have agreed not to have any speakers in the roller cover area, so that was sort of our request to them a couple weeks ago. Okay, so we of course want to be good neighbors and we, you know obviously it'd be nice to have some background music out there. Just you know to break up the silence, but we would, I think, stipulate to that and look if you get the thing built and you want music, you know you can come back come back. I think you said that you're going to close it at 10, but on the stip form. You know our standard Ask is 10 P.M and then 11, P.M, Friday and Saturday. I assume you prefer the 11 pm, yes, Sir, okay and then last thing for me. I believe you said this, but I want to include a stipulation, so the roller covering clues includes the whole thing. Sides roof everything right for me to keep. It permanently closed correct because my understanding yeah I mean because in order to open it up, you have to open large portions and it's not like you- can just open a little window and hold most of the sound in. I think which then kind of may defeat the purpose of the roll of cover and we did not. I did not make to make it a big issue. I just wanted to make sure, since it's going to be a stipulation that you know you'll be agreeing to christine I yeah on the page 10, which shows the opening and the capacity by area. I think it would behoove all of us to separate your second floor into the inside and outside, because the because all of those things we are discussing, no music blah et cetera. So I think that's a suggestion, yeah and I think Madison we'd asked your colleague to do that and you did update page two and five, but you did not update the chart right. Do that would be great okay, it's the page. It's page 10 of the submissions, so there's nine of nine and then there is stage which is multiple space floors. Oh yeah, yes, yeah. You break down second floor inside second floor outside okay, so that you in the future, it's clear to everybody, yeah, okay, yeah! These roller covers whether to deem them inside or outside you can label it. How you want, you can say terrace covered by roller cover, yeah, just something that distinguishes it from the true inside space: okay, brick and mortar inside space. Yep got it okay. Any other committee members comments. I got a question yeah on page 13, there's a blueprint and the blueprint shows the bar on the inside, but on the other side of the wall it shows that there are seats there and there's a retractable window now during the warmer time. Is that window going to be open and will that music be bleeding through? I'm sure we, certainly if the there's a window, that's capable of being open and you can have some cross breeze. That might be something that the applicant would want, but what cross breeze? If there's a roll of cover on it, it's no cross breeze yeah. Well, I mean I do not mean cross free. You know, there's no outside so you're talking about a window going from the traditional indoors to a window. According to the blueprint right here at your bar on the inside, just on the opposite side of that facing the outside, you have six chairs and a retractable window that is wide enough for six chairs for people to sit there. Okay, it's got to be a folding. It looks like it's a folding window. You know folding exactly, but if they have music on the inside, that's going to bleed to the outside. That's the point I'm trying to make, because that's going to wind up keeping open, that's all yeah Gary. Can you address if we're reading that the right way is that is that how this is being built? Well, what I underst from what I understand it is a retractable window and in the warmer months it will. It would probably be in the best interest to have it open. However, as Al had mentioned, that the music which is going to be on the inside may bleed out through this open window, but the sound is going to be barely audible on that terrace area. So I do not think it will impact anything well. I think we have to put some numbers on it. When you have an opening, sound can go through and frequently I'm involved with bars that already have a noise violation because the city came by and they measured noise out on the sidewalk. So usually the first thing I tell them, and it's just common sense is you do not have any speakers right next to the opening. You do not have any speakers and if you have speakers that are even remotely close to there, you point them away so that points the mid- range and the high frequencies away, and as long as there's a limiter on the indoor sound system which parenthetically I will say, protects the sound system from ever blowing up, then you've got the best of both worlds. So are you are you? Are you ready to put some limiters and taking a candles recommendation on the bar area? Say? Yes, thank you? Well, we would stipulate that you know. No speakers would be pointed outside this window. They would not be within a certain. You know footage. I mean we okay, how about this? How about? If which I think you would obviously do you will stipulate that you're going to implement all of the recommendations of the crystallog report right? The report does not test that the report tests the outside, but not the inside, going outside. That's it assumed there were speakers in the roller cover area right. Those were not going to bother residents right. So if there are no speakers in the roller cover area and we're all only talking about sound bleeding from the inside, it's it is even more attenuated than what Al tested well. No Al has to still put limiters on the indoor sound. Yes, okay, will you do that? Al yeah remember what I said before when Sound goes in through an open window or in this case out through an open window, it loses level in the case of an ordinary window, about 11 dba in the case of a large opening like this, which looks like it's, maybe 12 feet wide or something, then it probably is going to be more like 60 b, so I would say they really have to limit the sound level inside so that there's no speakers within eight feet of the opening. Okay, eight make that a stipulation, eight feet of the opening. None of them pointed toward the opening. Now this is getting too complicated. Can you just revise your report and then they'll agree to abide by it? All right I mean is that okay, Maston and Gary yeah we're really. I do not think it's a lot of work. No, I know I'm just. I just have a little concern that okay, so it's going to be background music on the inside, there's nothing on the outside and it was tested so the amount of overflow and then you I do not know limiters. You know when I go back to the client and say: hey: we got ta, you know you got to purchase these. I do not know how expensive limiters are, I think he's using limiters as a generic term. Oh okay, you just got to tell you can't have speakers within eight feet of the windows. Okay, yeah sure. Absolutely it's not equipment. I thought you needed some big elections. There are also limiters on the Al. So is that right, you were not talking about more equipment. You were talking about placement and such things yeah. Well, the limiter costs, 400 bucks correct so and very often, and very often very often it's built in you see when they buy the sound system. I do not sell sound systems, I used to install them, but they buy it from some company and the companies always want to stick in a device called a processor and the processor can do anything it can do limiting it. Can you know, do zones Zone one zone, two zone? Three, you get the idea so very often the limiters already built into the price of the sound system. It's not expensive. Okay, so you'll agree that our revises report and that Gary, you will implement all the recommendations. Yes, Sir Nick can we also say that you'll cl once you hit 10 and 11 and you're not using the roller cover space, all the doors and the windows will be kept closed. Absolutely. Okay, all right! Sorry! August! I'm done now! Well, I just knew what a limiter was a limiter. A limiter is like a little man when he hears the sound when he hears the sound go up too loud. He turns down the volume you try to override the little man. The little man keeps going and the little man always wins. It's a little woman and she always wins. Okay. On that note, do I hear a oh wait? Do we have more public comments? I had a question. This is tweeting the rollerco covers. Can you remind me how long they take to open and close like? Does it take 10 minutes to take two minutes? It depends on the roller cover. Some of them are motorized. Some of them are manual. It takes a few minutes either way yeah. So for this one particular location, I do not know if they're using manual or non- manual I'm recommending it stays closed all the time right. Yes, so you know I do not know they may want to purchase one that can't open it in the future, but we would have to go back to you too yeah. The application that's before us is that it's closed correct, so it does not matter if it's manual or whatever the opposite rule is automatic. Okay, thank you, okay, so it's a good concern, but not applicable for this application. Any other questions comments from committee members nelly. Anybody out there, no one I'd like to make a motion. Okay, let me just second, let me just summarize the step. Yes yeah. Let me just summarize the steps we have a lot of steps. The outdoor terrace will be covered with a roller cover which will fully enclose the space and be kept permanently closed. There'll be no speakers in the roller covered Outside area. Acoustolog will revise its report to address minimizing the noise coming from inside through the windows into the roller cover space. The applicant agrees to incorporate all the recommendations in the revised report and all doors and windows from the inside space to the roller cover space will be kept closed at all times after 10 pm or 11 P.M on weekends. You, okay with all of that Gary and Masten yep, yes, and revise the this tip form yeah. I do not think we need a step for that, but no I'm just saying yep I'll get that to Ellie tomorrow, all right and you had that revision of the gender of the limiter yeah. Okay, so we have a rob. Did you make a motion? Yep? I made a motion based upon all that. Second, yes, in favor, all right opposed abstaining present, not eligible. Okay. Good luck, guys! All right! Thank you. Thank you. Everyone. Okay item. Number, five 155, seventh avenue black water go ahead; how's everyone good! My name is Sam. I am I'm the applicant for 155 seventh avenue doing business as coffee project New York we're a coffee roaster, and we have multiple cafes in around New York City and we just opened up our new Chelsea location located on 7th Avenue between 19 and 20 street. This square footage of our location is about 1100, we're looking at operating from 7 A.M to 10 P.M from Sunday to Thursday and Friday and Saturday we're opening from 7 A.M to 11 P.M we're only looking at serving alcohol after 11 A.M, because we'll be having french and the liquor that we're focusing on serving as all coffee focus, so we'll be doing coffee, focused cocktail and also some beer from local brewery. We have about 15 tables and we're looking at sitting about 25 chairs, and it will be music that is going to be played on a sonos right now we do not have any outdoor sitting or so, but we're planning if everything works well with training and all we might apply for open restaurant to occupy the street seating for the future. Wait. Can you repeat that if everything works well with training? On our end, we might looking to open the open restaurant application where we can apply for street seating. A couple of questions you have other locations correct, that's correct! Do any of those have liquor licenses as of now none and broke our location in Brooklyn is in the middle of applying. We have past Community board meeting and we're in the middle of the SLA application, and did the community board recommend approval? Yes, it's approved, and that was for a full liquor license fully the license on your stip form. When we asked about sidewalk obstructions, you said you had a compliant sidewalk sign. Oh, that is right. So I am to my understanding. We are not allowed to be telling people on a sidewalk that we are serving alcohol, but because of the situation right now we have a scaffolding and we could not install our signage. So we have a let the a sandwich board sign and we attach the poster or that just to tell people we have coffee and sandwiches and we're at coffee shop. So that's the that's the compliant signage that we were seeing. Our concern was actually not about advertising liquor, but about having the sidewalk cluttered up awesome. So I'll leave this to christine to discuss I'll, take it over from there. So I have two questions just to remind everyone. This used to be a fika location and they had a beer and wine license. So it was already licensed to some degree, but this applicant wants a a full liquor license and speaker also was a coffee. What's called figure coffee pastry, they were swedish Norwegian yeah and we have just to summarize. While I'm talking, we got one email from a community board member saying that there are already four licensed bars and restaurants on this block, they're concerned that this is a back door to opening. You know a full bar and they think the block is getting oversaturated yeah. So I have two questions. One question is you say you are going to have a vestibule, a storm enclosure, one more time. You said it says: will applicants use a storm enclosure and you said yes: are those large plastic? You know enclosure which are at the door of the restaurant? Oh, I do not think so, possibly on the application. I might have missed it, but it's just going to be two doors and then open up and they would just go in okay. So we will change that and you'll stipulate. You won't have an enclosure right, enclosure, dormant closure. It's called western informant plastic in the winter doors yeah. I do not think so. It's just going to be a door, so that's definitely a mistake online, all right and then the second thing is that this discussion about the sidewalk sign. Where is your sidewalk sign right now? It's outside? Yes, it is outside, so our door opens up and then it is right by the door and we will. We definitely have more than eight feet of space for people to walk right, but that's not the rule is that it should be against the wall. I see. Okay, so if you could specify you know stipulate to that would be helpful, no problem. We can definitely move that back to the wall right and, as you've probably heard, would you agree that if you have any outdoor seating, you won't have any music? There? Definitely no music and no sidewalk cafe if it's in the street right. Yes, no sour cafe as well right, no sitting on the sidewalk at the same time as you are sitting in the in the streets, that's correct! Yes, thank you. Any other buddy from the committee have a comment question. Actually I do. I just want to run this by the rest of the committee they're opening from pretty much seven to ten pm, seven A.M, even with background music, the building's residential. How would you all feel about you know a business starting at 7 A.M on music on at 7 am at Saturday or Sunday. Would it be not more respectful to the people in the building to maybe start it like eight or nine Monday through Friday and on weekends? Maybe like nine or ten, I mean what does everyone else think about this? Well, I think that's a good point. The question is that is that establishment isolated from the floor above? What's the level of you know of music insulation between the store and the first, the second floor, so we're at the base of the residential area, but our music is really mellow. We play cafe music on Weekday. We open at seven, so music will be on by seven but on weekend we're actually thinking about opening at eight o'clock. So, instead of seven A.M, it's going to be eight A.M, I'm happy to see what we can do with the music, but in a coffee shop. Setting ambiance is really important, so we won't be playing anything that is loud and booming. So usually it's just more like a busanova jazz and it would not be too loud and we always have our doors closed as well, and this thank you for the answer. I appreciate the speakers of the same that were installed before who installed the speakers. It's us, so we do not have any ceiling speaker or anything right now. What we have right now is just one sono speaker on the wall, and that is like good enough to surround the whole space. We also try to encourage conversations. So it's a space where we want to be engaging with the customers as well, so anything that's way too loud. It's actually not good for us, okay Inga! You had wanted to say something and then yeah. I wanted to know who made the complaints from the community, because I am concerned it's a residential building and there are a lot of bars on this street. It was just one. It was an individual community member one email, oh just one, it was not a group okay, it was not a block and did they reach out to everyone in the building? Did people actually get back to them? I know they reached out, but did they actually speak to residents? We just opened up about two weeks ago. So far we've been seeing people who come in and ask us. How are we doing and then what are we planning to do so? We're not like a bar, we're actually still trying to be more of a coffee shop and and we're actually doing just coffee concentrate like more coffee team cocktail. So we're happy to talk to more people and all that. But essentially, our goal is just to be able to nurture part of our barista, who is going to be implementing some creative drinks from using coffee and cocktail, so that I think that there will be something that we are willing to work with the residents, if that's anything, but definitely not bar no shots, it's more like coming in and hey. I want to try this string, that is a paloma or like a dirty arnold palmer, where we're doing an honor power with like espresso, something like that. Okay Rob, to get back to your comment, the previous applicant Fika. According to that form, opened at 6 30 and at least the community Board never heard of any problems. So I was just looking researching that as well. Thank you, frank. Yeah, good point. Thank you. That is what I was going to say as well. Thank you were aware of that Kerry. Well, I was going to say that it because it was a coffee shop. Already I assumed that there was music and I was going to you- know inquire about whether there were complaints so yeah, okay, any other committee people comments, questions that was that to know from you tweet, I see you shaking your head. Okay, anybody from the community nelly, no one like to make motion. Okay again, let me just summarize these yes and soon. Let me know if there are any problems, you won't have a snow storm enclosure. Any a- frame signs have to lean against the building, no music in any outdoor space. If you have outdoor seating, it will only be in the roadway not on the sidewalk. Okay, did we second? Okay, all those in favor the vestibule should be fixed in the form yeah. I guess we're going to work on that anything present, not eligible. Okay. Good luck! Thank you! So much everyone! Thank you. Okay. Thank you item six times square 46 restaurant co-, op, 328, 330, West, 46Th street hi is Yora. Is your representative in the public chat? Mr Malta is Irene O'halloran with you hold on she's on the phone right now hi to the meeting. We should move her into the meeting, no I'll, do it myself, okay, she's on the phone with me, but I'll. I'm fine I'll answer my own questions. Yeah! Thank you! Costless! Okay, would you like to just give us a little summary of the operation sure so we're on restaurant roll? And basically I had bhutanesca, which was on 9th avenue at 56Th Street, and this will be puttanesca again. So it's going to be the menu is going to be crowd. Pleasers, the music is going to be Frank Sinatra, the Martin. It's going to be recorded music, nothing loud background, music, background music. Yes, it's going to be a white tablecloth operation and standard italian crowd. Caesars. Are you moving potenesca from Ninth Avenue, or is this a second location? No? Okay? So I was with you guys, I think. A year and a half ago I got approved for utensils downtown, which was 202 8th avenue. Unfortunately, I was not able to open it. I was ready to open it in Mid- march and unfortunately I can't open it right now until that thing gets healthy. So I have an opportunity to do this place on 46th street now, which would be the same. What was on 56th street and 9th Avenue from 1995 to, I believe 2016.. Can I ask you about the closing hours, because so this was the Brazil space right exactly so they their flicker license, went till 12 30 and looking at your putanesca, 9th avenue form that one only goes until 10 pm. Is there some reason you need to be open until 2 am here? It's not that I need to. I just wanted to be able to. You know utilize as much maximize as much as I could after theater. If I could get some people at the theater, you know it would be beneficial to me. You know, that's the only the other thing that confused me is that you say the certificate of occupancy is 120 people and the Brazil when they filed with us said the civo was 200.. Are you taking over less space than Brazil had? Well? I see it is 120 which was divided between two rooms, 60 and 60.. If we could I'd be happy with that yeah, I just do not know how they got up to 200.. I do not know. Is there that your pictures make it look like there's a back terrace, which is totally enclosed and you're, keeping that yes we're keeping that? Okay, that's part of the occupancy that I just stated say we're not changing anything at all: yeah, okay, basically, not changing anything at all. It's just you know. Okay, now, like we got a late email from a community member but she's she's here as a as an attendee. So if she wants to speak we'll, let her speak, but otherwise I'll summarize the email, okay, so there's nothing outside. So christine is not a storm enclosure issue, because the door it's inside right. I know I got it. Is there another question coming from you there's another question which is so? Obviously you are going to be taking advantage of 46th street to put your tables and chairs outside right? No, I do not plan on reopening until Broadway comes back, so no bro, but even then it's going to be permanent. So the question is: at that point: will you be? Will you be putting they allow me to within? You know the law I would do just the outside, but I'd be content at this point right inside. But my point is that once you put the the tables and chairs in the street, we want to make sure you are not putting any music there right and that new tables and chairs are put on the sidewalk, which no we'll not do that right. Okay, additional questions from committee members nelly: I have two people with their hands raised, I'm going to go in the order that I saw the hands go up. First person is hold on Christian hello here it is he muted? No, oh! No. Can you hear me now? No, yes, okay! I apologize. I was actually going to I apologize for not getting the email out. I actually wrote down a couple of questions and I did not know if it was preferential if I cut and pasted them here or if I said them out, go ahead and speak all right great. So I live right behind that. I actually like. If I look out my window, I see the rear of that building and I wanted to address some concerns that we had with the previous restaurant, and I wanted to just you know, discuss them and see what would happen. Even though the back is technically closed. It's not a brick and mortar back. It's like a plexiglas and the previous restaurant sometimes had music that would escape through the rear door. That's in the kitchen or that the base music was so loud that it would permeate into the apartment a lot of times the previous restaurant used to keep the rear door open because of airflow, and thus the music would leave, and although the applications state that there will not be a dj, they state that there will also be private events and sometimes those private events have djs or live music, and we would like to know how that would be addressed. Second thing is that late night workers, usually after the closing the restaurant, threw out garbage and did a lot of work in the back in the evening hours of like two and three o'clock in the morning, and then that would wake us up and that's another thing, I'd like to see how it addressed and they state that there's no accus acoustical support a report from a certified sound engineer. That's on the application, and I wanted to know if that was actually going to happen. Okay, so christian when they say what they say about music applies to private parties and everything else. So if they are agreeing with us to only have a dj, no one else can have live music. I mean, I only have background music. No one else can come in under their liquor license and have a private event with live music or dj, so that should that should not be a problem. I hear you about the sort of you know greenhouse thing back there would it help if they agreed to keep the rear door closed? You know whenever there were patrons in the restaurant and also not to you know let anyone you know go through that door after I do not know you know after they close yeah, I mean no, we want to be good neighbors, you know that's, you know we want to be there for a while. So whatever we have to do to comply, we will requires that, and the other thing is that in the restaurant itself I want to contain up front as much as possible and the back is I mean during the rush hour, so I think most of our business will be done in the front. There will also be was raised by Christian about employees almost like after hours hanging out, I will like I said. I want to be a good neighbor there we applied to that. Yes, well, I would say that the back door to the yard, no employees or other people should be able to go out there after midnight, I mean if they get a two o'clock license. You do not want them out there at one in the morning. You want to stop it at 11 or midnight. No one should be going into the backyard, so you should tell your employees no backyard, no opening the back door after a certain time, because 11 or 12 after that, it's ridiculous, yes to wake people up. Absolutely right! I have a question is: where is your garb? How is the garbage dawn because it seems that the garbage is stored or staged on the back? I do not know yet. I have not gotten into that, but right whatever we have to do to comply, we will. I do not know how everybody else does on 46th street. I have not crossed that bridge, yet so yeah natalie. Why do not we get a quick, real, quick out front of looking at the pictures and it looks like there's actually spacing proceeding so you're saying you're not going to utilize that space at all out front. I was aware that there was like five tables outside not using it, but we're not going to use that. So I mean is that their own kind of put that down is one of the stipulations that it's not going to be used then well Rob, those are on private property. It's like that. On paper, I mean we're going to try to comply as much as possible, we're not going to be in the streets. It's going to be on the property. It's like two steps down and if I have four or five tables that would only just bring people in we do not want to have any music there. I guess what I'm getting to is seeing how it is up front. It is part of the building front. Would you be willing on having it closer slightly earlier than your 2 am close time? You know what I would like to contain the crowd as much as possible inside in the main dining room, because it's a healthier energy. I, when you disperse the people, you lose the energy, so the main attraction would be the main dining room, but let me clarify it seems that there is maybe some confusion. The there is no application here to use the front outside right. This is not covered by the application right. You do not need to apply for a license if you do not use the sidewalk we're not using the sidewall yeah, but I mean in the stipulation form. We are asking some answers about the outside space and you have not answered any of that, so my assumption was that there would be no use of the outside space in the front. That's why I'm saying that I mean I'm not clear whether there is no. There is not five tables. If you wish not to put anything there, that's fine, but you know what I'm trying to do as much as possible. No, I just want. I just want to make sure we are all playing with the same deck of cards, best thing that if I needed those tables- yes, I can have them, so we should put tips there right. No, so I Irene and Mr Malta that there's a page on the stip form page five that has to do with outdoor space other than sidewalk cafes. So you need to fill that page out and that asks you if you'll close, that space by 10 o'clock on weekdays and 11 P.M on weekends- and I assume you'll agree to that. Yes, all right! So if you would ask your representative to fill out that page and then also on page two there's a chart that asks how much seating you have inside and how much you have outside and currently the form for outside says you know not applicable. So if you could correct page two as well: yeah Irene, you got that yeah! Okay, why do not? Why do not we hear from the other community somebody else from the community who wanted to say something? Yes, I have one more person grace! Yes, hi! Can you hear me? Yes grace, we got your email, but since you're here in person, I assume you'll address it. I do not have to summarize it. Thank you so much. I think it's mostly because living in the back, like what I think Christian said. We face that entire, that especially 228 and 3 30. I mean I actually go. Even I extend even more sangria 46 as an example is right on my basically eye level, so with all with all understanding, Mr Malta, what you're trying to do, because, obviously it's nice to have restaurants back and everybody happy and healthy. The my concern is again the outback, the noise, some of the things that were said kind of went in and out. So I just want to make sure if I may that I understand the with the terror regarding the terrorists in the back that has an enclosure. Are you saying that would be enclosed all the time or like Sangria 46? It would open and close? No, it would be enclosed all the time and then I also understand that there's no there's actually no dj or live music coming no just backwards. Okay, that does help a great deal. When are you scheduled to open? If I had a ball, I would say as soon as Broadway gets back, because it's going to be it's not going to be productive to open up until some sort of broadway shows come back right away. 120! That's it's around 30 40 people! Maybe you know, but when you announce it opening up, so I guess my main concerns have been answered other than you know, I'd just the board to also understand too it's just it's kind of gotten out of control. On 46Th Street I mean that's just the truth, and many of these businesses go well past the 12 o'clock on weekend hours as what he was saying with people out back after 1 am cleaning or whatever it's so noisy. I can't even describe to you so it's my urgent concern that will be something to the Broadway crowd. So when Broadway's over that's over and like I said, I want to use the main room as much as possible, contain the energy and the noise level, and so it's 2 am not 4 A.M. I thought the application. That's! Okay, if I can keep it on two. That would be nice if I get some of the crew or the the broadway gypsies from the shows that would be nice whatever I could do to maximize my survival there. That's what I'm trying to say well that beats four. That is that's better than 4 am and grace part of the issue here is so many of those places on 46th street have been there forever. You know and have 4 am licenses going back decades and we only try to pair things back as people you know come to get as is happening here. New operators come in and it's important to hear from people in the neighborhood. So it's great it's great that you came today because often we do not hear from a lot of. We do not hear a lot of complaints about 46th street. So it's good to know that there are issues. Well, I'm very grateful that you're listening because it's you know I hate to have to leave a building. I've lived in for over 30 years, but it has it's I'm definitely at that point and it's just it's a little much I mean I'm not. You know, I'm not young enough to be out every single night and partying it up. I mean there's even through, but I really want to be respectful of the city opening and I care about that deeply. I just it's: just there are times even a noise machine or like I have five do not cover the sound, especially live music when it was there before it was a flaherty's. It was, I mean you know it's just really challenging. So I'm grateful for you to have heard me and and Mr Walker also you know. Hopefully this will work out right, thank you and if grace, if you go to the Community board, 4 website, there's what's called the Nuisance reporting protocol that you know tells you how to complain about noise and other issues to various agencies. So you know you can't really complain about the entire block, but if there's a particular place, that is, you know becoming a nuisance. You should you know, use that information and start filing reports with 311 and the SLA, and you know ultimately things you know things add up and we try to help people resolve things. Well, I do appreciate it. Thank you. That's good knowledge to have. Thank you so much. Thank you grace so Frank. Can you recap the steps? Yes sure they're, going to correct pages two and five of the stip form to show that there are some outdoor seats within the property line, not on the sidewalk and those seats will be closed and vacated no later than 10 P.M weekdays, 11 P.M on weekends, there's recorded music, only there'll be no music in any outdoor space if they choose to use utilize outdoor space other than the front yard, the private property that seating will only be on the roadway not on the sidewalk doors to the rear yard will be kept closed at all times and, in particular, won't be open after 11 pm by anyone, including staff, and no one, if there's any unenclosed rear yard, no one will be there after out there after 11 pm motion to approve second, okay, all those in favor Aye President, not eligible. Okay. Good luck! Thank you. Thank you. Okay item, seven 331 west 51st street frank. How you doing we can hear you. They know me introduce yourself how you doing everybody. This is Michael Mastro everybody. How are you can you guys hear? Can you guys hear me? Yes, Michael, let's find out. What's up, I'm sorry, do you want me to start yeah? You can start yeah, because I do not know why my mic should. I start: go ahead. Michael's taking over the old spoon Fed space on 51st street he's opening an italian restaurant with his family members. The hours are 11 A.M to midnight seven days a week and we'll be happy to answer any questions you may have. I see that when you met with the Hk4954, you agreed that to be no sidewalk cafe that to be no amplified music, no open windows or doors Mike Michael. Is that correct? We can't hear you so every time I go to my video, it mutes me back. If someone could unmute me, that would be good. Am I still good? Yes hi everybody, I'm Mike good to meet. You! Sorry! Would you would you say Sir? I repeat the question, please sorry with the the 49 54 Block Association, Black Alliance. Yes, that's correct and you agree to some stipulations. Yes, you want to tell us about that. I have that Steve wrote us that you agree to no sidewalk, cafe: no amplified music, open windows, open door, anything else. Yes, that was just about it eileen the next door, neighbor that I happened to get to know. While I was doing a renovation in the building for the landlord she just you know she brought up a couple of things at the meeting and I was glad to to oblige the requests Michael. Could you tell us a little bit about your background in the in the restaurant industry eventually because I know have a contractor too right yeah, I own a successful construction company in the city and when I was a kid I started off in the deli in catering and then I moved up to being in a bar restaurant, from where I grew up a bouncer there and kind of like a manager, and then I came into the city worked around a couple of places and I found my way into property management, the real estate side of my life, and I saw a good opportunity with the landlord that I got to know in this situation. So have you have you owned or managed a restaurant before? Yes, which one is this bar sardine, yes, bar sardine, and along with that, before that I was at Port house in Nyack, New York, if you guys know the Rockin County area and are you the person, that's sort of going to be there? You know chiefly when it's open, or I mean how does that work with your construction work or you know other people with day- to- day, responsibility, yeah, absolutely like a construction company, there's foreman and there's managers and restaurants. So I'm going to have a manager staff and a head chef and, like any other business, just the pyramid of having a successful. You know restaurant. Will you be present there that time, of course much how much? How much of your week are you going to spend there? I see myself stopping there at least three four times a week. You know I'm going to be there to talk to my family, I'm going to be there to talk to the managers, probably going to be there at night, and you know I'll be there entertaining clients, but I'm going to make sure that my restaurant hopefully makes money in these unprecedented times and enhance the community with good italian food and a good crowd Michael. Could you speak a little bit about your family? Well, my cousin has been a executive chef for Hilton corporate for the past decade, and you know I've worked in the food business for a long time and we know it makes people happy and it definitely also makes money. So I kind of stumbled on this interesting opportunity through getting to know the landlord and okay Michael. So either you or your cousin's going to be there regularly, yes and or a manager, yes, so Frank and Michael. When southern hospitality closed, there were a lot of reports that a problematic operator in our district and one that owned another place down the street. A guy named bessem kukage, was actually operating illegally. Out of this location does qcad have any connection whatsoever with Mr Mastro or this operation or the ownership company Michael. That's your question. No, so you would stipulate because okay I'll be upfront about this. There have been reports that Mr Cucadge has been seen both at this address and one down the street that we're going to hear next 319 west 51st street. So is that not the case recently frank yeah? Recently it's like today, no, I was approached by some person who I think met with your community board in January or February. Apparently he was a front for this man. He came to me and told me that the community would have proved him and we did not have to notify the community. We should just file the application immediately. So I'm 64 years old and I'm doing this for 40 years I reached out to nelly who told me that you had actually disapproved this application. I believe this person was working for bessem, okay, so in other situations we've had people agree to this step. Can you guys? Let me know if these two are okay, the former operator at this location, bessem kukage, will have no involvement whatsoever, financial or otherwise in applicants operations, whether it's owner management manager, consultant or employee and besson, Cucad, has no involvement or connection with the corporate applicant, which I guess is 331 west 51St restaurant Inc. Will you folks stipulate to that? Yes, okay and then the next issue is we got a very troubling email just a couple hours ago from I guess, eileen who you were speaking about. She said your construction. Well, the construction workers at this location, put 10 or so bags of heavy garbage right in front of her building. Yesterday afternoon, I put the bags back in front of their door and off the street. There was no one at 3 31, so I went over to Maria, pia, where bessem Cucadge was supervising their interior work. He did not respond to me today. They again put five bags of garbage in front of my building when I tossed them back on their front space, a worker came out and said he did not know they could not put garbage in front of another's property. All the garbage is now on the sidewalk in front of 331. I do not think they have a private carter about two weeks ago. Their commercial garbage was picked up by sanitation. I just want to let you know, because these people do not seem responsible, so what's happening going to make sure all the garbage is cleaned up and eileen does not have that issue ever again, but how did it happen in the first place? Yeah? It does not seem like a mistake, a mistake, a mistake by the workmen, no a mistake by the workmen, but it seems like purposely letting the public sanitation department pick up the garbage which they should not be picking up since it's commercial garbage. Is it definitely construction debris? Do we know that? Well, I was. I did not look in the bags. There was a you know at the restaurant that I'm hoping to take over it. There was a lot of stuff in there and it cost a lot of money to cart, garbage away and having a construction company making this investment into the restaurant definitely trying to save costs where we can and if it's, if it's rubbish that can be picked up by the city, I'm I made that call I it did not mean to be placed in front of Eileen's property at all, but I did. I did make the decision that you know the rubbish. That is not you know any kind of sheetrock or anything that would require permits or work like that. It was just it was mostly rubbish and- and I apologize- and it won't happen again to the to the board in the community and I'll apologize. Sorry lean personally, I spoke to her today. Are you doing the construction work at 319, west 51st as well? No, okay, because, okay, thank you for being honest, yeah! Thank you really much appreciated there. So I just to finish so. Eileen also sent an earlier email concerned about the this is a two- floor space right, yes, and I do not think the private. Unfortunately, the prior applicant was not successful enough. I think to use the second floor often, but before that there was a bar there, that was really a nuisance. What are your plans for the upper floor? Is it the same room? It's a dining room, okay, so it's still only no stage no performance, it's a dining room with a service board and only only background music, only background music, okay, so midnight seven days a week. Today is the first floor. Oh wait. I thought it was 11 at midnight from 11 to midnight, right, 11 A.M, to a minute from 11 to midnight, which is good. I mean it's just fine, I'm just checking Steve Bolita's email. Someone else can go ahead. Question the tables that are within the building line that are still outside you've got them listed here. If you use them, will you agree to have them close by 10 yeah? They did. They said that? Okay, thank you. I missed it. It's in page five. I I'm looking at well, I I'm looking at their thing and I do not know what, but it has inside outside and then above it. It's got music and that's why I was looking but anyway, okay. Thank you. Any other committee members. I have a question same question is: are you going to use open street dining in the on the parking lane? You know we did not discuss open streets. I did not know it was definitely going to be permanent christine we had planned. The hope was by the time we opened. We would not have a Covid-19 situation yeah, but if we do and if it is permanent, then we would like to use it okay. So the same stipulation you have heard before, which is you know it's on the in the parking lot on the sidewalk and no music whatsoever, that's an hour with attention street. I have no problem with that anger. I have the same thing. It's my you know. If you're going to use the street open street, which is good just make sure the sidewalks are kept completely open, no signs, no stuff right. Just keep the happy to use the streets, keep the sidewalks completely open. Mike! You go with that 100, whatever you know, whatever the Community board suggests, I'm going to be good with. Thank you. Do not say things like that. Maybe you should listen to your lawyer. That's a good suggestion. Keep me out of trouble. Okay, any other! Any committee yeah wait a second I'm trying to find Steve's other email. Meanwhile nelly. Do you have anybody from the community with a hand raised? No okay? I guess the question I have 11 yeah 11 A.M to 12 is fine with me yeah. So the question. Well, let me go through the steps and then we can figure out how to deal with the bessem issue. You'll have those tips. I read about bessem having no connection with this right. You're! Okay, can I stop you, for a second frank, was vessel involved with the last operation? He was he. There were multiple community reports that he was operating there illegally closed in spoonfed yeah, and then he was bringing stuff over from Maria. He was sending overflow business there I heard he was in the place before spoonfed no spoon Fed closed. He was still in Maria, pia before he got closed down in Maria Pia. He blogged he carried liquor back and forth between Spoon Fed and Maria Pia. He sent overflow customers there. I have little doubt that happened because we heard about it. I did not see it personally, but we heard multiple community reports at the time and nothing more happened, because he was closed down in Maria, pia shortly thereafter. Okay and we're getting reports now that people have seen him at both of these locations. So we just have to be cautious here and the SLA has asked us to alert them whenever anyone tries to move into any of these spaces, so they can investigate and make sure there's no bessem connection. Okay, so we'll have those two stipulations background music. Only if you use any open streets or open sidewalks you'll only put the seating on the roadway and not on the sidewalk and you'll have no music whatsoever in any outdoor space motion to approve wait. We have not. You have not decided hold your horses, he paused too long. Okay, so the Michael Stupalita at 4953 sent us an email saying you agreed with them to the hours of 11, am 11 pm, Sunday, Monday, Tuesday, Wednesday, Thursday and then Thursday Friday Saturday to 12.. I'm sorry who said that Eve Boleta of the 49 53 Block Association met with more than one Black Association Mike Block Alliance. They cover all four blocks. Did you agree to cut the hours a lot has gone on since that meeting I've been pretty open to any and all suggestions to from the Block Association and the board members on this call. I do not remember exactly that's that detail. That's true! That's too early to shut down, that's crazy. It is okay. Well, Steve also said you agreed to soundproof the second floor due to its proximity to residential units. That's I did not. I did. I know I did not definitely agree to soundproof the entire second floor. I mentioned to Steve and eileen, who were on the call that I would only be having background music and I would be keeping the speakers away from the window. I do not believe that I agreed to soundproofing the word for word soundproofing, the entire second floor I mean Nellie is Stephen Steve's, not on the call. Is he no? Okay, I'm only going by his email, and this is what he said. He meaning Mr Mastro also agreed to soundproofing the second floor due to its proximity to residential units. Our concern is that this is a residential area which already has more than three liquor licenses in the block. Were there complaints with the prior operation, noise complaints, not the immediate prior one, but the one before that one before that was a bar, though right yeah, you know, I mean Steve is one of our more reliable. You know Steve well, Michael you're a contractor. Would it be a big deal, sound proof. It would not. The only reason why it would be a big deal is because you have exposed brick and it's not going to look tasteful to put a line in yeah and there's probably four there's, probably four courses of brick between the what about doing the ceiling. I would not. I would not mind adding. I would not mind adding another: it's not going to be worth the complaints down the road Mike yeah. If we give listen, if we need to use this special soundproofing glue and put up another layer of sheetrock on the ceiling and put- and you know, do construction on the ceiling we we can definitely do that to help prevent the prevent the noise for eileen and any other neighbor that has ever complained, but we're not going to have loud music. It's background music and 10 11 12 o'clock, we're having people eating, not you know a bunch of kids rolling out of rolling out of wherever and coming to make noise. It's not that kind of establishment. I think doing the ceiling would be a good, a good, reasonable compromise. Michael. Let me tell you: what's bothering you what's bothering me? I mean you know. We've now heard things from you know, community members. We know pretty well that are sort of complaining about things you did and I sort of contradicting things you've told us they've, said you've told them differently. I mean eileen in particular, has sent us. You know two, you see you seem to be saying you're getting along with her and she's sending us emails. You know that she has all these garbage problems that she's worried about the noise. The fact is that the garbage you know, I'm just concerned that there's some real lack of communication going on here. Well, I spoke to eileen today and she I've spoken to her, probably 25 times face to face over this entire summer. We've always been super cordial and friendly. I'm sure that the writing in the email is probably coming off negative Frank and like me, and her have a problem, but we do not. I'm definitely going to address the noise concern with doing spending extra money and doing extra construction to hopefully satisfy an issue that has not come up with me. Yet just as a preventative measure and in regards to the garbage taking total responsibility will not happen again. Okay, so frank, how are you what sort of stiff do you want? On the second floor? Soundproofing I mean how would or Michael how would you phrase it I'd phrase it that we would, you know I'd go as far as being detailed and saying we would use a soundproofing glue that I've used before and all that soundproofing other apartments which is expensive and using a soundproofing sheetrock, which is also more expensive than traditional construction on the ceiling. Is there it goes yes, okay, so can I ask a question just on the on the soundproofing glue and the sheetrock that is adhered right to the ceiling? That's there already, the sheetrock! That's currently there correct that's correct, but if you leave a space, if you use, for example, wool insulation, which is soundproof and fireproof, and then you know a couple inches with the next layer of sheetrock is not that a better soundproof, because there's space in between the applications that I've used and the research I've done, the glue works really well along with these rubber. These rub it's going to be put around any fixture or any kind of breach through where any lighting is coming through so between the rubber couplings. If you will and the glue and the soundproof sheetrock it's worked well for me on many projects. I have not used that application. I'm not opposed to it. Okay, just curious what the difference is. Okay, so anger. Are you okay, with sticking with what he proposed yeah? If yeah, I'm just, I thought that more space you know, sort of room within a box within a box gives you more sound proofing, but maybe right yeah. I do not know I just I do not know, but if you say that this other way works, then that's fine. A space cap actually is good because it adds insulation as well as it stops sound yeah. I do not know the. I know the wool insulation is the sound proofing and then the sheetrock is another soundproofing and then you've got at least maybe four inches. I do not know. I think it's my with all due respect. I think this might be more of a problem if the restaurant before had posed a problem, a noise problem we're doing that right. I understand there was a bar in the prior incarnation right. I went to the previous restaurant a lot and yeah what yeah and the second floor was never in use any time I was there we're hoping we do not have that. I know I'm saying I'm not sure. I'm not sure we can say that the lack of you know the lack of noise had because I do not think they ever had anyone well just as long as Michael is aware that it needs to be well sound proof because he does not want to come back and have to do it again, so whatever he uses is up to him. I guess he's this. I'm very controversial totally aware of that. I was raised by four women. You asked me something once I'm doing it. I do not want to hear about it again, all right. So, in addition to the other steps, I read we'll say that the applicant agrees to sound proof second floor space ceiling using soundproof, glue and sheetrock on ceiling right all right, and I suggest we do what we did with all the other bessem places same thing, I'm sorry Bert and tell the SLA that you know we do not have the ability to investigate that does not that have there had been reported connections with bessem cusack to this space. We do not have the ability to investigate- and you know, would recommend denial unless they can confirm that bessem has no connection and if they confirm that we recommend approval with these stipulations. I think you may have said that backwards. Frank. I think he said he said it. Fine recommend denial unless the SLA can determine that. Determines that there's no message it would be if the SLA determines right that there's no connection, we want them to do and to investigate, because we and you would approve if the SLA said the pessimism is not involved. No frank: we we're always denying so okay, but let me understand you're going to deny unless we agree with the stips and the SLA finds the best one's not involved right. No, we did not. We want this to get up to the three commissioners, because it's what they asked us to do in order for that to happen, we have to deny so we are denying, because we can't determine that bessem is not involved. If they determine that, then we are okay with it as long as the stipulations are in effect. Why does the three commissioners have to do that? Not that I care that much except you're waiting like three months of the approval time. I have a. I have a way better question, sorry to cut you off boss. What can I do to prove that I'm in connection with the landlord, and not this guy, that you're talking about what do? I have to do as an applicant to prove to the board right here right now that I'm trying to open up a business to feed my family and enhance the community, because I stumbled upon a good deal where I was doing a construction project so who just quit? Who are you doing the construction project for the Landlord Upstairs? I was renovating one of his apartments. Yes, okay, yeah and down downstairs is obviously how I'm trying to feed my family and I'm not for alcoholism, but I'm for a good time and reasonable drinking and that definitely helps my operation feed my family in these crazy times. I'm definitely taking a risk here, but I would definitely ask the board to hopefully make a motion to approve me. Instead of sending me up the road for nothing that I did wrong. Well, the footwork, by putting the full board approval on you're, adding three months to approval time. That's already six months so I mean so. The USA has to do its due diligence, whether it's the commissioners or investigations right. Let me ask a question: what is the involvement of what bessemer or whatever his name is with this place? There is none. I do not even know no wait. Michael, I'm talking to Frank I'll coach, you I'm sorry. Okay, so bessem had never had a restaurant in this place. He has Maria pia about five doors down right. When spoon Fed closed, we started getting reports that bessom had reached a deal with the landlord to use the spoon Fed place and was supporting it with liquor from Maria Pia. He was sending overflow clients down there and we heard those reports from several community members before anything could happen. The SLA closed down, Maria pia, which had the effect of closing down anything that was going on at spoonfed, but he's never had an official connection with this address. So what about we put in our letter? Just that you know, bessemer, never had a connection. However, we were aware that some customers and some activity was taking place there in Israel. You were aware, we would say there were communities right and you can say they were report that you know it was even though you did not have a license to wear activity related to in connection with Maria, pia here, and you do not put in the stipulation that we deny unless they go to the three. But you just put that we are. We are concerned about that and do it just as a regular deny unless right yeah, because we do not want to it's hard enough for restaurants here, but the fact that both this location and Maria pia before us again in the same month, but I guess yeah I mean, if is because Michael will agree to those steps wait Frank can I talk to you for one second Michael's case was on the September calendar. We were ready to go at the request of the Block Association. We pulled it off to give him the opportunity to yeah so now by coincidence, they're both in the same time yeah, but it looks suspicious so given that Michael will agree thanks for refreshing, our memory Frank, given that Michael will agree to the steps about no bessem connection, and you know we will flag this in a cover letter with the stip form, but I guess I'm okay doing it. You know if they you know deny, unless they, you know, determine that. There's no bessem connection and all the steps are agreed to right yeah, because it's hard times for restaurants and we do not want to give them three months longer. Alright, are you okay with that motion? Second yeah, I'm not go with the crowd. I mean. I we've had this issue before with other irrep disreputable operators, and we proceeded in the same way that Frank had been suggesting. I know, but times are different and I hear times are different. I tend to trust this attorney as well as being reputable. Do you hear that Frank yeah he's got a huge burden on me for next month seriously? I I've we've dealt with him for a long time and I think he turns down clients that are not as reputable and he has to come back again to us he does next month. I had a question go ahead. This is, I was not sure if there was any resolution with the inconsistencies with the 49 53 block alliance of Sunday to Wednesday 11 to 11 and then Thursday Friday, Saturday, Sunday 11 to 12. that was still open was not it. I thought it sounded like people were in favor of giving them midnight three nights seven days a week, yeah. Yes, I will follow up with Steve to try to find out what happened right since there's no one here from the Black association right. Naturally, we can't and frank if there's some bigger issue here, I'll contact you and maybe we can iron it out before full board. Michael came in with reason. Well, I think we're reasonable hours. It's a it's, a residential block. It's not! No, I'm not with the hours. I'm talking about the discrepancy with what Steve seems to remember and what what Michael does. This is going from us to the full board so there's time to find out. If there's anything in dispute reach out Frank. If you need me, I just want to make sure Steve a you know does not feel super strongly that this b11 and I do not see any reason he would okay. So, let's just us, thank you tweet do you want to summarize. Is that possible frank sure, they're going to be the stipulations about bessem, having no ownership or any kind of relationship with these operations or the corporate entity getting the license? The applicant will sound proof. The second floor space by using soundproofing glue and sheetrock on the ceiling there'll be background, music, only they're agreeing to our usual hours in the front yard space. To the extent they use something outdoor space beyond the front yard, they will only use the parking lane and not use the sidewalk, and there will be no music whatsoever in any outdoor spaces. Can we just add one thing with restaurant trash that it will be taken care of by the restaurant on front in front of their restaurant or yes or in the parking lot yeah? But if we just say all garbage during construction and operation, you know will be kept in front of this address. Only that's good. It will be disposed of according to sanitation regulations, which means he has to use the card Franken Michael. Yes, I mean we have not signed the lease yet. But yes, well, that does not mean you can't put the garbage. Well wait. Are you renovating it for the court yeah it's, but it's the it's, not our space, we're renovating yet, but that's all right we'll do it do not worry about it, where's the garbage coming from the renovation upstairs apartments. Yes, oh I thought you were renovating the restaurant. This is of thing. Let's see, two of you should not have, I think, in front of us right. What can we renovate I'm good with the I'm good with the Landlord Mike like Mike, you know Mike likes me. He thinks I'm a nice book later. I'm still going to follow Christine's motion and second, okay, all those in favor aye opposed abstaining present, not eligible okay, with a deep breath. Good luck! Thank you. Thank you all please come by, for you know, hopefully a cocktail and some italian food any idea what you're opening, hopefully, when I, when I get this liquor, license yeah you have to sign a lease. Also yeah! That's no problem! That's no problem guys! Thank you! So much be safe, come by please! Okay, thank you. Guys see you next month, bye. Okay item last item on the agenda: eight three one: nine right: next door: West 51st street: how are you guys doing my name's Kevin Marcel? I'm opening up bella Valentina on 3319 West 51St street. I work across the street from the from the place itself. I work at the Washington Jefferson Hotel, I'm the chief engineer over there as well. I've been staying in this block for the past seven months. Actually now any questions yeah. So what's your experience in the sort of restaurant industry have you owned? I use I used to work. I was I'm sorry, I'm sorry boys. I used to be a chef at the marriage at the Marriott in Ride, New York and then pretty much. I had left and I was more dabbling into different types of careers, so I went from being a cook to being on a mechanic to being in. To being a chief engineer, I just could not make up my mind really. A friend of mine was like. Why not was actually my cousin who told me why not open up a business, so you say why work for other people want to work for yourself. I was what you're right so I opened up. I actually have a mechanic shop, but I will it was my girlfriend who actually was the one who tried to say: why do not you go into food being the fact that I like to cook a lot, so I was what why not so you've operated a business with employees correct, and this is your first restaurant. This is my first restaurant, okay, great so both to Committee and Kevin. So, as you probably heard from the prior discussion, this is the other. This is actually a an official former bessem q catch place, Maria Pia, where he had operated and where he was closed down from the SLA Kevin do you know, did cues had q- Cadge's license actually get revoked. There said it again: did the prior operator's license actually get revoked there, or I think it has because I'm the one who's actually, I'm the one who's planned for a liquor license now it's meaningful for legalizing. That's a problem. I think it has. But the problem is we heard this from another lawyer who's trying to take over one of the places that if a license has been revoked, you need a waiver from the SLA to get a new license within two years of the same place. Not anybody not just you did you talk to your lawyer about that. We have not really spoke much about that, because from what I from what he has told me, was that being the fact that I'm, I guess the new I knew the new tenant. I guess in that, in that space being the fact that best this person besson, is not there anymore pretty much. He did not really tell me much about. He just told me pretty much. I would. I just have a lot of work to get done within it, but he has not told me about that, though. Okay so nelly at the Community Board office, emailed your lawyer a bunch of times over the past couple weeks, and we never got any response. What are your intentions for that back room that is sort of the backyard, but it's enclosed garden yeah. I wanted to do seating now. I understand how this block is. I know that we had. This block has had a lot of has between noise pollution between cars zooming in and out. We have between people playing loud music. You have between a bunch of restaurants between the mexican restaurant. That's right down the block towards the pizza shop, that's right across from them to vice versa, right pretty much right across from me to another one and then to another italian restaurant right there, plus on top of that Mike's restaurant. That's right! There also it's it is now Kevin. I had a simpler question: are you going to keep getting close to the way it is? I want to I'm going to keep it in close okay. So, but I wanted you I wanted to use the outside. I wanted to use that little space. At least I could put at least four tables into a little space, that's kind of like a, I want to say not a stupid before Bef after the sidewalk itself, because I know your garden in the front yard. Yes, I'm talking about the back. So in the back. I just wanted a couple of tables, but I wanted to just enclose it, but at a very limited time offer like pretty much from a certain time to a certain time and that's it compared to the rest of the world you're going to keep it enclosed. Yes, because here's the problem- we've gotten a bunch of applications through these spaces over this space over the past couple years and people have claimed that enclosure is illegal because it raises the capacity above 75 and therefore you need a public assembly permit and two exits and all this stuff has have. Has anyone looked into whether that back room is can be legally used like that? It can be? I have to just I have to make sure I just have to make sure one other person real quick, but supposedly enough it can be being the fact that it's been it's been with the property for since five regulations. So it's very important that we keep your customers safe and that we have the right. You know exit for all the people, so that is one of the issues for this the use of the backyard. I think there would not be enough exits for everyone, so the last factor has been used was the fact that it's existed for x amount of years does not make it legal. It might have been illegal from the beginning and dangerous endangered right. So couple things our district manager is has is working with the fire department and try to find out. If this is legal or not, and then the last time we had an applicant for this space, the applicant agreed to the following applicant will not use the enclosed rear yard until the Department of buildings issues a certificate of occupancy or other approval of use of the space and will notify mcb4 of the certificate. Kevin. Are you okay with that, I'm alright with that? Okay now Kevin. So what is what is the name again of the previous owner of Mariappia? Is he? Is he part of your corporation? Are you going to have a corporation? Is he part of a corporation? Is it funding is just giving you any funding that first, I do not know bessem. I have. I never really met him. I know from hearing from what everybody says that he's been around so far enough, but he's not part of me he's not part of he's, not part of he's, not part of my Kevin Empire restaurant, okay. So, what's going on, are renovations going on in that space? Now, I'm just trying to change the I'm just changing. I was just trying to change everything out, as in I'm doing the I was just doing the front facade, okay, but you're doing that. Yes, because, as you might have heard, we got an email from a community member who said she went over there today and Besson was there is. Does that make any sense? No, unless he's is he was he in the building or was he just there outside? I all I know is that she said she went over to 319 and he was there because it's so fun up like because I'm even like Nah, I'm in I'm right across street from the property yesterday I was outside, but I did not see this man, but I mean you have not seen him in months right. I have not seen him in months. Actually I've got. Would you recognize him? I know he looks like okay, I've seen I've seen a picture of them all right. So will you stipulate the way the prior guy did the former operator at this location? Bessem cucadge will have no involvement whatsoever, financial or otherwise in applicants operations, whether it's owner manager, consultant or employee and bessem kukage, has no involvement with connection to or ownership interest in the applicant. What's the name of your company Kevin Empire and Kevin Empire restaurant yeah? Would you agree to those I do agree to it? Hey Frank. I got a quick question up front between where the restaurant is and the space outside on the diagram. It's showing french doors. Is there any way of stipulating of having them shut? So the background noise does not bleed into the front yeah. I do not have this the form in front of me. Did he fill out page five or six and agree to that already, except it's very it's very difficult to read. I do not have very bad. I was the worst, I'm writing every time. I'm so sorry right, I can't even figure so the cross is when you rem, the cross means that's out, and the answer is the other one right so, for example, real yard. Okay, so we are moving to the front yard and he said Sidewalk Cafe will apply. Can be applying for sidewalk cafe now in the future, and you said yes, oh because we have the front yard okay and then only it liquor license include. But then you say the sidewalk cafe is not included in this in the liquor license. So I do not understand that because it looks like it's within the property line, but it's french doors between the restaurant and the outside. No, I know that I'm just saying the answers on that list are a little confusing, as applicants submitted an application. No, it's in the front yard. Okay! Will the applicant vacate by 11 pm and it says no, so can you help me about Am, I supposed to read the column which is crossed or the column which is not crossed. It looks like all the answers are wrong. I think I think the x's mean it's. The one he's agreeing to right is that the word Kevin, which switch page six page six gotcha now page six is my Edward cafe page yeah, it's a sidewalk! Cafe we made page five. Well, both I mean both. It does not have a sidewalk cafe! Oh yeah. I do not have a sidewall cafe, it was pretty much applying for one but being the fact that I'm using the garden itself not the front of it itself. That's what I was that's what I was pretty much mentioning so could you explain when you made a cross in the block which says? Yes, you meant that's what your choice is, which block exactly okay, page five H5, you know, have you read the rear yard policy? What's your answer there? That's actually six here! Oh sorry, I'm going by the number on our form, not the form, not the yeah, it's the actual form, yeah, all right so page. Six, six is the sidewalk cafe page is not it! No! It's five yeah! It's page, five of the form page five of the form, maybe a different number than the no that's the one so anyway, so page five for me is outdoor items or other than sidewalk cafe. Right, yes, which is what you have right correct! That's what I have. Okay right, go ahead, Frank! So the first question has the applicant read: Mcb4, really, art policy? Yes, okay, so by putting that x, you meant yes, I read, I read the roof. I read the rooftop policy, okay, and so that means you said yes outdoor space. You agree to close it by 10 and 11.. That's correct! I only seeded food service, correct. If you have music inside where windows and doors be closed, you said yes, no standing space. You said no yeah, no standing nose like it's like saying the let's say the bar: that's right down! That's right down the block, they have people who actually just stan. They have the tables where they just stand and sit the way they have the tables where you just stand, no chance. No, nothing! I'm not doing you're going to have seated patrons. Obviously everything is seated. The answer should be yes, then, on this one, it will change it to yes, that you won't allow people to stand. Okay, Rex are the answers, yes and then there'll be no, no music right. You said no music, no music outdoors. What do you mean? Yes? Do you agree? There'll, be no music. Well, there'll, be no amplifier, music, okay! So amplifier! That's what got me a little confused both of those are actually yes, gotcha. Okay, so we need to add something about the open doors, but the doors are on page four. Then right on page four, we have. Where are the those questions, because you have you said you're using building design yeah? Can you close them whenever there's music played inside and after 10 and 11.? That's perfect right and he crossed yes, which is good? That's fine! I was just so confused. I mean, I think we need to make a little. You know, because you know what it is when it came to amplify. I'm thinking, I'm thinking more, like a like a big base where I'm just I just have like more sneakers, well Kevin you're agreeing not to have any music at all outside yeah, correct, I'm not doing any music at all outside. Okay, trust me. This block already has enough noise, as it is. Oh, please, yeah and then, if you do a open streets, open street, open dining whatever? Will you put that if you put the tables in the in the street, you won't put them on the sidewalk right, correct, yeah, it's just yeah, because I seen the sidewalk we have those sidewalks. It came. It's lucky enough to even fit two people already on that side. There's nothing on the sidewalk yeah! No, but never! I would never do that. Okay, so I'm good with that Frank. Could we make a note somewhere that the X's mean you know the x? I mean it's very confusing. Look like they are right, okay, so Bert. How do we? How do we deal with the bessem issue on this one? Because he, you know, he's had a closer connection and you know we we've had other applicants that we've treated. You have to bring it up. Oh, it has to be mentioned yeah and stipulate no connect, no connections at all right. The last applicant here our letter was, as christine remembers an outright denial unless the SLA can determine. There's no bet some connection right. If they determine that it becomes a deny. Unless right, you should do the same thing. Do it the same way because it was one of his restaurants yeah? This was his reaction, which is different than across the street: correct: okay, yeah! It's also the issue that you raised Frank that Kevin has to bring up with his lawyer the issue. No one is allowed in that the possibility that no one is allowed another liquor license in that space until two years passes unless they get a waiver from the Sli right. I do not think we have to stipulate to that. That's the SLA will do that. I think we just have that's Kevin. You should bring that up with your lawyer. No, I am yeah. Your lawyer should know this and, as I said, you should really try to look what you you're agreeing to work with the DOB to figure out if the rear, if I can use the back yeah if it's illegal man, our conditional approval, is only that it's enclosed. If you, if you want to ever open it up, you'll need to come back to us. Okay, not understand, but I think that's important for the lease. If you have not signed the lease with the landlord, no yeah, I have not. I have not signed it yet. My point is that you should bring it up that you can not use the back or it's going to be a much smaller place. If the back is illegal, that's what I'm saying it's not it'll, save you on rent, exactly yeah! That's what we're trying to negotiation. Okay nelly! Is there anyone from the community about this applicant? No one has a raised hand. Okay, thank you nelly from the committee, or shall I summarize ocean? Oh well, okay, all right so Kevin! These are the additional stipulations. The very yard will remain enclosed, as is presently the case. You won't use the rear yard until you get a certificate of occupancy or something from the department of buildings saying that use is legal you'll. We changed the two answers on page five that says: yes, there's no music and to extend you use any open streets. You won't use the sidewalk. You use the roadway only and there'll be no music whatsoever in any outdoor space. Correct motion. Second, those in favor aye abstain. Present. Not eligible okay, good luck and Kevin, could you help me? Thank you maybe maybe have when you talk to your lawyer. Maybe have him reach out to Nellie and get my contact information, and maybe we I can talk to him about some of these issues just to make this kind of fun yeah. Okay, thank you. Thank you. Thank you. Everybody have a good night and thank you all yep last time on our agenda, some possible stipulations that we might want to consider for the open, dining christine is the author, and you may want to introduce them christine. Okay, so you all have the documents to based on my understanding that the open dining is now permanent, which is what bill De Blasio said, and the understanding also that the open, dining is not going to come in front of us at the Community board. I think that just like we're talking about you know outdoor space, maybe it makes sense to expand our outdoor space stipulation to include the open, dining and then ask the applicants to you know, comply with what we would prefer, especially because DOT has not been very strong on the on certain item and it's very confusing between the SLA and the and Ndot who is in charge and who has the guidelines. So what I did is I took all the items that which are already in the footprints which are already approved by which are in the DOT guidelines the complied with the duty guidelines, the tables on the sidewalk. No curbside. Will you leave eight feet of sidewalk? We know that, except we are making it a little stricter than what it is today. If the table are located on the parking lane, will you leave the sidewalk completely free? I think that Ingu has embraced that we had a letter that we sent to as Cb4, which says they should put their grab and go counter inside the establishment so that there is no line outside and we have already voted on that, and there are two new ones here: let's not discuss them, but I'll take them through, but the two new ones. How will you ensure that there is no standing patrons in front or 20 feet on each side and the second one with? Will you limit the number of table and shares outdoors to a maximum number and we'll come back to that? The next one? On the hours will we comply with you t hours of operation, which I think is 10 and 11 like our hours and music background? The recommendation would be no music outside at all, and you know we have the choice between saying yes to outdoor space or not from the storefront or just no outdoor music. I would prefer no outdoor music, no live entertainment. I'm saying that, because on 46th street there is live, entertainment and the whole street is listening to that and if windows are open and those are open no amplifies sound inside, which is what we already have so of all those things. There are only three which are new in a sense. The first one is: let's talk with the music. My recommendation is no outdoor music. This is something we have asked all the time and that's the law right now, it's very ambiguous when they have the the open dining, but I think it's a good idea to have no open music, because when you have open music in one of them, since everything is open, the whole street has opened music. Well, christine we're not talking about a policy right, we're talking about adding a question. Yes, so the question could just be what we're asking people tonight you know: would you agree not to have right exactly and then we can discuss whether there should be an exception right. Exactly the context of this is that the open dining they do not have to come to us right? Well, that's true, but when we ask us we ask them in advance this is these questions will be thrown out at an applicant if they're coming for a restaurant right license and we will throw these out at them, not that they have to and they want to go for open dining. They have to come to us, but we're going to say to them. If you go for open dining yeah, would you agree to these exactly just like? We did what's your reaction yeah, but we need to understand that they do not have to agree with us. No to get the open, dining, no we're just asking them just like in a lot of cases, we're asking them to do things which are stricter than the law yeah. We are asking them to. You know, be nice to their neighbors and do not do this. Okay, and I agree with the phrasing yeah and if they make a good case that it's not going to bother anyone, you know, then you know we might not care if they have outsold music. No, if it does not bother anyone yeah are we going to let them know that they do not have to say yes to these things. I mean I mean, let's be serious, now yeah, that's a good point Michael! Well, no, just like we are telling them. You know on sidewalk, cafe we tell them it. We like it at 10 and 11, but that's not the law, and we have a discussion about that right. Well, yes, and if you fail the same way that we know it's, not it's not a restriction right now, it's background only, but we will have the same discussion with that. Then you know we've got to remember that we have no enforcement. No, we do not have the living, they can come to us and say: oh yeah. We like this we'll agree to it, and these are questions, we're throwing yeah right and then six months later, when they actually go for the outdoor dining and they do not follow through all that says to us. We have no ability to say hey. You said you were going to do this and you did not. We have no enforcement to take the outdoor dining away from them. The only thing we do have is the next time they come to us for a renewal document or anything. Hey guys. You lied to us right and they say. Oh, we did not. We just changed that up. It's almost like the same way with storm cloud, enclosures right exactly it's a lot. It's the same way for a lot of things. So my next question is about limiting the number of table lift chairs outdoor. If you heard the new, the second version, open, dining version, two zero is: they are going to be allowed to version one zero. They were allowed to have chairs right in front of their footprint. You know their facade right in version two zero. They are going to be able to expand on both side right. Okay, they can expand. If there's a dress shop next door, they can put tables in front of the dress shop right. They need permission of the other. Yes, the landlord of the adjacent spacecraft, yeah right, obviously, but here's my question, so I have somebody on my block, which is like that they have a restaurant which has about essentially five tables and the outdoor space is like 20 tables and I'm posing the question to you. Does that bother you or not? I mean, let's assume they have. Everybody has a like a hole in the you know, a hole in the wall and then outside they are using an enormous space, and I just I have mixed feelings about that, but I, whatever the committee decides, is fine with me. It only bothers me if their neighbors are bothered correct. Okay, I just had months of complaints on a restaurant. Bert may know of it. It's on 23rd street and it's our neighbors. The towers. One of the restaurants was expanding their outdoor space under the scaffolding and in the street, beyond their storefront or restaurant front. To a for lease wine shop. That's no not empty right. Now we finally complained so many times they have retracted their tables at least the other day. When I saw it, I do not know if they were going to expand again, but they pulled back because there were enough complaints. I think that has to come from the people. It's bothering so it sounds like I hear three different issues here. One is that if we expand to both sides- and we get permission of the neighboring vendor, we still have to ask the vendor next to that without that table space, if it bothers them. The second one is: if there's vacant space commercial space, you really can't get permission from anybody. So what do you do in that situation? And the landlord still has one it's the landlord's space right and but then the third one is: if it's not the vendors or the landlord space complaining about it and it's the general public, then it feels as though it's an it depends situation. You might have a community that says we love this restaurant and we love them to expand to the vacant spot and you might not. I think, I think, we're assuming that the complaints would come from the neighboring buildings, not the judges, residents yeah. It could be the residents of the situation was talking about. She lived in a building where this restaurant that occupied one small part of it, was just expanding beyond it, and the residents did not want it to and they were the ones complaining. They complained so much that the landlord. Finally, I think said, move your tables back. You know I you know, and that's you know that I think those are the people who have sort of standing to complain if you will yeah. I do not know what I think about some general public person who lived 20 blocks away. Who said hey, I think they're taking up too much room, I mean so yeah. That's what I'm hearing is that we do not want to ask that question. That's none of our business and we're going to let the neighbors decide, I think so, yeah, because I think so. The whole purpose of the city's rule change was to give these places more space. Oh yeah, so you know where we know things are potential problems like music. I do not mean I do not mind being potentially more restricted right. We do not necessarily know this is a problem in all, or even the majority of cases so correct. I think we should be on the side of giving everybody as much of a chance as we as we can. Okay and the third big question is: will you ensure that there are no standing patrons in front and 20 feet on each side? The idea being we do not want to have a queue there, yeah, which is in the middle of the sidewalk, obviously waiting for go getting into the you know the restaurant, which is in the parking lot so christine the question. The comment I heard from a lot of operators when the governor came up with that you have to take care of the hundred feet on each. Was that you know what do you do if we have a restaurant? You know next to each other. You know you're, asking operator a to monitor the stuff in front of operator b, if you think of knight. So, but let me ask a question. So, let's assume you have the restaurant inside the sidewalk and the restaurant outside right and, let's assume now we were talking about ramen. Let's assume that you have a queue there on the sidewalk waiting for each side. What do we do? We? I think we should ask them not to be outstanding patron in their in their space right. Well, if it's clear, I would agree with you if it's clear they're patrons like the ramen line right, but if they're just you know, as we had the problems when we had, you know the outdoor drinking Mm-- hmm, you know if I have a restaurant here and you have christine- have the one immediately adjacent to me and there are 20 people hanging out in front of your restaurant. I know you know whose are they you know? That's the only issue I have with the 20 feet: yeah! No, but forget about the 20 feet. What about in front of their restaurant? I could be waiting for the ramen, but I'm standing in front of you know: Frank's hot dog stand while I'm waiting for my ramen Buzzer, because Frank's got a better beer. So what I'm hearing is that this line? We do not this question, we do not want to ask and the next question we do not want to ask and the one we are going to be asking is the outdoor music and the other guys right. Well, let's hear from other people I mean that was only a couple of us. I would agree with that. I think that the spirit of people not blocking a sidewalk is actually what I would. I do not know if it's a question or whether it's just in our jet, like we get into the habit of asking if they have a plan for where people will stand, if they're waiting for takeout or where they'll stand. If they're waiting for a table, because I think that's the biggest impediment is, if you have tables you've, white stuff, going back and forth and now you've got people just standing there. I think it's hard to implement like a 20 feet or any kind of like numerical perimeter on it, because every place is so different, so I'd be open to a question around. Do you have a plan for cueing? Basically yeah, I like that. I like that phrasing I, like yeah, very good wendy. Thank you, makes sense and christine you'd also include all the just confirm all the stuff that D.O.T already requires right. Those are uncontroversial. Well, I would say complete with got guidelines, because this is like five pages right yeah, but the start questions on your list. We would still put in right yeah exactly all those all those questions would be in and I would suggest to expand. We could either expand the outdoor space section, because we have a lot of redundancies here or we can have a separate page. Oh yeah, I have a question. You said that about the live music. That is in terms of the time that would happen, or just in general, having outdoor, music or performance or any kind of yeah entertainment I meant in general, we have had we dealt with one bar nine and people which are living around bar nine and we got 25 30 40 emails right from they had a live performance outside and speakers and everything and it was driving everybody nuts I was on 46Th street, and I mean I would I would not be comfortable with saying that I do not. I do not want it, because I think that's an opportunity for the artists that are, you know, striving right now. That is really difficult. I would just put it as a time like okay from this time to this time, and then we are conscious of the neighbors outside, like and honestly even for us like it's a distraction. She's just go outside, have a dinner, have somebody who's playing chess, or I think that the city, especially the arts, right, it's really struggling with that sense. So I think I would just stipulate it in a time that, like okay, this can not go further than 9 P.M or 10 P.M. Just I guess the way I see it is sort of the way we handle indoor music. Now we have the questions you know you're going to have background. Music live music dj and we use that as a starting point for discussion. If they say they're going to have live music, you know we say well when how many pieces there will be like a stipulation like okay, you have live music until this time. It won't be a question that says: will you agree to not have live music it'll, be you know where you have outdoor music? Where you have live music, they say yes or no. We look at the form and then we talk to them about it. But today, on the today on the outdoor space, we have a question which says: do you agree not to have any music right? Do not? We have that right in the rear yard, we do yeah in the rear yard, but we usually stipulate time right like okay. If you were going to have it we're going to have it in this time and during this time that's live music indoors, not on the outside, not on the outside. Okay. Well, today, on the outside, we do not have anything new music at all yeah, but I mean these are different times right. No, but obviously those questions are for the future. I agree with you that right now, during Covid-19 nobody's going to go and enforce anything. You know, but these are more long- term kind of questions all right I see. Maybe we probably need a little more discussion, maybe christine what we do is put a line on page two, where we currently have indoor you know what kind of music do you have? We can have a line for outdoor and you know just see what they say yeah, let's think about that. If outdoor is meant not as rear yard, but outdoors meant as the parking space rather than the sidewalk space, then the issue really becomes crowd. Control, though, because you're going to have people not eating at the restaurant wanting to stop and listen, no yeah, you have that and you have the other thing I had on 46th street, which is this entertainer was like 300 feet down and we could not hear ourselves. Everybody was you know everybody would clap, so it was like the whole street had become an entertainment space which I do not know. I do not think that's fair. I mean, especially because it's outside right, thank part of the problem. Is you know the city and the sla's regulations are so ill- formed about this. At the moment, like the SLA says, you can have live music outside as long as it's incidental to dining all show times and tickets, and I mean it's sort of so crazily vague. You know it's getting late. Why do not Chris? Why do not we make a draft and that's the question right I'll? Send it around right? Okay- and I also think you know the a problem. Another problem we've encountered in my neighborhood is the you've got the they're taking up the sidewalk space, then there's a sidewalk shed and then they've got the street so there's almost no people can walk, but anyone in a wheelchair can barely get through because of the poles in the middle from the sidewalk shed. So that's a huge problem that I've noticed and had a lot of complaints of in our neighborhood. Well, that's an issue the sidewalk shed like terrible, so there should never be tables under the sidewalk shed, which we've encountered and still are having a problem with, because there's no enforcement, even though that's already yeah, I think that's already. I think that's going to go away in six months, assuming that we are out of this problem in six months. Out of the kobe you know, I think some of those problems are going to go away. Yeah. I one restaurant in particular is really they're not going to go away and the sidewalk sheds scheduled to be up for another year and a half that's horrible. It became a big battleground at the restaurant Maria on Central Park South. Yes same situation, yeah and we're having the same thing, there's just it's hard to walk through, you can walk, but someone in a wheelchair. I do not know how they're going to maneuver through there. Okay, all right for listening all right, so christine you Bert, and I will work up a draft, a draft we'll send it to the committee and again, if you could respond with any comments just to burton me, because we do not want the whole email chain to turn into. You know a meeting of the entire committee and then we can go from there yeah and these, and this does not have to go to the full board. This is just amongst ourselves yeah. This is just changing the form right. Okay! Well, thanks everybody. Thank you. Thank you good night. Everyone.",
            "summary": "Let me take a look: eight plus the open dining, , I'm, Bert, Lazarin, Co, chair of the committee, and I called Zubiak, the other co- chair, If Chanco public, member, okay, So, on the agenda.\nIs anyone who's been with us before knows what this committee will do will make a recommendation on whether to grant or deny a liquor license to the full board, which will hear these applications and vote on them again on November 4.\nNow we're realizing the importance of having outdoor space that is open to the public, it's important, not only for us, but we believe for the public, not knowing how long this may continue, and also just an appreciation of the importance of having some outdoor restaurant space.\nOne is a change in method of operation to allow us to use that not just as amenity space But As a regular restaurant, that's serving meals, full meals, full menu with a service bar that will be open to the public and because we're putting in a service, bar.\nWe have approval of the license application by the state liquor authority, but we have not pulled it because the hotel's not opening right spring of next year.\nWhy, and then the anthony is like Ju is here, but I think his microphone is now working here now: Ah, here's, the second one: Okay, we we are applying for the restaurant y license for the transfer.\nYou know security plans I'm going to put somebody one of my employee stand outside Then we have a little space right in front of the store.\nAre you going to be using the street space a parking space for the restaurant, the outdoor dining?\nYeah, we're going to use the street On the north side and the only street air road, roadside, yeah, broadway, okay, So you're, going to use the open the street space for extra tables, but not the sidewalk yeah, not sidewalk, , so you'll agree to a stipulation that the you'll have no music in the out any outdoor, space.\nYes, I mean, if you're going to use the street, I think the sidewalk, especially in those streets, should be kept.\nOkay, no music and outdoor dining is only on the street, not the sidewalk, yes, you're.\n25% capacity indoors is maybe you could have a reservation system where you have people only use open table and that way people know that they really can't congregate.\nI, do not know if it's because there's too many people or whatnot, but I will talk a little bit about the general parameters of the proposed application and then certainly answer any questions throughout this discussion, but also I'd like to turn it over to aldi, Because, as I mentioned.\nInterrupt me if I lose something, but basically I show that compared to a three foot distance where these measurements are made inside the roller cover we're going to be 50 feet away from the nearest residences, which is on the north side of the street.\nAfter the music noise travels it's down to 59 Going inside an open, window.\nSo you that the only music that you'd hear would be when someone walks out the door to go outside out into the roller cover area, but I do not think there are any plans for any speakers or televisions, or at least speakers in that area.\nI think it would behoove all of us to separate your second floor into the inside and outside, because the because all of those things we are discussing, no music blah et cetera.\nOn, page 13, there's a blueprint and the blueprint shows the bar on the inside, but on the other side of the wall it shows that there are seats there, Is that window going to be open and will that music be bleeding through?\nThe applicant agrees to incorporate all the recommendations in the revised report and all doors and windows from the inside space to the roller cover space.\nWe have about 15 tables and we're looking at sitting about 25 chairs, and it will be music that is going to be played on a sonos Now we do not have any outdoor sitting or so, but we're planning if everything works well with training and all we might apply for open restaurant to occupy the street seating.\nWe got one email from a community board member saying that there are already four licensed bars and restaurants on this block, they're concerned that this is a back door to opening.\nWill applicants use a storm, enclosure, You, know enclosure which are at the door of the restaurant?\nSo that's definitely a mistake: online, all right, The second thing is that this discussion about the sidewalk sign.\nWe definitely have more than eight feet of space, for people to walk right, but that's not The rule is that it should be against the wall.\nDefinitely, no music and no sidewalk cafe if it's in the street right.\nYes, no sour cafe as well Right, no sitting on the sidewalk at the same time as you are sitting in the in the streets, that's correct!\nI wanted to know who made the complaints from the community, because I am concerned, it's a residential building There are a lot of bars on this street.\nWe're not like a bar, we're actually still trying to be more of a coffee shop, So, we're happy to talk to more people and all that.\nAny other committee people comments, questions that was that to know from you, tweet Okay, anybody from the community nelly, no one like to make motion.\nOkay, now, like we got a late email from a community member Christine is not a storm enclosure issue, because the door it's inside, right.\nMy point is that once you put the the tables and chairs in the street, we want to make sure you are not putting any music there right and that new tables and chairs are put on the sidewalk, which no we'll not do that.\nMy window, I see the rear of that building and I wanted to address some concerns that we had with the previous restaurant, and I wanted to just you, know, discuss them and see what would happen.\nThat's in the kitchen, or that the base music was so loud that it would permeate into the apartment a lot of times the previous restaurant used to keep the rear door open because of airflow, and thus the music would leave.\nSecond thing is that late night workers, usually after the closing the restaurant, threw out garbage and did a lot of work in the back in the evening hours of like two and three o'clock in the morning, and then that would wake us up and that's another thing.\nI was aware that there was like five tables outside not using it, but we're not going to use that.\nAnd, like I said, I want to use the main room as much as possible, contain the energy and the noise level, and so it's I thought the application.\nYou know and have 4 am licenses going back decades and we only try to pair things back as people New operators come in And it's important to hear from people in the neighborhood.\nRight, thank you and if grace, if you go to the Community board, 4 website, there's, what's called the Nuisance reporting protocol that you know tells you how to complain about noise and other issues to various agencies.\nYes sure they're, going to correct pages two and five of the stip form to show that there are some outdoor seats within the property line, not on the sidewalk, and those seats will be closed and vacated no later than 10 P.M weekdays, 11 P.M on weekends, there's recorded music, only there'll be no music in any outdoor space if they choose to use utilize outdoor space other than the front yard, The private property, that seating will only be on the roadway not on the sidewalk doors to the rear yard will be kept closed at all times.\nMichael's, taking over the old spoon Fed space on 51st street, he's opening an italian restaurant with his family, members.\nYou tell us a little bit about your background in the in the restaurant industry, eventually because I know have a contractor, Yeah, I own, a successful construction company in the city and when I was a kid I started off in the deli in catering And, then I moved up to being in a bar restaurant, from where I grew up a bouncer there and kind of like a manager, and then I came into the city worked around a couple of places.\nYou know chiefly when it's open, or I mean how does that work with your construction, work or You know other people with Day- to, day, responsibility, Absolutely like a construction, company, there's foreman and there's managers and restaurants.\nYou know I'll, be there entertaining clients, but I'm going to make sure that my restaurant hopefully makes money in these unprecedented times and enhance the community with good italian food and a good crowd.\nSo I kind of stumbled on this interesting opportunity through getting to know the landlord And So either you or your cousin's going to be there regularly, yes, The street.\nLet me know if these two are okay, the former operator at this location, bessem kukage, will have no involvement, whatsoever, financial or otherwise in applicants operations, whether it's owner management, manager, consultant or employee and besson, Cucad, has no involvement or connection with the corporate applicant, which I guess is 331 west 51St restaurant Inc. Will.\nI just want to let you know, because these people do not seem responsible, so what's happening going to make sure all the garbage is cleaned up and eileen does not have that issue ever again.\nIt cost a lot of money to cart, garbage away and having a construction company making this investment into the restaurant definitely trying to save costs where we can If it's, if it's rubbish that can be picked up by the city, I'm That is not you know any kind of sheetrock or anything that would require permits or work like that.\nIs: Are you going to use open street dining in the on the parking lane?\nYou know we did not discuss open, streets.\nWe would not have a Covid-19 situation If we do, and if it is permanent, then we would like to use it So the same stipulation you have heard before, which is you know it's on the in the parking lot on the sidewalk and no music whatsoever, that's an hour with attention.\nOne before that was a bar, though right And, you know, do construction on the ceiling We. We can definitely do that to help prevent the prevent the noise for eileen and any other neighbor that has ever complained, but we're not going to have loud, music.\nIt's background music and 10 11 12 o'clock, we're having people eating, not you know a bunch of kids rolling out of rolling out of wherever and coming to make noise.\nI thought that more space you know, sort of room within a box within a box gives you more sound proofing, but maybe right.\nI went to the previous restaurant a lot The second floor was never in use any time.\nWe can say that the lack of you know the lack of noise had because I do not think they ever had anyone well just as long as Michael is aware that it needs to be well sound proof because he does not want to come back and have to do it again.\nIn addition to the other steps, I read we'll say that the applicant agrees to sound proof second floor space ceiling using soundproof, glue and sheetrock on ceiling right all right, and I suggest we do what we did with all the other bessem places same thing , I'm, sorry, Bert and tell the SLA that you know we do not have the ability to investigate that does not that have there had been reported connections with bessem cusack to this space.\nThey will only use the parking lane and not use the sidewalk, and there will be no music whatsoever in any outdoor spaces.\nI'm still going to follow Christine's motion and second Hopefully a cocktail and some italian food Any idea what you're opening, hopefully, when I, when I get this liquor, license.\nYes, you meant that's what your choice is, which block exactly okay, page five H5, you know , Have, you read the rear yard policy?\nI read the rooftop policy, okay, and so that means you said Yes, outdoor space.\nWe changed the two answers on page five, that says: yes, there's no music and to extend you use any open.\nI. Think that just like we're talking about you know outdoor space, maybe it makes sense to expand our outdoor space stipulation to include the open, dining and then ask the applicants to you.\nThe recommendation would be no music outside at all, and you know we have the choice between saying yes to outdoor space or not from the storefront or just no outdoor music.\nSo the question could just be what we're asking people tonight you know The context of this is that the open, dining they do not have to come to us This is these questions will be thrown out at an applicant if they're coming for a restaurant right license, and we will throw these out at them, not that they have to And, they want to go for open, dining.\nYou know the restaurant, which is in the parking lot so christine the question.\nWe do not want to ask and the one we are going to be asking is the outdoor music and the other guys Let's hear from other people, I think that the spirit of people not blocking a sidewalk is actually what I would.\nIt won't be a question that says: will you agree to not have live music it'll, be you know where you have outdoor music?\nBut today, on the today on the outdoor space, we have a question which says: do you agree not to have any music right?\nControl, though, because you're going to have people not eating at the restaurant, wanting to stop and listen, no The other thing I had on 46th street, which is this entertainer, was like 300 feet down."
        }
    }
}