{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB5",
            "channelId": "https://www.youtube.com/channel/UCOkywXyXAPDP3E_aykq0XFQ",
            "title": "September 10th",
            "publishDate": "2020-09-10",
            "shortDescription": "",
            "lengthSeconds": "3:29:30"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB5",
            "normalizedName": "Manhattan Community Board 5",
            "twitterName": "Community Board Five",
            "youtubeChannelName": "Manhattan Community Board Five",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "twitterHandle": "@ManhattanCB5",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "XWm8HMLQIfY",
            "fillerWordCount": {
                "uh": 402,
                "um": 527
            },
            "readTimeFullTranscript": "117 min read",
            "readTimeSummary": "15 min read",
            "wordCountFullTranscript": {
                "budget": 90,
                "police": 41,
                "information": 34,
                "equipment": 33,
                "safety": 27,
                "shelter": 26,
                "services": 25,
                "language": 25,
                "renee": 24,
                "vote": 23
            },
            "wordCountSummary": {
                "budget": 18,
                "police": 11,
                "shelter": 7,
                "information": 6,
                "clients": 6,
                "conversation": 6,
                "officers": 6,
                "mayor": 5,
                "services": 5,
                "shelters": 5
            },
            "fullTranscript": "The first thing I noticed is it looks like almost everybody's gotten, a haircut now, I'm just going to wait until 605 make sure we can get as many people as possible to start so one thing we get on virtuals is good attendance. I'd like to make a general note for everybody in attendance tonight if you're joining from a phone during our public session. In order to be recognized, you have to raise your hand and if you're joining from a phone, you can press star 9 to raise your hand. Okay. Well, we've got a really good number of board members attending. So I'd like to say good evening to everyone. This is community board, fives full board meeting and I'm Vicki Barbero the chair. I hope you have been safe and healthy and enjoyed the summer in spite of the spring and summer challenges of 2020. So I will go over our usual explanation of how our meeting runs. We begin our meeting by hearing from those of our elected officials in attendance who wish to speak. They will be followed by the representatives of other electeds who will report to the board for two minutes each and we then enter our public session, which is an opportunity for anyone from the public to bring information to the board. Anyone wishing to speak, please sign up by 6, 30., be sure to include the subject you will be addressing as well as any contact information should we need to contact you and remember. There is a time limitation of two minutes. Please respect the time constraints that the board faces during each of its meetings. We then go into our business session, which is when the board enters the business session, which consists of the adoption of the minutes. The chairs report, the district manager's report and committee reports, which include resolutions, questions comments and we go into a vote on the actions that are before the full board comments and questions from either applicants or the public or if additional information is needed, that's allowed only if you are recognized by the chair, so I will start this evening's meetings calling on our electeds. I believe we have Senator Kruger on board. Welcome, muting hi. Everyone thank you so much for letting me jump in quickly. I have not been to a community board meeting in a while, although now we do everything by zoom, I think Justin from my staff is probably already on as well, but I just I want to recognize him and please everyone know you can always reach out to me through justin, if you can't find me otherwise, you might have recently gotten in your mail my summer update, which talks about a really hefty amount of legislation that I'm very proud. The legislature passed this spring and summer, even though we were also doing virtual legislative meetings and virtual committee meetings and hearings and even voting virtually is now possible in the state legislature we're not out of session we've continued and our commitment is to continue year round at this point, given how quickly the world changes and the demands on the legislature change. I know it's an angst- filled period for people. We do regular virtual town halls. If you have not taken a look at our website or you do not get my mailings for some reason anyone's welcome to join. We try to stay fact focused, not politics in our virtual town hall, so we have some of the world's leaders in scientific expertise around Covid-19 who have been willing to come on because everybody does it from their home. So you can get. You know world famous epidemiologists from around the world who are willing to come on and do Q&A with you. I think our next one coming up is about voting rights, and that is crucial because I hope I do not have to say to anyone on this call. Zoom perhaps never before has it been as important for everyone in the country to vote just once, although if you can get away with it, no just kidding just once, but we all need to vote this November, because I think the life of the world was dependent on it. I also wanted to just reference something that some of you may already know about. There's this very disturbing action that the city is trying to take by throwing out the 300 people living at the Harmonia Family adult family, shelter on West, 31St Street. It's been our neighbor now for two years, with a very effective set of programs for elderly and disabled adult households. Without children it is approximately 338 people, an active cab which has been reporting back, very good relations with the community and with community Board and with electeds and with basically no notice. Two days ago now they were told that they're going to have to all leave that building and not clear where those people would be sent or under what circumstances or whether anyone will even do an evaluation of all of their special needs and whether they could be met in other facilities, and this is being done for no justifiable reason regarding the harmonia, but rather because the mayor decided he was going to remove the men currently living in the Lucerne hotel on West 79Th Street, because some in the community were upset about that men's shelter. Although many are supporting and urging not to move it. So that's not my district, so I do not really want to speak on that. I just want to highlight that we have a successful functioning shelter for a special needs population on West 31st, while people are always nervous about new services when they come in, our community worked with them. The provider sus worked with us and it has worked out extremely well and I can find no justification whatsoever for telling this group you're out fire your staff, we're taking your building and we'll find somewhere else for all these people to go on a moment's notice, with no information as of Thursday night, where these people might be sent to so your elected officials, Keith powers, Dick Godfrey, Gail, Brewer, myself, Brad Hoyleman and the upper West side officials are all together and arguing. This is outrageous if there truly is a reason to move the men out of Lucerne and again I won't speak to that because that's not been part of my territory, then surely, with endless empty hotels in the city of New York, they could find alternative places for these men at this time. There's no reason to destroy two separate programs in two different locations with no community notice unless they contacted community board 5 within the last 24 hours, but they had not even contacted the provider of the services and so we're working hard to try to get press attention and to convince city hall that they have made a major error here and that they may have issues that they need to deal with at the Lucerne. But that is not a justification to destroy another very successful well- established community supported shelter in Community, Board 5.. I think that's pretty much what I wanted to say, and I appreciate you giving me some time and vicki. I have no idea if you ask questions in this model of zoo or not. Well, we usually do not we. Thank you very much, because this is something that has obviously upset us as well, and we will be just you know discussing it this evening. Right will you be able to stay on at all? I can not, but Justin is fully knowledgeable about all of this, and I can't see in my little squares whether he's there, but I think he's there somewhere. Okay, yes, he's there. Okay, there, he is very good. Thank you so much. We really appreciate it. Thank you all and best for the holidays coming up, even though we have no idea what time of year it is it's actually late, September and holidays are coming up. Take care! Okay! Thank you. Next, let's see, if we have, I know Senator Hoyleman was going to join us. Are you here brad? I am here. Thank you hi. Thank you, nice to see you Senator Krueger, and I share just on the outside the dismay of Senator Krueger and all of our colleagues on the shuttling of the homeless. It's I mean frankly, it's despicable that they're being treated like Chattel and being moved around. I mean obviously no one's asking them what they want. Let's just start with that, but in addition, no one asked us the community and there was no notice on the West side homeless. Provisions both in you know CB4 and CB7, which are in my district and adjacent to my district. I was at a press event yesterday outside of the Lucerne decrying. The fact that they were you know moving these men. We did not know they were being moved to Senator Krueger's district, but they were being moved simply on the threat of a lawsuit and like the capitulation is really going to. I think create a cascading effect as we've that as we're seeing right now with homeless, new yorkers being displaced and then others, you know, propose to be moved in their place. It's an absurdity, so I'm going to be joining Senator Kruger, even though it's not in my district and her efforts, along with my other elected officials, to stop this latest bad decision. I did want to say on a more positive note, vicky how grateful I was to you and the board for the call to action on our testimony on the empire station complex. I thought that was very positive. I joined Congresswoman Maloney and Congressman Nadler and Senator Jackson and Assemblymember gottfried on. You know our concerns about the draft scope and how we believe the override of existing zonings and local law are extremely problematic, so we'll be continuing to make our case on that front. But it really was CB5 to your credit who set the the argument one moment Lucy and like Senator Kruger. I hope everyone votes by absentee ballot. We had a press event outside of Farley station where we presented a prototype ballot dropbox, which we think should which we think should be used in addition to the other voting options that new Yorkers have and the governor has announced a some sort of compromise on dropping off ballots, but unfortunately, you're not going to be able to drop a ballot off to a secured dropbox, as you can do in 33 other states in the District of Columbia, at least at this point, but we're going to continue to make her case and then I'll leave it at that vicky. But because I know you're pressed on time. But you know, my office remains active on unemployment, insurance cases and we've helped over 1500 new yorkers. At this point and we'll continue to to to assist them- and we also testified at Dhcr yesterday at the behest of the skytown Peter Cooper Village Tennis Association- on the fact that the there has not been a lot of public transparency around how the Mci cost schedule is being formulated. So thank you very much fill out your senses and I'll stay on if anyone has any questions later in the meeting. Okay. Thank you. I'm also joined by by my colleague, Annabelle Decaster, who I know many of you know so thanks Annabelle for being here. Thank you Brad and another. Thank you again for the work that you did and the other electives. Regarding that Penn Station proposal. We really appreciate it. Okay, let's see, is our borough president on Gail Brewer, not on yet okay, how about Keith was going to join us, our council member Keith powers. I do not see him today. Okay, I'm looking to see if we have any other electeds right now and if not, we can go into their representative speaking and then go back when they do join us. So, let's, by a raised hand, let's see who will be speaking for the elections, Luke Wolf First hand up everyone, lukewall from Comptroller Strainer's office. It's good to see everyone. I hope you're, all well, just Wanna briefly touch upon a few of the things we've been working on this summer. I think our two main focuses like many folks acrosss. The city are one, of course, school reopening and also what's going on with small businesses I'll touch on each of those for a minute. So, on the small business front, we released a save mainstream initiative, which is really our plan to hopefully ensure that small businesses acrosss the city will be able to survive the pandemic and also be able to thrive on the other side of it. So the initiative has three big parts. The first is supporting existing struggling businesses, so that's things like tax credits to cover reopening costs. The second part is about supporting entrepreneurs, so that's programs such as a re- entrepreneurship program, which connects existing entrepreneurs who want to retire with aspiring entrepreneurs who can hopefully take over their business and the third part about building stronger neighborhoods. So that's stuff like how can we repurpose public space? How can we repurpose vacant space, Acrosss, Maine Street corridors to make sure that all that is doing best to serve community during this time? We're of course also very focused on school reopening? We know it's top of mind for many families, acrosss the city and I've joined with many teachers and parents to make sure that reopening is as safe as possible. One of our big pushes has been on outdoor education and making sure that schools and principals have the flexibility to use outdoor space at their disposal, whether that's neighboring streets, DOE area and nearby parks, and really pushing the department of Education to give principals that flexibility to do that safely. We've also been pushing for expanded access to child care, as we know, that's a big concern for many parents and lastly, we introduced a first of its kind bike to school program. We know that school buses are still a question mark. There's some question marks around transit as well, so we want to give high school students the opportunity to bike to school by making sure they all have access to a CitiBike membership and also develop bike infrastructure around schools to make sure they can do that safely. I will drop a link to our entire saved mainstream initiative in Chat, as well as my email, nice seeing you all, and I look forward to speaking to you all soon boy right down to the last second, that was impressive. Thank you. Luke, let's see lori. Are you on representation? Hi vicky? How are you I'm fine thanks great so indoor dining last week the speaker issued a statement calling for indoor dining. We were happy to see that, after calls from the speaker's office and other local stakeholders, governor Cuomo announced that indoor dining in New York City can resume on September 30th, albeit at 25% capacity, and with strict restrictions. You'll have to have your temperature taken, you'll have to wear a mask and obviously social distancing will be implemented by the restaurants also quickly. We have two events coming up. One is cleanup day that's this weekend and I'm so pleased that CB5 will be a part of it. Cb5 with fit will joining us on 26th, Street and 7Th Avenue we're going to start at 10, A.M and we'll go to 12, and then at that point from 12 to 1, Dsm Y will probably come along and pick up our bags of trash. We also have a Rad academy on Wednesday September, 23rd, you've probably heard in the news. This is kind of a big issue right now, so it's September 23rd from five to seven, we'll have a virtual free training on safe and effective methods for rat prevention in your building and your neighborhood, and I can send that flyer to Luke and that's it for me. Okay, thank you, lori sure, okay, next abigail, hello, everyone. I do not know how I can beat the Rad Academy Lori, but I actually, I did want to start by talking a little bit just about the situation and it's already been addressed, but tomorrow Keith is actually going to be hosting a press conference with a number of other electeds on this call, as well as advocates and potentially some residents of the shelter at Harmonia. So we will keep you updated on that, but obviously an unacceptable situation. On the legislative side. I had a few updates from the council member, along with Brad Lander Keith is supporting a bill to create a recovery lease program in the city, to incentivize landlords, to renegotiate, better leases to small businesses that are still recovering. So we're excited about that and he's also a co-, prime sponsor on a bill to ban housing discrimination based on criminal record in the city. We also introduced a bill to lower the number of units in a building where source of income discrimination protections kick in from six to two units, both of those past two bills that I mentioned are going to be on a hearing next week and we also have a hearing coming up in the criminal Justice Committee on Covid-19 in New York, City Jails, with Carolina Rivera's committee. And lastly, we are fighting to end the practice of solitary confinement in the city with the public advocate and advocating to the mayor. So let me know if you have any questions afterwards and you can always email me any questions, but thank you all and I'm looking forward to working with you on the Harmonia issue. Thank you, Abigail Betsy Schmidt. Yes, all right today, Congresswoman Maloney held a hearing on the importance of ensuring that the Census Bureau has enough time to ensure the complete count at the end of July, the president shortened the response window by 30 days, meaning that we only have until September 30th to for everyone to fill out their census. So we questioned them about that, but this is obviously still very important. So if you have not filled out your census, as everyone else has said, do that I can drop the link in the chat. She also hosted a round table today on the pandemic risk insurance act that she is sponsoring on Monday. She posts the congresswoman called for postmaster to joy's suspension after allegations have been made that he awarded bonuses to employees who donated to republican campaigns at his request. This comes on the heels of us subpoenaing documents from the postmaster last week after he failed to provide them to the committee on oversight and reform. After our hearing on August 22nd Congress returned for emergency session to pass Congresswoman Maloney's delivering for America's act, which would keep the post office running where it was in January 2020, at least through the election. We are waiting on the Senate to take that up. She also joined a group of other committee chairs, asking the Department of Defense's inspector general to launch an investigation based on new complaint, alleging that a campaign of retaliation against Army, lieutenant Colonels, Alexander Vinman and his brother Evgeny venman. So many things so, and we also just encourage you all. If you have any questions about any federal issue, anything that's going on anything you want to tell us about reach out to our office. Give us a call or email us we'll be happy to discuss everything and anything that's going on. Thank you. Okay, thank you, betsy. I think Gail has joined us our borough President Gail, are you on. I am thank you very much so I'll be quick because board 5 knows everything. So you know this homeless. Stuff is challenging. I think you've heard a lot about it, but just because I have the whole borrow. I am aware of what really goes on so to make a long story very short, you're dealing with the harmonia at 12 east, and I want to thank the local officials because they jumped right in those are adult families. You know individuals who have adult children who have challenges, and maybe the parent has challenges, and there are 150 of them so, and I think it was a lot of work to make people comfortable with that group of individuals so over on the West side. It's a situation where the city pushed, I have to say a very excellent organization project renewal and they to their credit, have stepped up meeting with hundreds and hundreds and hundreds on zooms and in person, Community, Board involvement, very heavily, certainly local, nonprofits and so on. It was challenging. They had no services when they came now they do it's better. It's still challenging, I'm not going to say all those men are perfect, there's 283 of them. If it was not an executive order by law, they could only be 200 of them and some people think only a hundred should be in any one building, so the lawsuit threat. I think scared the mayor. I do not know exactly what happened and I'll probably never know, but right now, they're still at the Lucerne hotel. The sad part is, we have got a Riverside to their everlasting credit. As a nonprofit has managed to get a donor to write a very large check and we were going to have a hundred men six days a week with phenomenal outdoor and indoor activities and 20 jobs paid full- time, so that's quite a generous opportunity. That's on hold, as we speak. There's a potential you'll know more than I will perhaps tomorrow lawsuit from legal aid to state that the residents of the harmonia can not be moved so we'll see what happens it's very hard on these staffs. As this cougar will tell you, the wonderful non- profit running the harmonia could lose 41 staff members because there would not be any jobs for them. Their residents would be scattered. Second, the harmonia is not a perfect fit for the 280 some men, some of them got arrested so they're, not all 283, there's about 20 less and all of them do not fit perfectly into the harmonia. I just talked to the director of project renewal, so it's not the best laid plans and from when the men came into the situation now. So that's what I know in a short version. Second, we did a report, as you know, on the police barricades. I'm sure you have some in board five board, one. It's particularly upset and I get tons and tons of emails. So we have we found that 19. I think it's probably 18, because some of them have been pulled back of all the precincts had he's fully or partially shut down the street from pedestrian or vehicle traffic, and I think it's not necessary does not help police community relations, so we have heard that there'll be a change there, but we have not seen it everywhere the issue of small businesses. I know you have worked so hard on this and we've mostly focused on Broadway from top to bottom. We did a report a while ago stating since 2017 to 2020 there's been a 78 increase in vacancies and that's a lot this Covid-19 we do not know how much is permanently or how much is going to be. Hopefully, the store will come back, maybe with indoor dining, but just so you know, 43 were below 14th street 105 vacancies between 14th and 59th 66 between 59th and 96th, and the list goes on. So it's a very challenging situation. I do not need to tell you that I hope indoor health will have to see. I'm also concerned about the schools on a couple of levels. You know that as well as I do, we just had a meeting with all the Cec members whom I appoint to her and your cec Ii is an excellent group. They have a lot of issues they're very concerned about the ventilators, particularly the woman, who represents children who have special needs, but everybody's concerned. In fact, one of the cec members is a expert scientist in ventilation and she has concerns. The second issue, of course, is I allocated funding, as I do every year, 12 million last year to the department affordable to the Department of Education, and they have not spent it, nor have they spent the city Council money, nor have they spent the other money from the borough. President in our response to an article in the paper that I got the mayor said they did not need the money, but then, when we were on with Chancellor carranza the other day on the zoom, his office stated: oh yeah, again we're talking to city Hall about spending this money, that money is for ventilation, bathrooms and devices and all kinds of technology- and I can tell you technology- is not in great shape, but every single child going to school, blended or virtual and remote is going to need remote. So I can go on and on. The other problem, of course, is teacher shortage. I think you'll hear that from your principals and the other thing we heard was just you know: they want to be sure how the testing works because nobody's exactly sure and I could go on and on. I testified at the Committee on education. I want to thank the chair. Mark Traeger he's been phenomenal. I think you know about census, but just so you know we have done two postcards 140,000 each to the rural Manhattan and the League of women. Voters is mailing to the 35,000 manhattanites. Many in board five, who left temporarily, we have their dresses, whether it's on the island Westchester, Connecticut Depart, you know down south in Indiana, wherever they are, they are going to get a postcard stating please use your New York City Manhattan address we've got the address is from the board of elections for those who asked for an absentee ballot and we scrubbed the list, and I think it's a pretty good list at this point. I think we all know about voting's, I'm not going to go into it. I hope that people do vote and I hope that the expansion of outdoor dining, if it's still warm until the end of November, continues because even at 25, these restaurants are going to need more support our newsletter. Today it comes out every Thursday and Monday, but Thursday is the big one does indicate the there are about four immediate testing sites in the borough Manhattan. Obviously, there are the other ones that have been around that take a little bit longer, but all the other sites are going to be used for the board of education, so you won't find them as readily as you had in the past. Thank you very much, and I want to thank board five, because that the worst of the pandemic we're still meeting coming up with ideas and it's never to be forgotten. Thank you very much. Thank you, gail. We appreciate that. We appreciate you. I do not see other any others in terms of the representatives, so I think we will move into our public session hearing from the public for two minutes each craig. Do you have a list of people to be called on? Yes, so thank you. Vicky it'll be helpful for everyone. If you had the name in your box to match the name that you signed up to work with, so I can match names with everybody. When I call your name, Luke will unmute you and you'll have two minutes to speak. Our first speaker tonight is Aaron Weiner Hi Erin, you're unmuted. If you'd like to testify. Oh hi, no, I'm just joining to listen in. I was not going to give a statement today. Okay, so then the next person will be Kristin, Guthenberg, Kristen, you're, unmuted or you're. Unable to talk. You have to unmute yourself. If you'd like to speak, okay, Kristen are you there? I think you you're unmuted. On our end, let me try to do this. Okay, I guess we can come back to her. If she wants to try Kristen. Are you unmuted now? Yes, hi, I'm sorry, you can continue. Okay! Thank you. Next person is Nicholas white. I do not think he's on right now. He was before okay Elaine Porn elaine. You are enabled to speak just unmute yourself. Can you hear me yep, okay, hi Elaine corn here and I'm a board member at 372 fifth avenue, which is 35Th Street and Fifth Avenue between fifth and sixth on the west side of the street? We are smack in the middle of the Amazon loading docks and down. The street is the Kixpy Hotel and the women's shelter and our neighborhood has has undergone quite a change. Most people who I'm living there 37 years and I've never experienced anything like this. The most people when they move to this area, which is a lovely area under normal circumstances, understand that it's a commercial district and that there is going to be loading and unloading of packages. However, Amazon has taken over that area to a point where it's really not about the loading and the unloading they're doing their business in the street. There are desks set up. There are people hanging out. There are people, smoking pot. There are people going to the bathroom on the street. The Amazon workers are quite arrogant. They sit on the steps of our building and when they're told to get off they do sometimes the police come and 10 minutes later they come back again. I want to send a shout out to Luke Sabados because he has been instrumental in improving the situation. I would say you know meaningful with me really meaningfully and I it really needs to continue because, even though it's gotten better there's this they're still doing the same things, and I see I only have five seconds left. So I won't touch the Kixby hotel, but that's also a disaster. Thank you. Thank you very much for letting me speak. Thank you, Suzanne Johnson. I did not realize I was supposed to be speaking, but I noted that you might that you had signed up, but it's up to it's. You know your discretion yeah. No, I did not sign up to speak. I think that I was called out the situation in the west 50s just in terms of the the shelter at the blakely hotel and the situation at the wellington and how it's impacted. The West 50s and I've gone around and spoken to some businesses and some of the businesses feel, like things are getting a little bit better. There's more population in the West 50s. We have endured a lot in this area. The crime is definitely up, residents are afraid to go out in the evenings. We have you know prostitution and public definition and fights and drag races or motorcycle races down 7Th Avenue. So it's been pretty tough here, but again our hats off to Luke. Who has been really on top of this for us and trying to communicate our needs. We have a lot of construction in this area that has contributed to a lot of the sheltering for some of the drug sales and some of the loitering and some of the hassling of residents and this scaffolding that is maintained up on buildings, where there's no work being done. That has contributed to some of the opportunities for all of which I've just discussed. So I'm not I'm just really giving an update. We've spoken a lot about this. We've had some virtual calls, both with residents as well as thanks to dave against and Luke, has participated and enabled this to happen, and we had a call with the res with the businesses as well and everyone's just motivated to open up their small businesses and their restaurants and feel safe and feel clean, and we do not really know how to get our arms around it and we're just trying, and we really appreciate Keith Power's office and Luke, trying so hard on our behalf. That's it. Thank you. David Calis, you'll be glad to hear I'll. Take a pass I'll discuss this with the board at another time so I'll pass tonight. Thank you, Lisa Wager, okay, Lisa you! I got it okay, so hi. A quick update about what's happening on campus classes, began on Monday, August, 31st and they're continuing through December 23rd, the clock's not running thanks for the extra time all classes, except for a couple of graduate level class courses will be conducted remotely and students have limited access to labs and studios with the supervision of trained personnel through a reservation system and following health and safety protocols for safe social, distancing and other measures and after thanksgiving break all classes and coursework will be entirely remote. There are no students living on West, 27Th Street this semester and there's a limited number in Kaufman Hall, which is on West 31St Street in CB4. Public safety is fully staffing. The campus and buildings and ground staff will continue to oversee and maintain the environment, so it'll be safe. It'll look nice, which brings me to to mention that Fit is very pleased to partner with Cv5 and Speaker Johnson's Cleanup day on Saturday, thanks for inviting us we're showing up and glad to be there. Three students from Fit's, Fashion design class have redesigned the girl, scouts uniforms and apparel. It's a collection that consists of 18 interchangeable pieces for girls grade through grades 6 through 12.. It all occurred under the auspices of our dtec lab, which is an entity in our innovation center and they used 3d virtual prototyping and certain software to minimize waste and eliminate the need for physical sampling. So they incorporated sustainable methods. They ran a focus group with the current girl scouts and the big takeaway was that they wanted pockets big enough for cell phones and clothes they could wear to school, so they got leggings, hoodies, sweatshirts and, of course, sashes and vests all with ample pockets, and I also just want to let you know that an fit Alum, Illustrated Lebron James's, New, York, Times best- selling children's book. I promise it was important to James that quote. Everyone who reads it can see themselves in the images and Queens born Nina Mata, who graduated in 08 with the bachelors in illustration said. I just basically drew my childhood and, like I said, she's from Queens, so she's our homegirl and we're especially proud of this New York City Grad from Fit. Thank you. Thank you. Lisa there were two people who signed up. I do not see them in the attendee list, but I just want to make sure that they are not under a different name on the attendee list. So if I call your name just raise your hand, so this way we know you're there and we'll call on you, raynard, Loki and Sharon Pope Marshall, seeing none then we are closed with the public section. Thank you, okay. That moves us into that moves us into the business session of the board. We will start with the adoption of the minutes from July may I have a motion to adopt motion and a second and a roll call vote by Craig. Sorry, Achalas, yes, bitchman, yes, Rosnahan! I do not think she's on okay burton, yes cafaro. I do not think she's thought she's not on yet. Okay chew. Yes, mark! Yes, Dale! Yes, Joseon! Yes, Ford! He was on yes, okay, Brewer, yes, Garcia! Yes, Goldman! Yes, Goshaw! Yes, Haas! Yes, Paris! Yes, Hartman! Yes, higher s, Isaacs Isaac's! Okay! I do not think he's on anymore Johnson. Yes, kback! Yes, Kang! Yes, kinsella! Yes, logaseco! Yes, levy! Yes, Lucy! Yes, Mafia! Yes, Mccall! Yes, Myerson! Yes, Miller! Yes, Raybar! Yes, shapiro! Yes, Slutskin! Yes, Smith! Yes, spandorf! Yes, spence! Yes, stern! Yes, birdie! Yes, webb! Yes, weintraub! Yes, waylon! Yes, Yang! Yes, asses! Thank you! Okay! Thank you! The minutes are adopted. I would like this evening for the chairs report, I'd like to call on Nick Athanal to update the board on the search for a new district manager. Nick. Thank you Vicky. So the Search committee report is is very positive. In response to our district manager posting, we received 57 responses. Nine of those were relevant of those nine four had the minimum qualifications and experience that we needed for the position and those four were interviewed. We are now in the final stages of the process, and we expect that one of those four will become the next district manager. We are moving quickly with the finalization of the of the process, and vicky will have to call a special board meeting for the board to approve the appointment of the new district manager, and that could happen as early as early next week. So as soon as a decision is made, the motion will be made to the full board to to accept the new district manager. Okay, thank you Nick, hopefully, and as has occurred in the past, that only takes usually less than 15 minutes. So when I do call that meeting, I'm I think six o'clock would be the best idea say between 6 and 6:30 on a night next week. We do not have any committee meetings next week, so, hopefully we'll be able to get a quorum. We must have a quorum obviously to vote on this. So look forward to that, and that takes us now into our committee reports and we start with budget education and city services, and that is renee consulate. Thank you, vicky. As you all heard in the public session, there's an issue that has arisen- and we at CB5 only learned of this yesterday afternoon via the borough president's Tweet, and this is regarding the location of the 280 adult male clients, from the Lucerne hotel to one of our permanent shelters in the district, the harmonia, which is at 12 East 31st street, that's between Madison and fifth avenues. What this means is that the 150 adult families are going to be moved from the harmonia and 280 adult male clients, from the cern will move into the harmonia. We do not know at this stage where the families will be relocated. Just to give you a little background. The harmonia is a DHS funded facility and it provides temporary emergency and transitional housing to adult single families of two people, adult families. So it's managed by Sus, who is the provider of services at Harmonia? We, as part of the community, are part of their Community Advisory board and we've seen the successes that they've had in stabilizing the lives of their clients and slowly but successfully helping them to move into permanent housing situations. It's taken some time, but sus and their clients have really been good, neighbors and they're really working to move them into this housing. So, while we're not sure when the families are scheduled to be moved from the harmonia and we're not sure where they're going to be moved to, we do not think their abrupt. Removal is a good thing. They're going to be moved to new service providers, potentially new doctors, therapists, neighborhoods. It's going to undermine the stability that was created over months by Sus. We do not understand why the city is dismantling this a very successful shelter. There was no notice. We do not have any clear rationale as to why, particularly because our understanding is there's not a lot of these family shelters that include senior citizens and the disabled as the harmonia does. We also understand we have not received any direct confirmation from DHS of the city that the people who worked in the harmonia may be in danger of losing their positions over the transition, and it's unclear who will be the provider if sus is not there once the current clients are removed. I do want to mention that of the 32 temporary hotels created to ensure the safety of the homeless clients during the pandemic 11 or one out of three of all of these hotel shelters has been cited in CB5. This number does not even include our permanent shelters like the harmonia, so we do recognize the importance of providing care for the most vulnerable and we really work to ensure the smooth transition of the homeless clients into the neighborhood. But we have continuously asked the city and DHS for transparency, open communication and collaboration and really clear plans for managing issues, particularly given that we have such a clustering within the district. As our lack of information about what's happening with the harmonia indicates, the city has not permitted our board to be a full participant in their decision. To cite these 200 men from the Lucerne never mind the thousands, and I mean thousands for all the other 11 temporary shelters already here in our district. For this reason, and due to the imminent removal of families from the Harmonia and as a member and chair of the Bex Committee, I'd like to make a motion to the board to become a committee of the whole so that we may address this matter. Okay, I'd like a second on the motion and then I'll give an explanation. Second, okay, so for just to make it clear as to what we're doing, because we very rarely do something like this, but when we have before us an issue that has timeliness is really of the of the greatest importance and it needs to be addressed immediately, which is what's happening this evening. The electeds have asked us to weigh in on this. We, as Renee said we only found out about this yesterday, but it is with a lot of concern, and so they have asked us to. Please take up the issue when we do that- and we do not in this case have the luxury of sending this to the relevant committee, which would be budget education and city services. That means that the entire board will become the committee that deals with this, and that is the committee of a whole and we would discuss question comment and decide on a final action, so the committee of the whole will be conducted under the same guidelines as any other committee and we'll begin with the chair of Beck's, presenting the issue before you, which she has. Basically, I think given us most of the information and then we'll enter into just as we would at a committee meeting, questions and comments and discussion on how we want to proceed. If we want to have an action and what it will be so renee do you have anything further to add to your explanation? Is there anything that you can think of before we ask for questions? No, I would. I would simply add that we've been involved with the harmonia from the outset. It's been cited in our district for about two years and the increasing support that they've given to their clients is that they've seen real movement, and I think that this is hard. The work that they do is hard and to get that incremental gain that incremental trust and get people to be really stabilized is tough work and so to just arbitrarily give very little notice if at all and just kick them out to who knows where we do not know. I do not think that that's something we should support, plus there will be losses of jobs. We understand. Is that correct? That is correct. Again, we do not have any insight. This has not been. You know we're learning things by Tweet and by asking everyone, but we have not received confirmation specifically, but that's what we understand is happening. Yes, I think that was in Senator Krueger's yeah. She puts out to the boards. I think that was in there as well all right. So, let's start with questions regarding this issue. Just raise your hand and we can get you know start the conversation renee cafaro. So what exactly is being asked of us? You know? Are we just sending a letter that we do not the mayor's plan to move these folks or are we offering up a solution? I mean we do have a you know. As you said, I mean the bulk of the hotels, which it's not fair, that we should be taking the lion's share. However, you know, maybe that is something we can do in order to save these families, so we're only going to cause a larger problem down the road by you know displacing these families, so we offering up solutions or just sort of like shaking our fist at them and asking for more transparency in the future, and I guess the second part of my question, which is sort of attached. This whole thing is: are we at all addressing the future of the homeless mail facility that was supposed to be going into park savoy? I do not know what the construction status of that is, but if it was close to being open or functional, perhaps they could go there, and we can. I mean, I understand this whole debacle reminds me way too much of the horrible. You know outcry. We heard- and the mayor heard about that- and I was really they should be ashamed of themselves- for how you know how we treated the homeless issue in the northern part of our district, and so I I'm a big supporter of that perks of having the shelter there, and I would think that could be an option. If that's something you know that someone would not mind writing in the resolution. It's just offering up as an option opportunity to maybe fast- track that and that could be the home. Instead of kicking all these people out of the shelter they need, renee, hi renee. Just to answer. I think one of the problems that we have is that we are not a participant in the conversation, so it's really hard to offer a solution when we do not understand why the move is being done right. We heard nominally that there's more room in the harmonia, but it's not clear to us. You know what is being offered to the Harmonia residents, why it's better for them to potentially move what is being offered to the men that are relocating from the luzerne. So I agree with you: we should be doing more than shaking our fist, but if we do not have any information about what's going on and why it's really hard to do fair enough, I mean I know DOH is essentially you know as of right, then kind of do whatever whenever without us. So obviously we need to continue to hammer at that, but I would be really in favor of a strongly worded letter or whatever was reading to be borderline politically incorrect and calling out the administration for basically, what I think is a political move to you know: appease big donor nimbys in the upper West side and these nicer areas or billionaires row, and you see it time and again and just thinking you just kick the can to a different neighborhood, and you know it's really unfair for folks to not take their fair share in New York City. We all need to do our part and you can't just dump everything near Penn station, so I think that it needs to be called out and I'd be happy to write something to that effect. If anyone really wants to call folks out- because I know that we legally do not have any heart in this fight, but I think we should try to force one, I think it would be helpful if anyone would like to know where the elected stand on this. We should have all gotten the statement from the Midtown elected officials on this, and it would. It came from Kruger Brewer gottfried powers. I think that was it it's, it should be in your inboxes. I think it was sent out early this afternoon if that would be of any help, any other, any other comments or questions and as to you know, information you might need, and then what are we going to do? Clayton? I agree with renee that it should be as strong as possible. In my opinion, what I would offer to the committee of the whole is that would be a resolution. I think this is not a letter. I actually think. Hopefully, if we work together tonight in a way that makes sense. I think a resolution is the strongest way that we can contribute and, given that we have managed to have this timing of this meeting tonight and respond in such short order, that would be optimal. I have concerns about getting into a conversation about which sites and possible solutions, because I do not know that we can have the capacity or the information have not done the due diligence to be able to fairly and comprehensively have that conversation, not that we should not have it, but I think that for the outset of this fight, which is only beginning most likely, what this resolution might be most effective is for it to be a and I'm happy to use the strongest language that rene Kafara would suggest. I know she uses strong language and I'm all about it to say all the problems that renee kinsella, you outlined the transparency, the accountability, the community involvement, data- driven decisions, rationale all of that stuff. We need to call them out about when he, when De Blasio first was defending publicly his decision to move these men into Lucerne. He had no concern about public sentiment or lawsuits and said this is the best decision out of public health. So where is that mayor? Because if that is the way, it is that's what he believes. I do not believe that this is a decision about public health and I think that our focus needs to be about what's happening in our district and with the programs renee kinsella that you did such a good job of explaining have attract real track record, and that should be our primary concern of this resolution is protecting those families. I think the stability of the providers that they have and the programs that they are part of should be the number one most important thing in this committee's deliberation right now: okay, Jordan! Thank you, Vicky, that's a question for renee kinsella or anyone else with knowledge, since this is a moving renee is the Answer Lady Excellent. Do we know when, when this is all slated to happen, we've heard as early as this weekend? We understand that people have received notices, but I do not know specifically, but we've heard that it's happening soon. So that's why time is of the essence. Okay, in that case, I I'm not to go around circles, but I agree with renee and clayton that this is a politically motivated move, having nothing to do with the needs of either the men at the Lucerne or the people at the Harmonia, and we should call out the administration on this, because this is a joke. This is really unconscionable and I think we should all be pretty angry a lot of issues going on with us. So thank you, okay. Anyone else, I do not see any other hands. No, I do not all right, so the suggestion is to have a resolution. Sorry Robert Isaacs raise his hand yeah thanks Luke. I just I wanted to say that I do think I'd like to see something in a resolution, kind of calling out the sort of non-, cohesive, whack-, a- mole nature of the administration's approach to homelessness. From really the very beginning and acknowledging that you know, we agree with the electives on the need to kind of share the share, the you know the difficulties and absorb some of the challenges and everything, but we also, you know, call on the administration to try to actually continue putting something together. That makes sense, and that does that in a coherent manner and is not just a matter of sort of passing around political footballs because it just feels like that's what they've been doing before during and probably after the pandemic. Okay I'll take another look. If anyone else, please raise your hand if anyone else has anything further to say: Charles, Miller, Chuck you're after me on you. Thank you. I have a process question will this so the resolution is written. Will we see it again or are we voting for what the resolution will say and then and then it will be written and sent off. Given the time element, I mean we'll probably send it to everyone, but if the vote has been taken and the information that we want to put in the resolution is gone over at this meeting, I think time is of the essence. We need to get it before the weekend. We need to get it out. Okay, thank you. Anyone else, I'm scrolling. Okay. Clayton again, I do have a question to the point about solutions that we can offer simply as far as process renee is there is there something that you would recommend that we could say about the ways in which we would want community involvement and transparency? Is there anything Sp, not even specific, maybe even general, that we should add about a demand that we have just about the process and you're talking to Renee Concell yeah sure, so I think Clayton we've been asking to be participatory when DHS is sort of citing, and we recognize that this has been a pandemic. But now we've moved along a little bit, and so we've asked to be participatory in that process right to enable the community to understand what's happening and to let the community know what's happening and to let us know what's happening. I mean again to reiterate: we learned about this via tweet, and so that's not so we would ask for that transparency and to collaborate in that way. We'd also ask for the data- driven plan that you're talking about. I think that someone said it's whack-, a- mole and that's what we feel like, because we have been on a lot of calls that involve hotels and providers. Some are good. Some are less good and it's just sort of we're focusing on this one and then we're focusing on that one and what we're really looking for is a cohesive plan and leadership to sort of deal with overall, the issue of caring for these individuals in these shelters and as well as the community right and the issues that we're seeing on the street. So I think that's, I think, that's helpful and important to include in our resolution, perhaps in terms of specifically calling out that those stakeholders, including CB5, who have knowledge of sus a knowledge of this facility and experience, be consulted in a transparent and participatory manner in terms of our opinion and consultation about that piece of the and any other future similar experience that any community board in any district where there is not just the sighting of where a shelter might go. But, more importantly, when you're talking about an existing facility with families there to consult others about our we are. That facility has been a success that it is integrated into our district. We have seen that we have experience with that. That's what we're here for it's ludicrous that we would not have been consulted, or even asked about that. I think that should be part of the resolution. Specifically. Okay, I'm glad you said that Clayton, because I think what's needed right now, it sounds to me is if renee confront the two Renais will work on putting together a resolution, but in order to do that, we need input the way we just got from Clayton information. In terms of how you want this to sound, you want it to sound strong. Do you want it to say, for example, as Clayton is saying, the need to be consulted and prior knowledge? All of that we need to give them a feeling of and an understanding of how Community board five feels about this. So I see Noah has his hand up in David as well, so we can entertain more questions and then I would love to hear from all of you any of you as many as possible of you in terms of how you want this resolution to sound and to read: that's really important. So, let's start with Noah yeah. So it looks like someone just put in the chat that all people that were at the shelter at the Harmonia Shelter on 31St street were moved out. I'm not sure if that is true, but that was reported in the chat. At this point we do not know. I mean our guest is as good as anyone else's. We found as Renee said. We found this out late yesterday, right, renee, absolutely yeah, and we- and there are a lot of rumors. I do not think moving them out- is a rumor. The question is: have they done it already? Are they doing it as we speak, or are they doing it this weekend, which is why we thought it was important to really get our voices heard immediately. So that may be true noah, but we have no way of knowing at this point. Thank you. I think David Achilles, you had your hand up. Well, I was going to make a comment. Well go ahead. Okay, I'm all for a very strongly worded resolution. I agree wholeheartedly with Clayton that the neighborhoods have to be informed as a president of the West 50S Neighborhood association. I we have 600 members, it's important that the neighborhood association, like the Community board, knows what's going on in their own neighborhoods, I'm all for that, and I do not know if there's any room in a resolution for involving the real estate industry that has been given tax abatements for the last 40 years to build whatever they want and not one thought is put into shelters of the homeless situation if there is some way to involve them. I do not know if that's possible or not, but it keeps it keeps coming up in my mind, anything is possible as long as the majority of the board agrees with it. So if you know that's a suggestion and we'll see, if no one objects to it, we can have that woven into the resolution. Anyone else. Okay, thank you. Okay, David, I think Vicky. If I yeah go ahead renee. I think that we need to demand an overall plan for managing all of this, the shelters and for some coordination between the different providers. While this is very important to protect the current residents of the harmonia, some of the issues that we're seeing overall, it would be really useful to have information about why and how things are being done. And why and how you know. We understand that we're providing services and the individuals need services, but we do not understand where they're going. Why they're going? How they're going? We just have no information, so the transparency is really key so that we can be helpful. Okay, leila layla, you're on mute. Sorry, thank you. I would even go further. You know it is a crisis situation, which is why we are acting as a committee of a whole. I think the language has to address this crisis, and the crisis is that individuals who have been living in this particular facility receiving services who are vulnerable adults are being moved, and this is just unacceptable. I mean you can not move people like that at you know the mayor's whim, because it is convenient because he needs to get rid of a problem somewhere else. It is not acceptable. I mean the contempt for the lives of these individuals that are being moved is simply despicable, revolting and I'm hoping that the language of our resolution will convey that. So I would hope that we would really focus on this. While I also acknowledge that you know the broader issue of where they are going is touched on, I'm just hoping that we can achieve what we're talking about that. Do not move these individuals, they should not be moved and, as far as the rationale for moving the individual from the Lucerne hotel elsewhere I mean the Lucerne is not in our district. We do not have full knowledge of what is what the situation is. I do not know that venus. We need to get involved, but certainly whatever the situation is over there, it should not be at the expense of residents of our district and a provider in our district that have been doing a good job, and you know I think we really should make that point as strong as possible and as Renee Faro said, you know if we have to be borderline politically incorrect. Maybe this is the time to be. Thank you, I'm happy to hear that I'm just going to say that this is one of those rare instances where I'm a part of the conversation as well and, as you know in my in our full board meetings and our resolutions, I very rarely give my opinion. I very rarely, as I think the chair should be. The chair should be running the meeting in this case and before Layla spoke, I was going to say I really want to hear from the board, because when I heard about this yesterday, I have to tell you I'm filled with emotion over this. I think it's despicable, I think it's horrible and I want to know if community Board 5, the majority of people in Community, Board 5, feel that way. I do not want it to. I do not want to put out a resolution that is either mealy- mouthed or not effective, so you do not have to agree with me and if you do not that's fine, but I want to hear if you do or if you disagree. This is an important issue. Renee has been working on this renee kinsella has been working on this problem of homelessness, not just this particular issue now for many weeks, and a lot of time has gone into it and a lot of thought has gone into it, and it's all done. It was done during the month of August when we did not meet and therefore none of you are aware of it. So I do not blame you for all of a sudden bam. This is coming in front of you, but again, I'm just going to reiterate. I see some hands up good, but I'm just going to reiterate and if I start to get a little too emotional, I apologize, but I am furious over this okay Matthew Hartman. So I have I have a question and then a comment to share my point of view. My point of view is, it seems like there's. This sort of emotional side of this is just the speed of the decision. It seems not humane to tell people that they're going to move out of a place and need to be gone in two days which, regardless of the overall the overarching policy and that's, gets my second question, but that seems like the the to me in a resolution that was going to be strongly worded talking about how the how the people who are being affected are treated as the most is the most important part, or it sounds like that's kind of what I'm hearing. The second part is a communication of a larger plan. I dropped a link to the political article about it that came out a couple of hours ago, where De Blasio. They do say that during his press briefing, he talked to the commissioner about the bigger policy approach and I'm just my question is how much of that has the community board been involved with updated on? How surprising is this? Is it just that the that the action happened so quickly or is this? Is this part of a larger policy that we we've been informed about getting people out of the hotels, long term renee? So we literally learned of this- and I think it's part of the larger policy program that we are not a participant in this process at all. You know very rarely. We get notification very short periods of time. So I think I think it's the larger policy issue that you're, referring to one thing that I will say is that when you think about the people in the Harmonia right, one of the things that clients need are is the stability and the routine the com. You know. If you talk, I once had a chat with the chef at the at the Harmonia, and he said you know the people come to rely on him. People come and they see him and they chat to him and it that is, that is important to develop that stability, and I do not just think in the harmonia but any shelter. It takes a long time to build up that trust and to get people stable when they may have. You know, disability issues or other issues and there's not many family hotels, the adult family, hotels. I do not think there's that many around, so this is really special and they've been doing they're great neighbors anyway. Does that help Matt? Thank you, yeah, that's helpful. I mean I would be supportive of particularly highlighting the speed that this is happening at. It is wonderful when the government moves at a fast speed. In many cases this sounds like one where it's really detrimental and the and the communication aspect those would be. I would sort of I'd highlight those too okay. I will interject that renee and I were on a phone call yesterday afternoon, a representative of the mayor, and we were told that there was going to be a move of the the men at the Lucerne. We asked the question as to where they would be moved and we were told that was information that could not be divulged, however, and they were not sure, but they were pretty sure that it was going to move somewhere in the area of where they had come from and within three hours. After that discussion, we were told they were moving into board five, so I can't believe for a second that no one knew that anyway, Christopher Clark hi. So I suppose the short answer is Vicki. I completely agree with everything you say. I agree with the passion. I agree that we should have basically the strongest stance that we can possibly take. I also agree with David's suggestion to include strong language about the role of the real estate industry, both in creating a situation in which certain types of development have been prioritized over others, which has led to a severe shortage of housing in addition to practices of eviction that make people homeless in the first place. So they'll, both their role in creating this problem and also the role that they can play in solving this problem, and specifically as the Covid-19 crisis, continues, we're probably going to see a wave of foreclosures as well as a wave of hotels, shutting down, and so that will represent a tremendous amount of housing becoming available. And when a city has a lot of housing available and a lot of people who need housing, it seems appropriate that the people who need housing be given that housing that has become available. So I think whether it is buying foreclosed properties at a reduced price or perhaps even using eminent domain to to take properties such as hotels that have been shut down. But the property owner refuses to sell. I think that would be a proportionate and appropriate response, and I also wanted to note something about the tone of the resolution. I have not gotten this sense from any anyone who has spoken so far, but I do want to note that sometimes, when community boards or other groups talk about, you know their frustration that they were not contacted about this plan. Sometimes that is merely a screen first for something else frequently when it comes to the issue of homelessness, communities will say that their objection is that they were not informed beforehand when their objection is really more that they do not want a homeless shelter cited in their area, and so I think, in addition to the strong language, about the need for community involvement in these decisions, I think it's appropriate to specify that our objection here is not that homeless people are being proposed to be moved into our district. Our objection is the displacement of these people who need these services and, in addition to our display our displeasure with the complete lack of a coherent scheme for addressing this issue. So that's my comment. Okay, thank you. Joseph Brewer. All right, thank you I'll! Try to keep it short because, honestly, I agree with most of the speaker's opinions on how despicable this is, and I agree that we should use very strong language. The only points that I wanted to add was that I think we should highlight the hypocrisy of the administration and how they're handling this. When the administration you know, started shuffling people willy- nilly into hotels without informing anybody in the city. The excuse that I know the DHS stated was that it's a pandemic, their biggest priority is the health of the residents of the shelters. They just could not inform people, because you know how can you know? How can you inform everyone and make everyone happy when you're saving lives right? It was a very noble response from them. In this case, though, they are doing something for political purposes, they're saying that they can't inform us when they're, actually taking an action, that's going to directly harm individuals, health. This is one of those vulnerable populations in the city. It's well documented that unexpected moving that being uprooted from your social connections, your doctors is horrible for mental health. It's actually terrible for physical health during a pandemic, and so clearly we need to stick up for the residents of this shelter, and I guess the last point that I would suggest adding is that you know sus. I do not know how involved or not involved they were in this. I have a feeling that they were directed to do this and I had no say, but you know, when there's so many stresses on the homeless services system, to direct a provider to suddenly shuffle around their clients all over the city, to let go staff to dismantle all of their administrative systems that supported this shelter. I mean it's probably a huge burden on the administration of Sus, so that takes away from their ability to serve clients all over the city at their other shelters as well, and I think this is happening writ large with all of these unexpected moves and how they affect the staff and the administration at all of these homeless services providers, including the one that I work at. Okay. Thank you, Rachel. For the sake of time, I just wanted to say that I fully support what everyone else has said and would fully support writing resolution on this matter. Okay, great, thank you Barbara. Also, in the interest of time I was going to say something very similar. I it's completely outrageous and I also advocate using very strong language to describe how we feel about the situation and for advocating for the residents of our district. Okay, great, thank you, Joe Mafia Vicky. I think we should word strongly word and condemn the action as well as call for a centralized, city- wide plan and the communication of that plan. Okay, great Jamie, Kane, hi Vicky. I had a question and then I'll share my remark. So I guess my question was, you know: do we know the stance of hotels, for instance like it? Is there a financial reason, because one the reason I say that is because I know few people who work in the hotel industry right now and there are a lot of hotels in this area that are closing because there's there are no people right now, no tourists- and maybe it's more financially motivated than we think concern- is one of them renee yeah renee. I just wanted to clarify what's going on in terms of context, you know because my understanding is that the hotel there's an association of Hotels and they present. You know they offer themselves to this program yeah. So I think that's you know they. I guess they make financial considerations or business considerations and offer themselves into this program and then DHS is allowed to choose from there. So I can't answer directly, but I assume you know it's financially motivated yeah, because I'm also thinking so there's a local homeless, shelter near me on 51st. I think it's connected to St Bart's the church and that soup kitchen they do not. They have a woman's shelter, but they have. They know shelter anymore because of Covid-19, and what I'm thinking is that you know as much as these peop. So there are two things I think the first thing is yes, it's kind of awful that there was no plan for these people right, no plan to bring them to any other shelter, and it's really unfortunate that the actual shelters that could potentially serve them are completely closed, especially the ones near me like the one on 51st street and park. So I think in the letter one thing I mean I think you know everyone's been echoing- that we should make a strong stance about it, but in addition to that, I think it'd be really valuable to come up with a plan in terms of where would these homeless people go right like there's not there's only so much, we can do to express anger frustration. You know contempt for the situation, but I think to make that more powerful as something that is more actionable, maybe like. Where can these people go? Should we start opening up the local shelters in Manhattan that used to house these people, and then I think the second thing is you know, so I'm sympathetic for both communities right because I think the hotel community. I think one thing that I just do not want people to miss out here is that hotels are closing their doors because they just have no income right now, and I know that that's not understandable, because the homeless population is very vulnerable and having worked in one myself, I completely see where this sentiment is coming from, but I just feel like we need to understand both sides where people might not have enough money to support the homeless at this time. I, for whatever reason and people will go on with their reasons, but and as a result, what can we do as solutions that are actionable to fix that this situation? You know, I think it's deplorable, but that there was no solution and it's just people moving out of a hotel, but anything you basically agree with everything. That's been said so far. Basically, Jamie. Sorry, do you basically agree with what has been said? Thus far in terms of what's going into the resolution, yeah and I mean what you're suggesting yeah, I agree with having stating our opinions right, but I think what would be more powerful is the state the backup plans right like what can I think about the sort of thing if renee, if you might want to take this renee, I think we do have the answer to that. Go ahead. So one of the reasons that people have been moved into hotels out of the congregate shelters is due to Covid-19 right. You want it. I know distance me and so the metrics to determine when it's safe to move them back to the congregate shelters. We've asked for that information. You know, when might it be safe? What metrics are you using? How are you determining this and we've not been able to get an answer for that, so it's sort of hard to advocate for moving people back to the congregate shelter. If we do not know what the metric is or when they will be safe. I also think that Brian from the Bp's office put something in the chat regarding more specifically the contracts that hotels have with DHS, and it's certainly something we can work on in the future right renee. Absolutely. I just feel like we're. Not addressing that. I'm sorry look Jeremy well, I just feel like we're not addressing the root cause. For instance, I rene. I know that people are. I think, at this point we're trying to voice our concern with the reasons why and then I think what you're bringing up is something that we absolutely have to work on. Would you like to be a member of that? I just feel like we're, not really addressing the root cause. I know I hear you, but we will it's just that we have to get a resolution on how we are reacting to the action. That's before us, that's going to happen or is happening right now, yeah, okay, I just do not want this. The other people who read this to make it seem like we're just complaining and we're not really looking at the big picture. No, I do not think it'll be written. That way, okay, but we'll take everything. You've said into account. I think it's a good point. Thank you. I really do. Thank you. Okay, nancy. Okay, so my I'm looking at this now and I'm saying to myself, this is a well- established, successful family shelter and it's being SAPOtaged by the city by moving in residence by moving the residents out of a successful operation and moving in residents from a DHS failed experiment from the upper West side, and that was to me the upper West side situation with the cern. That was a failed experiment when they put those men in there, they did not offer them any services, they just put them in there, but you can't do that. You have to provide homeless shelter with services and as long as the city does not provide services, it's going to fail, but the fact that they're SAPOtaging this successful family shelter is what's really upsetting me, the most okay. Thank you, Nancy Clayton. Yes, I two things one to Joseph's point about Sus. I just wanted to make sure that I have a clear understanding, renee kinsella, that Sus is in fact not been tasked with relocating these people. Their contract is being potentially severed and we do not know who the provider is going to be for wherever it is that these people are relocated. So if that's true, then Sus is as much of a victim of this whack- a- mole insanity as the people being moved. So I do think that should also be part of a resolution, because Sus is also one of our constituents in this district who we, who we admire and work with, and I think that's an important thing to highlight in the resolution and then the other thing is I've. People been dropping links and stuff in the chat from the googling that I've done de Blasio said no move would happen prior to September 20th, but there are interviews on the record with families who said to reporters that they got phone calls saying that they will be removed by Friday pack, your bags, so who knows who those people are and what those phone calls were. But that is the public record, so, given that I might also offer that the language of this resolution we might want to cover ourselves and imagine a scenario where, by the time somebody reads this resolution, the move has already occurred, so we might want to have the indictment of this decision be clearly. It was already going to be robust and strong, given the temperature of the zoom room, but we might just want to anticipate that where this lands is after. This is all over, which is a real shame, but that I think, is what we might very well be ending up dealing with. So I do not think that we should not be very aspirational. Is what I'm saying in the language of this, because I think it looks like it's going to happen. Okay, I see also in the chat that there are a number of people on the board that are in full agreement. Like James someone else wrote to Laura Garcia Sam Levy. Thank you. That's very helpful. All right, we probably can be winding down with chuck miller again and then Todd. Thank you. Thank you Vicky. I, as I hear the discussion, I am in agreement with it. I think that our best credibility as a board here will be to focus on in this resolution, to focus on the things that we feel most passionately and that we know we know that we care about the individuals who are in the shelter in our in our district. We know we care about that provider and we know that provider was a success, so I would encourage the resolution writers to focus on those themes that we care about the individuals and we care about disrupting what was a successful program. The transparency and all of the other things will support that. But those two particular points, I think, are our strongest. Okay, that's good todd. I was just going to say the same thing that Charles just mentioned, which is that I support the language. It should show our indignation in the strongest possible way and it's a lot easier. It's a lot easier to break something and to build something that works anyway. I fully support this okay, great okay. I think we can I'll take John Harris. I just want to mention that in the chat we've had some questions regarding other hotels and other problems, and rather than get into that this evening, because we are working on something very specific and trying to do that so that we can get to our regular agenda, which is rather lengthy as well. Please understand that is being worked on by the Bex Committee and that I encourage anyone. I see someone from from the public entered the chat about other hotels and so check our website check the next meeting of the Vex Becs Education and city services and you'll be able to get as much information as we can provide, and maybe you can help us as well. So all right, let's end with John Harris and then have a recap by the two renees John would it be? Would it add to the credibility accreditability of what we're doing to say that if the Ru, if the role was reversed, we would strongly support a keeping facility in our area. Sorry vicki, I unmuted you because there was some feedback. I think it's a good question, but I do think that's another whole subject that we could probably spend an hour on itself. We do not have the answer to that, because we as a board have not had that conversation renee. What would you say, because that's what I'm hearing the board saying that our objections are because of our concern? You know for the residents. So if we had a number of residents in a facility in our district that were being properly taken care of yeah, I get your questions and they were being disrupted. I you know, I would just like to know what the board thinks about that. If you know, because I think it is relevant to this resolution, it's I believe it's a conversation that would really require a very lengthy discussion and that, maybe you personally feel that way. I do not know if everyone does, and we would have to talk to everyone about that. We can't make an assumption that we would be reacting a particular way or we would not. If you want to see an example of that, you have to look at what happened on the upper West side, because there were very differing viewpoints on it and it took many meetings and long hard discussions to come to any conclusion, and in some cases it did not even come to a conclusion. So I'm not minimizing John. I just feel that it's something that we can't get into. We certainly can't make the statement tonight because we have not talked about that and that's fine- and I just want to be clear that I'm not saying that that's my view, I'm just suggesting that this is an issue. That's open, we're subject to being asked at some point sure: okay, it could be another discussion at another time. It's a good question, thank you, okay, renee and renee how about recapping so that the board has an idea of what will be going into this resolution and we can take a vote on it. Okay, what I have- and I have a strongly worded or politically incorrect resolution- protesting the treatment of the residents of the harmonia and Sus. We believe it's outrageous. What has occurred? It has threatened and undermined the stability and work that both the clients at that homeless, shelter and sus have done over these last months, because they've been incredible neighbors that we very much appreciate and value we would like. We were we're outraged at the lack of notice. We want clear, transparent decision making from the administrative administration and we would like to be involved we'd like to have community participation and input into the decisions of citing people in our district, because we have and will want to be part want them to be part of the community right renee could also help. Would you like to add anything? I think it pretty much covers it. The only other thing which you know once this you know this passes, which it sounds like it probably will that perhaps we can discuss is that I think we really whatever this it's a resolution or letter that should go far and wide through all of our social media, Et cetera, Et cetera, because there's one thing this mayor cares about it's reacting to bad press. So maybe if we kick up enough noise, someone will pay attention to us, because this is a problem we're going to continue to have- and I think maybe we can add- that in tier 2, saying that we are upset about all these things. But this is not the first time this has happened to us. Okay, and this is the worst, because it's the fastest that people have been getting kicked out. But this is a pattern and I'm happy to work with renee on writing that down, but I think she got all the salient points. I forgot the real estate that David Aquila, oh right, and I believe we determined way back in the beginning that this would be a resolve because we thought it would be. That way. Is that correct? Yes, is everybody? Okay with that right? Okay, all right is there anyone who feels that we've either forgotten something or misspoke something or would like to say anything before we take this to a vote. Clayton, you have your hand up. Well, yes, I guess my question is just what is the action of the resolution? Is it a? It is. What is the verb in the final resolve? That's my question because this is not an approval or a denial. Obviously right you're, absolutely right. Let's try to think about what would be the most if this is being addressed, I mean I guess this is being the resolution is going to be sent to the mayor and Cc everybody and under God. But what is the final resolve? I feel like the past. We have had a like strongly opposes. I mean at least when I was on Vex. We had a couple of those for things of this nature that were not exactly. You know in our purview to look at as an application, but we proactively saw, and so it would be like a strongly adv opposes and then there'd be like sometimes a secondary part of the end. That would say you know that we resolve these suggestions like if we have actual action items for that right, so strongly opposes the move to move people to displace the harmonia and therefore be it for the resolved that we strongly urge or whatever urge that you do. The following bullet points: cool is everybody? Okay with that, okay, all right, I think we're ready to take this to a vote todd you have one last thing to say yeah so on the action. The other additional point should be that we also say they should that the mayor and his administration should reconsider the move and give timely notice to the Community Board and the other community stakeholders to respond and give to give. You know a measured opinion. Okay, all right! Thank you all right, I'm going to take one last and then we've got to wrap it up, because we do have a very full schedule. Kelly hi, thank you Vicky. I was just wondering why we can't just ask for them to halt the decision like why we have to oppose it as opposed to just saying that we want them to halt it. Well, that can be part of it. If I might just jump in real quick on that, I mean we can't really put the in the resolve that we deny this or something because it's like by charter, not something that came to us, but we could definitely ask. I do think calling upon them to reverse their decision needs to be in there someplace, but practically I mean people are getting moved out of there as we speak. I do not think that we'll be able to possibly reverse this, because now you've moved people out of the Lucerne and they need somewhere to go, and so we can put that in there, but I do not think it's really in like legally in our purview to tell them to stop anything, but we should definitely put in, and I will write that clause as well about how we would like them to reverse their decision and find other suitable places for the folks at Lucerne if they can't go back to the Lucerne, so that yeah so I'll. Put that on my notes too. Okay renee did you renee Kinsella? Did you have something further? Yes, I just want to address. Clayton made an important point that the resolution should also address after the fact that if this is de facto happening- and I do not know where you were going- that with that clayton, but if we want to include that you said you know, we may not be able to halt that the resolution should address. After the fact. I just think it's going to take some strange language massaging, but I think we have to kind of we have to kind of shape- shift and use some tenses that allow for that possibility. So just in case our voice meaningfully adds to the push to at least pause this move or, if not, that the resolution can still be meaningful and helpful and contribute by making clear how we feel should not come to pass. You want to take a first crack at this. I will write down some of the clauses that I have. I can put them together, then maybe Clayton. If you're cool, I can send it to. You, could do a read through and see. If there's anything we missed and anything you want to add, and then we should be good to go. Okay, great, all, right, we're going to take this to a vote. Just please. Everyone understand that this will be written, taking into account everything. That's been said, everything that we've gone over and we because of time we'll be sending it out. You will get a copy, but it really has to be the final. I hope you all understand that all right. Let's take this to a vote. Do you need a vote? Oh sorry, Vicky, do you need a motion? The motion was made to be. I thought it would no you're right. We did not do the motion we did the most. I moved that we passed a resolution to oppose the move out of the harmonia in taking into consideration all the discussion heretofore. Second, okay. Great. Go craig achalas! Yes, Anthony! Yes, behar! Yes, Speichman! Yes, Burton! Yes, barrow! Yes, true! Yes, bark! Yes, dale! Yes, dosin! Yes, Ford! Yes, Brewer! Yes, Garcia! Yes, Goldman! Yes, dashao! Yes, us! Yes, Harris! Yes, Portman! Yes, Maya! Yes, Johnson! Yes, payback! Yes, Kang! Yes, Mafia! Yes, Mccall, yes, Meyerson, yes, miller; yes, Raybar, yes, shapiro! Yes, Slutskin! Yes, Smith! Yes, spandorff! Yes, spence, yes, stern! Yes, verdi! Yes, webb! Yes, weintraub! Yes, whalen! Yes, Yang! Yes, try again! Kang! Okay and barbaro is a yes on this one. I'm not okay! Craig Isaacs was a yes as well. Oh sorry! Yes, okay, it passes unanimously. Thank you! So much, I'm sorry. It took that long, but it really as you all I understand and know, it was really important. So now, let's get going into our committee reports and let's continue with bex thanks again everybody renee. Thanks vicky. We had two meetings since the last full board. The first was on August 4th and the second was on August 25th and from that we had six issues, but only two read six reports, but only two resolutions. The first was the committee's consideration of the NYPD budget and the role of the police department, and the second was support of exempting small businesses from the commercial tax rent tax. So the first reso took two meetings to put together. I want to thank Joseph Fuhrer because he really did Trojan's work and, taking all the conversations we had a very robust conversation about the NYPD budget and the role of the NYPD. There was a lot of committee and community input and what we did was we used a template that I think the transportation committee had developed as a way of organizing all the information, and we put it into the facts, our core principles and then the recommendations that we wanted to make it's a lot to take in. So please bear with me I'll go quickly. I just want to let you know, though, a little back background about this community boards CB5 included. We comment on the preliminary budget in 2021 in February. We did that back in February, but a lot of things happened between then and the issuance of the executive budget right and just if you do not know the mayor does a preliminary budget in January. We weigh in there's council hearings and then the mayor then releases an executive budget in April. There are more hearings and then the adopted budget is released by July first. So during that period during the executive budget, there were a lot of things happening in the world and we felt that we needed to speak to those things. So we wanted to weigh in again we wanted to respond to the physical year 2021 executive budget, just to speak to the distribution of cuts among agencies that directly serve some of the communities disproportionately impacted by Covid-19 and by the New York City Police Department, and we decided that we wanted a statement of principles to be incorporated into the boar's physical year 2022 budget request, so that can sort of guide and be used as a template when we make those requests later on. Just to take you back at the time of our discussion, we thought there was at least a 9 billion hole in lost tax revenue to the city in the fiscal year. 2021 and the preliminary executive budget for 21 was making up some of that loss through cuts to social services. You remember it was the youth employment program, but also social services, housing, education, infrastructure, all the things that were really crucial to kids and seniors and communities of color, and it left the NYPD pretty much untouched. A lot of people were calling for at least a billion dollars to be removed from the NYPD funding and the f21 budget, and when all was said and done, what actually passed was that the NYPD ended up being allocated 5.222 billion dollars and that equaled a four 414 million dollars reduction. So you can see in your packet. I believe it's on page four, how these savings were achieved, I'm not going to go through them all, but the problem, the way that we saw it was that the NYPD exceeded its overtime budget by 900,398 million and 407 million in fiscal years, 2019 and 2020.. So while this budget 21 reduced overtime spending by 60 there, it does not, it did not speak to overtime after fiscal year 21.. Another issue that we saw was that the budget yep counts on partial hiring freezes and agreements with the city's municipal, labor unions and all but 62 million of the reduction to the NYPD, comprised either fringe benefits, unenforceable, overtime and future commitments that were not really included in the signed budget. We were concerned that there was a shift of school crossing guards to the department of education, because that just really moves the money from the NYPD to the DOE, but according to the New York City's independent budget office, all that really meant was that the DOE would operate a program that it already had, but under funding because they underwriting rather because they were sending this 307 million to the NYPD for school safety programs anyway. Another problem that we had was that units of pro of appropriation in the budget were very broad, so it was hard to parse and difficult to understand and we did not really have clear. You know it was hard for anyone to really provide clear oversight on NYPD spending. Cb5 is on record as supporting schools and children and communities of color and frontline services, and all of that led to us creating this set of core guiding principles that we we're going to now use as a lens. When we make our budget recommendations, there's a so there's eight core principles in this resolution. You can see them in your packet, but briefly, it's the budget is a statement of values, efficient use of funds, equal opportunity, purpose and mission, diversity, transparency in accountancy, ethical and legal behavior, and trust and respect. Our conclusion is: we believe that there was a failure in this budget in prioritizing frontline services during the pandemic, and the budget cuts should be fairly distributed. Acrosss agencies, including the NYPD in the reso we ask for clear and honest communication from elected officials about budget decisions, a formal plan to achieve targeted reduction in NYPD overtime spending, a formal plan for the tradition of school safety agents and school crossing guards from the nyp to the NYPD to the DOE, a full reporting on the shift of some homeless outreach services from NYPD to DHS, which we heard is already happening. We also want OMB the office of Management and budget to work with the NYPD so that we can sort of see in 2022 budget appropriations that are organized really logically. So you can. You can have clear oversight and transparency and accountability, and we also ask for OMB to standardize the formatting of its publications so that we can pass current and future spending. So you can actually compare apples to apples when you're looking at these budget numbers. We also ask that the NYPD published what it's spending on military- grade equipment, how they've used that equipment, what they plan to do with the equipment in the future, and we've also asked for the mayor and City Council to create a plan that allow for the dismissal of officers. Who've committed, illegal or unethical behavior or you know, have consistent patterns of bias in their enforcement, and we look forward to making our budget requests when we do that. We commit to reconsideration of the role of police officers in our city and to try and think of alternative agencies and initiatives that might better serve the mission of NYPD the mission of the NYPD in certain sectors if they were funded. In other words, you know what you know, perhaps social workers, perhaps other agencies, might be better served in the mission of the NYPD if they were funded. Our resolution was unanimous. I know it's very ambitious, but I want to thank the committee. They really worked hard over two meetings to put this together, a phenomenal job. It's a great resolution. Thank you before I ask for questions and comments. I just want to mention to everyone that, while I understand that every so often you might have to take a break here and there this is a virtual meeting and please stay on as long as you can virtually that's. Why we're here? We're not doing a phone call conference calls. So, having said that, are there is there anyone who is who has a conflict with this resolution? Okay, does anyone have any questions? James Buzz? Yes, I kind of wish. I were not first, but I will do so first. I will say that I have read the resolution very carefully. I came this afternoon and I think I understand what needs to be done. I need to make a few words of background. I am 79 years old and we moved out of New York City upstate when things got bad with the virus in the end of March and we've been planning. Excuse me Buzz. Is this a comment? It is a question: okay, sorry, okay, so we are considering moving back or not considering. We've been planning moving back to the city within this month, because the virus situation is so much better, but we have heard and read and heard a person on here this evening. Talk about you know streetwalkers and fear to go out of the building on 57th street and we've read about the increase in shootings and the increase in crime and, in my neighborhood, a very significant increase in Graffiti. My question really: is I fully support what it is your we are trying to do. I want to know specifically, have you had input to these ideas from the police or any other law enforcement or law enforcement related agency in the city, such as the district attorney, have people who talked about the impact of this with the people who are charged with these responsibilities. For you and for me, we have not had input in our meetings from the NYPD or from the district attorney, and I do want to say in our conversations buzz. We are not suggesting that the NYPD do not do their job. With regard to all of those issues that you stated, you have suggested a reduction in funding and my question is very specific: okay, what is their reaction to their missions? Regarding the suggestions that have been made in your resolution, we have not had direct a direct response from the NYPD regarding our resolution, so I can't speak to that. I do know that there have been media reports that the NYPD is not believes that this may impact I've read different things may impact how they perform in their job duties. Our position is that we are not in reducing the budget. We are saying that there's a pot of money right and that there are some things that the nyp do very well and those things include crime, stopping right all of those things that you have mentioned, but other things such as school safety. Maybe they are not as well placed as other agencies and so what we're in a time of fiscal, we're in a pandemic and there's a hole in the budget we are suggesting. Perhaps there are other agencies that are better suited to fulfill the mention of say, school safety than armed police officers. You are suggesting that, and I agree with the suggestion, but if it has not been verified, I can not support this resolution. Okay, any other questions, Chris Craw Clark! Well, I'm! Actually this is sort of a meta question. I have several recommendations regarding specific budget language, I'm in a specific reso language, I'm not sure if that's a question or a comment for our purposes. It's a question because you're asking if they can be included, is that correct? Okay? Yes, okay! Great thank you. So I wanted to start by thanking the beck's committee and especially Joseph and Renee for all of the work. It's a massive topic and a lot of different passionate voices on this. I have several some minor, some less minor requests that I would love to hear feedback from the board regarding one or actually before I get into that. I also want to say that I appreciate that the resolution commits to, as you mentioned, rene a reconsideration later on of the role of the police in New York City. I think that's vital, I'm very excited for that conversation and sort of to that effect. I have a question about changing the name of the resolution. I'm not sure if the name of the resolution actually matters, but it currently says NYPD budget and alternative public safety strategies. I'm not sure that we're at the alternative public safety strategies section. Yet I do not want to give the impression that this resolution contains our full thinking on alternate public safety strategies, so my request would be if we could just sort of remove that part to make the name just NYPD budget is it? Is it best if I sort of go one by one or just sort of lay everything out yeah? Let's have a look renee. Is that a problem in terms of actually describing what this resolution is? We usually try and put as much information in the description as possible to let people know that it's not just you know budget is there. Is there any other way of adding information? That would not that you would not find problematic Chris or you, maybe you know core principles for NYPD budget allocations, or something like that. Like that renee I like that, I was going to suggest myself. We could add core budget principles, how's that that's great okay and I you know if anyone else has a problem with that. We'll talk about that later, but continue with your other and then we'll take other questions and comments. Okay and vicki. I do not mean to grandstand at any point, so please do not hesitate to interrupt me if I'm going beyond the role of go ahead, all right so moving on from the title, I have a sort of list that I'm consulting right now that I drew up earlier so going to line 227, which sort of introduces the black lives matter movement into the discussion of the budget. I sort of mentioned this in the last time that the full board discussed issues pertaining to the police. I'm a little concerned about us framing our position on this matter entirely in the context of a fiscal crisis. I believe that calls for changing the way that public safety is handled have existed before the current fiscal crisis and they probably will, unless something dramatic happens, they will continue even once. New York City is hopefully in a better, more stable financial situation, so my proposed language there would be instead of what it currently says, which is this fiscal crisis coincides with broad and sustained activism. I would propose that we say in addition to the fiscal crisis the fiscal year 2021 executive budget coincides with and then continue on with broad and sustained activism. It's a very minor change, but I want to sort of make clear that this conversation is not only a response to a fiscal crunch, but also concerns about public safety that exists separately from that Chris. I do not what line? Did you say right? That was 227.. Are you? Are you looking at the final d, or am I looking at the wrong one? I do not have lines. I think it's line, 21, that's 21.! Okay, I'm sorry yeah! I must be looking at a an outdated one, because I'm realizing all right. Okay, good! Sorry about that. That's okay, then, all the other line numbers that I have will be a little off there. Okay, renee! I think that's a fine! I think that's fine! I I'm perfectly happy okay! Thank you. Renee! Moving on to an incorrect line number I had a question just sort of clarifying about what I have as line 315, but about the school guards and also homeless, services being shifted. This might have been changed. I'm really sorry, I did not realize I was looking at the outdated version, but I believe it says that some aspects are being transferred over to DHS and I was under the impression that essentially, all aspects of homeless outreach were being transferred away from the police department, and I asked that because I believe would be appropriate for us to request that all homeless services be transferred away from the NYPD. If that's not already the policy, we believe it's the policy we're finding out that. So I do not want to say all until this is absolutely confirmed to us, which it has not been. We understand a lot of those services happen. Okay, that makes sense. I understand that a lack of transparency is the theme of the night. I'm hearing. Okay, thank you for that. So now, moving on to what I'm sure many of you will be happy to hear is my penultimate note at the bottom of the resolution. The very last result. I there's some language that I would ask that we change. I would change so I'll. Read the sentence out loud CB5 recognizes that the NYPD has become saddled with some responsibilities ideally suited to Accomplish saddled, I think, has Chris for some reason. I do not know if anybody else is experiencing this, but no I'm not getting it Chris you're. We can't hear you. Can you repeat after saddled? Can you hear me now? Yes, okay, great sorry? Yes, I was, I was saying: saddled has a certain connotation to it and my request would be that we changed that to tasked with or charged with, Saddle sort of implies, a passive role in the NYPD in this process of taking on new responsibilities, which I think is historically inaccurate in certain areas. Okay, renee, I mean I'm happy to I'm happy to to change that language. You understand that some of the DOE tasks where, with the DOE that it was put with the NYPD, and so we want it back and that's why that language is used, but I'm perfectly happy to use the language choice, task or charge with either of those are fine. Okay, thank you for that context, and on that same notes, this is all part of my penultimate note. I would just ask that, instead of saying that we consider a reconsideration of the role DOT to other agencies, that might quote better accomplish aspects of the Nypd's mission. I think the resolution is very effective in framing the mission of the NYPD is something that the funding should uphold. However, I believe that the certain parts of the NYPD mission are indeed best served by the police, specifically maintaining order. However, I believe that those are not in and of themselves positive things, and I believe that a budget priority should not just be the maintenance of order for the sake of maintaining order, but rather for guaranteeing public safety and justice. So I would ask that instead of NYPD mission, we say, might better promote public safety and ensure justice. That would be a friendly amendment and I need to know if everyone is okay with it renee. Let's start with, you are you, okay with that? I you know it may not be friendly, I'm not quite sure right. I think that I am okay with it. I mean if the. If you accept that the mission of the NYPD I mean we're looking to move some of the other aspects of the Nypd's work, meaning the Nypd's collective mission currently, which includes many of the things that you may not believe, are part of public order, which includes school safety and crossing guards and all those wonderful things, which is why we use the word mission collectively of what they do. So I do not. I I'm not necessarily loving the amendment, but I could live with. It is everyone else? Okay with that Matt. Do you have a comment about this? No, this is, I have a separate question. Okay, does it have a comment about this? Okay, the courts ensure justice, not the police. Yes, I was going to say that, can you can you repeal? Can he write the amendment then you've just determined that for us. So if you want that in we're going to have to vote on it, would it be possible to move on to my last note, since I do not want to waste our time on this, which is not necessarily my main point sure, moving on to what I had in as line 324, the discussion of the military- grade equipment, which is the third to last resolved. I do not think this would be a friendly amendment since it's a more substantial change. I would ask that, instead of asking for a justification and more items or not instead of but in addition to I'm sorry am, I am, I still cutting out no you're on now. Okay, I believe that, in addition to this sort of itemized information about military- grade equipment, I think it is important to actually ask for a plan to both cease the acquisition of new equipment and actually reduce the equipment that they have. I have no doubt that the NYPD could come up with reasons for having grenade launchers and tanks, but I think that, having those reasons why they will certainly impact the board's deliberations going forward and more information is always better than less. I think that when it comes to both funding the police and then also the way the police execute their jobs, it is sort of a mainstream position that equipping police with military- grade equipment turns them into soldiers in their own minds and if they're soldiers, then you know what does that make the citizens of New York, and I think that it would be appropriate to ask that, in addition to this information being shared with us, we also ask that they come up with a plan to stop the acquisitions within the next year, which again, I believe, is a relatively mainstream request and then also come up with a plan to sell that equipment back to the United States government, which itself would raise a substantial amount of money for the city. All right. I suggest that is that the last of yours, okay, what I suggest is that we continue with questions when we get into comments. If you feel very strongly still after hearing everyone else, I suggest you then make you're going to have to make a motion to add that to an as an amendment to the resolution- and I think it's too early to do that since we've not heard from everyone yet and comments, would then be. That would be something you could do when we get into comments. Okay, yeah, that makes sense. Thank you and that's it. Yes, right! Yes, okay! Thank you! Matt hi. I had a question about line 48, just understanding the intention of we. You talked about how the DOE already funds the school safety program, and so really this is moving from the NYPD or pd over DOE. My reading of that and how you presented it is that that's is that was negative and I'm and it. But when I read number four in the core principles where the mission should line up, it seems like that would be positive because you're there, what they were saying, is they're moving this thing that they believe lines up with the mission yoe more than an NYPD. So I just I was curious for the committee's thinking on that sure. So in the former we're talking about the budget, so it's sort of almost like a bait and switch right. It's in the NYPD budget, but it's coming in through the DOE. It's not in the it's, not in the NYPD budget, for the school safety it's coming out of DOE and that money is funneling through to the NYPD right, and so that's what's happening up top. When we talk about that and when you go down to our core principles. Sorry, when we talk about a budgetary, it must be in line. Where are we we are talking about that? It should come directly from so if the NYPD is doing DOE work, then it should. It should come out of their budget and be recognized that that's where that money is coming from not funding through DOE. Does that make sense? Am I making? I think that makes sense, and maybe I just do not understand the details of what was happening with the DOE, but it sounds like based on what's happening today. If they were to apply principle 4, they would get the outcome that you're describing in line 40.. They would say we're moving it over to the DOE and so, but so it seems like we're condemning it in 48, but then saying the principle. Actually, this is what should we would prefer to be done so my reading of it, I understand how you could reading it. Now. I can understand how you how you could can that be clarified renae. We can work to clarify that. Yes, absolutely, why do not you work with Matt on that? We'll do. Okay. Is that okay Matt? Yes, thank you! Okay yeah! I actually had the same thought one hand. Definitely there are people ahead of you, okay, what is it? What is it you wanted to talk about on that? I had I had a similar reaction reading that part. On the one hand, we were asking for do related responsibilities to be shifted back to DOE. On the other hand, we were saying the way it's worded us if we were not happy with that to be clear, we do want DOE to handle. We do not want the school safety piece to be part of the Nybpd's remit right. We want it to live with the ny DOE, and what we're saying is that the Nypd's budget should not. The DOE should not have to give that money to the NYPD now they've inflated the NYPD budget to do the school safety piece. That right now is part of their remit. Does that make sense, and what we're saying is it should be with the DOE that money should stay with the DOE. It's not part of NYPD, and it should not be. Does that make sense Julie? So just given that, oh sorry go ahead, wait a minute. Let's hear go ahead, it does make sense renee, but a budget reduction is a budget reduction at the end of the day. So we asked for a budget reduction and it got reduced. So I, unless DOE now, is paying NYPD in some other way to do the same work. We should be happy with the so if there, if, if that's worked on in terms of rewording, maybe it would be acceptable for you and maybe you'd want to work with Matt and renee on rewording that so that it is not so in opposition. One is not in that position of the other. Okay and just to be clear. The core principles are what is going to guide us as we make our budget request going forward. It's almost like the template that and the matrix that other committees use okay, if that makes sense, but I I'm happy to work with you on that language to clarify okay, I wonder if you could do it as we're discussing so that you have something that the rest of the members could hear if that's at all possible or the gist of something we'll move on for now and then go back if we need to okay. Thank you, okay, renee Caferro! Sorry, I have a comment, so I do not know if I should go. Wait: yeah, wait! Okay, thank you, Aaron, hey guys, so renee. I feel like. I brought this up at some point, but I can't remember when, but when you guys were looking at the budget numbers you know and again I support this resolution. You know wholeheartedly, but I do have some questions and some challenges so like to Buzz's statements. Right, you know, pre- coveted precincts were probably not really overstaffed. I know there's long- term overtime challenges, but I know individual neighborhood policing, you know was very challenged and you know there was a huge emphasis on counter- terrorism and especially in our district in Midtown. You know the balance of budget that was going towards counter- terrorism efforts and again, I'm talking like pre- protest, pre- writing right so back to a normal, New York. And then, when Covid-19 comes along, you have every major sporting event closed right, like things were shut down for three months. So how did you know? I would imagine there must have been some police savings on. You know, staffing stadium, staffing events. Did we ever get clarification on how like the sort of counter- terrorism, money had shifted versus neighborhood policing and obviously that would have had drastic impact on overtime of police and then obviously they had a whole other situation to deal with, but you know with it's a complicated matter, and you know I just worry about the staffing in a normal situation and you know again without their point of view. I just I struggle with like trying to figure out okay. Well, what does this mean right like? Where are we losing the funds? And you know so? I was just curious if you had any background on that larger issue sort of less about, and when we talk about police with military- grade equipment, you know again pre- covered. There was real reason for some of that stuff and I just want to know if you could speak to any of that a little bit sure. So I think what we're talking about when we talk about the police budget- and you see it in our resolution- is that it's really hard to parse. We had people come in to try and help us understand what the appropriations are for, and we you know there are. There are benefits and pensions and a whole bunch of stuff that goes into it, and I and I think you're right like we do not know, and that sounds terrible to say we do not know where it goes in each budget line right, so we're taking a stab at this, and what we're asking for is that clarity right? We want to understand this. I can't speak to whether this has resulted in lack of police officers on the street. That is not our intention whatsoever right, but we are saying that there are areas that could be trimmed. We want to understand what those areas are in the same way when we talk about the militarization of the NYPD, I disagree with Chris with his modification, because I think we just are looking for that information right. We can't even speak to it until we know and that's been a real difficulty for us to understand all these pieces. We can never say: okay, here's this little piece of budget and it should go to you know: community policing, that's not what we get. We get these big watches of budget and it's really hard to parse. Okay. So that's our stab in getting clarity around this and then we're going to do this again right like if we get the. If we can started to compare apples to apples and sort of understand the appropriations, then we can speak very specifically and to Buzz's point, hopefully at least invite some of the NYPD to come in and talk to us whether they will whether they won't. I do not know, but we need to get that information, and this is our first cut at this okay. Well, that makes sense and for the Department of Education sort of budget shift we're not advocating in any way by that resolution that, like or that portion of the resolution, that we would condone privatization of that correct, like okay, no we're just saying in certain instances you know social workers might be able not to take the place of police officers in keeping public order or addressing crime. We're not suggesting that at all, but it might be better to have an unarmed person dealing with. I do not know in the same way that tea agents are unarmed. You know it may make sense to have unarmed people in schools and unarmed civilians that have other skills to support the work of the police and that the police can support the work of those agencies. Great okay, thank you. Okay, other questions, Jordan. Thank you. Vicky, renee, historically, when Bex has done its work with respect to budgets, because police budgets have been an issue longer than you know. Longer this past year have we had input from the NYPD, and this is, I guess, a follow- on to buzz it as an initial question. So we do are involved and we're going to sit in this week in burl consultations where we have the opportunity to pose questions to the agency, so we will get that these are going on in the next three weeks. So we will have that opportunity and we will hear from the NYPD then I do not know that we ever get any response specifically about budget issues. Beyond those consultations during our budgeting requests- okay, John Harris, I have two. I have two suggestions and first I'd like to say one of the two suggestions and I'm thankful to renee for accepting some of the previous ones. I suggest excuse me, I'm sorry I was on Mute John. A suggestion is not a question. Are you do you have a question to the resolution and then, if you have suggestions that goes into comments? Okay? Well, I thought, if I want to make an amendment to the resolution, that's a question correct. No, that's a motion. Do you have any questions before you make your amendment right? Yes, I have two questions. Is it? Is it possible to put into the resolution references to two things? First, just a reference to best in class principles that this budget should consist of best- in- class budget principles and secondly, that it's a living budget, not a budget in stone and therefore as circumstances change, how some of our recommendations may change. I actually really like your last suggestion, John, because this is what we struggle with, because we get more and more information. So I think that's a great amendment John, you have a second one. Oh yes, well there were two one. I guess you could consider it one I was just saying also best in class, so the two are related. Did you some? You somehow make some reference that that our budget in general will embrace best in class budget practices and by best in class budget practices? Are you are you speaking to the way apples and apples and appropriations are broken out? Is that what you mean by that? That's part of it? Just broader in finance they're a set of principles, you know being efficient. You know proper accounting. You know you've addressed a lot of them online item basis, but sort of just incorporating it just broadly speaking, adopting best- in- class principles for the formation of a budget. Sure I think so John does that. Take care of your suggestions. Those were questions right, okay, good, they were questions after all, okay, let's go to Buzz again on me. I just had one further comment: okay, and that is who defines what militarization is again, I'm all for everything. That's in this idea. It just is not precise. Okay, that I I'm sorry, I'm a technical person yeah. I like precision who defines what's militarization end of militarization. What does that mean? Okay of the militarizing, any equipment that comes from the Us government is quote militarizing. Anything that comes from the National guard is militarizing, anything that you buy online. That's a piece of military equipment, that's militarizing! You need to. We need to be precise about what it is we're about. Okay, that's also, that's really more of a comment. So do we have any more questions all right, let's go to comments, Clayton Sorry, so military equipment is military equipment and they do not belong police precincts and under obama. There was a very clear, precise systems for stopping the flow of military equipment to police precincts and it worked for a limited period of time, and that has since changed. So I fully support Buzz's suggestion that we add language to be more technically specific. If we need to do that, there's absolutely only something to gain from doing that, but I do support any strengthening of that language, about capping any further acquisition of military- grade equipment and reducing, what's already there or selling it. I think that is I personally from what I understand from the work, the incredible work that you guys have done lines up with the principles and is very much in line with the budget request that we're making, I think, there's a it is. It is a completely different category of conversation to be talking about flamethrowers and tanks and automatic assault weapons. The second thing I want to say is that the billion dollar cut- that was the buzzword of the quote-, unquote defund movement a few months ago, just to be specific about the facts about this. That billion dollars was added to the NYPD budget under this mayor. This is not some historic budget. They've always had that. We're seeking to[, _ _] them by removing the decline of crime in this city began long before that billion dollars and those extra x hundred officers were added to the streets by years. The addition of the billion dollars and the addition of the hundreds of off of police officers on the streets did not escalate that decline in crime. I wish that I could just drop links right into Chat right now, so that there could be a very swift and impressive display of my knowledge. I do not have that, I'm just I'm remembering the work that we all did in June and that this fact was one of the things that I thought was most salient and most important. We're not talking about changing a budget that has historically been protecting all new yorkers. That just is false and then the third thing that I have came to understand is that, just for what it's worth is that the NYPD was invited to participate in this committee committee's deliberations and did not respond. Okay, Clayton! Do you want to do you have a suggestion on your explanation of military equipment that you'd like to add to the resolution you mean: do I want to write it yeah, I'm happy to give it a shot. Yeah! Okay, excuse me: okay, let's go to Jamie Kang Luke. Could you please share whatever links you're mentioning? That would just be great and sorry. I just wanted to add a point about the military equipment. Excuse me Jamie. Is it a question? We're still? Oh I'm sorry we're in comments go ahead. My mistake yeah yeah, so I just wanted to add a comment about the military equipment. So I fully understand that it could be a little bit extreme to have military equipment on the streets of New York, but I'll be frank with you. I live in Midtown and I'm sure we all kind of do right now, but there's a lot of violence that I've seen. I walk into shards of grass of glass. I've seen a burned car on my way next to whole foods. I've seen it I mean sorry. This was granted like a month ago, but like even now like when I'm out in on near 57 that someone else mentioned like someone just came attacking me one time and sorry like I just do not really feel like people. If you do not venture out every day, understand the gravity of how unsafe this place kind of feels right now, especially if you're out of town and I, although I fully appreciate that military equipment might be extreme, I still feel like. We need some sort of protective measures, and I just wanted to see that those stats, because I feel, like the number of police, have been increasing year over year, the same with the population, and we also have to keep in mind that the majority of the people employed at NYPD are ethnic minorities and the very population of people that we're really trying to protect. So, okay, next comment: renee caferol, so you know- and this is no disrespect to anyone- how they feel about you- know their neighborhood right now. But you know we do have stats. It's called Comp stats. They are updated very frequently and if just from you know cursory look at them, which I've done several times having this debate with many people in the past few months that we are currently like, if just looking at shootings and murders, because that's usually what people really focus on and comstats does the most egregious. It has everything all the way down to pettit Larceny but well. Obviously, people are focusing on the violent crimes. I think it's. We are grossly overstating the status of the crime in New York City. Right now we are currently at 280 murders. At this point. In the last year of Mayor Rudy Law order Giuliani, we are over 650, you know, so I think it's. There are statistics that I mean yes, there's a lot of chaos going on in civil unrest. This happens, and I'm not discounting that, but this the stats truly do not back this idea that we've gone back to you know a 1970s hellscape in New York City, and I am in no way- and I do not think anybody on the Bex Committee or anyone in support of this resolution is saying that they do not want the NYPD to do their job or that we feel that we should be asleep at the switch and rest on our laurels and be of our safety. However, I said this in June and I'll say it again. I we are not reinventing the wheel, there's an entire hundreds of people that work for the New York City comptroller, who June, I think, was fourth released his plan to do exactly what we're basically saying right now, which is and how you both do the cuts and to reorganize where the money goes. Taking things out of the purview of the NYPD. You know it mentioned. You know Clayton's point of a lot of the billion dollars. You know that money is only from this administration, so it clears out all those facts and with that I do not really feel. I will absolutely support this resolution because I know from those stats from people that are much smarter and do this for a living that I have run the traps on all of these things and I do not really need the NYPD to vouch for their own budget cut, obviously they're not going to ever agree with us, but that does not mean they're not going to be able to do their job. The stats are in the report from the comptroller's office of how this can be done, while still maintaining the safety of New, York, City, and so much can still be. You know occur that does not have to be in the purview of the NYPD as it is, and you know we'll be fine. They have more than enough money to do their jobs if they just focus and do what they need to be doing and we stop chasing our tails. So you know I really do not envy being renee in her committee tonight. With all of these issues, but I wholeheartedly support the Bex Committee. Okay, I'm going to call on everyone, but I just want to tell everyone and I'm not trying to stifle discourse. We are on the first resolution of the evening and it's past 8:30, so we have a lot more to go. Let's try not to be repetitious and let's try and get this wrapped up. So, let's go to July. Thank you vicky. I have three comments, two of which are quick, go ahead line. Seven in the most recent resolution, whereas New York City faces Nan historic fiscal crisis, I believe here a n should become a before historic. That's fine and line four I'll. Just read the sentence here: 2021 executive budget with regard to the distribution of cuts among agencies that directly serve communities disproportionately impacted by the cobit 19.. So here do we want to amend cuts among agencies, commas, some of which directly serve communities disproportionately impacted by cove at 19, because the way it currently reads now, as if all of the city agencies directly serve populations, this will disproportionately impact by Kobe 19.. It's a minor point. My common number three would be hold on aside some hold on. Let's deal with that, one renee, so I read it differently, but if it makes it clear to you, I think how it reads is it's with regard to the distribution of cuts among agencies that directly assert meaning those that directly is, is not that what you're asking yeah I mean it reads: okay to me, but if it makes it clearer to you renee are you okay? Putting in, I think agencies, that's fine! I mean it makes it easier to read and okay July go ahead. Thank you, aside from the budget cuts budget deficits, I do not know if we want to consider adding in just the general police officer's response. There's a general sense of disengagement among the police officers have had two separate conversations with various police officers on duty on the street, both for extended conversations between 20 and 30 minutes, and they have, at two separate occasions, told me that they are receiving very little respect from the citizens of New York City they've, been told by their supervisors to not respond or be involved in certain types of activities incidents. So I think it's almost. It is a separate matter from the budget cut that the remaining police officers that we have who are on duty need to respond according to their assigned responsibilities and according to the values of the NYPD. I think it's important that we add that in this solution, while recognizing that certain things that the pd do we highly value renee, I mean, I think, we're getting. I do not disagree with you, but I think the resolution is very so what we were doing in this resolution is looking at what came out of the budget, where the cuts to the NYPD really came at the agencies that were affected by these cuts and we're saying that look. The NYPD, in effect, did not get their fair share of cuts right. That's what we're saying and we're saying going forward. When we talk about the information we are trying to the militarization, we want to start with even getting that information buzz. You know if there's language that you want to say you know what this militarization is that's great, but we are trying to actually get at what that is right. We do not even know at this point, so this is our first cut at that, and I appreciate everybody's responses, I think, to add about the NYPD and giving them little respect. We are not in any way suggesting that we disrespect do not like do not want the NYPD we absolutely vehemently do we want them to focus on their core work. We think they're, terrific. I do not think anything in this resolution suggests that we do not. So I would reject the last piece. We've got three more comments and then we're going to take this to a vote, Matthew Nancy and then will I so I did a little bit of a a change languages. You asked: would you rather I do that separately or is now a good time? That's the one that you were working on correct yeah, that everyone should hear that. So my question is what, if we rather than in line in line 42, it says the mayor's claimed that Nypd's budget was reduced by a total of a billion DOT instead of having the sort of the where the section in 48 what if we incorporated the idea of what they were doing into line 42 so that it read, the mayor has claimed that NYPD budget was reduced by a total of 1 billion when all when all 43, but 62 million comprises either fringe benefits, unenforceable, overtime, reductions and then we add, in their comma shifts to other departments which were presented as cuts, because I think that that's actually the core of what you that's. That seems like what the goal was yeah and then we say end future 44., so we would remove the 48 section and then that would cover up okay. I think I'm good with that. Are you renee? I I'm delighted. Thank you, for that makes it clear everyone else. Okay with that, and who was the other one I asked, was it July to work with Matt? Is that okay, good all righty then we're on to will? And then oh boy, we got one more. That's it I'm going to stop at Joe Fruit, but we'll hire. Thank you Vicky. So I've spoken with a lot of my neighbors and colleagues, all of whom are constituents in this community in our community zone about this topic, and we feel that one of the core roles of the city government is to provide law enforcement. You know as a mechanism to support public safety for all residents and all visitors right. So you know I've heard various things on this call, but I think the rise in crime rates over the last six months has been well documented and, if not actual crime mates, I can tell you how people feel just being on the streets, and I hear Fellow Board members saying that the stats do not do that and that there have only been say 200 murders in the city so far this year. But I feel like that's unacceptable. You know, for me, one murder is one too many, so I'm struggling to understand this effort to reduce the Nypd's budget when the NYPD is the primary agency charged with this critical mission of providing a safe neighborhood for all of us. You know, and especially the most vulnerable will be disproportionately affected by any sort of budget cut to the police. If anything, it seems like the budget should be increased for things like recruitment of new classes which are increasingly comprised of minority cadets, which I think July may have said, there's a line in the resolution that discusses the budget cuts as a matter of fairness, and I understand that, but you know for a lot of people. I think this is more a matter of priorities. Not fairness and public safety is the paramount priority. So I'm sorry I just can not support this resolution. Okay, Joseph! Thank you, Vicky. So just a few I was going to suggest a new language in response to Matt's question, but I actually think Matt's suggestion was great good. I'm not going to do that. I guess just to the conversation really went off in a direction of a bigger picture view of what's happening in our city and what causes crime and how do we deal with people feeling safe and I think renee and Clayton like referenced the data, not really backing up feelings, and in many cases I guess I would challenge you know. I think I think those of us who feel like the police does not necessarily more police officers do not necessarily create more safety. That's my personal feeling. I do not think this resolution says that, but I would challenge those who disagree to actually provide data, that more police officers and a higher budget for police department actually reduces the violent crime rate, because that's not the data that I've been looking at. As I'm preparing this resolution, you know I I've also been the victim of a violent crime. I care a lot about this. That said, I actually think that there's other ways that we can fund public safety that are not just punitive and speaking as a new yorker who went to the protest this summer. I have to say the NYPD made me afraid much more than any criminal on the street when they refused to wear masks during a pandemic when they beat up people in peaceful protests for just being out after curfew. I would just I would push back on an assumption that a lot of people have that more cops is good, while also acknowledging that this resolution is not saying that cops are bad. I think we can. We can acknowledge both things. Okay, thank you Joseph. Before we take this to a vote. Clayton did you want to respond to that and then we're going to really fast. Just in case you missed it. Jordan very helpfully dropped the comp stat report through this week or last week into the chat. So everyone take a look at that. It shows that in many cases in many categories of crimes numbers were much higher in 2019 this week to date than in 2020.. Okay, thank you. I apologize, but since I was going to dropped it in that is a mixed report about how the city is doing. You'll also see that murders are up. 33 percent and earlier up 41 compared to this time last year, so it's a 10 this year and nine last year, I'm looking third column crime, complaints but year to date. Okay, let's move on sorry, let's move this on we're never going to get finished. If we do not, everyone can take a look at that, but before we do, I want to check in with Chris, because I promised you that if you wanted to make an amendment, you could so do you, I would say I would still ask for an amendment on the military- grade equipment in response to what Buzz was bringing up. I think that I agree that it's definitely helpful to have terms mean something I would okay, you have to make a motion and it has to be. You have to it has to be seconded. What is your motion? Okay, so my motion is that in the res, in the resolved section, with our request that they send us information about expenditures on military- grade equipment that we add to that without taking anything out, we add a request that the NYPD come up with a plan to bring these acquisitions to a full stop within the next year, as well as with a plan to actively decrease the existing reserves of equipment. Is there a second, a second all right? Take it to a vote. Sorry, an Ar-15 in the walmart is that military equipment is that covered by this resolution. I think buzz we are trying to. We are trying to in this resolution. Part of it is aspirational right we're looking for these things and we're looking for the information. So this is not aspirational. He made a very specific fascination. This is not a cross conversation. I'm sorry. Are there any questions to the amendment any comments laila as much as I believe that military weapons do not belong in precincts. I think a city of the size of New, York City, does have a need for some militarized equipment. Okay, any other comments. July, I I'm not. I've never worked in law enforcement. I do not. I can only imagine how challenging it is. I do not want to pretend that I know that the police officers can do their job with the equipment, so I do not I'm not comfortable making a decision this way. So I will not support the resolution. The amendment to the resolution- okay, Matthew, I agree with July and the reason I support the resolution is because of the focus on principles and sort of very specifically around the budgets, given that we have not got feedback from law enforcement. Okay, James- I am against the amendment. I definitely agree with the not using militarized equipment as much as possible, but I do not want to sort of tie the hands of a city like New, York City, based on kind of other cities, primarily overusing the equipment they should not be using. So I kind of agree with layla. Okay todd. Yes, the issue of military equipment used by police is a complex one and without the input of the NYPD and people who are expert on that subject, it's I think inappropriate for us. As a community board to make a decision- okay, I'm sorry go ahead, so you know I can not again. We should not forget. I mean this is New York City, we're at risk of terrorism, the police and our elected officials, and the experts around this issue have to we have to hear from them and get some explanation of just what the equipment is and why it's appropriate for New York City. For that reason, I can not support this okay renee cafarro, so I had security clearance for quite some time. When I worked in the government and a large, we need to remember that a large portion of what thwarts the terrorism attacks in New York City is actually funded through federal money, which obviously this community board has absolutely no ability to touch and will not be going anywhere. Counterterrorism and homeland security will always be here to support New, York City and keep terrorism at bay. This does not mean that every precinct needs to have this. We also need to realize that, where our place is, though, I love the community board. More than anything we are like Renee said slightly aspirational in this that clearly what we say tonight is not going to be the be all and end all of what the budget's going to be for the NYPD, but rather that we are trying to express our views and my view is, I actually am fine with this amendment, as is, and again I really stand by what bex has put together: okay, renee kinsella, thank you and thank you renee. I guess what I meant by aspirational is that we do not have the information on the military- grade equipment, and so this is a first step and I think the conversations and the points that you're making are important, but we're not even there yet. So we just want to have that information. We would like to get that information, and maybe our next step is to talk about that. Once we understand what is the military, you know things that the NYPD has how much of their budget does it comprise. Is it composed of right and then maybe this conversation could go beyond that, but right now we're just even trying to get that information and that's why it's in the resolution? Okay, let's take this now to a vote. Roll call vote craig just to confirm this is the vote on the amendment, not the actual motion. Okay, go backwards, a yang, no waylon; yes, one trap! No, not for the web. Webb web sister line; okay, ferdi! Yes, Stern is Noah still in yes, okay, spence! Yes, it's bandorf, no myth! Yes, let's get no shapiro, no raybar, yes, miller! No Myerson, wait! Myerson! Sorry, that's a yes mccall, no mafia, no payback, no Johnson, no isaacs! No higher, no hartman, no harris, no Ford, no docent, no dale! No Clark! Yes, chew! No cafaro! Yes burton yes, bitchman! No behar! No ethanelle! No michaelis yes motion will fail one two, three, four, five, six, seven! Eighteen! I think it's twelve. I counted either twelve. Yes, nine one, two, three, four: five: six, seven, eight nine ten eleven twelve. I got twenty nine thirteen or thirteen to twenty nine. Okay. It's not close. We now have to take the resolution itself to a vote, so we need to roll call vote on that. Okay and okay and just as a reminder, renee if you can get everything into the board office to in terms of all the amendments, but you know as soon as possible. Okay, yes, athanal! Yes, behar! Yes, Eichmann! No burton! Yes, the pharaoh! Yes, you! Yes, Clark! Yes, Dale! Yes, Ford! Yes, floor! Yes, Garcia! Yes, Goldman! No gotcha! Yes, Haas! Yes, Harris! Yes, Hartman! Yes, higher! No isaacs! Yes, Johnson! Yes, Abac! Yes, Kang! No concella! Yes, logasico! Yes, leaving! Yes, mafia! Yes, Joey! Yes, Miller! Yes, Raybar! Yes, shapiro! Yes, Slutskin! No smith! Yes, sandorf! Yes, fence! Yes, stern! Yes, birdie! Yes! What is it gone? Wine trap? Yes, wayland! Yes, Yang, yes, motion passes. Okay motion passes before we go on. I just want to mention that this is a really good example of one of those things that I say during orientation, which is whenever you look at the agenda of our committee meetings, and you think you see something that is of great interest and that's very intricate and very involved that you would be very interested in having your voices heard. Please go to the committee meeting and just so that you know in virtual meetings what we're doing is. We are allowing everyone to come in as a participant. So, even though you won't be able to vote you're not going to be sitting on the sidelines, observing what the committee is doing, you'll come in even though you're not a member of the committee, and if you have questions and comments and the kinds of things that came up this evening, you can do it at the committee level. Please keep that in mind. It's really important. I know time is valuable for most people, but when something super important comes up, try and be a part of it at that level. It's I think it really. It helps the committee, it really does. Thank you everyone. I think that was a very good and a very interesting discussion observation comments, questions it really was, and now we have to move on so renee. We are going to your next resolution. Yes, our last resolution deals with the commercial rent tax. The board may recall that businesses below 96th street they're, subject to a commercial rent tax, which is a 3.9 percent levy on annual rent applied to businesses that pay more than half a million dollars in annual rent and with more than five million dollars in annual revenue. There was a push back in 2017 to reduce the burden of this commercial rent tax. The details of that push to reduce it are in your packet at page, six CB5 supported that bill and it was implemented, passed and was implemented. Beginning June, 2018. fast forward to everything. That's happened and council member powers has introduced a bill into 2007 2020 and it's going to suspend the commercial rent tax during the Covid-19 emergency for all businesses paying less than 1 million dollars in rent, regardless of their business income. Cb5 we're on record for supporting a reduction in commercial rent tax, but with regard to this particular bill, our committee was concerned about the number of businesses that would fall into the suspension that maybe were chain stores or entities that did not really need the relief, because when we looked at it based on the 2019 data, it seemed that this bill would cost the city about 21 million dollars in tax revenue, and we were really cognizant that the city needs that money. So at the committee we had a conversation about alleviating the burden for those small businesses that truly need the relief and those that could still pay it, and we ultimately came out in support of this bill with the recommendation in our reso that the council consider exempting those businesses that are not in need. We left it to the council to figure out how that could be implemented, perhaps similar to what occurred in 2017 and it was unanimously approved. Okay, thank you. Renee. Anyone have any conflict with this resolution. Let me just check up and down. Okay, any questions to the resolution. Any comments see none. We will go God raised his hand, oh todd, okay, I'm a small business owner, and I commend the committee for taking the time to support Keith powers. Efforts in this regard that the commer, the commercial rent tax is a real burden, even in good times on small businesses and in times like this, where we're struggling to survive. Something like this is absolutely critical. Okay, thank you todd. Anyone else. I'm keep scrolling. Okay, all right comment that was comments all right. Let's take it to a vote. Craig. Sorry, okay, Yang! Yes, Whalen! Yes, wine, trout; yes, birdie! Yes, stern! Yes, spence! Yes, bandorf! Yes, Smith! Yes, fluttskin! Yes, shapiro! Yes, Raybar, yes, miller! Yes, Kinsella! Yes, Kang! She just voted yes in chat. I do not know if that counts. That's fine! Okay, K, Back, Jeff Johnson! Yes, Isaacs! Yes, higher! Yes, Hartman! Yes, Harris! Yes, us! Yes, Goldman! Yes, Garcia! Yes, Brewer! Yes, sorry, okay, Ford! Yes, docent! Yes, Dale! Yes, Clark yeah! True, yes, Faro! Yes, burton yes, Beichmann, yes, behar, yes, athonail, yes, motion passes. Okay resolution passes reports yep very quickly. We had a presentation from Nyu for information only about they're going to be taking over the W hotel in union Square as a dorm they're, going to be housing, several hundred students in their single rooms for social distancing, Nyu answered all of our committee questions. They followed up with us on things. They could not answer on the day to the committee and they provided phone numbers to us. Should we encounter any clustering problems or any other issue. We also sent out two letters. The first was in support of the release of the borough president's allocated funding for education. She referenced this in her conversation this evening, which were for school repairs such as events and technology that had already been appropriated and had not yet been released. Our second letter was directed to the mayor and the department of sanitation regarding the cuts. If you have been following the issue, there have been over 106 million dollar cuts to the department of sanitation's budget, fewer trucks. No Sunday collections skip baskets reduced street cleaning. We've received a lot of complaints and our letter asked for some of the restoration of services, particularly because we have a lot of outdoor, dining and restaurants, which mean more garbage more Vermin and the Lac sanitation creates more of a challenge for our small businesses. That leads me to the cleanup day. It was mentioned earlier: we're partnering, with Speaker Johnson's office in Fit, to clean up 26th street between 7th and 8th and Saturday. You can sign up on the website and the flyer was circulated, and finally, I just want to reference. The budget stuff is hard. It's really complicated. We had a really phenomenal in- depth indigestible report from our board member Joe Mafia on how to understand this and how to really parse it both what city budget is and where we are now. It's not always easy to really understand these numbers, so we're really grateful to Joe to help us digest all these facts and figures coming our way as we put together all these budget requests and try to understand really what the budget is. That's it for me. Thank you renee. Thank you to that committee. They worked very hard this month, super hard, as you can see, and Joe did a phenomenal job. I saw that presentation. It was pretty amazing. Thank you, Joe! Thank you. Okay, we are moving on to land use, housing and zoning layla all right good evening. We had one resolution this month. This is for the Ibm building located at 519 Madison Avenue. So, as you probably most of you know, they have a pops, a privately owned public space in the the ground floor covered unclosed area that is open to the public and in exchange for constructing this public space, they got a bonus far meaning that they could build a taller building, but out of this public space, there's actually a sliver that is a publicly accessible, but that did not generate a bonus and the application is actually to install tables and chairs, so that would be operated by the kiosk that is present in this space as a private use for their guests and customers. Typically, when we look at applications for seating associated with a restaurant or a hospitality business, we actually ask that these tables, although occupiable by patrons of this establishment, remain open to the public, but in this specific case, because it is in a space that is non- bonus, meaning that this open space open to the public did not generate any benefit to the developer of this of this building and in the deed of this building. When it was constructed, it was determined that this space should be commercial in nature and they had envisioned that it could become a new stand or a flower stand. We felt that the use by the kiosk for their patrons was acceptable. They presented a design that was also acceptable, they're going to install partitions that are slightly translucent they're, not just a trustive. Sorry, I'm butchering this one, but you know what I mean obtusive. I think I'm sorry I was using the french word, and so overall we felt that it was a an application that we could support. We made lots of detailed descriptions so that no one who would be in a different situation would use the language of the resolution. To cite a precedent, and the committee felt that supporting this application was the the right path to go and it was unanimous votes. Okay, does anyone have a conflict with this revolution? Yes, I think I have to vote present, but not yes, okay, anyone else! I do not see any okay. Any questions to the resolution. Any comments. Okay, seeing none take it to a vote. Ethanelle! Yes, behar! Yes, bitchman! Yes, burton yes, baro! Yes, you yes, mark! Yes, Dale! Yes, Joseon! Yes, Harris! Yes, Department, yes, higher! Yes, sorry, it's coming after me; okay, Isaacs! Yes, Johnson! Yes, payback! Yes, Kang Kinsella! Yes, Logaseco! Yes, Miller! Yes, Raybar! Yes, shapiro! Yes, let's slutskin! Yes, Smith! Yes, Spandar! Yes, bence! Yes, stern! Yes, birdie! Yes, wayland! Yes, Yang! Yes, Rezzo passes. Okay, thank you and we're on to a report from public safety quality of life. Nick. Thank you. Psql just wants to report that we are monitoring open street dining and that we have seen very few complaints in our district about social distancing or anything else. You may be seeing in the media that other districts are not faring as well, but the few issues that we've had have been addressed by the police and the SLA so far, so good, okay, also two reports or one report, an update from parks and public spaces Clayton. Yes, thank you. We had a report from the municipal arts society, in coordination with new yorkers for parks, about their advocacy and proposal for a new position in city government called the director of public realm. This position would be in the mayor's office, so it would be kind of be above any city agency, which would give this position the authority and ability to coordinate amongst, as we all know, very well. The many players who participate in governing the many different categories of public spaces in our district parks- Sidewalks pedestrian, plazas, even pops. So this also include working with department of City planning and private entities about issues pertaining to those spaces. The proposal is early in its development stages, but the advocacy is coming out strong and the committee was extremely excited to hear some very top- level, creative, big idea, thinking about how to handle the jurisdictional, gridlock and confusion and general city dysfunction. That happens when it comes to critical issues in our public spaces. So we are writing a letter of support generally in furthering the cause of raising awareness around the importance of this new position. But we also look forward to working with the Bex Committee and with land use to increase the number of spaces where we have this conversation when it comes to what we advocate for in the city's budget and how it would impact zoning issues before our land Use committee. So it's a super, exciting topic and I look forward to furthering it and working with all of you on how we can help contribute to their process of fleshing. This idea out. We had a lot of questions and feedback and concerns for them that I think they took very seriously and it's exciting to have such powerful collaborators and partners in identifying a very a potential solution for a lot of problems in our district in our city. Great and then you wanted to update and then a quick update. We had put it on the agenda because it was a very pressing problem and before the committee meeting the mayor announced his reversal on his opinion and policy and city Park athletic field. Permit freeze was a thing of the past by the time that we had our committee meeting. So this is just an update to let you know that youth programs are returning to play in the parks given safety protocols and the size of the groups, and I think there was something like nine, almost 9,000 people who signed a petition to advocate for the administration to reverse its policy about this, and so it was a good news night for the community to hear that was being reversed and almost immediately questions camp about like how about adults, and so that conversation is ongoing and the parks and public Spaces committee will be the place for you to here and have that conversation if you ever want to join us great thanks, Clayton, okay, that moves us to our last committee, which is landmarks leila you're up again all right. So we had three three applications through the resolutions this month. I would like to them deem red okay so deemed, and I would like to bundle and bundled okay before I go into presenting them on line 289 there's a typo, it should read. The last sentence should read: armatures is a partial steel frame, there's a r that lingers here. That does not belong. It's not strill, it's steel, okay, so we are on page nine, the application, the resolution the application is for 130 West 42Nd street. This is the Bush tower. This is between 6Th, Avenue and Broadway. This is an individual landmark, and this is actually the very first skyscraper that was built in New York City in the 1920s. The applicant is proposing to do a full roof replacement. The roof. The existing roof, which is the original roof, is copper. It has deteriorated and it is currently covered by a a membrane because it has deteriorated beyond repair. The applicant is proposing to remove the the roof, remove the membrane, remove the copper and replace the roof with a new membrane, but without the copper, a couple of reasons for that it is actually a very steep roof and the installation of copper would be very difficult. Another issue is that copper has actually a fairly poor resistance to wind, whereas this membrane, which is you know, applied in liquid form, basically has a much stronger resistance to wind. The committee, although we typically prefer a replacement in kind, did not have an issue with this proposal, because the roof is non- visible, with the exception of a minor visibility from very far away, and therefore we felt that it would not impact the landmark and the appreciation of the building with this type of replacement. So the vote was to support and it was unanimous folks. Okay, does anyone have any conflict with this resolution? Are there any questions to the resolution? Are there any comments? All right see? None. We will move on. Let me make sure yes, okay. Moving on it's an application for 2- 1, Park, Avenue South, also known as 50 union square east. This is currently the W hotel. I was billed as the our Germania Life Insurance company and then became the guardian or life insurance. The applicant is proposing to do a little bit of reshuffling of what is currently existing on the roof and by smartly doing this reshuffling. They are freeing up enough space to build a rooftop edition. The rooftop edition will serve as a lounge and area for guests at the hotel and it will be made of glass and steel. It will be or aluminum I'm sorry, glass and aluminum. It will be entirely recessed and non- visible from any thoroughfares, with the exception of a tiny sliver. But literally you know like a an inch of visibility on the West facade of the building. So, overall, in this process they are actually moving away. Some mechanical equipment that is currently visible and would no longer be, and the committee felt that the addition itself and the non- visibility or the very minimal visibility made this proposal acceptable and we voted unanimously to approve okay, any conflict with this resolution. Any questions to the resolution. Chris, you have a conflict or a question. Oh no, sorry! This is a question. Okay, go back to the I'm! Sorry, yes, ask a question: go ahead, so I'm just looking at the pictures and the proposed picture just to clarify. That is the view from the street. Even if there are people up on that rooftop area. What do you mean if there are people on the rooftop area? Oh you mean, are walking towards pretty much yes, because they're going to have to have some sort of a railing that will be recessed from the the neon sign. So even when patrons would be on the roof, they would not get so close to the edge of this of this railing. Okay, any other questions, any comments. I do not see any. I would just add on Chris's question, which I guess the point was that you know there would be visibility of humans and plants are actually deemed non- permanent and therefore are not taken into account by LPC when they make the recommendation. Okay, all right leila, I think we can go on to the next result. All right final resolution, 130 fifth avenue. This is in the ladies Male historic district at the corner with West 18Th Street. This is currently the express storefront, so it looks like Express is going to vacate the the this particular retail space. The applicant is cvs. They are proposing a number of alterations. Basically, I'm going to tell you. It was a denial and I'm going to tell you why they want to turn a storefront window into a door which would mean removing the historic fabric that is below the existing window, and they want this door to be an automatic door. They also want to install heavy signage and lighting inside. So, typically, anything that is recessed 18 inches behind the window is not under the preview of LPC, but in that case, although the light fixtures are indeed 18 inches besides the the window, the light itself will shine bright and red and will have an impact on the facade and on the street. So for that reason we do comment on that. We do comment on the fact that the method of operation for this store is non- historic, non-, contextual inappropriate, and we voted to deny this application. It was unanimous vote and I would say that we did ask the applicant if they would consider a different design and they told us that they would not. So you know we did not have really any you know offer on their end to take our concerns and into account. So we voted to deny the application. Okay. Is there anyone who has a conflict with this resolution? Are there any questions to the resolution? Are there any comments, all right scene? None, let me make sure yeah. We are taking a vote on all three at the end of this. One has another announcement. So this is the last vote of the evening. Yang. Yes, waylon. Yes, wine, trout, yeah! Yes, thank you! Ferdie! Yes, darren! Yes, spence! Yes, vandorf! Yes, slutskin! Yes, shapiro! Yes, Raybar! Yes, pawson! Oh she's out! Sorry, Miller! Yes, Myerson Meyerson! Yes, sorry! Thank you kimberly. Yes, I'm a call! Sorry, mafia! Yes, lucic! Yes, leaving! Yes, logico! Yes, abec! Yes, Johnson! Yes, Isaacs! Yes, higher! Yes, Hartman! Yes, Harris! Yes, Garcia! Yes, Brewer! Yes, Ford! Yes, yoson! Yes, Dale! Yes, Clark! Yes, chew! Yes, baro! Yes, burton yes, weichmann, yes, Bejar! Yes, ethanol, yes, motion passes. Okay, renee has a an announcement, just a quick announcement. I just wanted to share with you that councilmember powers is hosting a rally at the Harmonia Hotel tomorrow in support of the residents, so it is at 12 East 31St street, at noon tomorrow. If anyone can join, that would be fantastic. Okay, thank you with that. We will adjourn. I just want to say this was a very good meeting, a little lengthy, but a really good meeting with lots of wonderful input and back and forth. So we should be very proud thanks. So much have a good weekend stay safe.",
            "summary": "The first thing, I noticed is: it looks like almost everybody's gotten , I'm, just going to wait until 605 make sure we can get as many people as possible to start If you're joining from a phone during our public session.\nThe district manager's report and committee reports, which include resolutions, questions comments, and we go into a vote on the actions that are before the full board comments and questions from either applicants or the public or if additional information is needed, that's allowed only if you are recognized by the chair, so I will start.\nThere's, this very disturbing action that the city is trying to take by throwing out the 300 people living at the Harmonia Family adult family, shelter on West, 31St Street.\nNow they were told that they're going to have to all leave that building and not clear where those people would be sent or under what circumstances or whether anyone will even do an evaluation of all of their special needs and whether they could be met in other facilities, and this is being done for no justifiable reason regarding the harmonia, but rather because the mayor decided he was going to remove the men currently living in the Lucerne hotel on West 79Th Street, because some in the community were upset about that men's shelter.\nI just want to highlight that we have a successful functioning shelter for a special needs population on West 31st, while people are always nervous about new services when they come in, our community worked with them.\nNo reason to destroy two separate programs in two different locations with no community notice unless they contacted community board 5 within the last 24 hours, but they had not even contacted the provider of the services So we're working hard to try to get press attention and to convince city hall that they have made a major error here and that they may have issues that they need to deal with at the Lucerne.\nYes, all right, today, Congresswoman Maloney held a hearing on the importance of ensuring that the Census Bureau has enough time to ensure the complete count at the end of July, the president shortened the response window by 30 days, meaning that we only have until September 30th to for everyone to fill out their census.\nWe were going to have a hundred men six days a week with phenomenal outdoor and indoor activities and 20 jobs, paid full, time, There's, a potential you'll know more than I will perhaps tomorrow lawsuit from legal aid to state that the residents of the harmonia can not be moved.\nSo look forward to that, and that takes us now into our committee reports and we start with budget education and city services, and that is renee consulate.\nYou all heard in the public session, there's an issue that has arisen- We at CB5 only learned of this yesterday afternoon via the borough president's Tweet, and this is regarding the location of the 280 adult male clients, from the Lucerne hotel to one of our permanent shelters in the district.\nWe have not received any direct confirmation from DHS of the city that the people who worked in the harmonia may be in danger of losing their positions over the transition, and it's unclear who will be the provider if sus is not there once the current clients are removed.\nThis number does not even include our permanent shelters like the harmonia, so we do recognize the importance of providing care for the most vulnerable and we really work to ensure the smooth transition of the homeless clients into the neighborhood.\nWe have continuously asked the city and DHS for transparency, open communication and collaboration and really clear plans for managing issues, particularly given that we have such a clustering within the district.\nSo we're only going to cause a larger problem down the road by you know displacing these families, so we offering up solutions or just sort of like shaking our fist at them and asking for more transparency in the future, and I guess.\nThe mayor heard about that- And I was really they should be ashamed of themselves- for how you know how we treated the homeless issue in the northern part of our district, I'm, a big supporter of that perks of having the shelter, there, and I would think that could be an option.\nWhat I think is a political move to you: Appease big donor nimbys in the upper West side and these nicer areas or billionaires row, and you see it time and again and just thinking you just kick the can to a different neighborhood, and You know it's really unfair for folks to not take their fair share in New York City.\nI have concerns about getting into a conversation about which sites and possible solutions, because I do not know that we can have the capacity or the information have not done the due diligence to be able to fairly and comprehensively have that conversation, not that we should not have it, but I think that for the outset of this fight, which is only beginning most likely, what this resolution might be most effective is for it to be a All about it to say all the problems that renee kinsella, you outlined, the transparency, the accountability, the community, involvement, data, driven decisions, rationale.\nI do not believe that this is a decision about public health, And I think that our focus needs to be about what's happening in our district and with the programs renee kinsella that you did such a good job of explaining have attract real track record, and that should be our primary concern of this resolution is protecting those families.\nJust I wanted to say that I do think I'd like to see something in a resolution, kind of calling out the sort of non, cohesive, whack, a- That makes sense, and that does that in a coherent manner and is not just a matter of sort of passing around political footballs because it just feels like that's what they've been doing before during and probably after the pandemic.\nBut if the vote has been taken and the information that we want to put in the resolution is gone over at this meeting, I think time is of the essence.\nClayton again, I do have a question to the point about solutions that we can offer simply as far as process renee is there is there something that you would recommend that we could say about the ways in which we would want community involvement and transparency?\nIf renee confront the two Renais will work on putting together a resolution, but in order to do that, we need input the way we just got from Clayton information.\nI, we have 600 members, it's important that the neighborhood association, like the Community board, knows what's going on in their own neighborhoods, I'm all for that, and I do not know if there's any room in a resolution for involving the real estate industry that has been given tax abatements for the last 40 years to build whatever they want and not one thought is put into shelters of the homeless situation.\nI mean you can not move people like that at You know the mayor's whim, because it is convenient because he needs to get rid of a problem somewhere, else.\nWe need to get involved, but certainly whatever the situation is over there, it should not be at the expense of residents of our district and a provider in our district that have been doing a good job, and you know I think we really should make that point as strong as possible and as Renee Faro said.\nBut that seems like the the to me in a resolution that was going to be strongly worded talking about how the how the people who are being affected are treated as the most is the most important part, or it sounds like The. I dropped a link to the political article about it that came out a couple of hours ago, where De Blasio.\nThink it's the larger policy issue that you're, referring to one thing that I will say is that when you think about the people in the Harmonia right, one of the things that clients need are is the stability and the routine.\nThat is merely a screen first for something else frequently when it comes to the issue of homelessness, communities will say that their objection is that they were not informed beforehand when their objection is really more that they do not want a homeless shelter cited in their area, and so I think.\nIn addition to the strong language, about the need for community involvement in these decisions, I think it's appropriate to specify that our objection here is not that homeless people are being proposed to be moved into our district.\nBut, you know, when there's so many stresses on the homeless services system, to direct a provider to suddenly shuffle around their clients all over the city, to let go staff to dismantle all of their administrative systems that supported this shelter.\nI mean it's probably a huge burden on the administration of Sus, so that takes away from their ability to serve clients all over the city at their other shelters as well, I think this is happening writ large with all of these unexpected moves and how they affect the staff and the administration at all of these homeless services providers, including the one that I work, at.\nThere are two things: I think the first thing is Yes, it's kind of awful that there was no plan for these people, right, No plan to bring them to any other shelter, and it's really unfortunate that the actual shelters that could potentially serve them are completely closed, especially the ones near me like the one on 51st street and park.\nThe second thing is you know, so I'm sympathetic for both communities right because I think the hotel, community.\nI, think one thing that I just do not want people to miss out here is that hotels are closing their doors because they just have no income right.\nNow, and I know that that's not understandable, because the homeless population is very vulnerable and, having worked in one myself, I completely see where this sentiment is coming from, but I just feel like.\nWe need to understand both sides where people might not have enough money to support the homeless at this time.\nI. Think that our best credibility as a board here will be to focus on in this resolution, to focus on the things that we feel most passionately and that we know.\nI fully support this I just want to mention that in the chat we've had some questions regarding other hotels and other problems, and rather than get into that this evening, because we are working on something very specific and trying to do that so that we can get to our regular agenda, which is rather lengthy, as well.\nIt's, a good question, thank you, okay, renee and renee how about recapping so that the board has an idea of what will be going into this resolution and we can take a vote on it.\nI mean I guess this is being the resolution is going to be sent to the mayor and Cc everybody and under God. You know in our purview to look at as an application, but we proactively saw, and so it would be like a strongly adv opposes.\nI do think calling upon them to reverse their decision, needs to be in there someplace, but practically I mean people are getting moved out of there as we speak.\nI. Do not think that we'll be able to possibly reverse this, because now you've moved people out of the Lucerne and they need somewhere to go, and so we can put that in there.\nBut I do not think it's really in like legally in our purview to tell them to stop anything, but we should definitely put in, and I will write that clause as well about how we would like them to reverse their decision and find other suitable places for the folks at Lucerne if they can't go back to the Lucerne, so that Clayton made an important point that the resolution should also address after the fact that if this is de facto happening- But if we want to include that you said you know, we may not be able to halt that.\nThe first was the committee's consideration of the NYPD budget and the role of the police department, and the second was support of exempting small businesses from the commercial tax rent, tax.\nWe wanted to respond to the physical year 2021 executive budget, just to speak to the distribution of cuts among agencies that directly serve some of the communities disproportionately impacted by Covid-19 and by the New York City Police Department, and we decided that we wanted a statement of principles to be incorporated into the boar's physical year, 2022 budget request, so that can sort of guide and be used as a template when we make those requests later on.\nA lot of people were calling for at least a billion dollars to be removed from the NYPD funding and the f21 budget, and when all was said and done, what actually passed was that the NYPD ended up being allocated 5.222 billion dollars and that equaled a four 414 million dollars reduction.\nAnother issue that we saw was that the budget yep counts on partial hiring freezes and agreements with the city's municipal, labor unions and all but 62 million of the reduction to the NYPD, comprised either fringe benefits, unenforceable, overtime and future commitments that were not really included in the signed.\nWe were concerned that there was a shift of school crossing guards to the department of education, because that just really moves the money from the NYPD to the DOE, but according to the New York City's independent budget office.\nI also want to say that I appreciate that the resolution commits to, as you mentioned, rene, a reconsideration later on of the role of the police in New, York, City.\nI'm, not sure if the name of the resolution actually matters, but it currently says NYPD budget and alternative public safety.\nYet I- do not want to give the impression that this resolution contains our full thinking on alternate public safety strategies.\nMaybe you know core principles for NYPD budget allocations, or something like that.\nI was saying: Saddled has a certain connotation to it, and my request would be that we changed that to tasked with or charged with, Saddle sort of implies, a passive role in the NYPD in this process of taking on new responsibilities, which I think is historically inaccurate in certain areas.\nYou know it may not be friendly You accept that the mission of the NYPD I mean we're looking to move some of the other aspects of the Nypd's work, meaning the Nypd's collective mission currently, which includes many of the things that you may not believe, are part of public order, which includes school safety and crossing guards and all those wonderful things, which is why we use the word mission collectively of what they do.\nAnd if they're soldiers, then you know what does that make the citizens of New, York, and I think that it would be appropriate to ask that, in addition to this information being shared with us, we also ask that they come up with a plan to stop the acquisitions within the next year, which again, I believe, is a relatively mainstream request and then also come up with a plan to sell that equipment back to the United States government, which itself would raise a substantial amount of money for the city.\nWhen I read number four in the core principles where the mission should line up, it seems like that would be positive, because you're there, what they were saying, is they're moving this thing that they believe lines up with the mission yoe more than an NYPD.\nI brought this up at some point, but I can't remember when, but when you guys were looking at the budget numbers, you know And again, I support this resolution.\nThink what we're talking about when we talk about the police, budget- We had people come in to try and help us understand what the appropriations are for, and we, you know there are.\nBut we need to get that information, and this is our first cut at this Well, that makes sense and for the Department of Education sort of budget shift we're not advocating in any way by that resolution that, like or that portion of the resolution, that we would condone privatization of that correct.\nLike okay, no You know social workers might be able not to take the place of police officers in keeping public order or addressing crime.\nSo, we will have that opportunity and we will hear from the NYPD Then I do not know that we ever get any response specifically about budget issues.\nAnd I do not think anybody on the Bex Committee or anyone in support of this resolution is saying that they do not want the NYPD to do their job or that we feel that we should be asleep at the switch and rest on our laurels and be of our safety.\nWe are not reinventing the wheel, there's an entire hundreds of people that work for the New York City comptroller, who June, I think, was fourth released.\nI will absolutely support this resolution, because I know from those stats from people that are much smarter and do this for a living that I have run the traps on all of these things.\nThere's, a general sense of disengagement among the police officers have had two separate conversations with various police officers on duty on the street, both for extended conversations between 20 and 30 minutes, and they have, at two separate occasions, told me that they are receiving very little respect from the citizens of New York City It is a separate matter from the budget cut that the remaining police officers that we have, who are on duty need to respond according to their assigned responsibilities and according to the values of the NYPD.\nWe've got three more comments and then we're going to take this to a vote, Matthew Nancy That's, the one that you were working on correct If we, rather than in line in line 42, it says the mayor's claimed that Nypd's budget was reduced by a total of a billion DOT instead of having the sort of the where the section in 48 what?\nYou know I've heard various things on this call, but I think the rise in crime rates over the last six months has been well documented, And, if not actual crime, mates, I can tell you how people feel just being on the streets, and I, hear Fellow Board members saying that the stats do not do that and that there have only been say: 200 murders in the city.\nThere's a line in the resolution that discusses the budget cuts as a matter of fairness, and I understand that, but you know for a lot of people.\nI guess just to the conversation really went off in a direction of a bigger picture view of what's happening in our city and what causes crime and how do we deal with people feeling safe, And, I, think renee and Clayton like referenced the data, not really backing up feelings, and in many cases I guess I would challenge you, know.\nI do not think this resolution says that, but I would challenge those who disagree to actually provide data, that more police officers and a higher budget for police department actually reduces the violent crime rate, because that's not the data that I've been looking at.\nI do not want to pretend that I know that the police officers can do their job with the equipment, So So I will not support the resolution.\nThe issue of military equipment used by police is a complex one and without the input of the NYPD and people who are expert on that subject, it's I think inappropriate for us.\nWe need to remember that a large portion of what thwarts the terrorism attacks in New York City is actually funded through federal money, which obviously this community board has absolutely no ability to touch and will not be going.\nYou know things that the NYPD has how much of their budget does it comprise.\nI know time is valuable for most people, but when something super important comes, up, try and be a part of it at that.\nYes, I think I have to vote present, but Any questions to the resolution.\nWe also look forward to working with the Bex Committee and with land use to increase the number of spaces where we have this conversation when it comes to what we advocate for in the city's budget and how it would impact zoning issues before our land.\nThis is just an update to let you know that youth programs are returning to play in the parks, given safety protocols and the size of the groups, and I think there was something like nine, almost 9,000 people who signed a petition to advocate for the administration to reverse its policy about this, and so it was a good news night for the community to hear that was being reversed and almost immediately questions camp about like how about adults, So that conversation is ongoing and the parks and public Spaces committee will be the place for you to here and have that conversation."
        }
    }
}