{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB10",
            "channelId": "https://www.youtube.com/channel/UCHQFwC2CE3JTCHVvMLgBGwQ",
            "title": "August 2020 Executive Committee Meeting",
            "publishDate": "2020-08-12",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB10",
            "normalizedName": "Manhattan Community Board 10",
            "twitterName": "Manhattan CB 10",
            "youtubeChannelName": "Manhattan CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
            "twitterHandle": "@mancb10",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 173,
            "um": 542
        },
        "wordCountFullTranscript": {
            "community": 103,
            "people": 80,
            "lot": 53,
            "city": 52,
            "board": 37,
            "meeting": 33,
            "things": 33,
            "time": 31,
            "street": 30,
            "budget": 27
        },
        "wordCountSummary": {
            "community": 26,
            "people": 24,
            "city": 14,
            "lot": 11,
            "things": 8,
            "bikes": 8,
            "bike": 6,
            "boards": 5,
            "time": 5,
            "police": 5
        },
        "fullTranscript": "Hello, ah you hello, everyone, we're just gonna, wait for another couple of minutes and then we'll go ahead and get started. I hope everything and everyone and everything is okay and everyone's doing well. You do okay, we're gonna, go ahead and get started. Hopefully some more people will join. I don't believe we have any voting items just a lot of information to get out, so we can go ahead and get started so we're going to call the meeting to order at 6, 37 pm, so welcome to our July executive committee meeting, I'm so glad that you all were able to join in today. It's important that we continue to have our meetings over the summer. I know that a lot of what we're used to not meeting over the summer, but I believe a lot of the community boards are continuing to meet especially this year. So we want to make sure that we are able to stay active in the community and available and informed so we're going to go ahead and get started so in the email that juanita sent out. Thank you juanita and shatik for your diligence during this time and while working from home, there was a calendar for august 2020. If you can take a look at that, we do want to continue to have our meetings, because really important next month will be our executive board right before we go back into our regular session. So we want to make sure that we are staying as again informed as available as committee chairs and committee members as possible. So I'm going to just go ahead and move into my report, so this has been a very busy time and I'm sure everybody can say that, so we have been extremely busy on the scene. It started July 3rd with the black lives matter. Mural. I want to thank everyone on the community board for coming out and painting our letter. It looks great. I think we planned the a in matters. So, yes, we painted the am matter, so I hope everybody had a chance to go out there and look at it. If you had a chance, you'll see from an aerial view, decide where the organizations paint it and then decide where the art is painted. So please take a look at that just a little bit about that was brought to you by harlem park to park and got to stop erica and nicola put a lot of their own time and money into that. So we want to thank them for that. The street has been closed since July 3rd, but the street will be reopening on starting July 31st. So that's a little bit of my transportation report now, but the street will be reopening. There will be a street fair, I believe, on friday, so with fun, food and just some. I think some health booths will be out there as well on the mural. So please take a chance to go out there and take part in that, and I think we have a flyer if you haven't received it yet so that was on July 3rd and then July 4th. As you know around that time, and thank goodness had slowed down, the fireworks were afoot and they were everywhere. So there was a lot of community concern about that and we went out to the community one for the fireworks and then one for the uptick in gun violence. And it's been the talk all over the news. The talk of an alleged police slow down. All of these things have culminated into an outcry from our community, especially where community leaders community elected to come together as concerned citizens and have important conversations so July 4th. We had gotten news that there was going to be a big party at 143rd and malcolm x to get out there as a community and not to say that we are we're doing our own kind of neighborhood watch, not to say that we are we're doing policing, but we're having those conversations with these unauthorized block parties to make sure that you don't have a repeat of what you saw on 141st or 133rd at adam clayton powell. Again, we want folks to gather you know safely with social distance. We understand that people need to come out of their homes, but we wanted to be safely and with and without gun violence. So we went to the park. It was me brian, senator brian benjamin street corner resources went out there passed out mass talked to the people that were in the park. Some were there for the party, some weren't. It was just a good time to show them our faces, that we are part of the community and we care about it. So that's one of the things that we did it did have a little bit of so I think there was a shooting or I don't think anyone was shot, but I think there was a shooting at about 1 a.m when folks were out there, but before that it had gone pretty well. So that was the first time we were out then, on with street corner resources, there was an occupy at the corner. With mayor de Blasio, I was there shatik. Thank you for coming out. Dr hazel dukes. Was there also gail, brewer and assembly woman ivan sticklands assembly men, al taylor? They were all there for the occupy the street, with the young people sponsored by street corner resources. The mayor was there. I think that was on television, but one thing that we wanted to make sure is that when the tv cameras are not there, that people know that we are here and we are being a part of the community, and we are aware of everything going on. I have been on call since then, every week, with brian benjamin there they were first centered around dr dukes and c virginia fields getting out community information, but then they turned into calls about gun. Violence calls with the police, community police chief maldry and how we, as harlem knights, can come together and care for our young people, talk to our young people and try to understand where they're coming from with wanting to get out because we're all so you know, cooped up and want to enjoy the summer, but at the same time, do it safely. So we've had meetings with promoters to talk about what it might look like if we were to turn some of these unauthorized street parties into an organized event where there are mass there. Where there are. You know safety. If people are going to be, you know out outside that. They're distancing and if they're, sharing food and things like that, we are doing it safely. So there's been talk with promoters about having to do how to do that. There's also been talk about expanding open streets to partner with d.o.t and parks department, so there'll be scheduled activities on the open streets, not just open the street and open a hydrant but have actual activities there maybe bring out some equipment, so people can work out some big inflatable balloons, so people so the young people could enjoy it as well, something for all ages just to keep people busy during the summer and outside, but also you know doing something productive, but also out of this came the harlem good neighbor policy, so I sent that to shatik. Hopefully you all will get it we'll, send it out either today, probably after this meeting, but it's something that all the elected officials have signed on community board 10. We are the only community board of towns that have signed it thus far because a lot of the activities and things are happening right here in our area, and we don't want to be left out. So that is just saying that it's an agreement that we are supporting our young people, that we are supporting our young adults and that we are, you know, putting out guidance that will help us all enjoy the summer. So it's a harlem good, neighbor policy. You should be getting that and that should be circled around. Then we, I did burro board that was July 16th, where we all got together and we talked about rebel. Ironically, was the presenter at the borough board this past time and a lot of the community board chairs had a lot of concerns about revel. Since then, you know rebel has been stopped and suspended service because of the deaths that have occurred on those bikes, and there were a lot of concerns even on July 16th, we're talking about helmets and how are they going to make helmets safe, not only just safe to wear on the street but safe from coronavirus and any type of disease that might come from that and they were going to do a 50 off helmet purchase program. They were also going to offer lessons for inexperienced writers, which probably should have been a part of the deal about getting on the bike in the first place. Ironically, the only the only lessons that were available were in Brooklyn, so not really a central location for some of us in harlem, but that some of the young people that were riding those bikes, but they were the presents- also there's a lot of good events that came out of that one such is cba wanted to do an a bias project, implicit bias project that we have signed on to help out as well they'll be done within the community boards. But we hope to bring it out to the public as well and offer it as like a free course or a free class webinar. This will talk about implicit bias just in everyday life. We talk about it with police officers and in you know the workforce, but in everyday life and acknowledging those implicit biases. And what do we do with those? So that's something that we should be looking forward to. Okay and so then July 18th went to another street corner resources and cb10 me went out to look at another party site that we had heard was going to be an issue at 143rd and 8th avenue, frederick douglass. So we went out there and talked to the young people that were having that party just to make sure that they knew that we were there to support them and that we wanted them to do it safely and to talk to the party promoter there to see when they would be wrapping that up having the music going on into 2am, not to say that there has to be violence at that point or bad things happening, but it would be safer to wrap it up around 10 or 11, and that's what we were talking to them about. So we went out there and talked to those young people. I can I'm happy to say that there were no incidents that night, and that was a great help from street corner resources. We also occupied the corner that night, then. The next time we went to. I was present for the youth summit that street corner resources had with mayor de Blasio, senator brian benjamin commissioner, marco carrion and gail brewer was there and it was 25 young people that had that were especially chosen to talk to the mayor about their issues and not just the mayor, but to all the adults in the room. So they had the floor. We, the adults, just kind of sat there and listened, and it was very eye-opening as they talked about their own experiences with gun violence and the ways that they saw the community working with chief madrid, who was there as well to talk about community policing and what they saw that were issues. So we had that meeting with them. I also did a interview on a radio show to talk about gun violence and how we, as committee board 10, saw ourselves up in the effort of community policing and what role community boards can play to meeting with the 125th street bid and discuss those things there and how we were going to bring open streets and open dining or that concept, if in, if in any way to 125th street. So those are some of the things that we have been doing had another meeting with the harlem chamber of commerce, where the met the chief of Manhattan northwest there. I think her first name is kathleen and we talked to her about our issues with community policing and how the neighborhood police officers had not made themselves visible in our community, and we do not know them the whole thing about coming out and giving your cards to the young people and just the citizens, constituents that has not happened, and that has not happened in a long time. So we had those conversations with them, and that was the most recent thing. I did a couple of other things, but this has been extremely busy month. I want you to know that I've been out there. You know trying to represent community board 10 the best way I can to make sure that we are constantly involved and that we are constantly in the mix and not left out on the side to figure out things after things have already started to move in our district. So does anyone have any questions for me about some of the things that we've been doing? I do hi karen hi sisley hi everybody. I had a question about signage. There just doesn't seem to be a lot of signage out to explain to people the seriousness of what's of the Covid-19 virus and and the precautions that they should take, because they're still people who are not, you know, complying with what they're being asked to do for safety reasons. So there are signs that are interactive which that people could scan and they could get further information about the illness and the situation and updates. So there is, there are some and I think we got an email about something recently, a solar panel, kiosk bench type thing so, but this I think signage might be helpful. Yeah, that's a really good idea and we have been trying to partner with the elected officials and street corner resources to get out not only just mask but to continue to get out hand, sanitizer and things of that nature we are trying it is. You know an unfortunate limit that the whole country is facing when you do walk out there. It is I'm sorry to say a lot of the young people are not wearing masks and even when you present them with a mask, thank goodness they've been respectful. We haven't had any altercations, but I do see them throw them right on the ground after that, so after they leave. But so it has been a you know, a really eye-opening situation. Even when I was out there on July 4th, we were passing out mass. We bought 200 maps to the dj booth and made sure that he kept on announcing it. When I came back at about 10 o'clock, it was like 197 man still sitting there, so nobody had a mask on and you know when we would ask people where their mascara, they say, they're in their back pocket, not doing much good there, but we get. It is a struggle. We are still trying to get the message out, especially in our community people of color. But you know it is a struggle, but thank you for that. Karen sicily, thank you feel like you've. Been real busy, thank you for representing us. Well, we appreciate it. I just wanted to follow up with karen, because it what's really present is that young people aren't wearing masks and just an idea that we might want to think about activities that we've used with dycd and working with youth groups is to provide incentives. Dunkin donuts, coupons, mcdonald's, coupons in terms of trading it for wearing a mask something to think about. When you have those parties or those big forums, when you have young people might work there as well. That would be great, that's a great idea. Okay cicely, I was just wondering: is there any money from the city budget that could provoke, provide for the signage from our city budget or just from the city budget, at large, a city budget at large that we can petition for or write a letter to? You know I deleted to them to get the you know signage, I don't know what's downtown. So that's. That is an idea. I will say, though you know. A lot of the city budget thus far has gone to cover 19 efforts, you know, and rightfully so, but because of that and the replenishment that is not coming from washington right now. It is a strict budget cut on all sides from the state and city. So you know to ask for additional things right now and josh can tell you a little bit more about our budget and where we are so, we are even feeling it a little bit worse than what I thought. So I think it is a it's a money situation right now, for so this is charles. Can I just weigh in on this I just wanted. I think that there are great ideas that are being shared by karen and stephanie. I just want to emphasize. It is not just young people who are not wearing their masks, it's everybody. You know every age generation and I think the city and the state- and you know even you know, even some of the things that I've been seeing. Otherwise I agree with putting signage out there. I'm not sure how effective that would be. You know it's just you know. It's a reality that you know we're talking about grown people. You know I happened to have joined facebook about a month ago and I see images of people from my church and otherwise and the one thing I say to them: where is your man they're out there at parties they're out there at gatherings, they're out there, even at black lives matter and they're, not wearing their masks? You know so I agree with karen. I agree with stephanie, but I just wanted to emphasize. It is not just our young people, it is across the board, you know so our messaging has to be. You know something that we're not talking about age groups, we're talking about the entire harlem population. Thank you, charles, and it's definitely something to to remember that it isn't just young people but all of us, and we need to remember that just really quickly. I knew that there was one thing that I did forget. Thank you stacy for reminding us. There is the stop. The violence, anti-gun, violence, town hall meeting, that's gonna happen tomorrow, so that's July, 30th from 2 p.m, to 8 p.m. On 143 and lennox avenue, this is an old fire, because I believe linux is misspelled and we told them not to put this fire out with two ends. So I think there is another version coming out, but shateek I did send it to you, so if you could just send it to the board members, I don't know if we want to put it out with two ends in the spelling on linux. What email was that it was the stop. The violence flyer that I sent to you, the anti-violence, oh yeah. I posted that one up, yeah I'll, send it to the board. Okay, thank you. Thank you. Hi cecily hi. Everyone! God bless. This is pastor stacy ramos. That is the flyer that I just got today recycled from NYPD. So if there's an up-to-date one, I don't have it as yet. I just wanted to make sure that you had it because you were mentioning you know some things about NYPD and help there and doing stuff like that, and I just wanted to share it. Thank you stacey this. I actually had the flyer before this and I was on the call where we told them to take that extra in out. But, okay, that's why I didn't pass it out yet because I was like right, our social media. Some people think that we got the that linux wrong right, the spelling, yes, the spelling so but thank you so much for reminding me about it. I forgot to tell the board about it, but thank you absolutely kevin. Did you have something yeah? Just very briefly, going back to karen's questions about signage and something for us to consider. I know several of the city agencies, particularly, I know the department of cultural affairs, because that's my sector that I work with has been really proactive while providing downloadable, pdfs and signs for a lot of organizations. It might be interesting for us to look at some other city created pdfs that we could put on our own website and encourage restaurants, tenant associations to go to and to download, and you know, put signs up in their lobbies at their. You know mailbox areas, but that's a way that we could help encourage more signage. Being posted as reminders as people are walking out of their buildings, just a suggestion. Thank you. Thank you. That's a great suggestion kevin. I don't think there's anything else from me. I will say this, though, as we are talking about reopening and getting back to whatever this new normal is. I know some of the community boards are talking about being in person, and I will talk to everyone about this. You know as we start in september. I really feel that you know, since we've kind of got this zoom under control, and I and I would love to be in an area with you all, but it may be best for us to stay virtual for a while. So I do see that, maybe until december again, it is a conversation that we are open to having. I know some boards are talking about being in person in October. I don't feel like that would be best for our board at this time. But again it's an open conversation, but I just want to put that out there. Okay, so we can go to. Is it shatique with your report or is it josh? I can't have a thing: the agenda. I can go okay and then josh, okay, so first I just wanna say thanks sicily, for like all of your hard work that you've been doing. I've been seeing you out and about in the community on the street corner resources van with sister, I should say cool, I'm at the mayor's event. You know when they call for the community advocates to get in the community and stand you know with the community and act as liaisons between the presents and the community. So I just want to you know, give you a small round of applause for a little hard work that you've been doing throughout the summer. I'm also, I want to thank the office of the special narcotics prosecutor, bridget brennan and calvin solomon, because I was invited to two of virtual community forums and I was selected as a panelist to speak. One was with the interns that were there for the summer and the other one was with the assistant district attorney's office throughout the city. So when I spoke with the pen, excuse me when I spoke with, the interns was good to. Basically, they were asking me a lot of questions about community engagement and just what's the role of a district manager, and I was you know proud that I could give them some insight on. You know a lot of the things that I you know I dealt with from dealing with the agencies, elected officials, as well as on constituent issues and concerns on the assistant district, attorney's community forum. We talked about you, know, community, policing and then the relationships we talked about policy and we talked about. What's what was going on in the community with the gun, violence and prevention? I might have brought up some of the issues that were you know that we've been dealing with in our community as far as the unpermitted street activities- and I just want to thank the 30-second precinct for doing a good job at the at the at the streets that we were at the locations I believe, was 143rd street and on frederick douglass, the party or the event started at 6 p.m. They were out there with their cruisers, they surrounded the area and, like cicely said, there was no instances of violence, no shootings, but I just also want to remind people that there was an incident that happened earlier this month and I think it was the pink houses as a nature development in east new york Brooklyn. Where a woman, I think she was in her mid 30s she. You know she heard a lot of fireworks going on and in her development, and she went out to address some of the teenagers who are lighting the fireworks and she lost her life and that she was shot eight times. Omni said that the perpetrator stood over her body and kept shooting until there was no bullets left and this person is has yet to be apprehended, and this made the front page of the daily news, because they were saying that she, basically you know, were following the orders of us trying to be a good community neighbor, but we also want to recognize that being a good community. Neighbor could also be dangerous and you could be also risking your life. You know in the process of doing so. We just want everybody to be careful, and if you see something you know definitely contact, I'm the authorities, because just to try to be a good samaritan is not worth losing anyone's life, so I just wanted to put that out there also to follow up on some of the open street stuff that you were talking about. Sicily. I have a little bit more specifics on those, so the open streets concepts have been transformed into play streets and we have two play streets that are gonna be in our district. That will be opening up. One is on west one fiftieth street between saint nicholas place and edgecombe avenue on the other is on west 129th street, between adam clayton powell, jr and frederick douglass boulevard and the two organizations. The two non-profit organizations who have partnered with the city are the fresh air fund and the fresh air fund will host activities on west 150th street, and then the police athletic league will organize the activities on west 129th street. Some of the activities that will be included would be arts and crafts projects, board, games, sports drills and no touch obstacle courses. The activities are designed with social distancing guidelines in mind to protect against the spread of coronavirus. The west 150th play street will launch on august 5th, and activities will be held on mondays, tuesdays, wednesdays and thursdays from 10 a.m, to 4 p.m, and the west 129th street play street will launch on July 27th and their activities will be held on mondays, tuesdays, wednesdays and thursdays from 12 to 5, and both of these play streets will run through september 4th. Okay, also, I want to speak a little bit on city bike because in our neighborhoods we've seen that a lot of them on the new stations have been popping up. City bike has come to community board 10 in the winter time, with our proposals and maps, and they give us, you know different locations within our district that the city bikes would be, and they were looking for community input. We had at least two community forums where we gave our input. We were vehemently against. You know them taking up any additional street parking, but they have taken up some street parking at least two instances and we've heard neighbors, or at least I've got the complaints from neighbors one specific well actually, there's two specifically on an esplanade gardens. There's a city bike, rack station there that's being highly contested and also on 136th street and eighth avenue. The 136th street block association is against those bike stands as well. I know that obscenely spoke or we got in contact with the lawyer who represented esplanade gardens. We invited him in their in their group to attend our next transportation committee meeting and I also will be getting in contact with the 136th street black association, I'll, miss montgomery and letting her know that she'll be invited as well to speak on. You know this. The disdain for the city bike, so most of the disdain comes as far as they feel like they're, taking up parking in an area that we don't. You know the parking is very scarce. Also I want to announce with city bike. There were two non-profit organizations who received grants, community grants and the combined grant total was 230 000. They received this grant money from city, but one of those organizations was the boys and girls club of harlem, which is on 135th street and the other one is called urban upbound. So I think that when we're having the conversation on city bike, I think that would be good to know the loop, the boys and girls club of harlem and in the discussion, because they are working hand in hand with city bike and they are partly responsible for helping to usher in the bike. Racks and you know the initiatives, because they feel that in the low-income, neighborhoods and under representative communities that they didn't have enough bikes, so that part of their partnership was to bring these bikes into underserved or underrepresented communities. So just a quick list on some of the bike wraps that went up in our district. I have four one was at esplanade: gardens linux avenue between 145th and 146th. The other one was on adam clayton powell, between 150th and 151st street. We had another on mccoom's place between 151st and 152nd, and the last one was on edge comb avenue between 150 and 155th street. Also after the black lives matter, black lives matter, mural was painted on July 4th weekend board. Member terry wisdom sent me an email because she had a concern and she also reported that there was a group of bikers who went through the barricades and they were very rude and distasteful and bombarding on the mural. So I reached out to the organization by email. They sent me a response and we talked and they said that they kind of denied on the allegations against them, and they said that there was a miscommunication since that time they did get in contact with the organizers of the mural. They got in touch with nikola and they spoke, and they said that they are now working on partnership and they won't apologize for any misunderstandings or anything that happened. But I just wanted to thank board member terry wisdom for bringing that to my attention, because when she brought it to my attention, I was then able to act on it and then make sure that everything was fine from that point going forward. Let's see, let's see what else I have. Okay, also there's been viral videos, and you know things that people were saying that was going on in portland, with the federal troops coming in I'm in a portland oregon, and there were people. There were some concerns, you know if they were coming to the city, so I just wanted to announce for those who didn't know that mayor de Blasio sent a letter to u.s attorney general bill. Barr and acting secretary wolf are responding to recent threats by president trump to send federal agents to new york city. The letter expresses the city's unequivocal opposition and objections to the presence of federal law enforcement in new york city. Mayor de Blasio said that we do not consent. We object and do not send the proposed agents and officers from the department of homeland security or other federal agencies to new york city, and I believe, that's the general sentiment that we feel in our community and our city abroad. Also, I wanted to announce that last night there was a harlem community cleanup initiative, spearheaded by c virginia phil, as well as joe linda, roof hogan and the doran's brook square. I think miss barbara askins from 125th street was involved with that as well. But basically it's a bunch of community members who recognize you know that harlem is becoming a little quote-unquote dirty. There's a lot of trash and litter being left around the streets, so community members are coming together as far as a block by black initiative to try to clean up to clean up harlem. I was supposed to be on that car last night, but I missed it, but I will be joining the others. I will send an email out to the board and also send out the flyers when they become available to let everyone know in the community how they could join on this group to help clean up harlem, and the last thing I just wanted to mention is- is based on a conversation that I had yesterday with a second vice chair of charles powell, also chair of our housing committee, in regards to the way community board our follow-up and when we're when we're our follow-up and when we are requested to write letters of support for different rfps. For instance. Right now, mark 125 is a hot, but an issue and everyone there's a lot of people. A lot of organizations are trying to find a way how they can be involved in the project, and what we have to do is because a lot of times they look for the community board to get behind and support their projects. And then, when I was talking with charles powell, we were just saying that sometimes we have to let it you know it play out and we don't you don't really get involved until the full board hasn't had a chance to weigh in it. But you know sometimes they come to us premature shortly before the RFP has even been released and just in general, we have to find out. You know figure out as a board how we would like to deal with these type of instances in the future. For example, when beyond rosie's came to us about their proposal for the the site at the lincoln correctional facility, they wanted to move the women's facility there. They went to at least I would say three on different committees, I'm including public safety. They went to land use and I believe they also went to housing committee and they were looking for a letter of support, but I don't think we ever went through the full scope. I don't think this went to a full board, a vote, but I just under our recommendation- and I you know the conversation that I have with charles powell and he can follow up and speak on if he likes, but we have to be more diligent with following up on these projects and make sure that we have a good project process when it comes to looking at these letters of support and vetting all of these type of situations. So I don't know if you wanted to add anything on to that charles. But if not, that would pretty much conclude my report for tonight. I just had a couple of questions with the city bike station at esplanade gardens. It was my understanding that was removed because it's blocking emergency vehicles, the entrance ways for emergency vehicles and then also with the bicyclists that tyrion said there were a huge number of bicyclists that ran over the mural. Were those can we find out. I mean if we needed to investigate whether or not those bicyclists were using city bikes and be able to investigate that way, because I think that you know people should not be able to come into our community and vandalize. You know something like that. You know it's just it just sets a terrible precedence yeah. So for the first question that you raised our statement basically said where the bike racks moved. If they were moved, they weren't they weren't moving. Okay, they're still there, okay, so they must be stood there. I'll take your word for it, but I was, I didn't, get any information that they were moved and as far as the street bike riders, they didn't say that it was city bike. I think this is a group of people who ride bikes and probably more so, their personal bikes, but there were other people who joined in that may have been city, bikes and afraid, but this definitely I wouldn't categorize it as a city bike issue and once I spoke with them and then I spoke with the organizers of the mural, they pretty much have worked it out by the time that I had spoken with them. So if there's any other information that you want to get out actually probably get that through the organizers of the black lives matter, mural fatigue, I have two questions. One I'm excited to hear about the play streaks. I wish there was one further downtown around 114, but my question had to do with whether or not there was an RFP for the organizations that were selected to conduct those place streets. You mentioned pal and fresh air fund, both who have close relationships with the city, so I just want to make a point that, in the same way that we want to be supportive of small businesses in our community, there are lots of not-for-profits who have been existing in the community. Would love to know if they had an opportunity to bid for the opportunity to operate a price, a play street and the second question has to do with the bikes. On sunday. I think I saw three dozen young people on those city bikes riding around the park, so I thought we had maybe talked about what was there a program that allowed those kids to access those bikes at a discount or with some kind of coupon program? Okay. So the first question is about the RFP: I'm not sure if our RFP went out for the organization of the play streets, but I can't find out for you. I can reach out to get that information. I know that that's one of our community concerns and there's always been a community concern anytime. We had a conversation about city bikes of things being discounted. There hasn't been any advertisement sent to the board to suggest that there's been a discount. I haven't seen anything advertised on in the city on commercials buses, that's something else. I can look into it, but as far as far as I know, they have not given a discount to the youth in our community. They haven't. This is sicily, so I talked to jennifer stanan ns from d.o.t last week on a number of issues, and we talked about the possibility of a discount because, as you know to in order to even access city bike, you have to have a credit card so that- and we- and I talked about that again with her and right now- there is no change to that process. So there is no discount. There is a discount like if you qualify under snap, but not for like the use. Yes, they have discounts for nature residents and certain health care and health care programs for those with healthcare insurance, oxford health, first, maybe as well through the wellness partner program, but those are done as reimbursements through your health insurance, and I think you still need a credit card to even I mean so it's it is all still credit card based, so that's the biggest. It is exactly because I just did. I wasn't convinced that the three dozen young people I saw all had credit cards so just something to think about and for the record they're increasing their annual rates too. In the midst of you know a pandemic, and just so that you guys know the bikes are definitely being jimmied with plastic cards and those three dozen children or young people. That's probably why you see them all on these bikes. We watch them jimmy the bikes on a regular basis. Okay, I had a question shipy, thank you for sharing about what happened with the 4000 bikers and maybe we need to dig deeper because I did speak directly with the park. The park people and I know they were supposed to have a meeting at some point, but at some point they just said to me: they felt the it was. The point was mute and they were moving on and doing what they had to do. But I mean everyone knows that, following that there was a woman who came up with a car load of paint and was shouting about jesus and rolled over the mural and threw paint down, and I believe and she posted it on social media which went viral and she was, I believe, the same person that had done damage to the trump towers thing- and you know, was bold about that. I think she was arrested or something, but she was out by the next day. Once again, I haven't followed it up from you know. I saw the park the park people on sunday, but honestly when I asked them what is going on, I don't think the police were investigating this or doing anything, and maybe because it was like public art that the city wasn't paid for, but I think it's outrageous and I think that community board 10 and whoever, because that's in our area should have a position paper or statement that something like this could happen in our community. And nothing is done. I mean you know in any form and they were able to raise money. There were some private individuals and they're still having different events so that they could restore the mural and they had a very nice event last sunday, but I just don't think that things like that should be allowed in our community, because the city did not pay for that and probably should have paid for something in harlem, but that's not what happened and for them as a community organization that supports businesses to pay for it and it to be fair game to be attacked like that. I don't know what we do or should say, but it's I feel it's unacceptable. You know that it's not being investigated and it's unacceptable and I commend park, depart because they're very humble and they were resilient and they got it done and they were not letting any of this phase or stop the process of positivity, but I really feel we should have some kind of position paper or something because this is outrageous I mean I agree. I agree with you, you know initially, when the city you know proposed to do the black lives matter murals. I think that they said that they would put one in each borough and the one from Manhattan was the one that was, I guess, in front of trump plaza, and they had nothing to do with this with the one in harlem. So I commend harlem park the park for stepping up and feeling you know what this is: harlem black lives matter and putting something right and on 125th street in the center of harlem. You know to exemplify that, so I applaud them for that, but also, I want to say, it'll be very hard just to monitor it and then enforce it in the future, because how is anyone to stop any random person facing it? If any way, whether it was like whether it was a spray paint or a can of paint? You know, but every time that it does happen. It's good that media outlets such as yourself or on the ground and you report on it, because this particular thing that happened on 125th street. I don't think that it got the large attention that the one in front of trump plaza did so once again right, yeah, the media. The media didn't did not cover that at all. But the point is when something happens in our community and they have gotten some community security out there. Now there is security is from community groups. I don't know how they've arranged it, but there may be some volunteers or there are some private people who sold their art so that they could protect this art, and these are harlem artists, but the point is, and they also just for edification, the other black lives. Mural is downtown near to the burial ground that I believe, is city funded as well in front of the court. But the point is that this is our community, whether it was paid for by the city, but particularly because it was the community that volunteered harlem artists when things happen, there's supposed to be some kind of legal, something that happens to someone that does something like this, not that we could stop any random people, but I feel like there should be some kind of position, because when this happened- and it could be because of the police slow down- or I don't know what, but no police were in sight- this is at 11 o'clock at night. Community members were out there, so this is just incorrect and I don't know what we can say or do about it. But at least even if it's just words that you know we, this is unacceptable, and this is not what we expect, and this is not who we are because positive stuff, you know, should be saluted and celebrated and you're correct. The news didn't cover that at all they kept talking about a mural in Brooklyn that had pain on the you know got thrown pain, but this was more than just the letters black lives matters. This was artists, you know who were chosen, who you know labored and community members who labored to help them. So you know I don't know what can be done. Okay, thank you for that and just the last final word on the black lives matter mural. So we are going to I talked to nicola on sunday when I saw you out there, terry okay, how we're going to be sustaining it in the future, as the street is opening up on friday, so the street has been closed, but it's opening up friday's the last day right saturday should be open. So I believe that she said yearly. She wanted to do like a community day of you know. Cleaning it and repainting it and making it kind of like a June teen celebration every year and that's what you would do for the whole weekend. So I told her that you know she could count on our support for being out there doing that, so I will be in further contact with her okay great. I also know I I'll send it to you shatik. I don't know if you got it, but because they sent it out kind of late, but at about nine o'clock this morning I know they have activities this whole week, like they had meditation this morning with one of the harlem dance teachers. They had a cyclist, there's some stuff tomorrow and there's some kind of parade and double dutch or something on friday yeah. I think we got the fire so we're going to send that out. Okay, fantastic, okay, great! Thank you! Thank you! Okay! Josh did you want to go on with your treasury report? Sorry I was. I had to take the meat off my phone how's, everybody doing so the treasurer report for this month off for the new fiscal year. So we got our numbers in as we suspected. We got some huge budget cuts, so we have a operation budget of twenty thousand and one hundred dollars, but this year we will have to do without the normal city council budget that we get, which is forty five thousand dollars, typically, which we would use for you know, events for leasing, you know spaces for events etc or for buying equipment or any type of capital expense. So we don't have that budget at all this year, but we did get an additional 1 000, which can be used, which is which was allocated basically to to assist community boards and getting an urban planner to do studies etc on land use, which I don't think is enough quite to be frank, and then we got another five thousand dollars to support other land, use studies, etc. So not a lot to work with right there. But it's something is better than nothing. We'll have to be very judicious in terms of managing the budget for this fiscal year because last year, with a lot more funds than we have right now we exceeded that budget that we had last year. So in response to that, we were talking sicily, shatek and I about the budgets per committee. We don't think it would be feasible to allocate the fifteen hundred dollars to each committee, as we usually would so we're thinking that this year, we'll have to accept budget requests on a case-by-case basis and to that effect I've created a form. For you know, committee members, primarily committee chairs, to fill out a budget request form to submit their form so that when we do get a request, we can document it process it archive it, and then we can better track the requests per committee so that we can make sure that there's some balance and there's not just you know two three committee that are you know eating up all the funds before we get through the entire year. Shitiko. Do you want to share the form so that we can share it on the screen so that we can go over it? Let me give me one second, I can pull it up. Does anybody have any questions? Why are we waiting to throw that up? Josh? You want me to allow you to share your screen that you want me to share my screen with the form. That's fine, you can you can do it for me and I'll pull it up all right. Okay, so can everybody see that looks a little choosy? Oh no! This is a different form of [ __ ]. Okay, here we go okay, so this is the budget request form. So, first, it's pretty straightforward. Put in your name, I'm just gonna. Do it for myself, joshua clement email address. So then I'm gonna, whether depending on what committee you know, you're planning this project for or this request for you're to select your committee. So I'm going to select echo dev. Are you the chair of the committee? We prefer that you know you go through the chair, but if you're a vice chair or your chair just said, you know they want you to lead on this project, then you can still submit the form. So if you are not the chair, you say no, and then we just want to make sure that the request has been approved by committee. If yes boom, then you go to the details of the request you want to put in the total amount of the requests which is taxes and associated fees, etc. So, for example, making a quest for twelve hundred dollars. Then you wanna describe the requests, whether it's you know, food and beverages for an event, and you describe you know just the general purpose of the event, whether it's like a community resource, fair or something like that. That would probably look a lot different in the age of kovid in terms of what kind of events we're having, but you get the general gist of that and then you wanna to make it a little bit easier for the staff, because I see that we always go through this issue of people have budget requests, but then they don't have a city approved vendor that we can actually make sure that we can actually use to receive the funds so having this here kind of helps us make it easier for the staff so that you know before you submit your request. You want to find out with the person that you're going to be procuring the goods or services from that they are a city vendor, so that you know that you can work with this person. If not, then you would want to speak to like shitty and he might be able to direct you to some people who are proof city vendors, so that they can actually use the funds that we have. So yes and then you submit it and then simple and clean just like that, we'll review it etc. Probably in the executive committee meetings the requests to make sure that you know everybody's aware of it, it's pretty transparent and that's about all. Do you guys have any questions? Nope josh! I have a question. Well, it's a premature question, but within the budget and within the borough president's kind of abilities, if we do return to you know, in-person meetings with sisley mentioned at the top is a city providing like PPE or is that something that boards are responsible for providing on their own? That's a really good question. I'm not sure we can inquire about them. One thing we did do before we, our previous budget expired, was that we did purchase masks. I think we purchased about 250 mass rustic, so we should have that have that available. If we were going to go into that type of situation and have in-person meetings, we do have some sort of supply to work with, but in terms of ongoing procurement of PPE. That's definitely a good question where I have to figure that out and again one would hope by this point. We all have our own, but that may not be the case for everyone coming to attend the meeting and then second, you know again premature question but use of space venue just curious. Would we be you know the state office here, thinking of the harlem did office building still be our venue and it's a pretty much your question. So as far as the as far as the PPE equipment, one thing that they a couple of things that they're mentioning as masks as one two as hand, sanitizers or sanitizer stations, and the third would be like the digital thermometer to take people's temperature before they come in. So that's one thing: that's going to be in this year's budget request that we're going to have to buy either for the office or you know it's portable, so we'll be able to use that if we have events on other places besides the state office building, but I know I know at the state office building they're actually not taking digital readings thermometer readings because I've been in the state office building and there was no protocol for that. So did you know right? So those are really good questions that we'll have to figure out. If we do decide that we're going to have in-person meetings again. Does anybody else have any questions regarding the budget or the budget request form the one last question? Sorry for the notes as well. Thank you. The the city, the city budget, of course, was eliminated, but was there a reduction in the the city council budget was eliminated, but it was a reduction in the the city budget. The 20 000 was that a decrease from last year yeah, it was a decrease in it. There's going to be a couple of decreases in the upcoming fiscal years as well, okay and then the other. The other piece of that I'm still not sure about that we have to figure out, is the personnel budget, and if this, how long this hiring freeze will be in effect, because we were planning to hire an additional staff member and that got put on hold with everything that transpired. So we were, I was advised that we can I'm higher and I was going to talk to you and stephanie as well going forward this month. If we could wrap that up interview process up, because we came down to a small view of a small pool of applicants, so I figure by the next executive meeting we could. We could probably make a decision or, if not, it's no rush, because we're all meeting virtually and it's going to be a challenge just to even train a new employee and a virtual situation right now. So I would, I would think, somewhere by either august or the latest in september, but we can start the vetting process or continue where we left off this coming month. Okay, that's good to know: let's pick that up, have you reached out to any of the people that we previously interviewed to gaiji if they still had interest I reached out to let them know that we were in a hiring freeze. I did not reach back out to them. Let them know that it has been open. As of yet okay, we can discuss that offline, the three of us yes, the next steps sounds good. So that's about all! I have yeah, that's about all! I have folks. So unless you anybody has any other questions. Thank you josh and thank you for that form. That's a great forum. Thank you. Yeah, no problem we're going to go ahead and move into the standing committee and task force reports. We would normally have a housing report here, but charles powell, who was on the meeting earlier, is filling in for me. Graciously there is a conversation with assistant district attorney, sai vance today that what I was invited to, but because we have our meeting, I'm not able to go so he's gonna fill in for us, so we will have a presence and he'll. Let the board know me and the board. You all know what transpired and what was said. Okay, we're going to go on to land use. Lisa did you have anything is lisa on hi everybody. Can you hear me hello? Yes, oh hi, everyone! No! I just wanted to give everyone an update. We had malcolm hunter from hcci on the call last week and I know juanita sent out the transcript and the google the youtube or whatever sorry, I'm just coming in the presentation, and I just encourage everyone to read it view it. Malcolm, has a wealth of knowledge. He's born and raised in harlem, and now is leader of a esteemed nonprofit development organization. They own a lot of buildings, malcolm came before the community board a year and a half ago to present a project and the community denied it, and so I'm really trying to get the community board to understand the work that he does, along with the work of other non-profit developers, to show how the housing crisis that we're experiencing currently and all the other social issues. That is the other social mission of organizations like malcolm. So I would just encourage you to read it. Thank you. Thank you. Thank you, lisa, oh, that's it! Oh yeah. I mean we're going to be gearing up for the fall with some more robust programming. Now that not that the crisis is over, but the land use and the planning commission may open on monday august 3rd, so your looks will begin to happen again and I'm sure there will be a pipeline of developers waiting to come before us. So we anticipate a robust fall. Okay. Thank you, lisa, thank you for keeping us abreast transportation and then we'll and then I do even though karen's not on here. I'm gonna ask her to give an update, but just really quick transportation. You already updated a lot of people on the city bike issue, but please come out to our transportation meeting because we will be talking to d.o.t about city bike and we have invited espionage gardens to express their displeasure in that city by station. So we hope to hear from them then also I did speak to again d.o.t, like I said earlier about the frederick dallas boulevard alliance proposal that came to us. So at that time, which was about last week or maybe a week and a half ago, they, the fdba, did not put in the proposal so because they haven't done that. D.O.T was unable to weigh in on any of their ideas. However, I did speak to her about. You know the what ifs of the situation and again to reiterate our concerns about the intim bus line and the shutdown from 112 to 121st in some ways seems excessive when there's not an abundance of restaurants on every block. In fact, there's just one block of the writing that doesn't have any, I think that's 117. doesn't have any restaurants at all. So we were very concerned about that that hole shut down. So she understood and would keep us abreast. I've also reached out to fdba and they would keep us arrested anything that they have planned as well. So we should be in the know, but if there is a plan shut down of fdba, we talked about what it would look like to allow. You know they have to allow emergency vehicles there and some delivery vehicles, but what about our seniors or people who are identify as disabled and how will they get around? Where there'll be an assessor ride situation, where we can, where they can utilize that or even around allow green calves or the yellow calves or some ubers to go up and down fdba f, frederick douglas boulevard, just in case you know, we wanted folks to be able to still get around and they said they would look into that as a possible option, because they did understand that you know. While we do want to support our businesses- and we are, you- know- we're hopeful and there for them at the same time, but we want to be able to con support our whole community, and that does include seniors and that does include the disabled. So we wanted to make sure that happened, but that's all I have for transportation, we're gonna move on karen. Did you want to say a few words about all the wonderful work that you're doing in parks with the exonerated five? Yes, I had some other issues as well. We have, we still have an opportunity to provide feedback to the department of new york state department of environmental conservation on a brownfield cleanup program which would deal with land reuse, so that site is at 280 west 155th street and then so we have an opportunity to provide feedback for that. What we would like to see. We also have an opportunity to provide feedback to the mayor's office on the harlem river waterfront project for vision, 2020 plan. So that's pending, we got some very good news. I got a call from the department of parks stating that the colonel charles young playground is, is possibly going to be moved to a capital project, so we've been fighting for that for the past five or six years, so that may be in the works. Cal. The cal ripken foundation has come back on board so that that's all just wonderful news. We met on July 8th for our regular, and that was our July 8th, regular parks and rec meeting on the on July, 9th 16th and 23rd. We had community outreach on the exonerated five central park exhibit and the the discussions were extremely robust and just a wealth of information was obtained from those panel discussions we had. The first panel discussion was on what the exhibit should look like what message it should convey. So we had cynthia copeland from the seneca village project who was featured, and she talked about the process that seneca village went through in order to get the exhibit done in central park. It was a very lengthy process about 20 years, so that was a long time. We also had the innocence project on that panel, vincent sutherland and nyu professor of law, and we had anamola fola artist on and, of course, yusef salaam. Dr yusef salaam was on and for the second panel that was on funding and development, so we had yusef salaam again. This is mrs salam, his mother, and we had retired cap fdny, captain brenda berkman who came on she is with the monumental women and she described the process that the monument monumental women went through for the women's suffrage, monument which is being unveiled on august 26th in central park. The first women's monument in central park, so that was extremely helpful, just hearing what their process was. We also had on the second panel okay. Well, it was a very mrs salam was on. She talked about her experience as well. From the family's perspective and our last panel discussion, we were honored with the presence of sarah burns who's, the documentary, the filmmaker of who created the central park, five documentary, so she is committed to working with us she's, going to work with us to develop the educational component and we're also thinking about timing into school curriculum and into some other location where which would deal with social justice. We also were honored by malik yova, who was committed to working with us and had some great ideas about how we could get the project off the ground. We had jay larry, who spoke to us about the formation of a 501c3 and not not-for-profits, and he is an attorney who was with skadnarks, so he explained that process. He also worked with the new york lawyers alliance and did pro bono work as a member of that group, then we had ricardo barreto. Who is a public art public arts process consultant? So he explained what we would have to do in terms of art competition to get the to develop whatever the art piece is going to be. So it was a just a fantastic series of three discussion panels, which was, as I said, was our community outreach. It was a very diverse. We had some input from, or was some participation from some of the surrounding boards community board. 7 is very much interested in working with us on that. So we just had a lot of extensive outreach. Subsequent to the panel discussions, we got a call. Sicily was on the call with the mayor's office central park, conservancy in new york city parks and that they expressed their support and we're, and we were told that the parks commission is very excited about projects, so that was really great news. We are meeting tomorrow we're having a subcommittee meeting just to bring tie everything together and develop next steps, and also to take a look at developing a mission statement and a statement of objectives and goals. So that's my report. Thank you karen, and thanks for the wonderful panels that you've been able to put together, I'm really excited about it, and I hope you know that the board continues to support this effort. It's a lot of work that we are looking at getting ourselves into, but it's a lot of good work that we are here to do. The reason why we hopefully we joined this board, and I do have to say that when I was able to report on this at the borough board, there was a lot of folks on there. You know all the community board chairs are on there and as the only african-american and african-american female chair, I have to say you know. You know how I tend to get emotional, but I have to say that I was very proud that I that we are doing this and taking this effort on and that all the community boards are looking to us about criminal justice about what we want to see and what is so important is that we use this moment for what it is and we use it correctly and in an informed way in a very intentional way. I always use that word, because that is that I think that is. You know what we have to do and it's our calling to do so. I feel that you know when I, when we're talking about these things, that we're being purposeful, that this started out as an idea. Thank you chanel for that idea in that very contentious community board meeting that night. You know, there's a lot of feelings, but now to see it coming to this fruition as we bring the community together. We cannot lose sight of our vision for this, because this is very popular and a lot of people want to, you know, have their say, but we have to know that we want to share this with the community, but at the same time it is a community board 10 effort, and we want to make sure that we remain in control of our vision of what we want to see. So that is what I wanted to want to put out there, and I want us to be very again very intentional about the partners we bring in and about the way we go about doing things. So thank you for that. Karen you're welcome. Thank you. Okay. Are there any questions about that? Any questions for karen any initiatives just so I just want just that. I want to say that I was. I had the opportunity to participate in all the panels and I just want to congratulate and applaud karen's leadership. It was an incredible effort and she did it in less than a month. She pulls this together. I thought it was impossible girl, I'm telling you right now, but she and it and it did us proud. So, thank you very much. Thank you. Yes, I want to say I think karen is wrong because I'm on the phone with karen, sometimes 8 30 in the morning 30 at night, you know putting in requests sending out emails and you know just helping. You know to get the meetings done and I know karen is really diligent. On top of putting and organizing everything like she brings all of her people in from different agencies and this when she gets it there, she just makes sure she make sure you send out the email to get them to come or send them a reminder, but most of the work you know she does a lot of the work and then we just help her. You know from the office just on the technical assistance portion of it, but for the brunt of the committee work she does a good job and she doesn't have a vice chair, so she's doing a lot on her own. So you know within the committee and then within the task force, so I just also want to applaud you for that as well. Thank you. Yes, thank you. I wanted to applaud you as well karen, because I was at every meeting and kind of calling you and saying you, okay, but I think that you got some excellent panelists who had information that we can look at, and you know morph it to our needs, and I am in agreement with you, sicily, that we have to keep our vision and our intention, because, especially at this time and what the central park exonerated represents, it's very critical that it is done with our intention, because that is what will make a difference as we move into the future and as we are in this time, you know we have to use this time and use the correct intention so that it just doesn't get dispelled or dispersed or any of that, and we all know what can happen. So I salute you in saying that, and it's good, you know just seeing the models that people went through and you know pretty much we're creative so and we get things done and we have gotten things done with little or nothing sometimes. So I think that we're like that- and I think karen exemplified that all that happened. You know in that short amount of time, so I think I think we can get it done and I think we can get it done efficiently and I think we can get it done quicker because we're resourceful so and resilient. So thank you. Thank you. Oh you're welcome I'd just like to say we have a projected timeline for deadline for december. I believe it's december 19th the day the 20th anniversary of the exoneration, which was in 2002, so we do have a targeted date for okay and, I believe, with the team and the energy and the resourcefulness. I believe it can be done and, as we get to that date, it's you know, may not even be but the final, but it's going to be significant and something that can be added onto and contemporary, so that that's great, but they a lot of the people had some great ideas you know just to share when they were talking about the statue and the statue has talking parts and theater. You know that you could hear, and you know the same way that we have these stands where you can plug your phone in there's a lot of innovative technology and people, probably especially in this town, would be very interested and so very excited. Thank you karen. Thank you. My pleasure kept my kept me busy and I needed to be busy. That's a good thing. Yeah! Thank you, karen and just one more report. Before we go to old business, I wanted. I don't know if chanel's able to talk but she's been doing a lot on her echo dev committee. I didn't know what she wanted to share about her recent talks. Yes, hi everyone, I don't know if I can share my screen. Oh yes, I can hold on so I know you guys already know we are doing a newsletter. Every month we update the newsletter with who came to the committee. Everything is still the same on here. The forms are on there. What I did add is the sla applicants and renews so now you can actually see how we voted. You can just tap on to any of these and it'll pop up. How we all voted on the item. Also, the minutes and the video is there also. What I did add is give me one. Second, I did at cb10s resource guide. So now you can actually tap here and you will go to community board tens website where we have three resource guides. I do believe we need a updated one. You guys can go on there and see for yourself, so we probably should look into doing that. Also also I did these are now I'm active, so you can now press on any of these and it'll. Take you directly to the website, and so we had neighborhood brule coffee shop present this month and we also had open data. Come back for training that was held by stacy, garner and albert weber, if you guys just check on the minutes hold on. If you go here and you just tap here, it'll bring you the minutes from this month's meeting. If you guys would like to see that I don't want to press on it, because it's going to take me to another window and then I'm going to have to play with these screen sharing, so you guys should be able to go ahead and tap on that. So I just wanted to share those updates that has been added to the newsletter and that's how you can see updates on what took place in our economics development meeting and that's pretty much all well. I do want to say that I am seeing the articles in regards to all the kovic complaints that are being handed out to you know small businesses in harlem. I do have a forum here that says community concerns, so if anyone has any good ideas as how we can address this issue with small businesses in the covent or try to assist, please submit you just go here and it's basically like a form that josh just went through. It's a google form and you just submit it and I'll get those answers. And then I can try to see if we can call like a meeting or something on the side to see if we can possibly organize something to assist with bringing that number down. So yes- and that's pretty much it now, do we know if any citations have been issued in harlem to restaurants. Well, the article was specifically about the citations in harlem. I was I mean we have yes and how we have. You know a lot yeah. So that's why I'm asking if anyone have any ideas on how we can you know somehow support small businesses or support the community or figure out a way to bring that number down. That'll be great. Open data did a really good job with their presentation, so you'll be able. If you go on facebook, you can see their whole training that they do live and you will be able to bring these complaints up and see exactly anecdotally. I know we need to move on, but this sunday walking along forever douglas boulevard, the same corridor that the alliance is talking about opening up. I was quite shocked on the number of instances where servers I saw taking masks down, as I was just walking up the street talking to people at tables and also a few establishments having lines waiting for people to get tables and those lines were not socially distanced and many of those things were in front of residential entrances. So I know frederick douglas boulevard is just one corridor within harlem, but it is a corridor that is especially on weekends frequented by many right now and I could see it very easily getting out of control. I agree. I do know there are some businesses that are so. What I did do is the especially the the applicants that are coming before us. I do go to their establishments and visit to see. You know what's actually happening there, so I do realize that some businesses are supplying gloves or hand sanitizer and free mass, but we have businesses that don't. I do think that we should push to make sure that all businesses have free mass if you're gonna be able to like dine or sit and take something that they provide a free mask and that not be something that the customer provides. So I'm definitely open to having a conversation yeah. I think this is terry wisdom. I think that somehow, with the ambassadors or whoever it is, we should be trying to see, or at least have a position paper of what we think should happen, because you know some of even on lenox avenue. Like I mean quantum social was out of control, I mean way out of control, and I think you know I even like you know was writing about it and they looked like they tamped it down. They did get some signage, but it's still not where it should be, and I mean this is a concern, because these are extraordinary times, and this isn't just like. Oh we're trying to punish restaurants- and I mean I see the governor- is some people are losing their licenses if they're not doing the right thing, but I mean at the end of the day it's still like. Maybe the 20 to 35 year old crowd that is in there. That's not wearing masks, that's not social distancing and that could cause. We know where we were with the numbers that could really cause the whole community to go south, quick and everybody be sick and people be dying. So I don't think it's something that we play with lightly and if there's ambassadors- or you know the mayor or whoever can be appealed to like people should be the same way that they're going on the corner to stop the violence, because that kills people you know. Maybe there are you, know people who have to go to the restaurant and monitor and make these people do what they're supposed to because they're making money on potential deaths. It's not good and it's more than just the people in the restaurant, because they're going back into the whole community. So it's not a good thing right. So I mean, like you said: you know, who are the mask ambassadors, because there is a such thing, and so my thing is: how do we partner them up with the small businesses to make sure that, instead of being fine, that what you do is you invest? But you get it? Maybe the city could provide a discount since it would be like something mandatory, and when someone comes to your establishment, you automatically give them a mess like how you give them a napkin and a fork or a glass of water. Maybe that can be a way that we bring it down. Is that you know they? We put it on the businesses to provide that mass when they come through the door I mean. So we can definitely talk about that. I'll tend to smell out, trying to get grouped together to see how we can put something together to address that yeah, because I think it's another way that as cicely was saying like we're showing leadership, you know what I'm saying where harlem could really show leadership, because you know harlem is not massive like Brooklyn and you know our district. You know we could really show some leadership. Hopefully you know and show the rest of the city how to do this. I just want to say I just wanted to add to that real quick. I just want to add to that. I think the concern is warranted, but I think we also got to give our small businesses a round of applause, because they've been way better than you know the examples of what we've seen in parts of Brooklyn, Queens, inwood and dykman, and the other thing that we have to do is make sure that our businesses are getting timely information, because these regulations have been changing from week to week and what I've heard from different all business owners is that they've invested in getting you know, engineers and stuff, to design these outdoor seating and different things, and then the next week the city comes and tells them. Well, these regulations don't meet our new requirements. Now you have to do this over and they've already spent thousands of dollars. You know setting up their outdoor seating and doing all these things to make sure that they meet the requirements and then, by the next week they don't meet the requirements anymore. So I think we can do that trying to help them- or you know talking with these agencies and make sure that they're getting the information in a timely manner. I agree with alma josh said, because the article actually came out of a news. A news story called the harlem patch, a harlem patch, specifically focused on everything harlem. So in the news article for our community district, there were only 100 complaints and I can give you other community districts that had way more so soho in the west village had 236 upper east side and roosevelt island had 239 of chelsea and hell's kitchen had 189 and, like josh, said in astoria, where the governor actually closed down. Restaurants, there were 500 complaints, so compare it compared to everything else. It was very miniscule, but because it's a harlem newspaper, we, it was the focus because it's close to home yeah I mean. I also think that you know we know the restaurants and everybody has been through a lot and you know changing regulations, but some of the things that we're talking about are basic, like you know, people being six feet on the line that doesn't cost money. That just has your person out there or something on the ground or saying- and I don't know what the law is- that. Obviously people don't have a mask on when they're eating, but if people are just hanging, they need to have a mask on and that needs to be said and we're seeing every day across the country. What is happening so there's really not that's, not excusable. That's not building something! That's just a mindset, so that mindset, I think we need to you, know, support and encourage you know, because what is going to happen? You know if some places continue they're going to end up getting some sanctions that are going to cost them money going to lose their license or whatever it is. That's going to come down and people are going to get sick and die. So I think that you know that's a place where we as a small community can really show- I think, some leadership, not that's costly to any restaurants, but it's also, you know helping people to not get sick. I have one other question for chanel or anyone else for the restaurants that did not go through the kind of legacy process of obtaining a sidewalk cafe, license and they've kind of been ushered into this process by having sidewalks is there? Is there a time at which they will have to go through a process to renew that? Or how do we know any information about that? So I believe the chair gave some information. The last call about that, so they have a process in place. Currently that has no community board input. Somehow they came up with a fast process to try to solve the problem quickly and we were not included in that process. So there's really nothing. We can do to stop what's going on at the current moment and it was told to us that at a later date, because I believe the chair and basically let them know- you know that there should be community input into this process. So I believe in the future there should be some more community input. I don't know, I believe the chair can like elaborate more on what that would look like in the future, because she was at the meeting, so chanel you're correct right now. The process is, there is no community board input, and this is this process. This open streets, self-certification will last until October, it's been extended until October, so basically they can put whatever else they want. As long as it fits within the regulations I think after October, then we will go back to the community board process of street cafes and sidewalk cafes approval, but until then we don't have anything, but because the community boards were so concerned about this process and it just being you know, there is no real. You know requirements or regulations. Their madame borough president said that we would be getting the information for all of the businesses that had applied in our area, so there is supposed to be a list coming out. I don't think that has been sent to us. Is that correct fatigue? I don't think we've received it, but they did promise that we would get. It is not a requirement for the businesses to notify us. Some of them have which we thank them for doing, but from the bro president side they're going to give us a list of businesses that have applied, so we can kind of like keep a watch on it ourselves, yeah. We have not received that list. Okay, I mean it's the process. You know everybody is just reacting in real time to code 19 and the regulations and there's a lot of knee jerk reactions happening. So the process was not laid out very well. That's why I mean it's not you don't want to be too critical, but the process had a lot of issues when it first came out. So that's why there's been so many revisions to it that have been costly to the business owners but at the same time, there's a lot of processes that within small business services within the sla within dlt there is no meshing together. So some of the there's not so one hand doesn't know what the other hand is doing. That's a lot of the issue. That's going on right now. The last I do want to say something about the open data training is it. I did put in a request for the staff to provide a report on noise complaints. I would like to add Covid-19 complaints now to that, if they can just provide, you know that data, so that can be sent along with what was submitted by the applicant. So when the committee members view the documents they can also view those reports, I just got one question for you: yes, mark 125, any update from EDC at all, so mark 125. We're gonna have to reschedule the meeting, but I believe there is a meeting that's supposed to be coming up, that they will be hosting and I guess we will be invited. So we want to hold off until we get some updates on what's happening with that, because the watch and discuss are really for community input. We want to know you know: what does the community feel so that we can take that information to those meetings? So that's pretty much. How we're playing it now so there'll probably be will be another watch and discuss on that topic, but it will probably happen after they do their meeting. Thank you, but the watch and discuss you did was really good by the way I didn't know like I didn't even know they had that on you that you that video was on youtube right, the whole full movie all right. Yes, it's really good. If you haven't seen it, everybody should go check that out. I believe, if you just type in mark 182 mark 125 on google on youtube it'll come up. It goes to the whole history of the the site and chanel. You said this next meeting will take place in august or september or to be determined well right. Now I believe the chair is set is in communication with them currently to organize a meeting. It was something that was happening before covey and so she's reached out to see where they are in the process. So, if they're going to hold like a town hall discussion right, we will probably be you know involved in that discussion. However, we probably would want to hold a watch and discuss either right before or right after that event to allow the community to provide what they you know feel and not necessarily it be a panel where the community is listening to what you know. Others have to say about what should happen. It's an opportunity for the community to get on a call, and you know they raise their hand and I'll allow them to speak if they have a story. There's some vendors that said that they will be willing to get on the call and tell you know their experience, vending man, you know. So it's just a way to hear from the community a lot of times. People come to echo dev, you know and it gets emotional and then, but that's not the place to have the discussion. So that's why I created what we call these watch and discuss on like a sunday evening, so people could be in their homes and you know talk about things that we don't have the time and committee to speak about it. Thank you. Thank you, chanel, for that great update and the mark. One two five movie is really good, so it was, and it was a good conversation. Madame bro president was on there just to hear some of our concerns about mark 125. So we definitely will renew that conversation. We are going to talk to our representative wahira. I talked to her, maybe about a couple weeks ago, just to make sure that nothing has happened. You know in the midst of Covid-19 that we missed out on any information about mark one two: five, because we were again want to stay in the loop and nothing to be just you know, put up on us and we'd be surprised that it's not going to happen again. So she said that there's nothing going on, but we will be included in any conversations she does. There is a plan to bring community board 10, along with certain cbo's, to have a small conversation, and the conversation will grow as the time marches forward for an RFP to come out, and I it's going to be a brand new RFP. So that's what we're looking forward to, but she's have they're going to have these community meetings to kind of guide and craft the RFP into something that we can't see and support did they ever mention? If because they never really executed that contract, I know before it was like, like 18 million dollars for the site, do we did they mention at all if they still have that same amount of funding, or that is that reduced, so yeah? That's a new conversation that we'd have to have with her, because you know, of course you know that was like free coping last year, so I don't know how you know with the city budget cuts how that has affected even the possibility of getting this off the ground by next year. I know that there was, you know, talk and kind of a push to you know this administration has been supportive of our vision and trying to talk to the community. They heard us loud and clear last time when space works, you know that might have been a good organization for Brooklyn, but definitely the way it was done. It was not good for us at that time, so I don't want to spare space works and all that they've done in Brooklyn, but it wasn't the right fit for harlem. So with them. Acknowledging that I know when I spoke to the representative. They want to try to start this RFP now that this administrative administration is hearing us and we don't have to start all over with somebody new that gets into that office. So there is the push to try to get this going before. I guess it's. This mayor leaves the office thanks, josh, okay, any other questions we have reached the end of the meeting. I know kevin, we didn't do attendance, but I do want to make sure that you know the chairs that did come today get credit for it. Even though I know this is a summer meeting and we have a lax attendance policy because people are you know trying to do summer, things kevin yeah. Are you still there yeah? Sorry? Can you hear me? Yes, yep hi just do a quick roll call before we go into old business just so we can folks can get credit for showing up today sure folks could, since I'm looking at, I don't have a video screen up, but folks can just verbally announce their presence when I call your name. That would be great I'll start at the top cis lee harris here. Marquise harrison he's excused. Okay, charles powell was here had to leave for a meeting joshua clennan here, deborah yates was here, but I think she had to leave kevin bitterman here, stephanie palmer, and he was here she's still here, janine brown blackmoon, it's excused absent. She was here early. She was okay, lisa downing, I know was here: lisa is still with us. I'm here. Thank you, hazel dukes, dr dukes, excuse deborah gilliard george herrera karen orry. Thank you, charles johnson. Oh he's excused. Okay and chanel washington present awesome. Any other committees representing right now that I haven't announced any vice chairs. Oh caroline nixon is here sorry, I'm sorry who was that karen dixon hi karen hi everyone hi karen hi thanks kevin we're gonna go into old business. Is there any old business? Okay hearing now we're gonna go in a new business, any new business. I just hello, yes, hi just for old business. A few of you had asked about lettuce, terrace. I spoke with the representatives two weeks ago and nothing has happened. They will like to build as of right, but no permits have been filed. I think they're just laying low for right now. Thank you for that update lisa for new business. I thought george was gonna be on, but he said he might have a meeting. So I guess he went to his meeting, but they are having harlem week virtually this year. So we will send out the information we are working with: the sponsors, greater home, chair of commerce in the arts and culture division. Mr rosa rivers and george have got some acts and things that they are partnering on for the virtual harlem week, so we will be involved with that. They did send a letter to the board. Just letting us know that harlem is happening. So we will sorry about that, so we will send that out just so. You all will have noticed that harlem week is happening this year. Okay, that's it for new business. Is there any other new business? I have something: it's not really business per se, but I'll put it in the chat. A lot of you might know that they published the nyd nypd's criminal complaint records and it shows that the 32nd precinct right hand. Harlem, has the the most complaints in all of Manhattan. I talked to charles about this shaw johnson this week, so I know that he's on top of this and he's already sent like this information to shetty. So I just think it's something that you know in this age of you know we're when we're really looking at you know our criminal justice system and our policing in our community. We need to take a hard look at. You know our preaching right here in our district and in this relationship to the community. Okay, can I say something hello, yes go ahead, so I so I did reach out to the assemblies office to see if we can possibly get something that has to do with this profanity right, because that same report that he's talking about shows that we have a high number of profanity that goes with these incidents. So now we have the data, so it wasn't just me on the call you know saying things: the last public safety meeting it's actually accessible now, so I think we should take a look at that and try to see if we can get some sort of police community agreement in terms of them making sure that they make sure that their workers are not cursing at the public. Thank you chanel. I was there for the public safety call. So I think the representative from the 28th precinct was going to follow up with that, but thank you for bringing that up. This is a non-cb10 matter, but I did bring it up to karen about the activity in mount morris park over some weekends. I know we talked about the lack of social distancing with respect to restaurants, but there's no police control, there's no crowd management. People aren't wearing masks. There's no curfews, there's a lot of just escalating arguments, we're in a period of a lot of gun warfare and, like I said, I've reached out to cb11 and thank you kev karen for responding, but it's out of control. Thank you lisa we can. I can follow up with cb11 as well, just to see if nilsa has had anything and give a report back to you excellent. Thank you all right is that all I'm sorry, I have a question. It seems to me, especially over by lennox avenue, near linux, terrace and other places that there are a lot more homeless, people that you know actually have pretty well set up camps, so I just wanted to know if people have been noticing that- or you know where we are with that- because there's a lot more homeless people living on the street, like with all their belongings that I have noticed. So I don't know what that comes under or what how we can address it. You know I know like over on 127th off of you know going towards amsterdam. I saw police moving homeless people off the street, but there's a lot more and obviously, in these extraordinary times, they're going to be a lot more, but you know so. Yes, we've had several complaints about that or concerns for people who are experiencing housing and securities. So when we brought it up to some of the agencies, it's an unfortunate mix of you know. We don't do that anymore or it's not our responsibility with NYPD. They don't deal with it anymore, so it's homeless services but homeless services. You know it's just coming up to speed with all of their new responsibilities and they don't have enough staff to do what they need to do to deal with the issues, so they are looking to some cbo's or NYPD to kind of take up the slack. But then NYPD is saying it's not their job. So it's this big circle of everybody is saying. I can't do it, it's not my job. So it's a lot going on right now with these changes so, but we are bringing it up and when we were on calls. This is this. Is the rhetoric that we're hearing right now, so the community is kind of stuck in the middle of people trying to figure it out? Is there anything else? Okay, any announcements. Oh I'd just like to say that the women's suffrage monument will be unveiled on august, the 26th they're, having a virtual unveiling. There will be some physical presence and I was asked to do a statement for the virtual ceremony. So hopefully I sent it in today. I hope it will be accepted and then also I did a statement for seneca village. They are considering a permanent exhibit so they're coming to our next. I think the next meeting to do a presentation on that. Okay, the next parts meeting- yes, okay, thanks karen you're welcome. Okay great at this time, I will entertain a motion to adjourn so moved. Stephanie hasn't been moved and is there a second thank you josh, it's been moving properly. Second, all in favor aye any opposed lisa you're opposed. No. I was just saying I, oh okay. I was like what okay, no I'm just kidding, yeah, okay, okay, I'm sorry chad hold on. Will we get the list of new members who's going to be on who committee? I'm sorry? Is there a projected date we'll get that? Yes, we are going over that this weekend, where we were hoping to do it last weekend, but someone could meet so this weekend, we'll be going over that and you will get it the first week in august. Okay, thank god. Okay, so we are adjourned at 8, 34 p.m. Great seeing everyone! Thank you. Thank you thanks. Everyone bye! Thank you good night good night.",
        "summary": "I know that a lot of what we're used to not meeting over the summer, but I believe a lot of the community boards are continuing to meet, especially this year.\nWe want to make sure that we are able to stay active in the community and available and informed Thank you juanita and shatik for your diligence during this time and while working from home, there was a calendar for august 2020.\nBut one thing that we wanted to make sure is that when the tv cameras are not there, that people know that we are here and we are being a part of the community, and we are aware of everything going on.\nViolence calls with the police, community police chief maldry and how we, as harlem knights, can come together and care for our young people, talk to our young people and try to understand where they're coming from with wanting to get out because we're all So you know, cooped up and want to enjoy the summer, but at the same time, do it.\nSome big inflatable balloons, so people, so the young people could enjoy it as well, something for all ages just to keep people busy during the summer and outside, but also you know doing something productive, but also out of this came the harlem good neighbor policy We'll, send it out either today, probably after this meeting.\nWe are the only community board of towns that have signed it thus far because a lot of the activities and things are happening right here in our area, and we don't want to be left out.\nYou know rebel has been stopped and suspended service because of the deaths that have occurred on those bikes, and there were a lot of concerns even on July 16th, we're talking about helmets and how are they going to make helmets safe, not only just safe to wear on the street but safe from coronavirus and any type of disease that might come from that.\nThe only the only lessons that were available were in Brooklyn, so not really a central location for some of us in harlem, but That some of the young people that were riding those bikes, but they were the presents- Is cba, wanted to do an a bias, project, implicit bias project that we have signed on to help out as well they'll be done within the community boards.\nWe went out there and talked to the young people that were having that party just to make sure that they knew that we were there to support them and that we wanted them to do it safely and to talk to the party promoter there to see when they would be wrapping that up having the music going on into 2am, not to say that there has to be violence at that point or bad things happening, but it would be safer to wrap it up around 10 or 11, and that's what we were talking to them.\nI also did a interview on a radio show to talk about gun violence and how we, as committee board, 10, saw ourselves up in the effort of community policing and what role community boards can play to meeting with the 125th street bid and discuss those things there and how we were going to bring open streets and open dining or that concept, if in, if in any way to 125th street.\nI. Think her first name is kathleen and we talked to her about our issues with community policing and How. The neighborhood police officers had not made themselves visible in our community, and we do not know them the whole thing about coming out and giving your cards to the young people and just the citizens, constituents that has not happened, and that has not happened in a long time.\nI just wanted to follow up with karen, because it what's really present is that young people aren't wearing masks and just an idea that we might want to think about activities that we've used with dycd and working with youth groups is to provide incentives.\nA lot of the city budget thus far has gone to cover 19 efforts, you know, and rightfully so, but because of that and the replenishment that is not coming from washington right.\nI might have brought up some of the issues that were you know that we've been dealing with in our community as far as the unpermitted street activities- And I just want to thank the 30-second precinct for doing a good job at the at the at the streets that we were at the locations.\nOmni said that the perpetrator stood over her body and kept shooting until there was no bullets left and this person is has yet to be apprehended, and this made the front page of the daily news, because they were saying that she, basically, you know, were following the orders of us trying to be a good community neighbor, but we also want to recognize that being a good community.\nSo I think that when we're having the conversation on city, bike, I think that would be good to know the loop, the boys and girls club of harlem and in the discussion, because they are working hand in hand with city bike and they are partly responsible for helping to usher in the bike.\nThere's a lot of trash and litter being left around the streets, so community members are coming together as far as a block by black initiative to try to clean up to clean up.\nI will send an email out to the board and also send out the flyers when they become available to let everyone know in the community how they could join on this group to help clean up harlem, and the last thing I just wanted to mention.\nIs- is based on a conversation that I had yesterday with a second vice chair of charles powell, also chair of our housing committee, in regards to the way community board our follow-up When we're, when we're our follow-up and when we are requested to write letters of support for different rfps.\nAnd what we have to do is because a lot of times they look for the community board to get behind and support their projects.\nI. Don't think this went to a full board, a vote, but I just under our recommendation- You know the conversation that I have with charles powell He can follow up and speak on if he likes, but we have to be more diligent with following up on these projects and make sure that we have a good project process when it comes to looking at these letters of support and vetting all of these type of situations.\nI mean if we needed to investigate whether or not those bicyclists were using city bikes and be able to investigate that way, because I think that you know people should not be able to come into our community and vandalize.\nThis is a group of people who ride bikes and probably more so, their personal bikes, but there were other people who joined in that may have been city, bikes and afraid, but this definitely I wouldn't categorize it as a city bike issue and once I spoke with them So. If there's any other information that you want to get out, actually probably get that through the organizers of the black lives, matter, mural fatigue, I have two questions.\nI. Think I saw three dozen young people on those city , bikes riding around the park, so I thought we had maybe talked about what was there a program that allowed those kids to access those bikes at a discount or with some kind of coupon program?\nOn social media which went viral I saw the park the park, people on sunday, but honestly, when I asked them, what is going on, I, don't think the police were investigating this or doing anything, and maybe because it was like public art that the city wasn't paid for, but I think it's outrageous.\nLast sunday, But I, just don't think that things like that should be allowed in our community, because the city did not pay for that and probably should have paid for something in harlem.\nShe wanted to do like a community day of you, know.\nWe don't have that budget at all this year, but we did get an additional 1 000, which can be used, which is which was allocated basically to to assist community boards and getting an urban planner to do studies etc on land use, which I don't think is enough quite to be frank, and then we got another five thousand dollars to support other land, use, studies, etc.\n, You want to find out with the person that you're going to be procuring the goods or services from that they are a city vendor, so that you know that you can work with this person.\nIf we do return to you, know, in-person meetings with sisley mentioned at the top, is a city providing like PPE or is that something that boards are responsible for providing on their own?\nWe be you know the state office here, thinking of the harlem did office building still be our venue As far as the as far as the PPE equipment, one thing that they a couple of things that they're mentioning as masks as one two as hand, sanitizers or sanitizer stations, and the third would be like the digital thermometer to take people's temperature before they come in.\nYou already updated a lot of people on the city bike issue, but please come out to our transportation meeting because we will be talking to d.o.t about city bike and we have invited espionage gardens to express their displeasure in that city by station.\nYou know, there's a lot of feelings, but now to see it coming to this fruition as we bring the community together.\nOn top of putting and organizing everything like she brings all of her people in from different agencies, and But most of the work You know she does a lot of the work.\nBut I think that you got some excellent panelists who had information that we can look at, and you know morph it to our needs, and I, am in agreement with you, sicily, that we have to keep our vision and our intention, because, especially at this time and what the central park exonerated represents, it's very critical that it is done with our intention, because that is what will make a difference as we move into the future And You know just seeing the models that people went through To say, we have a projected timeline for deadline for december.\nIf anyone have any ideas on how we can you know somehow support small businesses or support the community or figure out a way to bring that number down.\nIt was very miniscule, but because it's a harlem newspaper, we, it was the focus because it's close to home And, you know changing regulations, but some of the things that we're talking about are basic, like you, know, people being six feet on the line that doesn't cost money.\nSo I think that you know that's a place where we as a small community can really show- You know helping people to not get sick.\nWhen the committee members view the documents they can also view those reports, I just got one question for you: We want to hold off until we get some updates on what's happening with that, because the watch and discuss are really for community input.\nWe want to know you know: What does the community feel so that we can take that information to those meetings?\nThat's why I created what we call these watch and discuss on like a sunday evening, so people could be in their homes and You know talk about things that we don't have the time and committee to speak about it.\nNow we have the data, so it wasn't just me on the call you know: Saying things, the last public safety meeting I think we should take a look at that and try to see if we can get some sort of police community agreement in terms of them making sure that they make sure that their workers are not cursing at the public.\nIf people have been noticing that- Or, you know where we are with that- because there's a lot more homeless people living on the street, like with all their belongings that I have noticed."
    }
}