{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "title": "MCB4 October 2020 Business License \\u0026 Permits Committee",
            "publishDate": "2020-10-14",
            "shortDescription": "Business Licenses \\u0026 Permits Committee  \\nTuesday, October 13, 2020 \\n\\n6:30 p.m. \\n\\n ALTERATION APPLICATIONS:\\n1. 401 W 53rd Street – Omakase LLC (change to hours of operation) Hours of Operation: 11 a.m. – 11 p.m. seven days a week; Capacity: 75; Tables: 11; Seats: 25; Service-only Bars: 0; Stand-Up Bars: 0 with 0 seats.  \\n\\n \\n\\n2. 351 W 38th Street (8/9) – Quadrum 38 F\\u0026B LLC \\u0026 GG W38 LLC (change to method of operation and an alteration to add interior restrooms to the rooftop area) Please see page 6, 7 \\u0026 18 of the packet for details for Hours of Operation; Capacity; Tables; Seats; Service-only Bars; Stand-Up Bars.  \\n\\n \\n\\nNEW WINE, BEER \\u0026 CIDER LICENSE APPLICATIONS: \\n\\n3. 366 W 52nd Street (8/9) – Toribro Ramen Inc \\nHours of Operation: 12 p.m. – 11 p.m. seven days a week; Capacity: 50; Tables: 5; Seats: 10; Service-only Bars: 0; Stand-Up Bars: 1 with 10 seats.    \\n\\nNEW LIQUOR WINE, BEER \\u0026 CIDER LICENSE APPLICATIONS: \\n\\n4. 142 W 24th Street - NY 24th Street Manager VI LLC, NY 24th Street Operating VI LLC and NY 24th Street VI LLC \\nHours of Operation: Hotel will operate 24 hours 7 days a week with alcohol service from noon to 1 a.m.; Capacity: 1,257; Tables: 52; Seats: 212; Service-only Bars: 0; Stand-Up Bars: 1 with 19 seats.  \\n\\n 5. 155 7th Avenue (19) – Blackwave 155 7Ave LLC  \\nHours of Operation: 7 a.m. – 10 p.m. Sunday – Thursday, 7 a.m. – 11 p.m. Friday \\u0026 Saturday; Capacity: 56; Tables: 15; Seats: 25; Service-only Bars: 0; Stand-Up Bars: 1 with 4 seats. \\n\\n 6. 328-330 W 46th Street (8/9) – Time Square 46 Restaurant Corp.  \\nHours of Operation: 12 p.m. – 2 a.m. seven days a week; Capacity: 120; Tables: 40; Seats: 120; Service-only Bars: 0; Stand-Up Bars: 1 with 8 seats. \\n\\n7. 331 W 51st Street – Corp to be formed by Michael Mestro –  \\nHours of Operation: 11 a.m. – 12 a.m. seven days a week; Capacity: 100; Tables: 46; Seats: 68; Service-only Bars: 1; Stand-Up Bars: 1 with 12 seats. Seating outside within property line: 4 tables, 8 seats.  \\n\\n 8. 319 W 51st Street – Kevin Empire Restaurant 319 Corp –  \\nHours of Operation: 11 a.m. – 11 p.m. Sunday – Wednesday, 7 a.m. – 12 a.m. Thursday - Saturday; Capacity: 45; Tables: 10; Seats: 34; Service-only Bars: 0; Stand-Up Bars: 1 with 4 seats. Rear Yard: Capacity: 36; Tables: 9; Seats: 36; Front Patio: Tables: 4, Seats: 8.",
            "lengthSeconds": "2:53:55"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "ymULXFLk7pk",
            "fillerWordCount": {
                "uh": 1,
                "um": 3
            },
            "readTimeFullTranscript": "122 min read",
            "readTimeSummary": "9 min read",
            "wordCountFullTranscript": {
                "music": 99,
                "Applicant": 93,
                "space": 86,
                "Member": 75,
                "restaurant": 61,
                "sidewalk": 52,
                "street": 33,
                "cover": 30,
                "bar": 29,
                "applicant": 27
            },
            "wordCountSummary": {
                "music": 19,
                "space": 17,
                "Member": 14,
                "sidewalk": 12,
                "restaurant": 8,
                "street": 8,
                "tables": 6,
                "cafe": 5,
                "noise": 4,
                "sound": 4
            },
            "fullTranscript": "Burt Lazarin- Co- Chair: Me to enhance culinary boy for our business licenses and permits monthly committee, meeting., Burt, Lazarin-, Co-, Chair:, Everybody I hope has a copy of our agenda was updated this morning by Nelly. Burt Lazarin- Co- Chair: It includes for the committee members. Burt Lazarin- Co- Chair: Possible, open dining steps for discussion as an item on our agenda. Hope you've all had a chance to look at that., Burt, Lazarin-, Co-, Chair: This is a continuation of our meetings by zoom Burt Lazarin- Co- Chair: We have an executive order from the Burt Lazarin- Co- Chair: Governor of New York order to a 2.1 that gives us the ability to have meetings by zoom rather than face to face,, which is I, was going to use the word normal circumstances,. But who knows what those are. Burt Lazarin- Co- Chair: Hopefully. Maybe. By this time next year, we'll be back to face to face. Burt Lazarin- Co- Chair: We have six Burt Lazarin- Co- Chair: Six items on the agenda,. Maybe let me take a look: At Burt Lazarin- Co- Chair: Eight, plus the open dining. So I'd like to have us introduce ourselves on fertilizer and CO chair the committee. Frank Holozubiec- Co- Chair: And I probably calls her back the other co chair. Burt Lazarin-, Co-, Chair: I'd, say on my left, and my right,, but I do not know who's on my left or my right. Inge Ivchenko- BLP, Public, Member:, So, Kenya. If chain go public member Okay., Christine, Berthet-, Committee, Member:, Christine, Bertie number Michael, Noble-, Committee, Member: My number is the picture of me. Wendy Gonzalez- Committee Member: Member. Kerry, Keenan-, Committee, Member:, And member Walker, member Burt, Lazarin- Co-, Chair:, So,, Sabrina and Brian,. You want to do that. Separately. Burt, Lazarin-, Co-, Chair:, Simultaneously, Sabrina., Sabrina, Reveron-, Committee, Member:, Sabrina., Brian, Sokal-, Committee, Member:, Brian, So, Cal, number, Burt, Lazarin-, Co-, Chair:, Okay., Welcome, everybody., And I, see faces of our applicants. Hello. Joe on the agenda,. We have Burt Lazarin- Co- Chair: The items route. We have the first grouping. Burt Lazarin- Co- Chair: Application alterations. Number one is for a one: less 53rd STREET. Burt Lazarin- Co- Chair: Changes. Two hours of operation. I guess: that's it. Do we have the applicant here. Frank Holozubiec- Co- Chair: Just for it. Before. We start, I, wanted to remind everyone that,. As with all the candy board, meetings. This is being recorded and will be up on the Community Board website on YouTube. It's, also being streamed, live on YouTube. Frank, Holozubiec-, Co-, Chair: And. Second, is anyone who's been with us before knows what this committee will do will make a recommendation on whether to grant or deny liquor license to the full board. Frank Holozubiec- Co- Chair: Which will hear these applications and voted on them. Again. On November for the full board will then make a recommendation to the state Liquor authority, but again, what we do and what the full board does is only a recommendation. We do not have our grant or deny like unless Burt Lazarin- Co- Chair: Yes. Okay. Burt Lazarin- Co- Chair: Number one, number one for one West 53Rd STREET., Christine, Berthet-, Committee, Member: I have a question. There are there are no hours of operation on the phone. Burt Lazarin- Co- Chair: And, look on the agenda, we have 11. Am to 11 pm Christine Berthet- Committee Member: The format's, nothing Frank, Holozubiec-, Co- Chair: Yeah,, so they have it on the first page where they say what alteration, they're seeking to do, but yes. Correct. They did not fill out. The second page correctly is the applicant here. Burt Lazarin- Co- Chair: Or, a lawyer,, a representative of the applicant. Wendy Gonzalez- Committee Member: They're, they're typing in the chat that they're here. Inge Ivchenko- BLP Public Member: They wrote their here. Nelly Gonzalez- MCB4: Okay. Let me move them. Over. Give me one second. Burt Lazarin- Co- Chair: Thank you., Nelly, Gonzalez-, MCB4:, Hello., Nelly, Gonzalez-, MCB4: Error listed under panelists,, but I Nelly, Gonzalez-, MCB4: Do, not know where we can't hear him. You're on mute. Christine, Berthet-, Committee, Member:, No. Then, you on Inge Ivchenko- BLP, Public, Member:, He's fixing, it. Nelly, Gonzalez- MCB4:, It's fixing, it. And, he's having audio issues. Christine Berthet- Committee Member: This is fun. Burt Lazarin-, Co- Chair: Why. Do not. We move ahead to item number two., Burt, Lazarin-, Co-, Chair: And, then we'll come back to one. Burt Lazarin-, Co-, Chair: And. Then two is 351: West 38, Street., Burt, Lazarin-, Co-, Chair:, Quadrant, 38. This is also a change, a method of operation and alteration to add an interior restrooms to the rooftop area. Donald Bernstein- Attorney: Yes, thanks for. Can, you hear me. Burt, Lazarin- Co- Chair: We can hear you. Donald Bernstein- Attorney:, Okay. Hi, everybody., Donald Bernstein, on behalf of the applicant, you'll. Probably remember this from December of last year, when we look here before you for this. Donald Bernstein- Attorney: Hotel license application that we reviewed at great length back then. And. Would you recommend it approval of? We did not file the hotel liquor license application with the state, Liquor Authority and we have the approval of the state. Liquor. Sorry., Donald, Bernstein-, Attorney: There has been a change since then, and the change really was covered that hit us and affected us in so many ways. And with respect to the hotel. Donald Bernstein- Attorney: What, it did is make us realize that we've got this outdoor space on the 26th floor, Roof Terrace,, which is on the floor. That also has a number of guests: rooms. Donald Bernstein-, Attorney: And. When we first planned the use of that space,, it was intended to be amenity space to be used. The outdoor portion of the 26th floor and then any space for use by the Donald Bernstein- Attorney: guest room on that floor. It was not open to the public,. You would have to be an occupant of that guest room to use that space. Donald Bernstein- Attorney: Now we're realizing the importance of having outdoor space that is open to the public. It's important, not only for us. Donald, Bernstein-, Attorney: But. We believe for the public,, not knowing how long this may continue. And, also just an appreciation of the importance of having some outdoor restaurant space., Donald, Bernstein-, Attorney: The. Other restaurant space in this hotel is all indoors. So. The application that we have for you this evening is for two things. One is a change, a method of Donald Bernstein- Attorney: Operation to allow us to use that,, not just as a melody space,, but as a regular restaurant that serving meals, full meals, full menu., Donald, Bernstein-, Attorney: With, a service bar that will be open to the public. And, because we're putting in a service bar. It also is going to be an alteration. Donald, Bernstein- Attorney: None of the other operational issues relating to the hotel or changed the hours remain. The same. All of the stipulations that we negotiated with you and all of the aspects of operation that we presented back last Donald Bernstein- Attorney: December remain in place. The. Only change is converting it from amenity space to public space., In, fact,, the,, I. Think the seating for that outdoor area,, which did originally have 57 seats. Donald Bernstein- Attorney:, is now going to be reduced.. I'm sorry. It was originally Donald. Bernstein- Attorney: 6866 seats on the outdoor portion and now it's being reduced to 58 seats. So. It's actually the occupancy will be a little less Donald Bernstein- Attorney: The search bar, as I said, is not a stand up. Bar patrons can not go up to it so that it or drink. It's a service bar only allowing the waitstaff to go and get a beverage and be able to bring it people sitting at tables., Donald Bernstein-, Attorney: We did have our fire STEAM come back.. You may recall that he did an acoustic study back last year that we gave to you, relating to that outdoor space. Donald, Bernstein-, Attorney: He came back and issued a report on September 18 we supplemented is October. Donald, Bernstein-, Attorney:, Report. And. He found that the conversion that we are seeking has no change in acoustic factor. So. All the acoustic Donald Bernstein- Attorney: elements that were in place before will remain in place and his recommendations will continue to be followed.. We did do some outreach to neighbors. Donald Bernstein- Attorney: We spoke to Frank and Christine about this. We spoke to hutch in your tool. Kit Hell's Kitchen alliance of a letter from them. The, Hell's, Kitchen, neighbor Association,, the garment center bid for all the advice of this and Donald Bernstein- Attorney: Supportive and that's the application. Frank Holozubiec- Co- Chair: I got older, I. Take it the revised our sheet that you sent to me this afternoon, your clients, okay with that. Frank, Holozubiec-, Co-, Chair:, Yes., Donald, Bernstein-, Attorney: Okay,. So the hours that we had presented to you. I think with the 2, am closing for those spaces. Yeah,, maybe change. Frank, Holozubiec-, Co-, Chair: Some of the hours on the sheet that breaks out the various spaces did not conform with what we agreed to last time. But. That was a technical mistakes. So that'll be corrected. So. The only changes as Donald said is relates to the roof,, how it's used. And the bar up, there. Burt, Lazarin-, Co-, Chair: There. Any questions from committee members and comments. Inge Ivchenko-, BLP, Public, Member: Yeah, can I ask how so it had a capacity of 66.. How often was it at maximum capacity. Peter, Krokondelas-, Kasirer, Consulting: Never. It has not been open. Hotel has not been opened, yet. Yeah., Donald, Bernstein-, Attorney: We have approval of the license application by the State Liquor Authority,, but we have not pulled it because I'll tell us not opening Donald Bernstein- Attorney: Right spring of next year. Inge Ivchenko- BLP Public Member: Okay,. So we do not even know. Inge Ivchenko- BLP, Public, Member: Whether. The weather will be packed all the time. Whether because when guests only have used, things are usually quieter.. Inge, Ivchenko-, BLP, Public, Member: I do not know what surrounding because I never did a site visit on this. I do not know. What's around there., Inge Ivchenko-, BLP, Public, Member: I do not know. I'd have to defer to Christina and Frankie face. Did the site visit. I'm, not quite sure. Christine Berthet- Committee Member: When, we did,. Where am I, yeah,, we did the site visit and we know that location, pretty well. And the that level of innovation. There is really new. Neighbor whatsoever. Okay. Inge Ivchenko- BLP Public Member: I'm, going to defer to you guys. Donald, Bernstein-, Attorney:, So, yeah, and just also. So, you know,. There are no Sandy's whether at the bar elsewhere. This is just Donald Bernstein- Attorney: A service and at its maximum you're talking about 58 people. That's if it's Full to that. Okay., Burt, Lazarin-, Co-, Chair:, Any, other questions, comments,. Any members of the public signed up to speak Le. This Nelly Gonzalez- MCB4: No, I have no one with any raised. Hands. Burt Lazarin- Co- Chair: Okay., Inge, Ivchenko-, BLP, Public, Member: Motion to approve. Burt Lazarin-, Co-, Chair:, Okay., On, favor, Rob, Walker-, Committee, Member:, I, Burt, Lazarin-, Co-, Chair:, Okay., Burt, Lazarin-, Co-, Chair:, Let's, go back to item number one. Donald Bernstein-, Attorney:, Thanks,, everyone., Peter, Krokondelas-, Kasirer, Consulting:, Thank, you., Donald, Bernstein-, Attorney:, Tonight., Donald, Bernstein-, Attorney:, Good, night., Burt, Lazarin-, Co-, Chair:, You, too., Fangjian, Yuan-, Applicant: Hi,. Can you hear me. Burt Lazarin- Co- Chair: Yes,? We can now. Fangjian Yuan- Applicant: Yeah., Hi. Sorry, I need to fix my microphone early Burt Lazarin- Co- Chair: So. Would you like to say something about the change of your hours. Fangjian Yuan- Applicant: Yes, yes. So. We decided to open. Sometimes, seven days a week, cause. We took a huge hit from the Covid-19. We have the open since March. So. That's like almost a half year, delay. So. We would like to Fangjian Yuan- Applicant: Make. The liquor license more flexible for us. So,, seven days a week,, so we can decide like which day can close Fangjian Yuan- Applicant: We can have more freedom on the schedule. Also,. We would like to add some daytime for the liquor license, because we do have a lunch hour from 1130 to 230. So we would like to add some time during for lunch. That's. Why I proposals from 11 am to 11 pm Fangjian Yuan-, Applicant: And, the so far, they've really love our restaurant. So I think the you we can bring the liquor for the daytime. We can attract more customers to come to our restaurant. Yes, thank you., Frank Holozubiec-, Co-, Chair: I have you so you have been open already: Fangjian Yuan-, Applicant:, Oh yeah,, we opened. I, think July 1. So we are open. Now., Frank, Holozubiec-, Co-, Chair:, Okay. So. What they're doing is they're not. We already approved the 11 pm closing time which they're not seeking to change. Frank Holozubiec- Co- Chair: They really want to open earlier in the day so that their liquor license covers lunch. So Frank Holozubiec-, Co-, Chair:, We, Frank, Holozubiec-, Co-, Chair: It's, not later., Fangjian, Yuan-, Applicant: Yes,. Yes, we actually own the launch like from July 1, but we did not see any liquor this whole time for the daytime. So. We start still liquor at 530 to 11, so that time did not change at all. Frank, Holozubiec-, Co-, Chair:, Okay, I'm. On your on the form you submitted their couple of things. You need to correct Frank, Holozubiec-, Co-, Chair:, On, page two., There's a chart we supposed to put in the hours, you're going to be open and the kitchens, open. Your form just had check marks. You need to put in every block the hours that are supposed to be in there 11 to 11 Fangjian Yuan-, Applicant:, Oh, I will correct that tonight and send it again to Natalie. Fangjian Yuan- Applicant: Yeah. OK. I will do that. Asap. Frank Holozubiec-, Co-, Chair: And. The other thing that I think is a mistake, because you answer the question differently, this time that last time. There's a question that asks if you're going to use outside promoters- and you said yes on this farm. But, you said no, the prior time. So I, think you mean no Fangjian Yuan- Applicant: Yeah,, that's the mistake. Yes, yes. Frank Holozubiec-, Co-, Chair: Okay,. So then any page. That's on page two as well. So. If you could correct that., Fangjian Yuan-, Applicant:, OK, I will quit. Frank Holozubiec- Co- Chair: And. The last thing the bar, the bar that you have. There is only a service bar., Correct. Fangjian, Yuan-, Applicant:, Yes., Frank, Holozubiec-, Co-, Chair: And. No one could go there to buy drinks, right. Fangjian Yuan-, Applicant:, No, no,, that's just a sushi bar, that's a workstation, just for the sole Mike. Our customers can see always chef. Make, a sushi. That's it. That's, an altar liquor, bar. Frank, Holozubiec-, Co-, Chair: Okay,. That's all I have. Burt Lazarin- Co- Chair:, Okay., Burt, Lazarin-, Co-, Chair:, Any, questions, comments from committee, members., Inge, Ivchenko-, BLP, Public, Member: And, that was, uh, yeah. I have a question. Are you currently using the street to help your business. Christine Berthet- Committee Member: Oh, Inge, Ivchenko-, BLP, Public, Member: Have, you set up in the street and the sidewalk. Fangjian Yuan- Applicant: Oh, yes. Fangjian Yuan- Applicant: Yes,, we do. We, do have Street. We set up a tent on the parking space straight, but we do not have any Fangjian Yuan- Applicant: Straight. So, the walk, side. We did not set up any table. Inge Ivchenko- BLP Public Member: On, the one boxer you've kept the walkway free, that's Inge, Ivchenko- BLP, Public, Member:, Very, nice., Thank, you., Fangjian, Yuan-, Applicant:, Yeah,, yeah. Because. We have a huge, a big stairs in front of our store. So. There's really not enough space for Fangjian Yuan- Applicant: For six feet, so we can support any table and maintain six feet away from the storage. Inge Ivchenko- BLP Public Member: Thank you. Some people are doing it. Anyway. We really appreciate it. Fangjian Yuan- Applicant: Yeah. Inge Ivchenko- BLP, Public, Member:, I'm happy with this application. Fangjian Yuan- Applicant: Thank you. Thank you. Christine Berthet-, Committee, Member: I'm, just going to follow up. Thank you for reminding me. Christine Berthet- Committee Member: The. Do you have,? You do not have any music outside., Right., Fangjian, Yuan-, Applicant: Oh,, so far, no. Fangjian, Yuan-, Applicant:, No, music, so Christine Berthet-, Committee, Member: It would be good to keep it that way because it's normally it's not. It's not permitted and it's very disruptive to other operations. Fangjian Yuan- Applicant: Okay. Fangjian Yuan-, Applicant: Yeah,. We can, yeah, we,. We will not play any musical side. Love. Yeah. Burt Lazarin- Co- Chair: Okay. Do. Anybody have your hand raised. Frank, Holozubiec-, Co-, Chair: Proceed. You wanna. Do you want to add a stipulation about that or Christine Berthet- Committee Member: Yeah, that'd be good. Frank Holozubiec-, Co-, Chair: Okay,, so Frank Holozubiec- Co- Chair: Sarah,. Would you agree that there'd be no music in the in any outdoor space. Fangjian Yuan- Applicant: Yeah. Yeah, I, agree., Frank, Holozubiec-, Co-, Chair:, Okay,, so, well,? We're going to add that as an additional stipulation on the form. Okay,, that's fine. Fangjian Yuan-, Applicant:, Thank, you., Frank, Holozubiec-, Co-, Chair:, Thank, you., Burt, Lazarin-, Co-, Chair:, Know, anybody in their hands up to speak. Nelly Gonzalez-, MCB4: Now,; no one Burt, Lazarin-, Co-, Chair:, Okay., Do I, hear emotion. Inge Ivchenko- BLP Public Member: I'd like to make a motion. Wendy Gonzalez- Committee Member: Second, Burt Lazarin- Co-, Chair: All, those in favor, Rob, Walker-, Committee, Member:, Aye., Opposed., Burt, Lazarin-, Co-, Chair:, Of staying present, not eligible., Okay., Burt, Lazarin-, Co-, Chair: We will not be category.. Number two. Fangjian, Yuan-, Applicant:, Good, luck., Thank, you., Thank, you., Burt, Lazarin-, Co-, Chair:, New, wine,, beer and cider license applications. 366 was 52Nd, Street Tory bro on Burt Lazarin-, Co-, Chair:, The, applicant here., Burt, Lazarin-, Co-, Chair:, A, representative of the applicant Nelly. Do. We see anybody, Hwal, Kim:, Know,, hello., Hi, here., Hwal, Kim: How. Can? Yes why Hwal Kim: And, then the Anthony's like Jane? You is here, but I. Think his microphone is not working here: now. Burt, Lazarin-, Co-, Chair:, So,, Frank, Holozubiec-, Co-, Chair: Do. We can you go ahead, or do you want us to wait and see if you can get him on the line as well. Hwal Kim: Yeah, I want to read to him literally Frank Holozubiec- Co- Chair: No. Okay,. So why do not you will move ahead when you're both on just put it in the chat and we'll come back to you. Jae Yu- Attorney: Can? You hear me. Frank Holozubiec- Co- Chair: Yeah, okay. Jae Yu-, Attorney: Okay,. This is Jay Christine Berthet-, Committee, Member: Here's, the second one. Burt Lazarin- Co- Chair: So, you most here: now. Burt, Lazarin-, Co-, Chair:, Yes., Okay. So go ahead,, guys., Jae, Yu-, Attorney:, Okay, I'm, real applying for the restaurant. Why license for the transfer. It's been licensed to sell beer and wine at the location. Jae Yu- Attorney: At 366, Western, 52nd, Street., Jae Yu- Attorney: It is a Japanese restaurant. Jae Yu- Attorney: And, the opera operation, our operating hours at 12 pm 11 pm seven days. A week. We have about five tables with a 10 settings. And. We also have a foot counter with a 10 settings and the premises is about point escapades. Jae Yu- Attorney: That's, all I have., And then,, you know, I'll, answer. If. You have any questions for daddy., Frank, Holozubiec-, Co- Chair: So. Do you have any connection to the prior operator? Toto Robin,? Are you completely new. Jae Yu- Attorney: Mr. King. Can, you answer. Hwal Kim: Yeah,. This is really like to be to go to over the place. Frank Holozubiec- Co- Chair: I'm sorry. Hwal Kim: Yeah,. We took over the place. Frank Holozubiec- Co- Chair:, But I you and it. Are you, a new operator or did,. Did you have any connection with them. Frank Holozubiec- Co- Chair:, No., Okay. So. One thing: we got some letters from the community. And. Actually, we've been hearing about this for years that when Toto Robin was there., Frank Holozubiec-, Co-, Chair: That, the crowds were so bad that they hung around. On the sidewalk. They sat on the steps of the neighboring buildings and the sidewalks were basically impossible.. Frank Holozubiec- Co- Chair: And. That operator kept saying they would do something about it. And. They never did., So I. Guess I'm, asking us, that of what your plans are. If. You are as successful as we all hope you are and you get those kind of crowds waiting, Jae, Yu-, Attorney:, Oh, Mr. Kim,. Do you have an answer for it. Hwal Kim:, Yeah,, I, totally thought that place was really noisy and then everything is less so people we change the domain. And. Then it's everything to new and they are used to work at their like two years: ago, and then Hwal, Kim:, As I, like just getting guy. For now we just open to like two months, everything., It's, really quiet and everything new and then Hwal Kim: They have like okay, so nearby, like just to pull up over a trauma, another one. And. Then we do not have any connected with them. Hwal Kim: And. Then you have a just new run and then people is going to be new people coming means you're, clear everything for the new lead generation and the new everything I think Frank Holozubiec- Co- Chair: Okay,. But what do you do? Frank Holozubiec-, Co-, Chair: And. There are people waiting to eat, there. Hwal, Kim: We do not have any at waiting now and then. Burt Lazarin- Co- Chair: One of us as successful as you can. Burt Lazarin- Co-, Chair: Hopefully. You will be that successful, Hwal Kim: We want to try it on it. Just for the database and they will clean is usually do,, but we are not take a sample future because yeah just, I do not want to people want to get Hwal. Kim: I want to people want to wait outside because really it's kinda, we can not candor and we can not control them. That's. Why I knew it's robbery happen? Again. It makes me like Hwal Kim:, Really, no good for everybody. Like, commutes mode and then the customer. And. The first thing to try. I want to make a reservation. Way. And then,, you know,, just think about it. Wait., Burt, Lazarin-, Co-, Chair: I think it will be important., Burt, Lazarin-, Co-, Chair:, I, do not know if you met with Burt Lazarin- Co- Chair: The block Alliance, I requested and they've invited you to come. Burt Lazarin-, Co-, Chair: As far as I know. You have not, and they would like to have sit down and discuss this issue. Jae Yu- Attorney: Okay. Because, uh,, you know, the as you are, the biased we contact all of them on the list and then some people about couple of people. Jae, Yu-, Attorney: Asking me more information about it and then I answer all the information what they asked for it,, but the reward never invited any kind of meeting or any kind of discussions. Burt Lazarin- Co- Chair: Well,, and that maybe is not the past. But this invitation to come speak at the HK 4954 block, alliance. Jae Yu- Attorney: Okay., Burt, Lazarin- Co- Chair: Me, with them. Jae Yu- Attorney: Okay, I'll try to meet with our tried to contact them HK,. What was it, Burt, Lazarin-, Co-, Chair:, 64 block alliance. Steve Molina is the chair. Frank Holozubiec- Co- Chair: And. Now I. Can you get them? The contact, information. Nelly, Gonzalez-, MCB4:, Yes, I, will send it over to you. Jae Yu- Attorney: Okay. Appreciate that. That's It. Jae Yu- Attorney: Right now,, though the places are really tiny.. We have only 20 settings and I did not know. Jae Yu- Attorney: There was a problem,. You know, customers sitting outside, whatever,, nobody! Actually, we did not know that. And, then Jae, Yu-, Attorney: That's. Why I could not answer you, your specific questions,, but I will get back to you with more, you know, you know, security plans and then,. You know, more better answers for that. Questions. But. As far as I understand that we do not want to have that kind of problems in the future. Jae Yu- Attorney:, And, Jae, Yu-, Attorney: If. You know if it become a problem and then I, you know, I'm, going to try to, I'm going to put somebody one on my employee stand outside and then, if you know those things are happen and then we're going to ask them to Jae Yu- Attorney: You know, come into the store, or there is a little outside. It's like a happy sermon. And. Then we have a little space right in front of the store. And. Then we're going to make some kind of a sitting area and then to make them to wait. There. Burt Lazarin-, Co-, Chair:, OK, I, see Christine I want to have speak. Christine Berthet- Committee Member: Yeah,, when I look at your plan. Talking about this issue of the queue and the line on the sidewalk and look at your plan, the map of your restaurant,, and it seems that your Christine Berthet- Committee Member: Counter, is going all the way to the entrance. And I. Think if you would cut that last two to us tools and reduce your counter a little bit so that you would have a vestibule there and you could have people much more people waiting there, so Christine, Berthet-, Committee, Member: That, would be my suggestion. So. You can have more waiting, space. Because. We want Christine, Berthet-, Committee, Member: It says we want you to be successful. But,, you know,! So if you had two less seats at the counter and the counter would be a little bit shorter than you would have a week, waiting, space. Jae, Yu-, Attorney:, I, see., Okay., Jae, Yu-, Attorney: I'll, take your advice and then we're going to think about those things. Christine Berthet- Committee, Member:, Right., Jae, Yu-, Attorney:, Okay,, okay, and Inge Ivchenko- BLP Public, Member: I just have a question. So. Are you going to be using this street space a parking space for the restaurant. The outdoor dining. Are you going to use space outdoors. Jae, Yu-, Attorney:, Mr. Kim,? Can you answer it. Hwal Kim: Yeah,, we're going to use the street. Yeah. On the north side and on the street, a lot of North side. Yeah. Inge Ivchenko-, BLP, Public, Member:, Broadway. Okay,, so you're going to use the open this street space for extra tables, but not the sidewalk. Hwal Kim: Yeah, and last sidewalk. Inge Ivchenko- BLP Public Member: Okay. Christine, Berthet-, Committee, Member:, Okay, you're not going to put any music outside. Right. Hwal Kim: No, no, no. Music Inge Ivchenko-, BLP, Public, Member:, Okay., Frank, Holozubiec-, Co-, Chair:, Okay,, so you'll agree to a stipulation that you'll have no music in the end, after space. Christine Berthet-, Committee, Member: And, nothing on the sidewalk. Inge Ivchenko- BLP, Public, Member: And, nothing on the sidewalk. That's. Why I keep asking is because I think that important. I've encountered a lot of bad street combo sidewalk restaurants, lately. Hwal, Kim:, Yes,, yes,, no sides, no music. Yes., Inge, Ivchenko-, BLP, Public, Member:, I mean,. If you're going to use the street. I think the sidewalk,, especially in those streets, should be kept open. Inge Ivchenko- BLP Public Member: Okay, thank you., Frank, Holozubiec-, Co-, Chair: Just, so we're clear to you and your attorney. We're, going to put this in as a stipulation as one of the terms that you're agreeing with us. Okay, no music and outdoor dining is only on the street,, not the sidewalk. Frank Holozubiec- Co- Chair: Yes, you're, okay, with that. Hwal Kim: Yes. Okay, thank you., Burt Lazarin- Co- Chair: And, before the full board is meeting on November 4 Burt, Lazarin-, Co-, Chair:, The, first Wednesday of the month of November,, and so when the full board will be reviewing our recommendation that we make tonight. It would be good. By that time, you have met with the block lands and maybe have an answer to Christine's. Question. What has suggested change of seating. Jae Yu- Attorney: Okay. Frank Holozubiec- Co- Chair: Yes,, like that, may depend on when Burt Lazarin- Co- Chair: When. They meet Frank Holozubiec- Co- Chair: Me because they only meet once a Frank Holozubiec- Co- Chair:, Month., Frank, Holozubiec-, Co-, Chair: I, do not know when I Burt, Lazarin- Co- Chair: Went into Monday me. I do not know what the schedule is: Frank, Holozubiec-, Co-, Chair:, At least reach out to them. As soon as you, can. Jae Yu-, Attorney: I will Jae Yu- Attorney: I will try to do it. Tomorrow. Burt, Lazarin-, Co-, Chair:, Any, other additional questions., Thuy, Pham-, Committee, Member:, Comments. Yes, I did the raise hand function. Thuy, Pham-, Committee, Member: This is Tweet, I did the raise hand function. May I, speak well: Thuy Pham-, Committee, Member:, Yeah,, okay., Thuy, Pham-, Committee, Member:, Thank, you. I'm, just to go back to the reservation and the crowd control. What I've see people doing now,, especially since restaurants, are Thuy Pham-, Committee, Member:, Only 25% capacity indoors is maybe you could have a reservation system where you have people only use Open, Table, and that way people know that they really can't congregate, so to speak,. So they know it's by reservation. Only Jae Yu- Attorney: Are you, I asked you a question. Thuy Pham- Committee Member: That was a suggestions in terms of the as an alternative or in addition to the removal of the tools, as had been previously suggested. Thuy Pham-, Committee Member: In terms of Thuy Pham-, Committee, Member:, In terms of prevention of any crowding. If people know it's by reservation, only then, there won't be people standing around as walk ins. And, so you would reduce potential students sitting under yeah Jae Yu- Attorney: Okay, I also take a consideration of the recommendations. Um, anyway. This is a really tiny place, its maximum. We have about 20 settings and that 400 square feet. Jae Yu- Attorney: And then,, you know,. We tried to push it to,, you know, most of the sale to go,, but there are people, you know, during the weekends and they want to sit down and the habit,, but we will Jae Yu- Attorney: Also like a right now during the pandemic. You only can put 25% of total capacity,, which is not a lot of people in there and then meanwhile yeah you know the community's concerns. Jae Yu- Attorney: We also have to concern about survivability of business to so right now we are more pushing it. As far as the online sales for take out and the,, you know, try to minimize that sittings at these days. Jae Yu- Attorney: But, yes, I will take up for consideration of your recommendations or so. Burt Lazarin- Co- Chair: Thanks. For that suggestion to Burt Lazarin- Co- Chair:. Anybody else on the committee wants to say anything. Anybody from the community has a raise hand., Nelly Gonzalez- MCB4: Now,, no one Burt Lazarin- Co- Chair: No, I'm Inge, Ivchenko-, BLP, Public, Member: Still, I have to approve. Burt Lazarin- Co- Chair: Second,, with the steps that we've known All those Burt Lazarin-, Co- Chair: Abstaining present, not eligible. Okay. Burt, Lazarin-, Co-, Chair:, Good, luck., Jae, Yu-, Attorney:, All, right. Thank, you very much. Have, a good night. Burt Lazarin- Co- Chair: See you on November for us. Burt, Lazarin-, Co-, Chair:, All, right,, section three., Burt, Lazarin-, Co-, Chair:, Monster, the liquor license, wine,, beer,, etc. Item for on the agenda, 142 West, 24th, Street., Maston, Sansom-, Attorney: Yes,, excuse me., Good, evening,, numbers, good to see everyone again. Thank you for the opportunity to speak. Here.. My name is masked and Samsung on the attorney. Maston Sansom- Attorney: Representing, the applicant. I'm joined here this evening by Gary Maida who's. The general manager. I can't see him on my screen,, but you may be able to see him. Maston, Sansom- Attorney: Or at least see that he's present I do not exactly know but I'm also joined by our fire STEAM. The sound consultant who did a sound study involving the role of cover for a second floor terrorists house, would be on as well. Maston, Sansom- Attorney: Again, I can't see. Al. I do not know if it's because there's too many people or whatnot, but I will talk a little bit about the general parameters of the proposed application and then Maston Sansom-, Attorney: Certainly answer any questions throughout this discussion,, but also like to turn it over to Alby because,. As I mentioned,. He did perform a sound study. Frank Holozubiec-, Co- Chair: Hold on one second. Alec,. Can you move. I'll Nelly Gonzalez- MCB4: Just moved out. Who's, the other person. Maston Sansom- Attorney: Gary Maida Nelly Gonzalez- MCB4: Okay, I'm, going to move him over. Frank Holozubiec- Co-, Chair:, Thank, you., Maston, Sansom-, Attorney:, Alright., Maston, Sansom-, Attorney: So as mentioned, this is,. This is an application for a full liquor license for a hotel. Maston Sansom- Attorney: There on the on the first floor. There's, a dining area in that dining area., Maston, Sansom-, Attorney: Well,. Let me back up. There's a first floor, dining area. But, then there's also a second floor. Dining area where they'll be one bar will be located., Maston, Sansom-, Attorney: It's,, it's the only stand up are the will be 19 seats at the bar. Maston Sansom- Attorney: There are no service bars and also on that second floor. There's the second floor terrorists that will be fully enclosed by a role of cover. That's, a polycarbonate roll, a cover., Maston Sansom-, Attorney: There will be the music will be recorded, music only know jukebox or DJ, or anything like that. The hours of operation for the service of alcohol., Maston, Sansom-, Attorney:, Inside and now I get a little, little confusing, because the role of cover is kind of inside,, but the area, that's not. The role of cover. We are hoping to serve alcohol from noon to 1 am and but the outside, or underneath the role of copper, Maston, Sansom- Attorney: Would be only till 10 pm. Maston, Sansom-, Attorney: The number of seats out under the role of cover would be 76. Seats., Maston, Sansom-, Attorney:, 20, tables., Now I, know on the application. It says: TBD no less than 7060 as well. That was what was tested. Maston Sansom- Attorney: That's. What we would agree to and stipulate to I think I could not find it. I thought I read somewhere that there was a maximum capacity of 90 out there. But,, you know,. We understand that the test was for 76, so we would limit it to that, um, Maston Sansom- Attorney: As I said,. It's recorded music, only Maston Sansom- Attorney: And I'd like to Maston Sansom- Attorney: Turn it over to Al. I. Think if you would allow so Al could discuss a little bit about the study and the results. Maston Sansom- Attorney: So AL YOU MAY BE TALKING. We can't, I can't see you, but you're muted. Just FYI., Burt, Lazarin-, Co-, Chair:, Now, now., Al, Fierstein:, Okay,, I'm, here. Can. You hear me. Burt, Lazarin-, Co-, Chair:, Yes., Al, Fierstein:, Okay,, good. Alright,, so I did a study in August,. I did my usual background late night survey to see what the background noise was remember. We're in a pandemics thing is a little bit quieter than normal. Al Fierstein: Do. You guys all have copies of my report. Christine Berthet- Committee Member: Yes., Al, Fierstein:, You, do. Okay,. So basically I. Look at the minimum noise level,, which I'll move my phone for a second., Sorry. And you! Can you see that graph. Al Fierstein: So? That graph shows the level from 11 pm to 11:20pm and there's two curves, a black curve and a red curve on Frank Holozubiec- Co- Chair: Our? I do not think your cameras, on. We can't. We, do not even have a photo of you. Let alone. It graphs. Al, Fierstein:, Good., All, right., Start, video. Here. We go. Is that better. Burt Lazarin- Co- Chair: Yeah. Al Fierstein: Yes, I'm, hearing., Yes., Al, Fierstein:, Yeah,, okay., Al, Fierstein: So. This shows the, the sound levels. Al Fierstein: Of, the base,, which is the red line. Al Fierstein: And, the mid range,, which is like voices and that's the black line and they're roughly about the same. And. This is, you know,. Occasionally a truck goes by, or there's a siren, Al Fierstein: But generally, the sound levels around 55 decibels,. You will see that. So. What I do is when I look at these types of data., Then I put them into a spreadsheet,. The spreadsheet calculates a number of factors. Al Fierstein: I, do not usually show this to people,, but I'm going to show it to you now. Can you see this spreadsheet. I'm, showing you now guys Al Fierstein: Yeah,, so Al Fierstein: What we've got here. Al Fierstein: Is in some Burt Lazarin- Co-, Chair:, you're, muted, again now, yeah now., Inge, Ivchenko-, BLP, Public, Member: You, know you've, muted yourself, out., Maston, Sansom-, Attorney: We can't hear you. Christine Berthet- Committee Member: It's logical, right. Maston Sansom- Attorney: Now,. Can you hear Burt Lazarin- Co- Chair: Me. We can hear you. Al Fierstein: I am I complicating things too much. Here you're, muted., Al, Fierstein: unmuted, you Christine, Berthet-, Committee Member: Do not touch anything now., Inge, Ivchenko-, BLP, Public, Member: Yeah,, just say what you did and point again. Okay. Al Fierstein: interrupt me: I'll break every few seconds. Interrupt me if I lose something,, but basically I show that compared to a three foot distance where these measurements are made inside the role of cover. Al Fierstein: We're going to be 50 feet away from the nearest residences,, which is on the north side of the street. Hey Everyone, hear me so far. Al Fierstein:, Yeah,, okay. So, based on that,. The sound level drops, of course, sound level gets quieter with distance. So. After the music noise travels it's down to 59 the voice levels after travel or Al, Fierstein: However,, the ambient sound level is Al Fierstein: Going inside an open, window, believe it or not, the sound level, drops. Another 11 de BA. When you open a window all the way, Al Fierstein: Now,, the role of cover,, that's the key thing. Here. This is going to give us an average of 17 decibels of reduction. Everyone hearing me continuing so far. Al Fierstein: Yes. Okay,. So when you subtract all these things. The music final level inside the apartment is 30. The voice final level inside the apartment is 24. Al, Fierstein: I realized. There's lots of apartments acrosss the street. There's three storey, buildings. There's 456, even a seven story: building acrosss the street. Al Fierstein: But. These noise levels are actually lower than the ambient sound level inside the apartment,, which is basically this 56 minus the 11, which is about 45 Al Fierstein:, Now,, New, York City has a number of codes.. One of them says that in the DPA level, the maximum you can have is 42 Al Fierstein: Well, the ambient Sound will be louder than that. But. That's not the key thing. The key thing is that our music will be below that 42. So 30 is lower than 42 within code. Al, Fierstein: But. Also on this graph, you can see there's all these different frequencies. That's bass, Mid range treble., Think of it like a piano, keyboard. There's, the bass. The mid range and the treble. And I have a line here that says: Music Okay. Can. You all see that music. Okay. Al Fierstein: Yeah,. If it was not OK, there would be the letters energy in that line. There's, no energy. And when I graph. This all out. You can say that with the voices. Al Fierstein: The voices are going to be down here and all the different frequencies and as well as the DB, a level which I stuck on the right at 24, dB, A, Al, Fierstein: way lower than the ambient way lower, not half as loud, because you guys have heard me talk before 10 decimal reduction, 10 decibels. Subtraction means it's half as loud. Al Fierstein: To, the average person, so 35 is half as loud as 45 and 25 is half again is loud. So. This is more than four times. Loud. This is one quarter as low as the ambient and that's for the voice. Al Fierstein: And for the music. Again, we have to be below,, not only the 42 dB A limit for music and we are,, but we also have to be below all these base and mid range limits which we're putting in 1992 what was Al Fierstein: Where they. Finally thank God Edit base to the regulation and all of our music is going to be considerably below that. So. It's all in the report. These charts that I'm showing you now are in the report,. Let me stick my phone there. And. If I can answer any questions for you. Frank Holozubiec- Co-, Chair: So, we've been,, you know, getting a lot of row covers presented to us,, but we have not actually have not experienced with one that's been installed,. Have you sort of worked with any that have been installed, such that,? You know, you know,, whether they work. Al Fierstein:, Okay. Well,. Let me tell you about roller: covers., Let's, see., Frank, Holozubiec-, Co-, Chair:, No,, no,, I, know I've, read all about roller covers., I! Guess my question to you: is, Frank, Holozubiec-, Co-, Chair: Are, you basing it on abstract projections of what relic covers say they can do or have you actually seen, one. You know, in closing, a space and confirmed, whether it behaves the way your reports suggest they will behave. Al Fierstein: Thank you for asking that question. I'll, send you your 10 bucks, later. Al, Fierstein: The,. The pictures on page 11 of my report show the Empire hotel my clients who live in this building at 61, West 62nd street sued., Al Fierstein: The Empire hotel is a whole big case. Nice appeal. We won the appeal because they were making too much noise when they opened their role of cover. They I did not make them put a role of cover in they had one Al Fierstein: And. You can see pictures of the role of cover open and closed. So finally, when they lost. They were forced to deal with us. And I, actually measured, Al, Fierstein:, The standard role of cover open and closed and then on page 13 of my report, you'll see a chart that says sound level reduction and you can see, while it does not do a great job and reducing base, the role of cover, because after all, it's like it's like San. It's, like bulletproof plastic, Al, Fierstein: It does do a very good job at reducing mid range and trouble. Noise. So I always base that on the actual measurements I made because Al Fierstein: That's what I like to do. It's real world. It's, not just some manufacturers, bullshit. Frank, Holozubiec-, Co-, Chair:, Okay, so,, since they kept the Roma cover close to the empire. Have any of the your clients or any of the neighbors, had any complaints. Al Fierstein: Yes,, but not because of the role of cover the Empire hotel has a,. Let's say this role of covers on the West side, closer to New, Jersey and Al. Fierstein: They have this also this open area that does not have a roll of cover, which is a great contrast. By, the way, on the east side, closer to France and Al Fierstein: So. That's where people have still been congregating and they have a smoking area and people have complained,, but the lawsuit ended,. As far as I know, I was dealing with Chris Cobb will fold and stain law firm, and so we basically got that soft Frank, Holozubiec- Co-, Chair:, Mass and I. Guess, I'm confused. But a couple things when you filled out our to stipulation sheep for the relic cover terrorists., Frank, Holozubiec-, Co-, Chair:, The question. That said, what do you have any music out there and you said,? Will there be no amplified music? And you said you said yes to that? Was that I, you saying, and you're, you're going to have music out there, now. Maston Sansom- Attorney: Sorry. Where's, that Frank Holozubiec- Co- Chair: The outer items, page, page., Frank, Holozubiec-, Co-, Chair:, Five of the step. Form. It was one of the ones you sent us: Frank, Holozubiec-, Co-, Chair:, A, revised version of Maston, Sansom-, Attorney:, Yeah, okay and so Maston Sansom- Attorney: Oh,. Will there be no amplified music. And? We said yes., Maston, Sansom-, Attorney:, Gary,, correct me if I'm wrong,, but my understanding is that he only music would actually be inside at this point. So. You that the only music that you hear would be when someone walks out the door to go outside at out into the roller rolling cover area., Maston, Sansom-, Attorney:, But I. Do not think there are any plans for any speakers or televisions or early speakers in that area at this time. Frank Holozubiec- Co- Chair:, So Gary,, and you stipulate that there won't be any you know, speakers out in the relic cover area. Gary Maida: Yes, to my knowledge,. There will be no speakers as master and said there were,. There are speakers inside the bar area. So, when people exit. Gary Maida:, The, end. Oh,, and that door is open,. You will hear some music,, but it will be very low. And, it's very easy. Listening. Music, Gary, Maida: I,, however out. What I, will say. Is that if it's an issue, if the plan calls for speakers, outside. We are happy to not install speakers outside Frank, Holozubiec-, Co-, Chair: That'd be great.. The only music would be coming spilling over from inside when the doors open or something. Gary Maida: That is correct.. Al, Fierstein:, Okay., Can, I interject, guys. I did my whole report based upon the idea that there would indeed be speakers in the role of cover area., Al, Fierstein: And, I, that that's what I put in there. Not that they would just be inside and it would leak out when they would be basically hardly any sound from music going outside and I have the levels at a relatively low 88 decibels at BC., Al, Fierstein: Measured three feet from the speaker. Now three feet,, as we all know from Covid-19, is basically like one arm's length: away. Al, Fierstein: So. Imagine you get next to a loudspeaker,. You know, a small loudspeaker with like a six inch, wafer. Al, Fierstein: And. You touch it. You're, that close to the speaker and it's only 88 slightly louder than the voices that are going to be all around. You have 77 Al, Fierstein:, And I think that's quite reasonable. It's going to stop that noise and all the charts. Everything in my report is based on that deal with it. What you want. Frank, Holozubiec-, Co-, Chair:, And, that's great out just made, it'll be even more quiet and Frank Holozubiec- Co- Chair: As. We've discussed in earlier meetings with the applicant. Frank Holozubiec- Co- Chair: Every time we've had a roller cover. People have agreed not to have any speakers in the roller cover: area. So that was sort of our request to them. A couple of weeks: ago. Christine, Berthet-, Committee, Member: Okay,, so the Maston Sansom- Attorney: First one to be good. Neighbors and we,. You know, obviously, it'd be nice to have some background: music, Maston, Sansom-, Attorney:, Out, there, just,, you know, the break up the silence,, but we would I think stipulate Frank Holozubiec-, Co- Chair: To. There is an unlocked. If, you get the thing built and you want music,, you know,. You can Burt Lazarin- Co- Chair: Earn, that Maston Sansom- Attorney: Some that Frank Holozubiec- Co- Chair: I, think you said that you're going to close it a 10 but on the step form in our standard, Ask is 10 pm, and then 11 pm, Friday and Saturday I assume you prefer the 11 pm Maston Sansom- Attorney:, Yes,, sir., Frank, Holozubiec-, Co-, Chair:, Okay. And. The last thing for me, I believe you said this,, but I want to include a stipulation. So. The role of cover includes the whole thing: sides: roof everything: right. Frank, Holozubiec-, Co-, Chair:, For, Frank, Holozubiec-, Co-, Chair: Me to keep it permanently. Closed. Maston Sansom- Attorney:, Correct. Because, my understanding. Yeah, I mean,, you know,, because in order to open up,, you have to open large portions Maston, Sansom- Attorney: And, it's not like you, can just open up a little window and hold most of the sound and I think which then kind of made defeat the purpose of the role of cover and we did not Frank Holozubiec- Co- Chair: I did not make to make it a big issue.. I just wanted to make sure. Since it's going to be a stipulation that you know you'll be agreeing to Christine Berthet- Committee Member:, Kristen, I yeah on the page 10, which shows the opening and the capacity by area. I think it would be behoove all of us to separate your second floor into the inside and outside Christine Berthet- Committee Member: Because, the Christine Berthet- Committee Member: Because. All of those things we are discussing new music,, blah,, etc. So I. Think that's a suggestion., Frank, Holozubiec-, Co-, Chair:, And I. Think mastering we'd asked your colleague to do that and that you did update Page two and five,, but you did not update the chart. Christine Berthet- Committee Member: Right, right. Frank Holozubiec- Co- Chair: That'd be great. Maston Sansom-, Attorney:, Okay., Christine, Berthet-, Committee, Member: It's, the page. It's page 10 of those submissions. So, there's nine of nine and then there is a page, which is multiple space, floors. Maston Sansom- Attorney: Yeah. Yes. Yeah. Maston Sansom- Attorney:, Yeah, yeah, Christine, Berthet-, Committee, Member:, Wait, down second floor inside second floor outside Christine Berthet- Committee, Member: Okay, in the future,, it's clear to everybody. Maston Sansom-, Attorney:, Yeah., Maston, Sansom-, Attorney:, Okay,, yeah, these,, these rolling covers,, whether they deem them inside or outside Frank Holozubiec-, Co-, Chair: Or. You can Frank Holozubiec- Co- Chair: You can label it. However, you want. You can say: terrorists covered by Rolla cover., Frank, Holozubiec-, Co-, Chair: Yeah thing that distinguishes it from the true inside space. Maston Sansom- Attorney: Okay., Frank, Holozubiec-, Co-, Chair:, Brick and mortar inside space., Maston Sansom- Attorney: Yeah, got it. Burt Lazarin- Co- Chair: Okay, any other committee members, comments. Rob, Walker- Committee Member: I've got a question. Rob Walker- Committee Member: For yeah I'm on page 13 on there's a blueprint and the blueprint shows the bar on the inside,, but on the other side of the wall. Rob Walker- Committee Member: It shows that their seats there and there's a retractable window. Now, during the warmer time. Is that window going to be open and will that music be bleeding through Maston, Sansom-, Attorney: I'm? Sure you certainly. If there's a window, that's capable of being open and you can add some cross breeze,. That might be something that the applicant would want. Rob, Walker-, Committee, Member: But. What cross for us? If there's a role to cover on it. It's, no crossbreed, Maston, Sansom-, Attorney:, Yeah., Well,, I, mean, I do not mean cross free., You know,, there's no outside. So you're. Talking about a window going from the, the traditional indoors to Maston Sansom-, Attorney:, A, window., Rob, Walker-, Committee, Member: According to the blueprint right here at your bar on the inside,. Just on the opposite side of that facing the outside. You have six chairs and a retractable window that is wide enough for six chairs for people to sit there. Okay. Christine, Berthet-, Committee, Member: To be a folding. It looks like it's a floating window, you know, full day, Rob Walker- Committee, Member:, Exactly. But. If they have music on the inside. That's going to bleed to the outside. That's the point I debate,, because that's going to wind up keeping open. That's all. Yeah. Frank Holozubiec- Co- Chair: Gary,. Can you address the for a reading that the right way. Is that,? Is that how this is being built., Gary, Maida: Well,? What I understand from what I understand? It is a retractable window and in the warmer months it, it will,. It would probably be in the best interest to have it. Gary Maida: Open. However,, as our Gary Maida: Had, mentioned, that the music, which is going to be on the inside may bleed out through this open window,, but the sound is going to be barely Gary Maida: Audible on that terrorists, area. So I do not think it will impact anything Al, Fierstein:, Well, I think we have to put some numbers on it. When you have an opening, sound can go through and frequently I'm involved with bars that already have a noise violation because the city came by and they measured noise out on the sidewalk. Al Fierstein: So. Usually the first thing I tell them, and it's just common sense is,. You do not have any speakers right next to the opening,. You do not have any speaker. Al Fierstein: And. If you have speakers that are even remotely close to there,, you point them. Away. So that points the Mid range on the high frequencies, away. Al, Fierstein: And. As long as there's a limiter on the indoor sound system which parenthetically, I will say, protects the sound system from ever blowing up,. Then you've got the best of both worlds. Mm hmm. Christine Berthet- Committee Member: So are you? Are you? Are you ready to put some limiters and take into account those recommendation on the bar area. Al Fierstein: Say yes. Maston Sansom- Attorney:, Yes,, yes., Maston, Sansom-, Attorney:, Thank, you., Well,, Maston, Sansom-, Attorney:, That, Maston, Sansom-, Attorney: You would stipulate that you know. No speakers would be pointed outside this window,. They would be within a certain Maston, Sansom- Attorney: You know footage. I mean,. We Frank Holozubiec- Co- Chair: Okay, how about this. How about, if which I think he would obviously do. You will stipulate that you're going to implement all of the recommendations of the Cousteau Og report, Right Christine, Berthet-, Committee Member: Report does not test that the report test the outside, but not the inside, going outside. That's Frank, Holozubiec-, Co- Chair: Soon to their out it assumed they were speakers in the Rolla cover area. Christine, Berthet-, Committee, Member:, Right and Frank Holozubiec- Co- Chair: Those were not going to bother residents. Frank Holozubiec- Co- Chair: Right. So. If there are no speakers in the recovery area and we're only talking about Sam leading from the inside. It's, a is even more attenuated than what I'll test it. Inge Ivchenko- BLP Public Member: Window Al has to still put Inge Ivchenko- BLP Public Member: limiters on the indoor sound. Frank Holozubiec- Co- Chair: Yes,. Yes, we do that out. Yeah. Al, Fierstein:, Yeah. Remember. What I said before, when Sound goes in through an open window, or in this case out through an open window,. It loses level in the case of an ordinary window, about 11 de BA, Al Fierstein: In the case of a large opening like this,, which looks like it's, maybe 12 feet wide or something and probably is going to be more like 60, be so I would say they really have to limit the sound level inside so that there's no speakers within Al Fierstein:, Eight. Eight of the opening okay, eight make that a stipulation, eight feet of the opening. None of them pointed toward the opening Frank Holozubiec- Co- Chair: Getting too complicated. Can. You just revise your report and then they'll agree to abide by it. Al Fierstein: All right, I mean, Frank, Holozubiec-, Co- Chair: Is, that okay, mastering and Gary Maston Sansom- Attorney: Yeah., Maston, Sansom-, Attorney:, We're, really Frank Holozubiec-, Co-, Chair: I. Do not think it's a lot of work. Maston, Sansom-, Attorney:, No, I, know I'm just, I just have a little concerned that okay. So it's going to be background. Music on the inside. Maston Sansom- Attorney: There's, nothing on the outside, and it was tested. So the amount of overflow and then I do not know. Limiters, you know,. When I go back to, to the client and say, hey, we, we got ta, you know you got to purchase. These. I do not know how expensive limiters. Are, um, Frank, Holozubiec-, Co-, Chair: I think he's using limiters as a generic term and Maston Sansom- Attorney: Oh, OK. Frank Holozubiec- Co- Chair: Yes, tell you can't have speakers within eight feet of the windows. Maston Sansom- Attorney: Okay, yeah, sure. Frank Holozubiec- Co- Chair: Not equipment. Maston Sansom- Attorney: I thought you needed some big Maston Sansom- Attorney: Collapse. Inge Ivchenko-, BLP, Public, Member: They're, also limited Inge, Ivchenko- BLP, Public, Member:, Level., Frank, Holozubiec-, Co- Chair: And go wait. An hour. So, is that right, you were not talking about more equipment. You were talking about placement and such things. Al Fierstein:, Yeah, well,, the limiter costs, 400 bucks., Al, Fierstein:, Correct., So, and very well,, and very often. Al Fierstein: Very. Often it's built been you see when they buy the sound system.. I do not sell sound systems. I used to install them, but Al Fierstein: They buy it from some company and the company's always want to stick in a device called the processor and the processor can do anything. It can do limiting it. Can, you know,, do zone. Al Fierstein: zone one, zone to zone three,. You get the idea. So very often the limiters already built into the price of the sound system.. Al Fierstein: It's, not expensive., OK., Frank, Holozubiec-, Co-, Chair:, OK,, so you'll agree that our advisors report and that Frank Holozubiec- Co- Chair: Gary,. You will implement all the recommendations. Gary Maida: Yes, sir. Frank Holozubiec- Co- Chair: Nick,. Can we also say that your client. Once you hit 10 and 11 and you're not using the recovery space, all the doors and the windows will be kept. Closed. Absolutely., Frank, Holozubiec-, Co-, Chair:, Alright., Frank, Holozubiec-, Co-, Chair:, Sorry,, I, guess I'm done, now. Inge, Ivchenko-, BLP, Public, Member:, Well, I just knew what a limiter was: Al, Fierstein:, A limiter, a limiter is like a little man when he hears the sound. Al Fierstein: When you hear Al Fierstein: The sound go up too loud,. He turns down the volume. Your turn. Try to override the little man. The little man keeps going. And the little man always wins. Christine Berthet- Committee, Member: It's, a lumen and she always wins. Burt Lazarin- Co- Chair: Do I hear a Frank Holozubiec- Co- Chair: Way. Frank Holozubiec- Co- Chair: We. Having more Burt Lazarin- Co- Chair: Of, an Answer. Thuy Pham- Committee Member: To question. This is tweet. Right. Thuy Pham-, Committee, Member:, The role of covers. Can, you remind me how long they take the open and close like to take 10 minutes to take two minutes. Al Fierstein: It depends on the role of cover. Some of them are motorized.. Some of them are manual. Al Fierstein: It takes a few minutes, either way. Thuy Pham- Committee Member: Yeah. So. For this one particular location. Al, Fierstein: I do not know if they using manual or non manual I'm recommending it stays closed. All the time. Maston Sansom- Attorney: Right,, that's Maston, Sansom-, Attorney:, A, whole big club years, Maston, Sansom-, Attorney:, So,, Maston, Sansom-, Attorney:, Now,, I, I do not know,. They may want to purchase one that can open in the future,, but we would have to go back to you to Burt Lazarin- Co- Chair: The application that before us, is that it's closed. Burt Lazarin-, Co-, Chair:, Crap., So matter. If it's manual or Burt Lazarin-, Co-, Chair: Whatever, the opposite was automatic. Thuy Pham-, Committee Member: Okay, thank you., Burt Lazarin-, Co-, Chair: Okay,. So it's a good concern,, but not applicable to this application. Any other questions, comments from committee, members., Burt, Lazarin-, Co-, Chair:, Now, anybody out there. Nelly, Gonzalez-, MCB4: Now,, no one Rob, Walker-, Committee, Member: I'd like to make a motion. Okay,. Let me Burt Lazarin- Co- Chair:. Just summarize the step. Yes. Yeah. Frank Holozubiec- Co- Chair: Yeah,. Let me just summarize the steps. Frank Holozubiec- Co- Chair: Steps. The,. The outdoor terrorists will be covered with a brawler cover which will fully enclosed space and he kept permanently closed. There'll, be no speakers in the relic covered outside area. Frank Holozubiec- Co- Chair: Acoustic log will revise its report. Frank Holozubiec- Co- Chair: To address minimizing the noise coming from inside through the windows into the roller cover. Space. The applicant agrees to incorporate all the recommendations and the revised. Frank Holozubiec-, Co-, Chair:, Report and all doors and windows from the inside space to the relic covers face will be kept closed at all times after Frank Holozubiec- Co- Chair:, 10, pm., Frank, Holozubiec-, Co-, Chair:, Or, 11 pm on weekends. Frank, Holozubiec-, Co-, Chair:, You're, okay, with all Frank Holozubiec-, Co-, Chair: Gary, and mastering Frank Holozubiec- Co- Chair: Yep. Yes. Christine Berthet- Committee Member: And revise the this tip form. Frank Holozubiec-, Co-, Chair: Yeah, I do not think we need a script for that,, but Christine Berthet- Committee, Member:, Oh,, no, I'm, just saying. Yeah. Christine, Berthet-, Committee, Member: I'll get back to La tomorrow. Burt, Lazarin-, Co-, Chair: And. You had that revision of the gender of the limiter. Burt Lazarin- Co- Chair: Okay,. So we have a Burt Lazarin- Co- Chair: Rod,. Did you make a motion. Rob, Walker- Committee Member: Yep. By, made emotion based upon all that Christine Berthet- Committee Member: Yes. Burt Lazarin- Co- Chair: In favor Aye., Burt, Lazarin-, Co-, Chair:, Opposed., Burt, Lazarin-, Co-, Chair: Abstaining present, not eligible. Okay,, good luck,, guys., Thank, you. Thank you., Burt, Lazarin-, Co-, Chair:, Okay., Burt, Lazarin-, Co-, Chair:, Item, number 530 577, you Chi Sum, Ngai-, Applicant:, Go, ahead., How's, everyone, Doing, Chi, Sum, Ngai-, Applicant:, My name is some I am. I'm the applicant for 155, seven Avenue., Doing business, as., Copy project, New York, where coffee roaster and we have multiple cafes in around your city and we just open up our new Chelsea location. Look at seven Avenue between 19 and 20, Street., Chi, Sum, Ngai-, Applicant:, This definition. File location is about 1100 were looking at operating from 7 am to 10 pm from Sunday to Thursday and Friday and Saturday. We're, opening from 7AM to 11PM. We're only looking at serving alcohol after 11 am because we will be having French and Chi Sum Ngai- Applicant: Liquor that we're focusing on serving as all coffee, focus., So, we'll be doing. Coffee focus cocktail, and also some beer from local brewery. We have about 15 tables and we're looking at sitting about 25 Chi Sum Ngai-, Applicant: Chairs, and it will be music that is going to be played on a Sonus right now. We do not have any outdoor seating or so,, but we're planning,. Everything works well with training and all we might fly for open restaurant too occupied a street seating for the future. Christine Berthet- Committee Member: What. Can you repeat: that. Chi Sum, Ngai-, Applicant: If everything works well with training on our end,. We might look into open the open the restaurant application where we can apply for St, seeing Frank Holozubiec-, Co- Chair: A couple of questions you have other locations, correct., That's, correct. I. Do any of those have liquor: licenses., Chi, Sum, Ngai-, Applicant:, As of now, none and broke our location in Brooklyn is in the middle of applying. We have passed community board meeting, and we're in the middle of the SLA application. Frank Holozubiec- Co- Chair: And. Did the community board recommend approval. Chi Sum Ngai- Applicant: Oh yes,? It's a brief. Frank Holozubiec- Co-, Chair: And. That was for full liquor license fully license. Frank Holozubiec- Co- Chair: On your step form. When we asked about sidewalk obstructions. Frank Holozubiec- Co- Chair: You had you had a compliant sidewalk side, Frank Holozubiec- Co- Chair: Oh, that is Chi Sum, Ngai-, Applicant: Right,, so I am to my understanding,. We're not allowed to be telling people on a sidewalk that we are serving alcohol, but Chi Sum, Ngai-, Applicant:, Because of the situation. Right now we have a scaffolding. And. We could not install a sign. Ah,, so we have a lead to a sandwich board sign and we attach Chi Sum, Ngai-, Applicant:, The poster or that just to tell people,. We have coffee and sandwiches and we're a coffee shop. So that's the compliance side issue we're seeing Frank Holozubiec- Co- Chair: Our concern was actually not about advertising liquor about having the sidewalk cluttered up. Frank Holozubiec- Co- Chair: So I'll leave this to Christine to discuss Christine Berthet- Committee Member: Take it from there. Christine Berthet-, Committee, Member:, So,, Frank, Holozubiec-, Co-, Chair: Just to remind everyone, this used to be a FIFA location and that had a beer and wine license. So. It was already licensed to some degree,, but this applicant wants a full liquor. License. Burt, Lazarin-, Co- Chair: And speaker also was of coffee. Let's go to Frank Holozubiec- Co- Chair: The pastry. Burt Lazarin- Co- Chair: They were Swish your Legion. Frank Holozubiec- Co- Chair: And. We have just to summarize,, while I'm talking. We got one email from a community board member saying that they're already for licensed bars and restaurants on this block. Frank, Holozubiec-, Co-, Chair: They're concerned that this is a backdoor to opening,. You know, full bar, and they think that block is getting over saturated Christine, Berthet-, Committee, Member:, Yeah., Christine, Berthet-, Committee, Member:, So I have two questions. One question. Is you say you're going to have the vestibule a storm enclosure. Chi Sum Ngai-, Applicant: One, more time., Christine, Berthet-, Committee, Member: You, said it. Says, Will applicant use a storm enclosure and you said: yes. Christine, Berthet-, Committee, Member: Clubs are those large plus two, you know, Christine Berthet- Committee Member: Enclosure, which are the door of the restaurant. Chi Sum Ngai- Applicant: Oh, I do not think so. Chi Sum, Ngai- Applicant: Possibly on the application. I might have missed it,. But it's just going to be two doors. Chi Sum Ngai- Applicant: And then open up and it would just go in Christine Berthet- Committee Member: Okay,. So we will change that and you will stipulate,. You won't have an enclosure. Right. Chi Sum Ngai- Applicant: Enclosure Se Christine Berthet- Committee Member:, Dorman, closure., Chi, Sum, Ngai-, Applicant:, It's gone west., Burt, Lazarin-, Co-, Chair:, In, the winter, something Frank Holozubiec-, Co-, Chair:, New, doors., Chi, Sum, Ngai-, Applicant:, Yeah, I. Do not think so. It's just going to be a door, so that's definitely stay online., Christine, Berthet-, Committee, Member:, All, right. And, then. The second thing is that this discussion about the sidewalk sign was your sidewalk sign right now, we talk Chi Sum, Ngai-, Applicant: Yes,. It is upset. Chi, Sum, Ngai-, Applicant: So. Our door opens up and that it is right by the door and we will,. We definitely have more than eight feet of space for people to Christine, Berthet-, Committee, Member:, Write. But, that's not the rule is that it should be against the wall. Christine Berthet- Committee Member: I see. Okay,. So if you could specify, you know, stipulate to that would be helpful.. Chi, Sum, Ngai-, Applicant:, No problem. We can definitely move that back to the wall. Right. Frank Holozubiec- Co- Chair: And, as you probably heard,. Would you agree that if you have any outdoor seating,, you won't have any music there. Chi, Sum, Ngai-, Applicant:, Is, no music, Christine, Berthet-, Committee, Member:, And, no sidewalk cafe or if it's in the street right Chi, Sum, Ngai-, Applicant:, Yes, No cell cafe as well. Right. Christine Berthet-, Committee, Member: Know, sitting on the sidewalk at the same time as you're sitting, Christine Berthet-, Committee, Member: In, the industry? That's what Chi Sum Ngai- Applicant: Scary. Yes. Christine Berthet- Committee Member:, Thank, you., Burt, Lazarin-, Co-, Chair: Any. Other buddy from the committee have a common Rob, Walker- Committee Member:, Question., Actually,, I do. I. Just want to run this by the rest of the committee on their opening from pretty much seven to 10 pm on Rob Walker-, Committee, Member: Even, with background music. The building's residential,. How would you all feel about, you know,? A business, starting at 7, am on music off at seven and Saturday or Sunday on Mote It Be, not more Rob, Walker-, Committee Member:, respectful to the people in the building to maybe started like eight or nine Monday through Friday and on weekends,, maybe like nine or 10. I mean,. What does everybody else. Think about? This., Rob, Walker-, Committee, Member:, What, Christine, Berthet-, Committee, Member:, Well, I? Think that's! A good point. The question is that is that Christine Berthet- Committee Member: Establishment isolated from the floor above Christine Berthet-, Committee, Member: What's,? What's the level of, you know, of music installation between the data store and the first,? The second floor. Chi Sum Ngai- Applicant: So we're at the base of the residential area,, but our music is really mellow. We play cafe music on weekday. We open at seven show music will be on by seven,, but on weekend. We're actually thinking about open at eight o'clock,, so instead of 7 Am is going to be 8. Am. Chi, Sum, Ngai- Applicant: I'm happy to see what we can do with the music. But in a coffee shop. Setting ambience is really important. So. We won't be playing anything that is loud and booming. So. Usually it's just more like Bossa Nova Jazz and it would not be too loud. And. We always have our doors close as well. Rob, Walker-, Committee, Member: And. The second sorry I appreciate Christine Berthet- Committee Member: The speakers that were installed before Chi Sum Ngai- Applicant: Who inside Chi, Sum Ngai-, Applicant: Yours is so we do not have any ceiling speaker anything right now. What we have right now, it's just one sono speaker on the wall,, and that is like good enough to surround the whole space. Chi Sum Ngai- Applicant: We also try to encourage conversation. So, it's a space where we want to be engaging with customers as well. So. Anything that's way too loud,, especially not good for us. Christine Berthet-, Committee, Member:, Okay., Burt, Lazarin-, Co- Chair: You can go,, you have to say something. Inge, Ivchenko-, BLP, Public, Member:, Yeah, I wanted to know who made the with the complaints that from the community,, because I am concerned,, it's a residential building and there are a lot of bars on the street. Frank Holozubiec- Co- Chair: It was just Frank Holozubiec- Co- Chair: It was an individual community member one email. Inge Ivchenko- BLP Public Member: Oh,, just one. It was not a group. Okay. Burt Lazarin- Co-, Chair:, Association and Inge Ivchenko- BLP, Public, Member: Did. They reach out to everyone in the building. Inge Ivchenko- BLP Public Member: To people actually get back to Inge, Ivchenko- BLP, Public, Member:, Them. I know they reached out. But. Did they actually speak to residents. Chi Sum Ngai- Applicant: just opened up about two weeks, ago. So far we've been seeing people to come in and ask is, how we doing, and then what are we planning to do so? We're not like a bar bar. We're, actually still trying to be more of a coffee, shop., Chi, Sum, Ngai-, Applicant: And. What Chi Sum Ngai- Applicant: And, we actually doing just coffee. Chi Sum, Ngai-, Applicant: Concentrate, like more coffee team, cocktail., So, we're happy to talk to more people and all that. But essentially,. Our goal is just to Chi Sum Ngai-, Applicant: Be, able to nurture part of our abrasive, was going to be implementing some creative trends from using coffee and cocktail so that Chi Sum, Ngai- Applicant: I think that there'll be something that we are willing to work with. The residents. If there's anything but definitely not bar no shots. Chi Sum Ngai- Applicant: It's like coming in. And hey, I want to try the string that is Diploma or like a dirty or no comma,. What are they doing? No problem playing the stress of something Burt: Lazarin- Co-, Chair:, Okay., Frank, Holozubiec-, Co-, Chair:, Sorry, Rob,, to get back to your comment. The previous applicant FIFA. According to that form, opened at 630 and at least the community board never have any problems so Rob Walker-, Committee, Member: I was just looking researching that as well. But thank you,, Frank Yeah,, good., Good, point., Thank, you., Kerry Keenan- Committee Member: That is what I was going to say as well. Thank you. Burt Lazarin- Co- Chair: You were not aware that carry Kerry, Keenan- Committee Member: Well, I was going to say that it because it was a coffee shop. Already. I assume that there was music and I was going to. You know inquire about whether there were complaints., Kerry, Keenan-, Committee, Member:, So,, yeah., Burt, Lazarin-, Co-, Chair: Okay,, any other community people, Burt Lazarin- Co- Chair:, Comments,, questions., Burt, Lazarin-, Co-, Chair: I was asked to know from you tweet. Burt, Lazarin-, Co-, Chair: I, see you shaking your head. Okay. Burt Lazarin- Co- Chair: Anybody from the community. I Nelly Gonzalez- MCB4: Know,, no one Rob, Walker-, Committee Member: Likes to make motion. Rob Walker- Committee Member: Okay., Frank, Holozubiec-, Co-, Chair: Again,. Let me just summarize these Frank Holozubiec- Co- Chair: And soon webinar. If there are any problems,, you won't have a snow storm enclosure. Any a frame signs have to lean against the building. Frank Holozubiec- Co- Chair: No music. In any outdoor space. You have outdoor seating. It'll only be in the roadway,, not on the sidewalk. OK. Burt Lazarin- Co- Chair: OK,, all those in favor Burt, Lazarin-, Co-, Chair:, Why, closed., Christine, Berthet-, Committee, Member:, I, guess to view the vestibule should be fixed. Christine Berthet-, Committee, Member: In, the form. Yeah. Burt Lazarin- Co- Chair: I, guess., Chi, Sum, Ngai-, Applicant: I did not know work on that. Burt, Lazarin-, Co-, Chair:, President, eligible., Okay., Good, luck., Chi, Sum, Ngai-, Applicant:, Thank, you so much, everyone. Burt, Lazarin-, Co-, Chair:, Thank, you., Okay., Chi, Sum, Ngai-, Applicant:, Thank, you., Burt, Lazarin-, Co-, Chair:, I am six times square. 46 restaurant called 328 330 West 46Th Street. Diego Enrico Malta- Applicant: I Burt Lazarin- Co- Chair: Hey., Hi., Frank, Holozubiec-, Co-, Chair:, Hi., Is your, is your representative in the public chat. Frank Holozubiec- Co- Chair: Mr Martinez Irene O'halloran, with you. Diego Enrico, Malta-, Applicant:, Know,, Frank, Holozubiec-, Co-, Chair: We should move right into the meeting. Diego Enrico Malta- Applicant: I'll. Do myself one Diego Enrico Malta- Applicant: Okay. She's on the phone with me,, but I'll find Diego Enrico Malta- Applicant: I'll answer questions. Christine Berthet- Committee Member:, Thank, you., Burt, Lazarin-, Co-, Chair: Is. It just give us a little summary of the operation. Diego Enrico Malta- Applicant: Sure. So, we're on restaurant row and basically I had to Nazca,, which was a night Dahlia 56 three, and this will be good to ask again. So it's going to be the menu is going to be crowd. Pleasers., The music is going to be Frank sinatra: Dean Martin., Diego, Enrico, Malta- Applicant: It's, going to be recorded. Music. Nothing loud. Diego Enrico Malta- Applicant:, MUSIC, Yes., Diego, Enrico, Malta-, Applicant: It's, going to be a white tablecloth operation. Diego Enrico Malta- Applicant: Standard Italian crowd, Caesars Frank, Holozubiec-, Co-, Chair: Are, you moving put in ESCA from Ninth Avenue,, or is this a second location. Diego Enrico Malta- Applicant: Or no, okay. So I was with you guys, I think, a year and a half ago, I got approved for me to Nestle downtown Diego Enrico Malta- Applicant: Which was to go to a tab and you unfortunately, I was not able to open. It. I was ready to open it in mid March and, unfortunately, I can't open it. Right now to the thing get selfie. So, Diego, Enrico, Malta-, Applicant: I have not have an opportunity to do this place. Yeah I'm 4630 now,, which would be the same, like,. You know, international. What was on 56 389 10 you from 1985 22,016 Burt Lazarin-, Co-, Chair:, For, you., Yeah., Frank, Holozubiec-, Co-, Chair:, Can I. Ask you about the closing hours, because Frank Holozubiec- Co- Chair: So. This was the Brazil. Brazil space, right. Frank Holozubiec- Co- Chair: Though. They their liquor license, went to 1230 and looking at your Putin ESCA night Avenue form that one only goes till 10 pm. Frank Holozubiec-, Co-, Chair: Is there. Some reason you need to be open. Till 2 am here. Diego, Enrico, Malta-, Applicant: It's, not that I need to.. I just wanted to be able to, you know, utilize as much maximize as much as I could. Diego Enrico Malta-, Applicant:, After, dinner., If I get some people have to do. You know it would be beneficial to me. Christine Berthet- Committee, Member: That's, that's Frank, Holozubiec-, Co-, Chair: The. Other thing that confused me is that you say the certificate of occupancy is 120 people and the Brazil. Brazil. When they filed with us, said the CFO was 200. Are you taking over less space than Brazil. Brazil had Diego Enrico Malta- Applicant: Last,? It is 120 which was divided between two rules: 60 and 60. If we could, I'd be happy with that. Frank Holozubiec-, Co-, Chair:, Yeah, I just do not know how they got up to 200 Diego Enrico Malta- Applicant: I do not know. Frank Holozubiec- Co-, Chair: Is there that your pictures. Make it look like. There's a back terrorists. Diego Enrico Malta- Applicant: On rule,, which is totally enclosed. Frank Holozubiec-, Co-, Chair:, And you're, keeping that. Yes. Diego Enrico, Malta-, Applicant: That's, part of it. I just did it. Diego Enrico Malta- Applicant: Okay,, basically not changing anything at all, just, you know,, okay., Frank, Holozubiec- Co- Chair: Now,, like we got out late email from a community member, but she says she's here as a, as a, an attendee. So if she wants to speak, will let her speak, but otherwise I'll summarize the email. Christine Berthet- Committee Member: There's, nothing, Christine, Berthet-, Committee, Member:, So,, Frank, Holozubiec-, Co-, Chair:, Christine It's, not a storm enclosure issue, because their door. Christine Berthet-, Committee, Member:, Inside,, right. I, know I got it. Burt Lazarin-, Co-, Chair: Is there. Another question coming from you. Christine, Berthet- Committee, Member: Was, another question,, which is, so obviously you're going to be taking advantage of 46Th Street to put your tables and chairs outside right. Diego, Enrico, Malta-, Applicant: Now I do not try to reopening until Diego Enrico Malta- Applicant: Broadway comes back., So, no Christine Berthet- Committee Member: No, no,. But even then it's going to be permanent. So. The question is, at that point,. Will you be? Will you be putting Diego Enrico Malta- Applicant: Long it to within you know the law, I would do just the outside. That'd be content at this point. Christine Berthet-, Committee, Member:, To, right inside,, but Christine Berthet-, Committee Member: My point is that once you put the Christine Berthet-, Committee, Member:, The tables and chairs in the street. We want to make sure you're not putting any music there. You, know,, Christine, Berthet-, Committee, Member: And, and that new tables and chairs are put on the sidewalk. Christine Berthet- Committee Member: Right. Burt Lazarin- Co- Chair: Okay. Additional questions from committee, members. Burt, Lazarin-, Co-, Chair:, Nelly., Nelly, Gonzalez-, MCB4: I have two people with their hands: raised. I'm going to go in the order that I saw the hands, go: up. Burt, Lazarin-, Co-, Chair: It's, a Nelly Gonzalez- MCB4: Person is Nelly Gonzalez- MCB4: Christian Nelly Gonzalez- MCB4: Hello. Christine Berthet-, Committee, Member: Here, it is. Burt, Lazarin-, Co-, Chair:, Muted, Nelly, Gonzalez-, MCB4:, No., Christine, Berthet-, Committee, Member:, No., Oh, now., Christian, Liendo: Can, you hear me: now. Nelly, Gonzalez-, MCB4:, Now,, Christian, Liendo:, Yeah,, okay., I, apologize. I was actually going to, I apologize for not getting the email, out. I actually wrote down a couple of questions and I did not know if it was preferential if I cut and pasted them here or if I send them. Out. Inge Ivchenko-, BLP, Public, Member:, Go ahead and speak. Christian Liendo:, Alright,, great., So I live right behind that, um, I, actually like. If I look out, my window. I see the rear of that building. Christian Liendo: And I wanted to address some concerns that we had with the previous restaurant, and I wanted to, to just,. You know,, discuss them and see what would happen. Christian Liendo: Even though the back is technically closed. It's, not a brick and mortar back. It's like plexiglass Christian, Liendo: And, the previous restaurant sometimes had music that would escape through the rear door. That's in the kitchen. Christian Liendo: Or that the bass music was so loud that it will permeate into the apartment. I'm a lot of times the previous restaurant used to keep the rear door open because Christian Liendo:, Of Airflow and thus the music would leave. And. Although the application state that there will not be a DJ., Christian, Liendo: On the state that there will also be private, events. And, sometimes those private events have DJ or live music, and we would like to know how that would be addressed. Christian, Liendo:, Um. Second thing is that late night workers, usually after the closing the restaurant throughout garbage and did a lot of work in the back. Christian Liendo: In the evening hours, of,, like,, two, and three o'clock in the morning, and then that would wake us up and that's another thing I'd like to see how it addressed. Christian Liendo: And. They see that there's no excuse acoustical support our report from a certified sound engineer. That's on the application. And I wanted to know if that was actually going to happen. Frank Holozubiec-, Co-, Chair: Okay, so Christian when they say what they say about. Music applies to private parties that everything else. Frank Holozubiec- Co- Chair: So. If they are agreeing with us to only have a DJ. No, one else can have live. Music. I mean, I only have background music,. No one else can come in under their liquor. License and have a private event with live music or DJ Frank Holozubiec- Co- Chair: So, that should that should not be a problem. Frank Holozubiec- Co- Chair: I hear you about the set of DNA. Greed has thing back, there. Would it help if they agreed to keep the rear door closed, you know,. Whenever they were patrons in the restaurant and also not to,, you know,. Let anyone Frank Holozubiec-, Co-, Chair: You know,, go through that door after I. Do not know, you know, after they close Christian Liendo:, I mean,, you know,, Diego, Enrico, Malta-, Applicant: We want to be good, neighbors. That's. What we want to be there for a while. So, whatever we have to do to comply with well Diego Enrico, Malta-, Applicant:, It kind of requires that, and the other thing is that in the restaurant itself. I want to contain upfront as much as possible and the back is. I mean, during the rush, hour. So I, think most of our business will be done in the front. Burt Lazarin- Co- Chair: They've. Also, he was raised by Christian about employees,, almost like after hours hanging, Diego, Enrico, Malta-, Applicant:, I, will, I will let you said it would not be a good neighbor there. We reply to that. Yes. Inge, Ivchenko-, BLP, Public, Member:, Well, I would say that the back door to the yard. No employees or other people should be able to go out there. After midnight. I mean, Inge Ivchenko- BLP Public, Member: If they get a two o'clock. License. You do not want them out there at one in the morning.. You want to stop it at 11 or midnight. No one should be going into the backyard. So. You should tell your employees. Inge Ivchenko- BLP Public Member: No backyard, no, opening the back door after a certain time because 11 or 12 after that. It's, ridiculous. Read, yes to wake people, up. Absolutely., Frank, Holozubiec-, Co-, Chair:, Right., Christine, Berthet-, Committee, Member: I have a question is,. Where is your God. How is the garbage done, because it seems that the garbage is stored or staged Christine Berthet-, Committee, Member:, And, Diego, Enrico, Malta-, Applicant: I, do not know yet. Diego, Enrico, Malta- Applicant: Have, not gotten into that. Diego Enrico Malta- Applicant: Right,, whatever we have to do to comply. We will. I do not know how everybody else does not 46th Street. Christine, Berthet-, Committee, Member:, Right., Diego, Enrico, Malta- Applicant: I have not crossed that bridge. Yes, sir. Yeah. Frank, Holozubiec- Co-, Chair: Now,. Why do not we take Rob Walker- Committee Member: A, quick, break., Real, quick, I'm, outside of looking at the pictures, and it looks like there's actually spacing for seeding. So you're, saying you're not going to utilize that space at all out: front, um,, Rob, Walker-, Committee, Member:, I, Diego, Enrico, Malta- Applicant: was aware that there was like five tables outside Diego Enrico Malta- Applicant: But, we're not going to use that. So, He sat Rob, Walker-, Committee, Member: Down, one of the stipulations that it's not going to be used in Frank Holozubiec-, Co-, Chair:, The, Rock. Do, not those are on private property,. It's right. Diego Enrico Malta- Applicant: Down on paper. I mean,, we're going to Diego Enrico Malta- Applicant: Try to comply as much as possible. We're, not walking the streets. It's going to be on the property. It's like two steps: down. And, if I have four or five tables that will only just bring people in. We do not have any music Rob, Walker-, Committee, Member:, I, guess what I'm getting to is it, seeing how it is frightening. It is part of the building front,. Would you be willing on having a closer slightly earlier. Rob Walker- Committee Member: Did, your 2 am close. Time, I would like to contain the Diego Enrico Malta- Applicant: Crowd as much as possible. Inside. In, the meantime,, because it's a healthier energy. I will disperse the people that use the energy. So. The main attraction will be the main dining Christine, Berthet- Committee, Member: It. Let me clarify it seems that there's maybe some confusion. The,. There is no obligation here to use the font outside right. Christine Berthet- Committee, Member: This, is not covered by the application, right. Diego Enrico Malta- Applicant: You do not need to apply for a license if you're, if you do not use decide what we're not using sample. Christine Berthet-, Committee, Member: Yeah, but I mean in the stipulation form. We are asking some answers about the outside space and you have not entered any of that. So. My assumption was that it would be no use of the outside space in the form. That's. Why I'm saying that I'm not clear whether there is no? There is not one Diego Enrico Malta- Applicant: Tables,. If you wish not to put anything there. That's fine. But, you know what I'm trying to as much as possible. Christine Berthet-, Committee, Member:, No,, no, I, just want. I just want to make sure we are all playing with the same deck of cards. The Diego, Enrico, Malta- Applicant: Other thing that if I needed those tables., Yes, I can., Christine, Berthet-, Committee, Member: Fix that there. Okay. Christine Berthet-, Committee, Member:, All, right., Frank, Holozubiec-, Co-, Chair:, Now,, so I read and Mr Malta,, there's a page on the strip. Form. Frank Holozubiec- Co- Chair: Page, five that has to do with outdoor space, other than sidewalk cafes. So. You need to fill that page out. And that asks you if you're close, that space. Frank Holozubiec- Co-, Chair:, By 10 o'clock on weekdays and 11 pm on weekends and I assume you'll agree to that. Yes. Alright,. So if you would ask your representative to fill out that page, and then also on page two., Frank Holozubiec- Co- Chair: There's a chart that asks how much seating you have inside and how much you have outside and currently the form for outside says,. You know,, not applicable. So. If you could correct Page two as well. Yeah,, we Got that., Okay. Burt Lazarin-, Co-, Chair:, Okay., Frank, Holozubiec-, Co-, Chair: Why do not. Why! Do not we hear from the other Burt Lazarin- Co- Chair: From. The community wanted to Burt Lazarin- Co- Chair: Say something. Yeah. Nelly Gonzalez- MCB4: I have one more person. Nelly Gonzalez- MCB4: Grace. Grace Millo: Yes. Hi. Can. You hear me. Nelly, Gonzalez-, MCB4: Yes, and Frank Holozubiec- Co- Chair: Grace. We got your email. But since you're here in person,, I assume, you'll address it. I do not have to summarize it. Grace Millo: Thank, you so much. I think it's mostly because living in the back luck,, which I think Christian said we face that entire, that especially to 28 and Grace Millo: 330., I, mean, I actually go even I, extend even more sanctuary of 46 as an example is right on my basically I level. So, with all with all understanding,, similar to what you're trying to do,, because obviously it's nice to have restaurants back and everybody happy and healthy. Grace Millo: Then my concern is, again,, the outback, the noise. Some, things that were said kind of went in and out. So I just want to make sure. If I made that I understand. Grace Millo: The with the chair regarding the terrorists in the back that has an enclosure. Are, you saying that would be enclosed all the time, or like Sangria 46. It would open and close Diego Enrico Malta- Applicant: Know, and we've been closed., Grace Millo: And. Then I also understand that there's no, there's actually no DJ or live music coming Grace Millo: Okay,. That does help a great deal when,. When are you scheduled to open Diego, Enrico, Malta-, Applicant:, I'm, probably close to a suit Broadway gets back because it's going to be. It's not going to be productive to open up until Diego Enrico, Malta-, Applicant:, Some sort of Broadway shows from that. Right. Diego Enrico Malta- Applicant: 25% for have 120 that Diego Enrico Malta- Applicant: It's around 3040 people maybe, you know,, Burt, Lazarin-, Co-, Chair: I can answer that opening up Diego Enrico Malta- Applicant: I want to be ready as soon as Broadway gets on so you're able to open the doors. Grace Millo:, So I, guess my main concerns with an answer. Other than,, you know, I'm, just like, Grace, Millo:, You know, the board to also understand to it's just, it's,, it's kind of gotten out of control on 46Th Street., I mean,, that's just the truth. Grace Millo: And. Many of these businesses go well past the 12 o'clock on weekend hours as what he was saying with people out back after 1 am cleaning or whatever it's so noisy. I can't even describe soon. You know,. It's my concerns that will be somebody in Diego, Enrico, Malta-, Applicant:, The, crowd. So. When Google is over,. That's over., And, like I said, I, want to use the main room as much as possible to change the energy and the noise level. Grace Millo: And. So it's 2 am not for.. Am I thought the application. Diego Enrico Malta- Applicant: Know that if I can keep it on to be nice if I get some of the crew or the or the Broadway Gypsies from the shows, they'll be nice. Diego Enrico, Malta- Applicant:, whatever I can to maximize Diego Enrico Malta- Applicant: My survival, there. That's what I'm trying to say. Grace Millo: Well, before Grace Millo: Bed, that's better than 4 am Frank Holozubiec-, Co-, Chair:, And, grace. Part of the issue. Here is so many of those places on 46th Street have been there. Forever. Frank Holozubiec-, Co-, Chair: You, know and have 45 licenses going back decades and Frank Holozubiec- Co- Chair: We only tried a pair things back as Frank Holozubiec- Co- Chair: People, you know, come to get as what is happening. Here, new, new operators come in and it's important to hear from people in the neighborhood. Frank Holozubiec- Co- Chair: So. It's great,. It's great that you came today because often we do not hear from a lot of you. Do not hear a lot of complaints about 46Th Street. So. It's good to know that there are issues. Grace, Millo: Well, I'm, very grateful that you're listening because it's, you know, I'd hate to have to leave a building. I've lived in for over 30 years, but it has. It's. Definitely at that point and Grace Millo: It's just, it's,, it's a little much. I mean, I'm not,, you know, I'm, not young enough to be out every single night and partying it up. I, mean,, there's even through Covid-19 Grace Millo: But I really want to be respectful of the city, opening and I care about that deeply. I just,, it's just Grace, Millo: There are times even a noise machine or like I have five do not cover the sound, especially live music when it was there before was a flaherty's. It was., I mean, you know,. It's just really. Challenging. So I'm grateful for you to have heard me and Grace Millo: Mr Walter also,, you know,. Hopefully this will work. Out., Frank, Holozubiec-, Co-, Chair: And. If grace. If you go to the Community board for website, there's, what's called a nuisance reporting protocol that you know, tells you out a complaint about noise and other issues. Frank Holozubiec- Co-, Chair: To various agencies. So you know you can't really complain about the entire block. But. If there's a particular place. That is,, you know, becoming a nuisance,, you should Frank Holozubiec- Co-, Chair:, You know,, use that information and start filing reports with 311 and the SLA, and you know ultimately things, you know, things add up and we try to help. People resolve things. Grace, Millo:, Well, I do appreciate it. Thank, you., That's, good,, good knowledge to have. Thank you so much. Burt Lazarin-, Co-, Chair:, Thank, you., Christine, Berthet-, Committee, Member:, So, fun. Can. You recap: this tips. Frank Holozubiec-, Co-, Chair: They're, going to correct pages two and five of the Strip form to show that there are some outdoor seats within the property line, not on the sidewalk, and those seats will be closed and vacated no later than 10 pm. Frank Holozubiec- Co- Chair: weekdays, 11 pm on weekends. Frank, Holozubiec-, Co-, Chair:, Is recorded music, only there'll be no music in any outdoor space. If they choose to use utilize outdoor space, other than the front yard, the private property. That seating will only be on the roadway,, not on the sidewalk. Frank Holozubiec- Co- Chair: doors to the rear yard will be kept closed at all times and in particular, won't be open after 11 pm by anyone,, including staff, and no one. If there's any unin closed rear, yard. No one will be there. After out there after 11 pm, Inge Ivchenko- BLP, Public, Member: Motion to approve. Burt, Lazarin-, Co-, Chair: Okay,, all those in favor Rob, Walker- Committee, Member:, Aye., Burt, Lazarin-, Co-, Chair:, President, eligible., Okay., Burt, Lazarin-, Co-, Chair:, Good, luck., Diego, Enrico, Malta-, Applicant:, Thank, you., Thank, you., Burt, Lazarin-, Co-, Chair:, Okay,, I'm, seven 331, West, 51St, Street., Kevin, Marcel-, Applicant: Are, you doing I read Burt Lazarin- Co- Chair: Oh,. Can you hear me, Lisa. Inge Ivchenko- BLP, Public Member: Can hear you. Frank Palillo: Know Me Introduce yourself. Michael Mastro- Applicant:, Hi, everybody. Frank Palillo: This is Michael Mastro everybody,. How are you Christine, Berthet- Committee, Member: Like? Oh Michael, Mastro-, Applicant: Can. You guys hear me. Can, you guys hear me. Yes. Frank Palillo: Michael is Frank Palillo: Now,, I'm, sorry. You want me to start Michael Mastro- Applicant: You can start yet because I do not know why my Frank Palillo: My work. So I thought, Hey, Frank Palillo: Michael, taken over the old spoon Fed space on 51St Street is opening Italian restaurant with his family members. Frank, Palillo: Um. The hours are 11, am to midnight, seven days a week., Frank Palillo: And we'll be happy to answer any questions. You may have. Burt Lazarin-, Co- Chair: I, see that when you met with the Burt Lazarin- Co- Chair: AK 4954 you Burt Lazarin- Co- Chair: Agreed to be no sidewalk cafe. Burt Lazarin- Co- Chair: At, the vino amplified. Burt Lazarin- Co-, Chair: No, open windows., Who, ADORES., Burt, Lazarin-, Co-, Chair:, Mike, Frank, Palillo: Michael,. Is that correct, Frank Palillo: We can't hear you. Michael Mastro- Applicant: So every time. I go to my video. It mutes me back. If someone could unmute me that would be Christine Berthet- Committee Member: Good. Michael, Mastro-, Applicant:, Am, I, still good. Inge Ivchenko- BLP Public Member:, Yes., Michael, Mastro- Applicant: We do hire, everybody. I'm like, good to meet you. Sorry,. What would you say,, sir, I? Repeat the question. Frank Palillo: Please, sorry. The Burt Lazarin- Co- Chair: 4954, plus Association black alliance. Michael Mastro-, Applicant: Yes,, that's correct., Burt, Lazarin-, Co-, Chair: And. You agree to some stipulations. Yes. Burt Lazarin-, Co-, Chair: Do. You want to tell us about that.. I have not even noticed that you agree to know. Sidewalk cafe, know Africa music, open windows, open door, anything Yes., Michael, Mastro-, Applicant: About. That was just about it. I mean,, the next door, neighbor that I happened to get to know while I was doing a renovation in the building for the landlord. She just, you know,. She brought up a couple of things at the meeting and I was glad to oblige the requests. Frank Holozubiec- Co- Chair: Michael,. Could you tell us a little bit about your background in the in the restaurant industry. Frank Holozubiec- Co- Chair:, Event., Michael, Mastro-, Applicant:, Is I know you have a Frank Holozubiec- Co- Chair: Contractor to right, Michael, Mastro-, Applicant:, Yeah, I own I own, a successful construction company in the city. And when I was a kid,, I started off in the deli and catering and then I moved up to being in a bar restaurant from where I grew, up., Michael, Mastro-, Applicant:, A, bouncer there and kind of like a manager and then I came into the city. Worked around a couple of places. And I found my way into property, management., The, real estate side of my life and I. I saw good opportunity with the landlord that I got to know in this situation. Frank Holozubiec- Co-, Chair: So. Have you have you owned or managed a restaurant before Frank Holozubiec- Co- Chair: Yes,, which is this bar sardine Michael Mastro-, Applicant: Yes bar sardine and along with that. Before that, I was at poor house in Nyack New York,. If you guys know the Rockland County area. Frank Holozubiec-, Co-, Chair:, And,, and, uh, you,, the person that sort of going to be there,, you know, chiefly when it's open, or I, mean how does that work with your construction work or you know other people with day to day responsibility. Michael Mastro-, Applicant:, Yeah,, absolutely. Like,, you know,, like a construction, company., There's foreman, and there's managers and restaurants. So I'm, going to have a manager staff and a head chef and, like any other business, just the Pyramid of having successful. You know: restaurant. Burt, Lazarin-, Co-, Chair:, Really present them at time. Michael Mastro-, Applicant:, Of, course,, Christine, Berthet-, Committee, Member:, Much, Burt, Lazarin-, Co-, Chair: Those, that Christy Christine Berthet- Committee Member: How much,. How much of your week you can spend there.. Michael Mastro- Applicant: I see myself stopping there at least three, four times a week. You know, I'm, going to be there to talk to my family. I'm going to be there to talk to the manager is probably going to be there at night. Michael Mastro-, Applicant: And,, you know, I'll, be there entertaining clients arm but I'm, going to make sure that my restaurant, hopefully makes money in these unprecedented times and enhance the community with good Italian food and a good crowd. Frank Palillo: Michael,. Could you speak a little bit about your family. Michael Mastro- Applicant: Well, my,, my cousin was been a executive chef, Chef for Hilton, Hilton corporate for the past decade. And, you know, I've worked in the food business for a long time and Michael Mastro-, Applicant: We know it makes people happy. And. It definitely also makes money so kind of stumbled on this interesting opportunity through getting to know the landlord and Frank Palillo: Okay, Mike. So. Either you or your cousin's going to be there regularly. Michael, Mastro-, Applicant:, Yes, and or manager. Yes. Frank Holozubiec-, Co-, Chair:, So Frank and Michael Frank Holozubiec- Co-, Chair:, When, Southern. Hospitality closed. There were a lot of reports that a problematic operator in our district and one that owns another place down the street,, a guy named Best time to catch, was actually operating illegally. Out of this location. Frank Holozubiec- Co-, Chair:, Does Q catch have any connection whatsoever with Mr Mastro or this operation or the ownership company. Frank Palillo: Michael,. That's your question. Michael Mastro- Applicant:, Now,, Frank, Holozubiec-, Co-, Chair: So. You would stipulate because okay I'll be proud about. This. There have been reports that Mr. Q. Catch has been seen. Frank, Holozubiec-, Co-, Chair: Both at this address, and one down the street that we're going to hear next. Frank Holozubiec-, Co-, Chair:, West 51St Street. So. Is that not the case. Frank Palillo: Recently, Frank. Burt Lazarin- Co- Chair:, Yeah. Recently,, so Frank Holozubiec- Co- Chair: Like today. Michael Mastro- Applicant: No. Frank Palillo:, No,, I, Frank, Palillo: I was approached by some person who I think met with your community board. Frank Palillo: In January, February. Frank Palillo: Apparently,. He was a front for this man,. He came to me and told me that the community was approved him and we did not have to notify the community. We should just found the application. Immediately. Frank Palillo: So I'm, 64 years old and I'm doing this for 40 years, I reached out to Natalie,, who told me that you had actually disapproved this application I believe this person was working for vessel., Frank, Holozubiec-, Co-, Chair: Okay,, so in other situations. We've had people agree to this step. Can. You guys. Let me know if these two are okay. Frank, Holozubiec-, Co-, Chair: The former operator at this location best, some Q edge will have no involvement, whatsoever,, financial or otherwise, and applicants operations,, whether its owner management manager, consultant or employee. Frank, Holozubiec-, Co-, Chair: And best. Some Q catch has no involvement or connection with the corporate applicant,, which I guess is 331 West 51st, restaurant,, Eric., Frank, Holozubiec-, Co-, Chair: Will. You folks stipulate to that. Frank Holozubiec-, Co-, Chair:, Yes., Okay, and then Frank Holozubiec-, Co-, Chair: The next issue. Is,. We got a very troubling. Email, just a couple hours ago from I guess: I lean, who you were speaking about: Frank Holozubiec-, Co-, Chair: She, said your construction. Well,, the construction workers at this location put 10, so bags of heavy garbage right in front of her building. Yesterday, afternoon. Frank Holozubiec- Co- Chair: I put the bags back in front of their door and off the street,. There was no one at 331, so I went over to Maria PA, where best some Q catch was supervising their interior work. He did not respond to me. Frank Holozubiec- Co- Chair: Today. They again put five bags of garbage in front of my building. When I, tossed them back on their front. Space, a worker came out and said he did not know they could not put garbage in front of another's property. Frank Holozubiec- Co- Chair: All. The garbage is now on the sidewalk in front of 331.. I. Do not think they have a private Carter, about two weeks ago that commercial garbage was picked up by sanitation. I just want to let you know, because these people do not seem responsible, Frank, Holozubiec-, Co-, Chair: So, what's happening. Michael, Mastro-, Applicant: Going to make sure all the garbage is cleaned up and Eileen does not have that issue ever again. Frank Holozubiec- Co-, Chair: But? How did it happen in the first place. Burt Lazarin- Co- Chair: Yeah. Burt Lazarin- Co- Chair:, s&c, mistake., Yeah., Michael, Mastro-, Applicant: I mistake a mistake by the workman. Christine Berthet- Committee Member: Know, Burt Lazarin- Co- Chair: I'm the state, by the way,, but it seems like purposely letting the public Sanitation Department, pick up the garbage, which they should not be picking up, since is commercial garbage., Frank Palillo: Is it construction, debris., Frank, Palillo: Do. We know that Burt Lazarin-, Co- Chair:, Well,, I was, I, did look in the bags. Michael Mastro- Applicant: There was,, you know, at the restaurant that I'm hoping to take over. Michael Mastro-, Applicant:, It. There was a lot of stuff in there and it costs a lot of money to cart, garbage away and having a construction company making this investment into the restaurant. Michael Mastro- Applicant: I'm, definitely trying to save costs, where we can and if it's, if it's rubbish that can be picked up by the city. Michael Mastro- Applicant: I'm I made that call. I did not mean to be placed in front of Eileen property at all., Michael, Mastro-, Applicant:, But, I, did, I did make the decision that you know the rubbish. That is not. You know any kind of sheet rock or anything that would require permits or work like that. Michael, Mastro- Applicant: It was just,. It was mostly rubbish and I apologize and it won't happen again to the to the board in the community and I'll apologize. I've been personally I spoke to her today. Frank Holozubiec- Co- Chair: Are, you doing their construction work at West. 51St as well. No., Frank, Holozubiec-, Co-, Chair:, Okay, cuz, okay, Inge Ivchenko-, BLP, Public, Member: Thank, you for being honest. Christine Berthet- Committee, Member: Yes, thank you., Really. Inge, Ivchenko-, BLP, Public, Member: much, appreciate it. There, Frank, Holozubiec-, Co-, Chair:, So, I just finished so Eileen also sent out an earlier email concerned about the. This is a to floor. Space. Right., Yes., Frank, Holozubiec-, Co-, Chair:, Yes, and I do not think the private. Unfortunately, the prior applicant was not successful. Enough, I think, to use the second floor. Often,, but before that there was a bar there. That was really a nuisance.. What. Are your plans for the, the upper floor. Is that the same Frank Palillo: Or, the dining room. Frank Holozubiec- Co- Chair: Okay,? So it's still only no stage no performance. Frank Palillo: So dining room with a service book. Frank Holozubiec- Co- Chair: And. Only Frank Holozubiec-, Co- Chair: Only background music. Only Background Music Okay. Frank Palillo: The Midnight seven days with Burt Lazarin- Co- Chair: 10, is the first book. Frank Holozubiec- Co- Chair: I wait. I thought it was 11 and midnight. Christine Berthet- Committee Member: Into me midnight. Frank Palillo: Right living Christine, Berthet-, Committee, Member:, From 11 to midnight. Christine Berthet- Committee Member: Which is good. It's fun. Frank Holozubiec- Co- Chair: Just checking. Frank Holozubiec- Co- Chair: Email Frank Holozubiec- Co- Chair: I'm, asking a Rob Walker- Committee Member: Question, the tables that are within the building line that are still outside on you've got them listed. Here. If you use them. Will, you agree to have them close by 10 Rob Walker-, Committee, Member:, Yeah., Christine, Berthet-, Committee Member: They said that Okay, thank you. I've missed Christine Berthet- Committee Member: It's in Page five Rob Walker- Committee Member: I, I'm looking at, well, looking at their thing. Um, and Rob Walker- Committee, Member: But it has inside, outside and then above it is got music. And. That's why we're looking but anyway. Okay, thank you. Burt Lazarin- Co- Chair: Any other community members. Christine Berthet- Committee Member: I have a question., Same question. Is,, are you going to use open street dining in the on the parking lane. Frank Palillo: You know,? We did not discuss open, streets. I did not know. It was definitely going to be permanent, Christine,. We had planned. The hope was by the time we open,. We would not have a corporate situation. Christine Berthet- Committee Member: Yeah,, but Frank Palillo: If we do,, and if it is permanent,, then we would like to use it. Christine Berthet- Committee, Member: OK,. So the same stipulation. You have heard before,, which is you know it's on the in the parking lane, not on the sidewalk and new music whatsoever. Frank Palillo: That's an hour with their street have a problem with Inge Ivchenko- BLP Public Member: Anger, I have the same thing. And my, you know,. If you're going to use the street open street, which is good. Just, make sure the sidewalks are kept completely open. No signs., No,, stop., Inge, Ivchenko-, BLP, Public Member: Right,. Just keep them happy to use the streets. Keep the sidewalks, completely open Frank Palillo: Mike, you're, doing good. Michael Mastro- Applicant: 100%. Whatever you know, whatever the community board suggests, I'm going to be good with Inge Ivchenko- BLP Public, Member:, Thank, you. Will, say things like that. Burt, Lazarin-, Co-, Chair: Maybe. You should listen to your lawyer. Michael Mastro- Applicant: That's, a good suggestion to keep me out of trouble. Christine Berthet- Committee Member: Okay. Michael, Mastro-, Applicant:, Any other,, any Frank Holozubiec- Co- Chair: Coming. Yeah. Wait, a second. I'm trying to find Steve's other email. Burt Lazarin- Co-, Chair: Meanwhile, Nelly. Do anybody from the community with a hand, raised. Burt, Lazarin-, Co-, Chair:, OK., Frank, Holozubiec-, Co-, Chair:, OK,, I, guess., Inge, Ivchenko-, BLP, Public, Member:, The, question I'm, 11 yeah 11 am to 12 is fine with me. Christine Berthet- Committee Member:, Yeah., Frank, Holozubiec-, Co-, Chair: Um,. So the question is, well,. Let me go through the steps and then we can figure out how to deal with the best. Some issue. Frank Holozubiec- Co- Chair: You'll. Have the steps I read about Bessemer, having no connection with this right? Here. Frank Palillo: Can I, stop you for a second.. Frank was Bessemer involved with the last operation. Frank Holozubiec- Co- Chair: He was he. There were multiple community reports that he was operating: their illegally. Frank Holozubiec-, Co-, Chair:, Restaurant, closed., Frank, Palillo:, And spoon, Fed, Frank, Holozubiec-, Co-, Chair:, Yeah. And. Then he was bringing stuff over from Maria Pa. He was sending overflow business. There. We heard about Frank Palillo: The place before spoofer Frank Holozubiec- Co-, Chair: Now. Now spoon Fed, closed. He was still in Maria PA. Before you get closed down and Maria PA, he logged in, carried liquor back and forth between Spoon Fed and Maria PA,. He said overflow customers there. Frank, Holozubiec-, Co-, Chair: I have little doubt that happened because we heard about it. I did not say, personally,, but we heard multiple community reports at the time, and nothing more happened because he was closed down and Maria P or shortly thereafter., Frank, Holozubiec-, Co-, Chair: Okay, and we're getting reports. Now that people have seen him at both of these locations. Frank Holozubiec- Co- Chair: So, we just,. We just have to be cautious here and the SLA has asked us to alert them whenever anyone tries to move into any of these spaces. So they can investigate and make sure there's. No that's some connection. Frank Holozubiec- Co-, Chair: Okay,. So we'll have those two stipulations. Frank Holozubiec- Co- Chair: Background Music only Frank Holozubiec-, Co-, Chair: If. You use any Frank Holozubiec- Co- Chair:, Open streets, rope and sidewalks. Do. You only put the seating and the roadway and not on the sidewalk,. You'll have no music whatsoever in any outdoor space. Inge Ivchenko-, BLP, Public, Member: Motion to approve. Frank Holozubiec-, Co-, Chair:, Wait,, wait, wait. We have not Frank Holozubiec- Co- Chair: You have not decided to Christine Berthet- Committee Member: Hold, your horses. Inge Ivchenko- BLP Public Member: He paused too long. Inge, Ivchenko-, BLP, Public, Member:, So,, Frank, Holozubiec-, Co-, Chair: People. Later at 4953, that's an email saying you agreed with them to the hours of 11, am 11 pm, Sunday, Monday,, Tuesday,, Wednesday, Thursday, and then Thursday, Friday, Saturday at 12, Frank Palillo:, I'm sorry,, who said that Frank Holozubiec- Co-, Chair: He, believed of the 4953 Block Association. Frank Palillo: That was more than one block: Association. Frank Holozubiec- Co- Chair: Walk alliance. They cover all four blocks. Frank Palillo: Did. You agree to cut the hours. Michael Mastro- Applicant: A lot has gone on since that meeting. I've been pretty open to any and all suggestions to from the block Association and the board members on this call. I do not remember exactly,. That's that detail. Um,, that's Frank, Palillo:, That's, too. That's too early to shut down., That's crazy., Inge, Ivchenko-, BLP, Public Member: It is Frank Holozubiec-, Co-, Chair:, Yeah, well. Steve also said he agreed to soundproof the second floor due to its proximity to residential units. Michael Mastro- Applicant: Um,, that's Michael, Mastro- Applicant: I did not,, I did not know.. I did not definitely agree to soundproof the entire second floor. I, I, mentioned to Steve and Eileen, who are on the call that I would only be having background music and I would be keeping the speakers away from the window. Michael Mastro- Applicant: Um,, Michael, Mastro- Applicant: I do not believe that I agreed to soundproofing the word for word soundproofing, the entire second floor. Frank, Holozubiec-, Co-, Chair: I, know, is Steve on Steve's, not on the call is he Frank Holozubiec- Co- Chair:, Now,, okay., Frank, Holozubiec-, Co-, Chair: I'm, all the guys email, and this is what he said. He meaning, Mr Mastro also agreed to soundproofing. The second floor due to its proximity to residential units. Frank Holozubiec- Co- Chair: Are concerned is that this is a residential area which already has more than three liquor licenses on the block. Frank Palillo: Where, their complaints with the prior operation, noise, complaints., Frank, Holozubiec-, Co-, Chair:, Not, the immediate prior one,, but the one before that. Frank Palillo: One before that was a bottle right. Yeah, Frank, Holozubiec-, Co-, Chair:, You, know,, I, mean, Steve is one of our more reliable know. Frank Palillo: Steve, well Frank Palillo: Michael your contract. It would it be a big deal., soundproofing Michael Mastro-, Applicant: It,. It would not be only reason why it would be a big deal is because you have exposed brick and Michael Mastro- Applicant: It's not going to look Michael Mastro- Applicant: tasteful to put a Frank Palillo: Line exposed brick and natural soundproof Michael Mastro- Applicant: Yeah. Michael, Mastro-, Applicant: And, there's, probably four Michael Mastro- Applicant: Courses of brick between the Christine Berthet-, Committee, Member: What about doing the ceiling. Michael Mastro-, Applicant: I would not. I would not mind. Adding I would not mind adding another Frank Palillo: It's not going to work. The complaints down the road. Right. Michael Mastro- Applicant:, Yeah., Michael, Mastro-, Applicant: Listen,. We need to use the special soundproofing glue and put up another layer of sheet rock on the ceiling. Michael Mastro- Applicant: And put an you know: do construction on the ceiling, we,. We can definitely do that to help prevent the prevent the noise. Michael Mastro- Applicant: For for Eileen and any other neighbor that has ever complained. But when we were not going to have LOUD MUSIC It's background music and 10 1112 o'clock or having people eating not Michael, Mastro-, Applicant: You know a bunch of kids rolling out of rolling out or wherever, and coming to make noise. It's. Not that kind of establishing Christine, Berthet-, Committee, Member:, I, think doing the ceiling would be a good, reasonable, compromise., Frank, Holozubiec- Co- Chair: Michael,. Let me tell you: what's bothering you. What's bothering me. I mean, Frank Holozubiec- Co-, Chair:, You know,, we've now heard things from, you know, community, members. We know pretty well. Frank Holozubiec- Co-, Chair:, That, I, sort of complaining about things you did and I sort of contradicting things. You've told us they said,, You've, told them. Differently. Frank, Holozubiec-, Co-, Chair:, I mean, Eileen in particular, has sent us, you know, to,. You seem you seem to be saying you're getting along with her and she's sending us emails. You know that she has all these garbage problems that she's worried about the noise. Frank Holozubiec- Co- Chair: The fact is that the garbage. Frank Holozubiec- Co- Chair: You know, I'm just concerned that there's some real lack of communication going on here. Michael Mastro-, Applicant:, Well, I spoke to Eileen today and she I've spoken to her, probably Michael Mastro- Applicant: 25 times face to face over this entire summer. We've always been super cordial and friendly.. I'm sure that the writing in the email is Michael, Mastro-, Applicant:, Probably, coming off negative Frank and like me, and her have a problem,, but we do not, um, I'm, definitely going to address the noise concern with doing spending extra money and doing extra construction to Michael Mastro- Applicant: Hope, hopefully satisfy an issue that has not come up with me. Yet. Just, as a preventative measure and I'm regards to the garbage taking total responsibility will not happen. Again. Michael, Mastro-, Applicant:, Okay., Frank, Holozubiec-, Co-, Chair:, So, Frank, Holozubiec-, Co-, Chair: What,. What sort of steps you want on the second floor, soundproofing. I mean,? How would you or Michael,? How would you phrase it? Michael Mastro- Applicant: I'd phrase it that we would, you know, I'd, go as far as being detailed and saying,. We would use a soundproofing glue, Michael, Mastro-, Applicant:, That I've used before, and all that soundproofing other apartments,, which is expensive and using a soundproofing sheet rock,, which is also more expensive than traditional construction. Frank Holozubiec- Co- Chair: On, the ceiling, he's ever goes, Yes. Inge Ivchenko-, BLP, Public, Member:, Okay, so, can, can I ask a question. Inge Ivchenko- BLP Public Member: Just on the on the soundproofing glue and the sheet rock that is adhered right to the ceiling. That's there already, the sheet rock. That's currently there. Correct. Michael Mastro-, Applicant:, That's, correct., Inge, Ivchenko-, BLP, Public, Member: If. You leave a space if you use, for example, will insulation,, which is soundproof and fireproof and then, you know, Inge Ivchenko- BLP, Public Member: couple inches with the next layer of sheet rock. Is, not that a better soundproof, because their space in between., Michael, Mastro-, Applicant: The applications that I've used in the research I've done. The glue works really well, along with these rubber Michael Mastro- Applicant: These raw. It's, going to be put around any fixture, any kind of breach through where any lighting is coming. Through. So between the rubber Michael Mastro-, Applicant: couplings,. If you will,, and the glue and the soundproof sheet rock, it's worked well for me on many projects. I have not used that application. I'm not opposed to it. Okay. Inge Ivchenko-, BLP, Public, Member:, Just curious what the differences. Okay. Frank Holozubiec- Co- Chair: Do, not need.. Are, you, okay! With sticking with what he proposed. Inge Ivchenko- BLP Public, Member:, Yeah,, it's,, yeah,, I'm just, I thought that more space, you know, sort of room within a box within a box gives you more soundproofing, but Rob Walker-, Committee, Member: Nobody it Inge Ivchenko-, BLP, Public, Member:, Right., Yeah, I do not know, I just, I do not know. But. If you say that this other way works,, then that's fine., Rob, Walker-, Committee, Member:, It's, just basic app actually is good because it installation, as well as it stopped sound. Inge Ivchenko- BLP, Public, Member:, Yeah., Inge, Ivchenko-, BLP, Public Member: I. Do not know. I know the wall, insulation. Inge, Ivchenko-, BLP, Public, Member:, Is, the soundproofing and then the sheet rock is another soundproofing and then you've got at least maybe four inches. Inge Ivchenko- BLP Public Member: I do not know because my Frank Palillo: World respect. I, think this might be more of a problem. If the restaurant before had pose a problem or noise problem, we're doing Inge Ivchenko- BLP, Public, Member:, Right,, right., Frank, Palillo: I understand there was a bar, you know, prime incarnation. Inge Ivchenko- BLP Public Member: Right, right., Frank, Holozubiec-, Co-, Chair: I went to the previous restaurant, a lot and I get what Frank Holozubiec- Co- Chair: Spencer and the second floor was never in us anytime. I was there. Frank, Palillo:, I, hope, Frank, Palillo: We do not have that. Frank Holozubiec-, Co-, Chair:, You're. I'm, not sure we can say that the lack of Frank Holozubiec- Co- Chair:, You know,, the lack of noise, said because I do not think they ever had. Anyone well Inge Ivchenko- BLP, Public, Member: Just. As long as Michael is aware that it needs to be well soundproof because he does not want to come back and have to do it, again. Inge Ivchenko-, BLP, Public, Member: So, whatever he uses his up to Inge Ivchenko- BLP Public, Member:, Him,, I, guess., He, says,, I'm, Michael, Mastro-, Applicant:, Totally, aware that I was raised by for women. Yes, me something once I'm doing. It. I do not want to hear about it: again. Frank, Holozubiec-, Co-, Chair: Alright,. So in addition to the other steps, I read will say that the applicant agrees to soundproof second floor space., Frank Holozubiec-, Co-, Chair: Ceiling, using soundproof glue and sheet rock on sale. Christine Berthet- Committee Member:, But, Frank, Holozubiec-, Co-, Chair:, All, right., And I suggest we do what we did with all the other best: some places. Burt Lazarin- Co- Chair:, Same, thing., Frank, Holozubiec-, Co-, Chair:, Go ahead and Frank Holozubiec- Co- Chair: Tell, the SLA that, you know,. We do not have the ability to investigate that. Does, not that if there had been reported connections with best some Q Sec to this space. Frank Holozubiec-, Co-, Chair: We do not have the ability to invest, investigate and you know, would recommend denial, unless they can confirm that with Bessemer has no connection. And. If they confirm that we were at RECOMMEND APPROVAL WITH THESE, stipulations., Frank, Palillo: Think, you may have said that backwards, Frank., Burt, Lazarin-, Co-, Chair: I, think he said. Christine Berthet-, Committee, Member: He said it. Fine., Frank, Palillo:, Recommend denial, Frank, Palillo:, Unless, Inge, Ivchenko-, BLP, Public, Member: Unless, the SLA. Frank Holozubiec-, Co-, Chair: Then determine that determines that there's no best it Frank Palillo: Would, be if the SLA determines Frank Palillo:, Right., Frank, Holozubiec-, Co-, Chair:, That, there's no connection. We want them to do.. And did not to investigate. Burt Lazarin- Co- Chair: Because. We had no Frank Palillo: Clue. If Frank Palillo: The person was not involved., Christine Berthet-, Committee, Member:, Know,, Frank it. We, always denying Frank Holozubiec- Co- Chair:, denying it order. Christine Berthet- Committee Member: igniting is an approval. Frank Palillo: So, okay. Frank Palillo: Well,. Let me understand you're going to deny unless we agree to the steps and the SLA finds the best ones, that about Frank Holozubiec- Co- Chair:, No. No,. We did not. We want this to get up to the three Commissioners,, because it's what they asked us to do. In order for that to happen. We have to deny. So. We are denying Frank Holozubiec- Co- Chair: Because. We can't determine the best them is not involved. Frank Holozubiec-, Co-, Chair: If they determine that,. Then we are okay with it. As long as these stipulations are in effect. Frank Palillo: Why,, why does the three Commissioners have to do that. Not that I care that much except you're, adding like three months of the approval time, Michael Mastro- Applicant: I have a what I have a way better, question,. Sorry to cut you off, boss. What can I do to prove that I'm in connection with the landlord, and not this guy, that you're talking about. Michael, Mastro- Applicant: What do I have to do as an applicant to prove to the board right here right now that I'm trying to open up a business to feed my family and enhance the community, because I stumbled upon a good deal where I was doing a construction, project. Frank, Holozubiec-, Co-, Chair: So, who just quite who you're doing the construction project for the landlord. Michael Mastro- Applicant:, Upstairs, I was renovating one of his apartments. Yes, okay, yeah and down downstairs is obviously I'm trying to feed my family and Michael Mastro- Applicant: I'm, not for alcoholism, but I'm for a good time and reasonable drinking, and that definitely helps my operation feed my family and these crazy times. Michael Mastro-, Applicant: I'm, definitely taking a risk here,, but I would definitely ask the Board to hopefully make a motion to approve me. Instead of sending me up the road for nothing that I did wrong. Frank Palillo: Well, the foot,, the public, by putting the full board approval on you. Ready, three months and approval time. That's already: six months. Frank Palillo: So, I, mean,, Frank, Palillo:, Still, and yes, I have to do. Frank Palillo: It's due diligence. Frank Palillo: Whether. It's the Commissioners. Christine Berthet- Committee Member: Weight, Frank, Palillo:, Or, investigations., Right., Christine, Berthet-, Committee, Member: Let me ask a question.. What is the involvement of what's best for me or whatever? His name is with this place. Michael Mastro- Applicant: There is none. I, do not even Christine Berthet- Committee Member:, With Michael I'm, talking to Frank Holozubiec- Co- Chair:, I'll, coach., Oh,, sorry. Okay,, so Frank Holozubiec-, Co-, Chair: That's. Some had never had a restaurant. In this place. He has Maria Pa. Frank Holozubiec- Co- Chair: Five doors down Frank Holozubiec-, Co-, Chair:, When spoon, Fed closed,. We started getting reports, the best. Some Frank Holozubiec- Co- Chair: have reached the deal with the landlord. Frank Holozubiec- Co- Chair: To use the spoon Fed place and was liquor from Maria. P. He was sending overflow clients down there and we heard those reports from several community members. Frank Holozubiec- Co- Chair: Before, anything that happened, the SLA closed, down. Maria PA,, which had the effect of closing down anything that was going on at Spoon Fed,, but he's never had an official connection with this address: Christine Berthet-, Committee, Member: So. What about we put in our letter,? Just that you know Bessemer never had a connection. However,. We were aware that some customers and some activity was taking place there in is Frank Holozubiec- Co-, Chair: Where. We say they were Christine, Berthet-, Committee, Member: Committed for right, and you can see where we port that you know he was even though you did not have a license. They were activity related to Christine, Berthet-, Committee, Member: Can in connection with Marissa PR here, and you do not put in the stupid edition that we deny unless they go to this free,. But you just put that we are. We are concerned about that. Frank, Holozubiec-, Co-, Chair: And. Do it justice a regular, did not deny unless Right. Inge, Ivchenko- BLP Public Member: Yeah,, because we do not want to. It's Hard enough for restaurants. Frank Holozubiec- Co-, Chair:, Here., Frank, Holozubiec-, Co-, Chair: At, the fact that both this location and Maria to be forest again in the same month that Frank Holozubiec- Co-, Chair:, But, I guess. Yeah, I mean, if is because Michael will agree to those steps. Frank Palillo: When Frank Sinatra for one second. Frank Palillo: Michaels case was almost September calendar,. We were ready to go at the request of the block. Association. We pulled it off to give him the opportunity to Frank Palillo: Yeah. Now by coincidence. They both have the same guy. Frank, Palillo: Yeah,. It looks suspicious. Frank, Holozubiec-, Co-, Chair: So, given that Michael will agree. Burt Lazarin- Co- Chair: Refreshing, my memory, Frank. Frank Holozubiec- Co- Chair: Given. The Michael will agree to the steps about know best in connection Frank Holozubiec- Co-, Chair: And, you know,. We will flag this in a cover letter with the step form,, but I guess I hate doing it. You know if they, you know, deny unless they, you know, determine that there's no best connection and all the steps are agreed to Inge Ivchenko- BLP, Public, Member:, Right., Yeah. Cuz it's hard times for restaurants and we Inge Ivchenko- BLP Public Member: Do not want to give them three months longer: Frank Holozubiec-, Co-, Chair:, Already, okay, with that. Motion., Burt, Lazarin-, Co-, Chair:, Yeah, I'll go with the crowd. Burt Lazarin- Co- Chair: I mean I,. We've had this issue before with other Rep disreputable, Burt, Lazarin-, Co-, Chair: Operators, and we proceeded to the same way. Burt Lazarin-, Co-, Chair:, That Frank had been suggesting Inge Ivchenko-, BLP, Public, Member: But times are different and Burt Lazarin- Co- Chair: I hear times a different Inge Ivchenko- BLP Public Member: I tend to trust this attorney,, as well as being reputable Burt Lazarin- Co- Chair:, Here,, Frank., Frank, Palillo: Yeah,. It's good huge burden on me for next month. Inge Ivchenko-, BLP, Public, Member:, Seriously, I. We've dealt with him for a long time and Inge Ivchenko-, BLP, Public, Member: I think he turns down clients that are not as reputable Burt Lazarin- Co- Chair: And. He has to come back again to us with other Guys. I had a question. Burt Lazarin- Co-, Chair:, Good., Thuy, Pham-, Committee, Member:, This, is,, um, I was not sure. If there's any resolution with the inconsistency is with a 4953 block lines of Sunday to Wednesday 11 to 11 and then Thursday, Friday, Saturday, Sunday 11 to 12. That was still open. Was, not it Frank, Holozubiec- Co- Chair: I thought it sounded like people were in favor of giving them midnight. Burt Lazarin- Co-, Chair: Well, I'd seven days a week., Yeah. Yes., Frank, Holozubiec- Co- Chair: I will follow up with Steve to try to find out what happened. Burt Lazarin- Co- Chair: Crisis is nobody from the black Association right Natalie,. We can't Frank Holozubiec- Co- Chair: Add Frank. If there's some bigger issue, here. I'll contact you and maybe we can iron it out before full board., Frank, Palillo:, With, reasonable. I think we're reasonable hours. It's a maybe it's a residential block,. It's not Frank Holozubiec- Co-, Chair:, No,, I'm, not., Frank, Holozubiec-, Co-, Chair: Talking about the discrepancy with what Steve seems to remember and what Mike Burt Lazarin- Co- Chair: This is going from us to the full board. So this time to Burt Lazarin- Co- Chair: Like. If there's anything in dispute., Frank, Palillo:, Reach out right, Frank, Holozubiec-, Co-, Chair: I just want to make sure, Steve. A, you know does not feel super strongly that this be 11. I do not see any reason he would Okay. So, Burt Lazarin-, Co-, Chair:, Us. Thank, you tweet, do want to summarize. Is that possible, Frank. Frank Holozubiec-, Co-, Chair: Sure they're, going to be the stipulations about that. So I'm, having no ownership or any kind of relationship with these operations are the corporate entity,. Getting the license. Frank Holozubiec- Co- Chair: The applicant will soundproof the second floor space using soundproofing glue and sheet rock on the ceiling. They'll, be background music. Only Frank, Holozubiec-, Co- Chair: They're agreeing to our usual hours on the front yard, space, to the extent they use something outdoor space beyond the front yard,. They will only use the parking way to not use the sidewalk and there'll be no music whatsoever in any outdoor spaces. Inge Ivchenko-, BLP Public, Member: Can. We just add one thing with restaurant trash that it will be taken care, of., Inge, Ivchenko-, BLP, Public, Member: By, the restaurant on their Christine Berthet-, Committee, Member:, Phone in front of the restaurant or yes or in the parking lane. If you want., Yeah., Frank Holozubiec-, Co-, Chair: But, if we just say all garbage during construction and operation,, you know, will be kept in front of this address. Only Frank, Holozubiec-, Co-, Chair: That's good will be disposed. Of. According to sanitation regulations, which means Frank, Holozubiec-, Co-, Chair:, I, guess to use a car. Burt Lazarin- Co- Chair: Car. No. Thank you, Michael. Burt Lazarin- Co- Chair: Yeah,, I, Frank, Palillo: Mean. We have not signed the lease yet. But yes, yes. Frank Holozubiec- Co- Chair: Wow,. That does not mean you can't put the garbage. Well, wait,. Are you renovated Inge Ivchenko- BLP, Public, Member: Or, the cart. Frank Palillo: Yeah,? It's see it's not our space for renovating yet., Frank, Palillo: But. That's how I will do it. Do not worry about Frank Holozubiec- Co- Chair: The garbage coming from Christine Berthet- Committee Member: From, the innovation upstairs. Frank Holozubiec- Co- Chair: Apartments. Yes. Frank Holozubiec-, Co-, Chair:, Oh, I thought you were renovating the restaurant. With Christine Berthet- Committee Member: An excuse, though. Frank, Palillo:, Mike, I'm saw the restaurant yet,. Have you Michael Mastro- Applicant: Here. We did not find out a little Christine Berthet- Committee Member: Fun. Frank Palillo: With Elise was signed. Burt Lazarin- Co- Chair: Like. This is it. Burt Lazarin- Co- Chair: You should have Frank Holozubiec- Co- Chair: It. Christine Berthet- Committee, Member: In front of us. Right. Rob Walker- Committee Member: Again. We are Burt Lazarin- Co-, Chair:, Good. This is Michael Mastro- Applicant: Good, with the I'm good, with the landlord like Michael Mastro-, Applicant: Mike,, you know,, Michael, Mastro-, Applicant:, Mike, likes me., You, think someone, nice Inge, Ivchenko- BLP, Public, Member: I'm, still going to follow Christine's motion and second. Burt Lazarin- Co- Chair: Okay,, all those in favor Michael, Noble-, Committee, Member:, Aye., Burt, Lazarin-, Co-, Chair: Opposed at staying present, not eligible Burt Lazarin-, Co-, Chair: Okay,. With a deep breath. Good luck. Michael Mastro- Applicant: Thank. Thank you all. Please come by for, you know,. Hopefully a cocktail and some Italian food. Frank Holozubiec- Co- Chair: Any idea when you're opening Michael Mastro- Applicant: Hopefully, when I when I get this liquor. License. Burt, Lazarin-, Co-, Chair: You have to sign a lease. Also Michael Mastro- Applicant: Yeah,. That's no problem! That's Michael! Mastro- Applicant:, That's, it., Michael, Mastro-, Applicant: Guys,! Thank you! So much. Be, safe Kumbaya, please OK. Burt, Lazarin-, Co-, Chair:, OK, I am last item on the agenda. 8319 right next door was 51st: Street. Kevin, Marcel-, Applicant: You, guys doing Kevin Marcel- Applicant: name's Kevin Marcel, open up Bella Valentina on Kevin Marcel- Applicant: West 51st street work acrosss the street from the, from the base. Itself. I work at the Washington, Jefferson hotel. I'm, the chief engineer over there as well. Kevin Marcel- Applicant: I've, been staying in this block for the past. Several months actually know: Kevin Marcel-, Applicant:, Any, questions., Frank, Holozubiec-, Co-, Chair: Yeah,, so Frank Holozubiec-, Co-, Chair: What's. Your experience in the city of restaurant industry have you Frank Holozubiec-, Co-, Chair:, I use. Kevin Marcel- Applicant: I used to work. Kevin Marcel- Applicant: I was, I'm sorry,, I'm, sorry., I was, I used to be a chef at the Marriott at the Marriott in New York. And, then pretty much I had left and Kevin Marcel- Applicant: I was more dabbling into different types of careers.. So I went from being a cook, to being auto mechanic to being in being a chief engineer., Kevin Marcel- Applicant: I just could not make up my mind. Really friend of mine was like,. Why not was actually my cousin who told me why now open up a business to use a why work for other people want to work for yourself. Kevin Marcel- Applicant: I was like,. What, you're, right., So I opened up actually have a mechanic shop,, but I will. It was my girlfriend. Who actually was the one who tried to say. Why do not you go into food being a fact that I like the color. So I, was like,. You know, what am I, not Inge Ivchenko- BLP Public Member: Tell, you about created a business with employees. Correct. Burt Lazarin- Co-, Chair: And. This is your first question, Kevin Marcel- Applicant: This is my first festival: Christine Berthet- Committee Member: Okay. Frank, Holozubiec-, Co-, Chair: Right,, so Frank Holozubiec-, Co-, Chair: Both to Canadian Kevin. So,, as you probably heard from the prior discussion. This is the other.. This is actually an official former best in queue, catch place, Maria, p, Frank, Holozubiec-, Co-, Chair: Where. He had operated and where it was closed down from the SLA Kevin, do you know, did cute. That's cute catches license actually get revoked. There. Kevin, Marcel-, Applicant: So that again. Frank Holozubiec- Co-, Chair: Did, the prior operator's license actually get revoked there or Kevin Marcel- Applicant: I think it has because I'm the one who's actually I'm the one who's planning for a liquor, license. Now,, it's me. I found the Frank Holozubiec- Co- Chair:, Problem., Kevin, Marcel-, Applicant: I think it has Frank Holozubiec- Co- Chair: Got. The problem is we heard this from another lawyer who is trying to take over one of the places that if a license has been revoked., You need a waiver from the SLA to get a new license within two years. At the same place, not anybody not just you. Frank Holozubiec-, Co-, Chair: Did. You talk to your lawyer about that. Kevin, Marcel-, Applicant: We have not really spoken much about that, because from what I from what he has told me, was that being fact, that, um,, I guess the new, a new Kevin Marcel- Applicant: The new tenant, I guess, in that, in that space, be in effect that best this person best them is not there. Anymore. Pretty, much. He did not really tell me much. About. He, just told me pretty much. Our I just have a lot of work to get done with it,, but he has not told me about that. Though. Okay., So,, Frank, Holozubiec-, Co-, Chair: Nearly at the Community Board office, emailed your lawyer, a bunch of times over the past couple weeks and we never got any response. Frank Holozubiec- Co- Chair: What are your intentions for that back room that is sort of the backyard. But. It's enclosed, Kevin, Marcel-, Applicant:, Garden., Um, I wanted to do seating.. Now I understand how this block is, I know that we had. This block has had a lot of Kevin Marcel- Applicant: Has between noise pollution between cars, zooming in and out,. We have between people playing loud music. You have between Kevin Marcel- Applicant:, A bunch of restaurants between Mexican restaurant. That's right down the block toys, a piece of stuff: that's right: acrosss from them to vice versa. Right. Kevin, Marcel-, Applicant:, Pretty much right, acrosss from me to another one in it to another Thai restaurant right. There was not that much restaurant. That's right. They also. Um, it's,. It is Frank Holozubiec- Co-, Chair: Kevin had a similar question. Are you going to keep getting close to the way it is. A, Kevin, Marcel- Applicant: I want to. I'm going to keep an enclosed Frank Holozubiec- Co-, Chair: Okay,, so Kevin Marcel-, Applicant: But I, want to you. I wanted to use the outsides. I wanted to use that little space,, but at least like a police for tables into a little space.. It's kind of like this, I want to say, not a stupid before after the sidewalk and stuff,, because I know: Frank Holozubiec-, Co-, Chair:, Your garden in Christine, Berthet- Committee, Member:, The, front., Kevin, Marcel-, Applicant:, In, the front yard. Yeah. Frank Holozubiec-, Co- Chair: Talking about the back Kevin Marcel-, Applicant:, So, back. I just wanted a couple of tables,, but I wanted to just close it,, but at a very limited time, offer like pretty much a certain time to save time and that's it. Frank Holozubiec-, Co- Chair: You got to keep it in closed. Yes. Because. Here's, the problem., Frank Holozubiec-, Co-, Chair: We've, gotten a bunch of applications through these spaces. Over this space. Over the past couple years., And people have claimed that enclosure is illegal., Frank, Holozubiec-, Co-, Chair: Because. It raises the capacity above 75 and therefore you need a public assembly permit into two exits and all this stuff has, has anyone walked into whether that back room is can be legally used. Like that. Kevin, Marcel-, Applicant: It can be, I have to just have to make sure will. I just have to make sure one other person real quick. But. Supposing up, it can be in a fact that it's been it's been with the property for since Kevin Marcel- Applicant: I've got to make sure Kevin, Marcel- Applicant: To make sure I do not Christine Berthet- Committee Member: Know,, but the issue is not it's not completely. Just the property. The issue is that it's a fire regulation. Christine Berthet-, Committee Member: Also. Do not. If you have people in the back and you have people in the font. Kevin Marcel-, Applicant: You. Remember when Christine Berthet-, Committee Member: You do not have enough energy to satisfy the fire. Regulation. So, it's very important that we keep your customers safe and that we have the white, you know. Exit, Christine, Berthet-, Committee, Member:, For, all the people, so that is the issue. One of the issues for this,. The use of the backyard. Christine Berthet- Committee Member: I think there would not be enough exits for everyone. Frank, Holozubiec-, Co-, Chair:, So,, Burt, Lazarin-, Co- Chair: The last factor is that he used was the fact that it's existed for X amount of years.. Does it make it legal Burt, Lazarin-, Co-, Chair: What, might have been illegal from the beginning. Christine Berthet- Committee Member: And, dangerous endangered., Frank, Holozubiec-, Co-, Chair: So couple things., Frank, Holozubiec-, Co-, Chair: Our district manager is, as is working with the fire department. Frank Holozubiec- Co- Chair: To find out. If this is legal or not. And, then the last time we had an applicant for this space. The applicant agree to the following applicant will not use the enclosed rear, yard. Frank, Holozubiec-, Co-, Chair: Until, the Department of Buildings issues, a certificate of occupancy or other approval of use of the space and we'll notify MC. Before of the certificate. Kevin,. Are you, okay, with that. Kevin Marcel- Applicant: Tomorrow,, with it. Okay. Christine Berthet- Committee Member: No Kevin it. So? What is,? What is the name again of the previous owner of Marissa,, is he,? Is he part of your corporation. Are you going to have a corporation is the part of the corporation? Is the funding is giving you any funding. Kevin Marcel- Applicant: He that purse? I do not know. Bassam I have I, never really met him. I know from here and from what everybody says that he's been around. Um so far, enough, but he's not part of me. He's, not part of he's, not part of is not part of my Kevin empire restaurant. Frank Holozubiec- Co-, Chair: So. What's going on. Frank Holozubiec- Co- Chair: Renovations, going on in that space, now. Kevin Marcel-, Applicant:, We're, just, I'm, just trying to change the I'm. Just changing. I was just trying to change everything out, as in doing the I was just doing the front: facade. Frank, Holozubiec-, Co-, Chair: Okay,, but you're doing that, yes,, because, as you might have heard, we got an email from a community member who said she went over there today and best them. Was there is. Does that make any sense. Kevin Marcel- Applicant: No? Unless he's is he was, he end up building, or was he just they're outside Frank, Holozubiec-, Co-, Chair: I? All I know is that she said she went over to and he was there. Kevin Marcel-, Applicant: Is, so fun up like because my jam, even like that. I'm, I'm in radical Street from the property. Yesterday I was outside,, but I did not see this man. Christine Berthet- Committee, Member:, But, I mean,. You have not seen him in months. Right., Kevin, Marcel-, Applicant: I have not seen him in months actually have Kevin Marcel- Applicant: Do, not Kevin Marcel- Applicant:, Come, up., Frank, Holozubiec-, Co-, Chair: Would. You recognize him., Kevin, Marcel-, Applicant: I know he looks like I seen, I've seen a picture of him. Frank Holozubiec- Co-, Chair: Alright,, so we use stipulate the way the prior guy did: Frank Holozubiec-, Co-, Chair: The former operator at this location best some Q Frank, Holozubiec-, Co-, Chair: Catch will have no involvement, whatsoever,, financial or otherwise in applicants operations,, whether its owner manager, consultant or employee, and best some Q catches. No involvement with connected to our ownership interest in the applicant. What's, the name. Your company. Kevin Marcel- Applicant:, Kevin empire and Kevin empire restaurant. Yes. Kevin, Marcel-, Applicant:, He, he., Here, my,, my auto mechanic, restaurant, his workers. Frank Holozubiec-, Co-, Chair: Were, you were you, agree to those Kevin Marcel- Applicant: I do agree to it. Rob Walker- Committee, Member:, Hey Frank, I got a quick question., Rob Walker- Committee Member: Up front on between where the restaurant is and each space outside on the diagram is showing French doors. Rob Walker-, Committee Member: Is there any way to stipulating of having them shut. So the background noise does not bleed into the front Frank Holozubiec- Co-, Chair:, Yeah, I do not have this form in front of me. Did. He feel I Page, five or six and agree to that. Already. Christine, Berthet-, Committee, Member: Except,, except it's very,, it's very difficult to read. Christine Berthet-, Committee, Member: I have no other choice than writing out,, which I'm so sorry. Christine Berthet-, Committee, Member:, Right, I can't even figure. So. The cross is when you, when the cross means that's out and the,. The answer is the other one. Right. So for example,. We are yard. Okay,, so we are moving to the front yard, and he said, Christine, Berthet-, Committee, Member:, sidewalk, cafe. We were lucky can be applying for cyber Cafe. Now, in the future,, and you said yes. Oh, because,, because we have the front yard. Okay, and then only in liquor, license. Christine, Berthet-, Committee, Member:, Include. But. Then you say the cyber cafes not included in this in the liquor. License. So, I, Frank, Holozubiec-, Co-, Chair: Do, not understand that. Rob, Walker-, Committee, Member: Because. It looks like it's within the property line,, but it's French doors between the restaurant in the house. Oh. Rob, Walker-, Committee, Member:, No, I know that I'm just saying the answers. Christine Berthet- Committee Member: On. That list are a little confusing as African submitted. An application know it's in the front: yard. Okay. When the applicant vacate by 11 pm and it says no. So,. Can you help me about Am I supposed to read the column which is cost or the column which is not cost.? Christine Berthet-, Committee, Member: It looks like all the answers are: wrong. Frank, Holozubiec-, Co-, Chair:, I, think, I. Think the exes mean it's the one he's agreeing to Right. Christine Berthet- Committee Member: Given Kevin Marcel- Applicant: A, which page. Christine Berthet- Committee Member: Page Six. It's got you. Frank Holozubiec- Co- Chair: Know, page sex, Rock, Cafe page., Yeah., Kevin, Marcel-, Applicant: It's, a sidewalk cafe. Frank, Holozubiec-, Co-, Chair:, rebate, Page five Christine Berthet-, Committee, Member: Well, both. I mean both Frank Holozubiec- Co- Chair: Have, a sidewalk cafe. Kevin, Marcel- Applicant: I do not have a sidewalk cafe. It was pretty much applying for one,, but being a fact that I'm using the garden itself,, not the front of it. Itself. That's what I was. That's? What I was pretty much mentioned meant mentioning Christine Berthet- Committee Member: Still,. Could you explain when you made a course in the block which says? Yes, you meant. That's, what your choices. Kevin Marcel- Applicant:, Which black, exactly Five. Frank, Holozubiec-, Co-, Chair:, Yeah. Have! You read the rear yard policy. What's your answer: there. Kevin, Marcel- Applicant: outdoor space will fall. Thuy Pham- Committee Member: That's, actually paid six here. Frank Holozubiec-, Co-, Chair:, Oh,, sorry I'm, going by the number on our forum,, not the form,, not the Thuy Pham- Committee Member: Yes,, the actual form. Yeah. Kevin Marcel- Applicant: So, page six,, Frank Holozubiec-, Co-, Chair: Is, the sidewalk cafe page is Christine Berthet- Committee Member: Fine. Yeah,. It's page five of the form, page, five of the phone. Frank Holozubiec- Co- Chair: Maybe different everything done Kevin Marcel-, Applicant:, So, anyway,, so baseball for me is outdoor items or other dance.. I will Cafe. Christine Berthet- Committee, Member:, Right., Yes., Frank, Holozubiec-, Co- Chair: Which is what you have right: Kevin Marcel- Applicant:, Correct. That's. What I have Christine Berthet- Committee Member: Right. Go ahead, Frank., Frank, Holozubiec-, Co-, Chair:, The first question: as the applicant read MC before we are policy. Yes. Okay. So. By putting that x, you mad. Yes, yes. Kevin, Marcel-, Applicant: I, read that read the roof. I read the rooftop policy., Frank Holozubiec- Co- Chair: Okay. And. So that means you said yes, outdoor space., Frank, Holozubiec-, Co-, Chair: You agree to close it by 10 and 11 Frank Holozubiec- Co- Chair: For I. Only seated food service., Frank, Holozubiec-, Co-, Chair: If. You have music inside or windows and doors be closed,. You said: yes. Christine, Berthet-, Committee, Member:, No, standing space,. You said no. Kevin, Marcel-, Applicant:, Yeah,, no standing knows like Kevin Marcel-, Applicant: It's like saying Kevin, Marcel-, Applicant: Let's, say the bar. That's right down right down the block. They have people who actually just stand. They have the tables where they just stand and sit the way they have the tables where you just stand. Okay,. It's not that Inge Ivchenko- BLP Public Member: I'm, not doing, you're, going to have seated patrons everything. I see the Christine Berthet- Committee Member: Answer should be yes. Then on this one. Frank Holozubiec- Co- Chair: Yes, that you Frank Holozubiec- Co- Chair:, won't allow people to stand. Frank Holozubiec- Co-, Chair: racks, rack. So. The answer is yes. And, then there'll be no music right. You said: Kevin Marcel-, Applicant:, Music, no music, outdoors., Frank, Holozubiec-, Co-, Chair: But. You mean yes, you agree, there'll, be no music. When we do Kevin Marcel- Applicant: Will, there be no amplifying music. Okay,. So that's what got me a little confused. Kevin Marcel- Applicant: About thinking, Frank Holozubiec-, Co- Chair:. Both of those are actually yes, yeah, okay, Christine Berthet-, Committee Member: So. We need to add something about the open doors,, but the doors are on pitch for then right: Frank, Holozubiec-, Co-, Chair:, On, right, Christine, Berthet-, Committee, Member:, We have,. Where are the tools to this question because you have Kevin Marcel- Applicant: He said, using building design. Yeah. Christine Berthet- Committee Member: Yeah yeah, Frank, Holozubiec-, Co-, Chair: Close them. Whenever there's music played inside and after 10 and 11 Inge Ivchenko- BLP Public, Member:, That's, perfect., Christine, Berthet-, Committee, Member: Right, any cost. Yes,, which is good. Christine Berthet-, Committee, Member:, That's, fine. I was just so confused. I mean, I think we need to make sure Kevin, Marcel-, Applicant: You know what it is when it came to amplify. I'm thinking, I'm thinking more like a like a big base where I'm just, I just have like more sneaky. Christine Berthet-, Committee Member: We. Go to Frank Holozubiec- Co- Chair: Kevin, you're agreeing got any music at all outside Kevin Marcel-, Applicant:, Get, correct. I'm, not doing any music at all outside Kevin Marcel-, Applicant: Okay,, just Valley, this,. This block already has enough noise as it is. Christine Berthet-, Committee, Member:, Oh,, please., Yeah., Christine, Berthet-, Committee, Member: And. Then, if you do a Christine, Berthet-, Committee, Member:, Open, 90 degrees, open street, open dining,, whatever., Christine, Berthet-, Committee, Member: Will, you put that if you put the tables in the in the street,, you want, put them on the sidewalk. Right, right. Kevin Marcel- Applicant:, Yeah,, yeah., Because I. Seen that the sidewalk, we have those. I will. It came. It's, like a favorite to people already on. This is Christine Berthet- Committee Member: Nothing on the sidewalk. Yeah. Kevin Marcel- Applicant: Now. Whenever I would never do. That. Okay., Christine, Berthet-, Committee, Member:, So I'm good with a friend,. Could we make a note somewhere that the exes mean you know the X. I mean,? It's very confusing. Frank Holozubiec- Co- Chair: I Christine Berthet- Committee Member: Look, like they are right. Okay. Frank, Holozubiec-, Co-, Chair:, So Burt,? How do we? How do we deal with the best some issue on this one? Because he, you know, he's had a closer connection and you know: we've had other applicants that we've Frank Holozubiec- Co- Chair: Treated Christine, Berthet-, Committee Member: Us, to bring it up.. Burt Lazarin-, Co-, Chair: Oh, has been mentioned. Burt Lazarin-, Co-, Chair:, Yeah, and Burt Lazarin- Co- Chair: stipulate Know connect, no connections at all, right. Frank, Holozubiec-, Co-, Chair: The last applicant. Here our letter was as Christine remembers and outright denial,. Unless the SLA can Frank Holozubiec- Co- Chair: Determine, there's no best of connection. Christine Berthet- Committee Member: What, Frank, Holozubiec-, Co-, Chair: If. They determined that it becomes a deny unless what Christine, Berthet- Committee Member: You should do the same. Thing. Frank, Holozubiec-, Co-, Chair: The same way: Inge Ivchenko-, BLP, Public, Member: Because. It was one of his restaurants. Burt Lazarin- Co- Chair: Yeah,. This was his Yes,, which is different than acrosss. The street. Frank Holozubiec- Co- Chair: Correct. Okay. Christine Berthet- Committee, Member:, Yeah., Burt, Lazarin-, Co-, Chair: It's. Also, the issue that you raised: Frank Burt, Lazarin-, Co-, Chair:, That Kevin- has to bring up with his lawyer. Burt Lazarin- Co- Chair: The issue. Burt Lazarin- Co- Chair: Loud, in that the possibility that no one is allowed.. Another liquor license in that space. Until two years, passes. Frank Holozubiec-, Co-, Chair: Unless. They get a waiver from the sky. Inge Ivchenko- BLP, Public, Member:, Labor, right, Frank, Holozubiec-, Co-, Chair: I. Do not think we have to stipulate to that. That's. The SLA will do that. Christine Berthet- Committee, Member:, Yeah., Frank, Holozubiec-, Co-, Chair: I. Think we just Burt Lazarin- Co- Chair: Have that Kevin, you should bring that up with your lawyer. Inge Ivchenko- BLP Public, Member: Your lawyer should know this. Frank, Holozubiec-, Co-, Chair: And, as I said,. You should really try to look at why you you're agreeing to work with the DMV to figure out if the rear, Kevin Marcel- Applicant:, The, back., Yeah., Burt, Lazarin-, Co-, Chair: If, it's illegal., And, Frank, Holozubiec-, Co-, Chair: Our,. Our conditional approval is only that it's enclosed. If you, if you want to ever opened it up, you'll, need to come back to us. Okay., Christine, Berthet-, Committee, Member:, Listen,, but I think that's important for the lease. If. You have not signed the lease with the landlord, and I Kevin Marcel- Applicant: Have, not I, have not signed it. Yet. Christine Berthet-, Committee, Member: But. My point is that you should bring it up, that you can not use the back. Frank Holozubiec- Co- Chair: Or. It's going to be a much smaller place if the back is illegal. Christine, Berthet-, Committee, Member: That's. What I'm saying., Inge, Ivchenko-, BLP Public Member: It's, not save you on rent. Exactly., Christine, Berthet-, Committee, Member:, Yeah., Frank, Holozubiec-, Co-, Chair: That's. What we're trying to negotiation. Okay. Now,! Is there anyone from the community about this applicant. Nelly, Gonzalez-, MCB4: No,? No one has a raised: hand. Burt, Lazarin-, Co- Chair: Okay, thank you., Now, Frank, Holozubiec-, Co-, Chair: Committee,, or shall I summarize Christine Berthet- Committee Member: Ocean. Oh., Frank, Holozubiec-, Co-, Chair: Alright, so Kevin. These are the additional stipulations. Frank Holozubiec- Co- Chair: The very art will remain in closed, as is presently the case,. You won't use the rear yard until you get a certificate of occupancy or something from the Department of Buildings saying that uses legal Frank, Holozubiec- Co-, Chair: You'll. We change the two answers on page five,: that's a Frank Holozubiec- Co-, Chair: Yes,, there's no music, Frank Holozubiec-, Co-, Chair: And. To the extent you use any open streets,, you won't use the sidewalk,. You use the roadway only and there'll be no music whatsoever in any outdoor space for a Inge Ivchenko- BLP Public, Member:, Second,, Burt Lazarin- Co- Chair: was not fair. Burt Lazarin- Co- Chair: Abstain. Burt Lazarin- Co- Chair: Not eligible Burt, Lazarin- Co-, Chair:, Okay., Kerry, Keenan-, Committee, Member:, Good., Frank, Holozubiec-, Co-, Chair:, And, Kevin. Could. You maybe have, when you talk to your lawyer,, maybe have him reach out to Nelly and get my contact information, and maybe we can talk to him about some of these issues, just to make Kevin Marcel- Applicant: A profit. Okay. Frank, Holozubiec-, Co-, Chair:, Thank, you., Kevin, Marcel-, Applicant:, Thank, you,, everybody. Have, a good night. Burt Lazarin- Co- Chair: And thank you., Oh, yeah., Burt, Lazarin-, Co- Chair: Last time on our agenda,, some possible stipulations that we might want to consider for the open, dining Burt, Lazarin- Co-, Chair: Christina's, the author Burt Lazarin- Co-, Chair: And. You may want to introduce them, Christine. Christine Berthet- Committee Member: Okay,, so you will have the documents to based on Christine, Berthet-, Committee Member: My, understanding that the open dining is no permanent,, which is what Bill De Blasio said, and the Christine Berthet- Committee Member: Understanding. Also that the open dining is not going to come in front of us at the community. Board. I think that, just like we're talking about Christine Berthet-, Committee, Member:, You know, outdoor space,, maybe it makes sense to expand our outdoor space, a stipulation to include the open, dining and then ask the applicants to Christine Berthet- Committee Member: You know, comply with what we would prefer, especially because duty has not been very strong on the on certain item and it's very confusing between the SLA and Christine Berthet- Committee Member: And and do T, who is in charge and who has the guidelines. So. What I did is I took all the items that which are already in the footprints, which are already approved by which are in the duty. Guidelines. The complied with the get dirty guidelines. The tables on the sidewalk know curbside Christine, Berthet-, Committee, Member: Will. You leave eight feet of sidewalk.. We know that, except we are making it a little stricter than what it is. Today. If the table are located on the parking lane. Will you leave the sidewalk completely free. I. Think that NGO has embraced that Christine Berthet- Committee Member: We had a letter that we sent Christine Berthet- Committee Member: To, see before which says they should put their grab and go counter inside the establishment, so that there is no line outside and we have already voted on. That. Christine, Berthet-, Committee, Member: And. They are two new ones: here. Let's not discuss them, but I'll. Take them through. But the two new ones. I. Will you ensure that there is no standing patrons in Florida 20 feet on each side., Christine Berthet-, Committee, Member: And, the second one, with really limited number of table and chairs outdoors to a maximum number Christine Berthet- Committee Member: And we'll come back to that. The next one on the hours,. We will comply with you two hours of operation, which is I, think it's 10 and 11 like ours and Music Background The recommendation would be no music outside at all and Christine Berthet- Committee Member:, You know,. We have the choice between saying yes to outdoor space or not from the storefront or just new outdoor music. I would prefer. No, I do not. Music Christine, Berthet-, Committee, Member: No live entertainment., I'm, saying that because I'm 46Th Street, there is live, entertainment and the whole street is listening to that, and if windows are open and doors open, non preferred sound inside,, which is what we already have. Christine Berthet- Committee Member: So have all those things. They only three,, which are new, in a sense,, the first one is,. Let's talk to the music My recommendation is new outdoor music, Christine Berthet- Committee Member: This is something we have asked all the time. And. That's the law right, now. It's very ambiguous when they have the Christine Berthet-, Committee, Member:, Open, dining,, but I think it's,. It's a good idea to have new music, because when you have open music in one of them, since everything is open, the whole street as open. Music Frank Holozubiec- Co-, Chair:, Or, Christine, Frank, Holozubiec-, Co-, Chair: We're, not talking about a policy right, we're talking about adding a question. Frank Holozubiec- Co-, Chair: Yes,. The question could just be what we're asking people tonight, you know,. Would you agree not to have Christine Berthet- Committee Member:, Right,, exactly., Frank, Holozubiec-, Co-, Chair: And? Then we can discuss whether there should be an exception. Christine, Berthet- Committee, Member: Right, exactly. Burt Lazarin-, Co-, Chair: It's. The context of this is that the open, dining Burt, Lazarin- Co- Chair: They, do not have to come to us. Christine Berthet-, Committee, Member: Right,. Well, let's shoot it. And. When we asked Burt Lazarin- Co- Chair: Us,, we asked them, and again Burt Lazarin- Co- Chair: This is these questions will be thrown out at an applicant if they're coming for a restaurant., Burt Lazarin- Co- Chair: Right license and we will throw these out of them. Burt Lazarin- Co- Chair: Not, that I have to, and they want to go for open dining,. They have to come to us, but women to say to them,. If you go for open dining, Christine, Berthet-, Committee, Member:, Yeah., Burt, Lazarin-, Co-, Chair: Would, you agree to these Christine Berthet- Committee Member: Exactly. Just, like we did what was Burt Lazarin- Co- Chair: Your reaction. Burt Lazarin- Co- Chair: Yeah,, but we need to understand that they do not have to agree with us. Christine Berthet- Committee, Member:, Not, Burt, Lazarin-, Co-, Chair: To get the open, dining Christine, Berthet- Committee Member: Know, we're just,, just like in a lot of cases, we're asking them to do things which are stricter than the law, asking them to,. You know,, be nice to their neighbors and do not do this. Okay. Wendy, Gonzalez-, Committee, Member:, And, I agree with the front Christine Berthet- Committee Member: Yeah. Frank Holozubiec- Co- Chair: And. If they make a good case that it's not going to bother anyone know then then, you know,. We might not care if they have about so music Christine Berthet-, Committee, Member: Know. If it does not bother anyone. Yeah. Christine, Berthet-, Committee, Member:, Um,, Michael, Noble-, Committee, Member: Let them know that they do not have to say yes to these things. I mean, Michael, Noble-, Committee Member: Let's be serious. Now. Inge, Ivchenko-, BLP, Public, Member:, Yeah., Thuy, Pham-, Committee, Member: That's, a good point. Michael Christine Berthet- Committee Member: Well, no,, just like we are telling them. You know on sidewalk, cafe. We tell them it. We like it at 10 and 11, but that's not the law, and we have a discussion about that. Right. Michael, Noble-, Committee, Member:, Well,, yes., Christine, Berthet-, Committee, Member:, The same way that we know it's not Christine Berthet-, Committee, Member: It's, not a restriction right, notes, background only,, but we will have the same discussion without Burt Lazarin- Co- Chair: The can remember that we have no enforcement. Burt Lazarin- Co- Chair: Know,. We do not have to have any. They can come to us and say, oh, yeah, we like this,, would we do it. And? These are questions. We're throwing. Yeah. Right. And, then, six months later, when they actually go for the outdoor, dining Burt Lazarin- Co- Chair: And. They do not follow through all that says to us,. We have no ability to say, hey,. You said you were going to do. This. You did not. We have no enforcement to take it. The outdoor dining away from them. Burt Lazarin-, Co-, Chair: The only thing we have Burt Lazarin- Co-, Chair: Is, the next time they come to us for renewal. Christine, Berthet-, Committee, Member:, Or, anything Burt, Lazarin-, Co-, Chair:, Hey guys,. You lied to us. Christine Berthet- Committee, Member:, Right., Burt, Lazarin-, Co-, Chair: And. They say always getting. We just changed our Rob Walker- Committee Member: It's, almost like the same way with storm close enclosures., Right,, exactly., Christine, Berthet-, Committee, Member: It's, a lot. It's the same way for a lot of things. Christine, Berthet-, Committee, Member:, So my,. My next question us about limiting the number of table of chairs outdoor. If you heard the new, the second version open, dining version, two, zero., Christine, Berthet-, Committee, Member:, Is, they're all going to be allowed to up version. One zero. They were allowed to have chairs right in front of the footprint,. You know, their facade right in version two, zero. They are going to be able to expand on both side. Christine Berthet- Committee Member: Right, okay. Burt Lazarin- Co-, Chair: To the, to the press,. They can expand. If there's a dress shop. Next door. They can put tables in front of the trash. Frank Holozubiec- Co- Chair: Right,. They need Frank, Holozubiec- Co- Chair: Them. Burt Lazarin- Co- Chair: As well, yes. Frank Holozubiec- Co- Chair: Landlord of Christine Berthet- Committee Member:, Jason's, probably., Yeah,, obviously., But. Here's, my question. So I, have somebody on my blog, which is like that. They have a restaurant, which has about essentially five tables. Christine Berthet- Committee Member: And. The outdoor space is like 20 tables and I'm, posing the question to you. Does that bother you or not. I mean,. Let's assume they have. Everybody has like a hole in new,. You know, a hole in the wall. Christine Berthet-, Committee, Member: And, then outside are using an enormous space. And I just, I have mixed feelings about that. But I, whatever the committee, decides it's fine with me. Burt, Lazarin-, Co- Chair: It only bothers me if their neighbors above it. Christine, Berthet- Committee, Member:, Correct., Okay., Inge, Ivchenko-, BLP, Public, Member:, All, right, I just had Inge Ivchenko- BLP Public, Member:, A months of complaints on a restaurant, Bert may know of it. Inge Ivchenko- BLP Public Member: It's on 23rd STREET, AND, IT's, OUR, NEIGHBORS., Inge, Ivchenko-, BLP, Public, Member:, The towers,, one of the Inge Ivchenko- BLP Public Member: Restaurants was expanding their outdoor space under the scaffolding, and in the street, beyond their storefront or restaurant front. To a for lease wine, shop. Inge, Ivchenko-, BLP, Public, Member: That's, no, not empty,. Right now we finally complained. So many times they have retracted their tables. At least the other day when I saw it.. I do not know if they're going to expand again, but they pulled back because there were enough complaints., Inge, Ivchenko-, BLP, Public, Member:, I, think Inge Ivchenko-, BLP, Public, Member: That has to come from the people. It's bothering Thuy Pham- Committee, Member: So. It sounds like I hear three different issues: here. One is that if we expand to both sides- and we get permission of the neighboring vendor. Thuy Pham- Committee Member: We still have to ask the vendor next to that. Without that table space if it bothers them. The. Second one is: if there's vacant space commercial space,, you really can't get permission from anybody. So. What do you do in that? Situation. Inge Ivchenko- BLP Public, Member: And, the landlord. Burt Lazarin-, Co-, Chair: The last one. Inge, Ivchenko-, BLP, Public, Member: It's, the landlord space. Thuy Pham-, Committee, Member:, Right and but then the third one is. If it's not the vendors or the landlord space complaining about a nice, the general public,, then it feels as though Thuy Pham- Committee Member: It's an IT DEPENDS situation. You might have a community that says we love this restaurant and we loved them to expand to a vacation spot and you might not Frank Holozubiec-, Co-, Chair:, I, say Frank, Holozubiec-, Co-, Chair:, I think we're. Assuming that the complaints would come from the neighboring buildings,, not the Christine, Berthet- Committee Member:, Residence. Yeah,. It could be the wisdom, something Frank Holozubiec- Co- Chair: Commissioning was talking about. Frank Holozubiec- Co- Chair: She lived in a building where this restaurant that occupied one small part of it, was just expanding beyond it, and the residents did not want it. To. And they were the ones complaining. Inge, Ivchenko-, BLP, Public, Member: They complain so much that the landlord. Finally, I think, said, move your tables back Frank Holozubiec-, Co-, Chair:, You, know, I,, you know,, and that's you know that I think those are the people who have sort of standing to complain if you will. Frank, Holozubiec-, Co-, Chair:, Yeah, I do not know what I think about some general public person who live 20 blocks away,, who said, hey, I, think they're taking up too much room. I mean,, Inge, Ivchenko-, BLP, Public, Member:, So yeah,, that was Christine, Berthet- Committee Member: What I'm hearing is that we do not want to ask that question. That's none of our business. And we're going to let the neighbors decide. Inge Ivchenko- BLP, Public, Member: I, think so. Frank, Holozubiec-, Co-, Chair:, Yeah., Inge, Ivchenko-, BLP, Public, Member:, Because, I, think so., Frank, Holozubiec-, Co-, Chair:, The, whole purpose of the City's real change was to give these places more space., Frank Holozubiec- Co- Chair: Oh, yeah, though,, you know,, where we know things are potential problems like music. I, do not mean I, do not mind being potentially more discouraging. Christine Berthet-, Committee, Member:, Right., Frank, Holozubiec-, Co-, Chair: We do not necessarily know this is a problem in all or even the majority of cases,, so Kerry Keenan-, Committee, Member: I think we should be on the side of giving everybody as much of a chance as we as we can. Christine Berthet- Committee Member:, Okay., Christine, Berthet-, Committee, Member: And, the third big question is,. Will you ensure that there are no standing patrons in front and 20 feet on each side. The idea? Being,? We do not want to have a Q there. Christine Berthet-, Committee, Member: Is in the middle of the sidewalk, obviously, waiting for good. Getting into the you know the question which is in the parking lot, right. Frank Holozubiec- Co-, Chair:, There., Christine That question the comment. I heard from a lot of operators when Frank Holozubiec-, Co- Chair: The governor came up with that. You have to take care of the hundred feet on each Frank, Holozubiec- Co- Chair:, Was that,, you know,. What do you do if we have a restaurant, you know, next to each other,? You know, you're, asking operator A to monitor this stuff in front of operator, be you think of nine. Christine Berthet- Committee Member: So,, but let me ask a question. So. Let's assume you have the restaurant inside the sidewalk and the restaurant outside. Right. And. Let's assume now we were talking about ramen. Let's, assume that you have a Q there on the sidewalk waiting for each side., Christine, Berthet-, Committee, Member: What. Would we do with we I think we should ask them not to be upstanding patron in their, in their space right. What Frank, Holozubiec- Co- Chair: If, it's clear. I, would agree with you if it's clear their patrons, like the robin line. Frank Holozubiec- Co- Chair:, Right. But. If there are just, you know, as we had the problems when we had, you know, the outdoor drinking Inge, Ivchenko- BLP, Public, Member:, Mm, hmm., Frank, Holozubiec-, Co-, Chair: Now,. If I have a restaurant here and you have Christine- have the one immediately Jason to me. And. There are 20 people hanging out in front of your restaurant. Christine Berthet-, Committee, Member: I, know Frank Holozubiec-, Co-, Chair: You know whose are they Frank Holozubiec- Co-, Chair:, You know,. That's the only issue I have with the 20 feet. Inge Ivchenko- BLP Public, Member:, Yeah., Christine, Berthet-, Committee, Member: Well,, but forget about the 20 feet. What about in front of their restaurant. Inge Ivchenko- BLP Public, Member:, If, Inge, Ivchenko-, BLP, Public, Member: I could be waiting. For. I could be waiting for the ramen. But I'm standing in front of you know: Frank's Inge, Ivchenko-, BLP, Public, Member: hotdog stand while I'm waiting for my ramen. BUZZER Inge Ivchenko-, BLP, Public, Member: Because. All right so got a better Christine Berthet- Committee Member: Beer. So. What I'm hearing is that this, this line with this question,? We do not want to ask. And the next question. We do not want to ask and the one we are going to be asking is the outdoor music and the other guys right, Frank Holozubiec-, Co-, Chair: Well,, let's hear from other people. I mean,. That was only a couple of us. Wendy Gonzalez-, Committee, Member: I would agree with that. I think that the spirit of people not blocking a sidewalk is actually what I would, I do not know. If it's a question or whether it's just an are just like we get into the habit of Wendy Gonzalez- Committee Member: Asking. If they have a plan for where people will stand, if they're waiting for takeout or where they'll stand up there, waiting for a table., Wendy, Gonzalez-, Committee, Member:, Is I, think that's the biggest impediments. If you have Wendy Gonzalez- Committee Member:, Tables weights, F1 back and forth. And now you've got people just standing. There. I think it's hard to implement like a 20 feet or any kind of like numerical perimeter on it, because every place is so different. So I'd be able to do a question. Around. Do. You have a plan for queuing, basically Frank Holozubiec- Co-, Chair:, Just, Burt, Lazarin-, Co-, Chair:, Like, yeah, I, like that phrasing. Yeah., Burt, Lazarin-, Co-, Chair:, Yeah,, very good. When. Do you think Frank Holozubiec-, Co-, Chair:, Makes, sense., And, Christine you'd also include all the justice confirm all the stuff to do. Trt requires right that was around Controversial Christine Berthet- Committee Member:, Well, I will see complete with you to guideline, because this is like five Frank Holozubiec- Co- Chair: Pages right yeah, but at the start. Questions on your list, we would still put in. Right. Christine Berthet-, Committee, Member:, Yeah yeah. Exactly all those all those questions would be in, and I would suggest to expand.. We could either expand the outdoor space section, because we have a lot of redundancies you or we can have a support. Page. Frank, Holozubiec-, Co-, Chair:, Oh,, yeah., Sabrina, Reveron-, Committee, Member: I have a question.. You said that about the did live music, Sabrina, Reveron-, Committee, Member: That is in terms of the time that would happen, or just in general, having outdoor music, Sabrina Reveron-, Committee, Member: Or performance or any Kind of, yeah I entertain. Christine Berthet- Committee Member: I meant in general,. We have had we dealt with one bar nine and people,, which are leaving around bar nine, and we got 25 3040 emails right from the had a live performance outside and speakers and everything and it was driving everybody nuts. I was on 46Th Street and Sabrina Reveron- Committee Member: I mean I. Would not, I would not be comfortable with saying that I do not I do not want it, because I think that's an opportunity for the artists that are, you know, striving right now, there's really difficult. I would just put it as a time like okay, Inge, Ivchenko-, BLP, Public, Member:, Do, it., Sabrina, Reveron-, Committee, Member: From, this time to this time,, and then we are conscious of the neighbors outside, like Sabrina Reveron- Committee, Member:, And honestly,. Even for us,, like you said, these directions. It's, just God. So I have a dinner. Have somebody who's playing chess or Sabrina Reveron- Committee Member: I? I think that the city,, especially the arts. Right. It's, really struggling with that sense. So I, think I would just stipulated in a time they'd like. Okay. This can now go further than 9 pm or 10 pm. Sabrina Reveron-, Committee, Member: So, just Frank Holozubiec-, Co-, Chair:, I, guess the way I see it is sort of the way we handle indoor music. Now. We have the questions. You know, you're, going to have background. Music live music DJ, and we use that as a starting point for discussion. Frank, Holozubiec-, Co-, Chair: If, they say they're going to have live music, Frank, Holozubiec-, Co-, Chair:, You know,, we say, well,, when Sabrina Reveron-, Committee Member: How many pieces. It will be like a stipulation. Okay,. You have live music arranging this time. Frank Holozubiec-, Co-, Chair: It won't be a question that says: will you agree to not have live? Music. It'll, be you know where you have outdoor music, but you have live music, they say yes or no. We, look at the form, and then we talked to them about it., Christine, Berthet-, Committee, Member: But. Under today on the outdoor space. We have a question: says, Christine, Berthet-, Committee, Member: Do. You agree not to have any music right do not. We have that Frank Holozubiec- Co- Chair: Right in the rear yard, we do. Christine, Berthet-, Committee, Member: Yeah, in the real yard, so Sabrina Reveron-, Committee Member: We, usually stipulate time Sabrina, Reveron-, Committee, Member:, Right,, like, Okay,. If you were going to have it. We're going to have it done this time. And during this time. Frank Holozubiec- Co- Chair: That's live music, indoors. Burt Lazarin- Co- Chair: Not on the outside. Sabrina Reveron- Committee Member: Not only are Christine Berthet- Committee Member: They on the outside. We do not have anything new music at all., Sabrina, Reveron-, Committee, Member:, Yeah,, I, Sabrina, Reveron-, Committee, Member: Mean,. These are different types: Christine, Berthet-, Committee, Member:, No, no. Obviously. Those questions are for the future. Christine Berthet- Committee Member: I agree with you that right, now., During Covid-19 nobody's going to go in and force anything, you know,, but these are more long time kind of Sabrina, Reveron-, Committee, Member:, I, see., Frank, Holozubiec-, Co- Chair: It probably needs a little more discussion, maybe, Christine,. What we do is put a line on page two,, where we currently have indoor arena, we're kind of music. Do you have,? We can have a line for outdoor and,. You know, just see what they say. Christine Berthet- Committee Member: Well, yeah,. Let's think about that, how Thuy Pham- Committee Member: About. If outdoor is meant not as we're yard, but outdoorsman as this. The parking space rather than the sidewalk space, right,, then the issue really becomes crowd. Control, though,, because you're going to have people not eating at the restaurant wanting to stop and listen. Christine Berthet- Committee Member: No, yeah, you have that,, then you have the other thing. I had on 46Th Street,, which is this entertainer was like 300 feet down: Christine Berthet- Committee, Member: And. We can hear ourselves. Everybody was,, you know,, everybody would clap. So. That was like the horse treat that become an entertainment space, which I do not know. I do not think that's fair. I mean,, especially because it's outside by Frank Holozubiec- Co-, Chair:, Everybody., Thank, you. Part of the problem. Is, you know,, the city and the SL A's regulations are so he'll formed about this. At the moment. Frank Holozubiec- Co- Chair: Like, the SLA says you can have live music outside. As long as it's incidental to dining, Frank, Holozubiec-, Co-, Chair:, showtimes and tickets and I mean it's sort of so crazily vague. Frank, Holozubiec-, Co-, Chair:, You know,. It's getting late. Why do not Christine Berthet- Committee Member: We,. Why do not we make a draft and ask the question, right. Christine Berthet- Committee Member: I'll, send it around, right. Inge Ivchenko-, BLP, Public, Member:, And I. Also think,, you know,, the problem. Another problem we've encountered in my neighborhood. Is the you've got the they're taking up the sidewalk space,, then there's a sidewalk shed. Inge Ivchenko- BLP Public Member: And, then they've got the street. Inge Ivchenko- BLP Public Member: So. There's almost no people can walk,, but anyone in a wheelchair can barely get through because of the polls in the middle, from the sidewalk shed. Inge Ivchenko- BLP, Public, Member: So. That's a huge problem that I've noticed and had a lot of complaints of in our neighborhood. Christine Berthet- Committee Member: This issue. The sidewalks are Inge Ivchenko- BLP Public Member:, Terrible. So. There should never be tables under the sidewalk shed,, which we've encountered and still are having a problem with, because there's no enforcement,, even though that's already Inge Ivchenko-, BLP, Public, Member:, Yeah, I, think that's already. Christine Berthet-, Committee Member: I think that's going to go away in six months. Christine Berthet-, Committee Member: Assuming that we are out of this problem in six months out of the coffee. You know, I, think some of those problems are going to go. Away. Inge, Ivchenko-, BLP, Public, Member:, Yeah,, I, Inge, Ivchenko-, BLP, Public, Member:, One restaurant in particular, really, they're not going to go away and the sidewalk sheds scheduled to be up for another year and a half. Christine Berthet- Committee Member: That's horrible. That Frank Holozubiec- Co-, Chair: Became, a big battleground at the restaurant Maria on Central Park South Inge, Ivchenko-, BLP, Public, Member:, Yes,, yes., Inge, Ivchenko-, BLP, Public, Member:, Situation., Yeah. And, we're having the same thing. There's just, it's, it's hard to walk through,. You can walk, but someone in a wheelchair. I do not know how they're going to maneuver through there. Burt Lazarin-, Co-, Chair:, Yeah., Christine, Berthet-, Committee Member:. For listening. Frank Holozubiec- Co- Chair:, So Christine, you Britain, I will work up a draft. Burt Lazarin- Co- Chair: Draft Frank Holozubiec- Co- Chair: Will send it to committee. And again,. If you could respond with any comments just to Burton me, because we do not want all email chain to turn into,. You know, a meeting of the entire committee., Frank Holozubiec- Co- Chair: And. Then we can go from there.. Yeah., Burt, Lazarin-, Co-, Chair:, Very, nice. And. This does not have to do the full boy. This is just amongst ourselves. Frank, Holozubiec-, Co-, Chair: Yeah,. This is just taking the form Right. Burt Lazarin- Co- Chair:, Okay. Okay,. Well, thanks everybody. Wendy Gonzalez- Committee Member: Thank, you., Good., Burt, Lazarin-, Co-, Chair: Night, everyone, Sabrina, Reveron-, Committee, Member:, Good., Night.,.",
            "summary": "Donald Bernstein- Attorney: Now we're realizing the importance of having outdoor space that is open to the public.\nOne is a change, a method of Donald Bernstein- Attorney: Operation to allow us to use that,, not just as a melody space,, but as a regular restaurant that serving meals, full meals, full menu.\nInge Ivchenko, BLP, Public, Member: Yeah, can I ask how so it had a capacity of 66.\nWe have approval of the license application by the State Liquor Authority,, but we have not pulled it because I'll tell us not opening Donald Bernstein- Attorney, Inge, Ivchenko, BLP, Public, Member, Inge, Ivchenko, BLP, Public, Member, The weather will be packed all the time.\nInge, Ivchenko, BLP, Public, Member: I do not know.\nInge, Ivchenko, BLP, Public, Member: Are. You currently using the street to help your business.\nOh, Inge, Ivchenko, BLP, Public, Member: Have, you set up in the street and the sidewalk.\nInge Ivchenko, BLP, Public, Member, I'm happy with this application.\nFangjian, Yuan, Applicant, No, music, so Christine Berthet, Committee, Member: It would be good to keep it that way, because it's normally it's not.\nTalking about this issue of the queue and the line on the sidewalk and look at your plan, the map of your restaurant,, and it seems that your Christine Berthet- Committee Member: And I.\nOkay,, so you're going to use the open this street space for extra tables, but not the sidewalk.\nIvchenko, BLP, Public, Member, Okay,, so you'll agree to a stipulation that you'll have no music in the end, after space.\nPham, Committee, Member, Only 25% capacity indoors is maybe you could have a reservation system where you have people only use Open, Table, and that way People know that they really can't congregate, so to speak.\nI do not know if it's, because there's too many people or whatnot, but I will talk a little bit about the general parameters of the proposed application and then Maston Sansom, Attorney: : Hold on one second.\nThe music noise travels it's down to 59 The voice levels after travel or Al Going inside an open, window, believe it or not, the sound level, drops.\nNot, that they would just be inside and it would leak out when they would be basically hardly any sound from music going outside Now. Three feet,, as we all know from Covid-19, is basically like one arm's length: away.\nYeah, I mean,, you know,, because in order to open up,, you have to open large portions Maston, Sansom- And, it's not like you, can just open up a little window and hold most of the sound The purpose of the role of cover Chair: I did not make to make it a big issue.\nI think it would be behoove all of us to separate your second floor into the inside and outside Christine Berthet- Committee Member: All of those things we are discussing new music,, blah,, etc.\nWait, down second floor inside second floor outside Christine Berthet, Committee, Member: Yeah thing that distinguishes it from the true inside space.\nWindow Al has to still put Inge Ivchenko- BLP Public Member: limiters on the indoor sound.\nAl, Fierstein, Correct., Frank, Holozubiec, Co, Chair, OK,, so you'll agree that our advisors report and Inge, Ivchenko, BLP, Public, Member, Al, Fierstein, Can, you remind me how long they take the open and close like to take 10 minutes to take two minutes.\nFrank, Holozubiec, Co, Chair, Report and all doors and windows from the inside space to the relic covers face will be kept closed at all times after Frank Holozubiec- You had that revision of the gender of the limiter.\nWe have about 15 tables and we're looking at sitting about 25 Chi Sum, Ngai, Applicant: Chairs, and it will be music that is going to be played on a Sonus right.\nWe might look into open the open the restaurant application where we can apply for St, seeing Frank Holozubiec, Co, Chair: I.\nWe got one email from a community board member saying that they're already for licensed bars and restaurants on this block.\nYou know, full bar, and they think that block is getting over saturated Christine, Berthet, Committee, Member, Is, you say you're going to have the vestibule a storm, enclosure.\nClubs are those large plus two, you know, Christine Berthet- Committee Member: Enclosure, which are the door of the restaurant.\nWe definitely have more than eight feet of space for people to Christine, Berthet, Committee, Member, Write.\nChi, Sum, Ngai, Applicant, Is, no music, Christine, Berthet, Committee, Member, And, no sidewalk cafe or if it's in the street right Chi, Sum, Ngai, Applicant, Yes, No cell cafe as well.\nA business, starting at 7, am on music off at seven and Saturday or Sunday on Mote It Be, not more Rob, Walker, Committee Member, respectful to the people in the building to maybe started like eight or nine Monday through Friday and on weekends,, maybe like nine or 10.\nMy point is that once you put the Christine Berthet, Committee, Member, The tables and chairs in the street.\nNelly, Gonzalez, MCB4: I have two people with their hands: Inge Ivchenko, BLP, Public, Member, Go ahead and speak.\nLicense and have a private event with live music or DJ Frank Would it help if they agreed to keep the rear door closed, you know.\nI mean, Inge, Ivchenko, BLP, Public, Member: No one should be going into the backyard.\nSo you're, saying you're not going to utilize that space at all out: Front, um,, Rob, Walker, Committee, Member, I, Diego, Enrico, Malta- Applicant: was aware that there was like five tables outside Diego Enrico Malta- Do, not those are on private property.\nThe main attraction will be the main dining Christine, Berthet- Committee, Member: It. This, is not covered by the application, right.\nApplicant: It's around 3040 people maybe, you know,, Burt, Lazarin, Co, Chair: I can answer that opening up Diego Enrico Applicant: I want to be ready as soon as Broadway gets on so you're able to open the doors.\nI, mean,, there's even through Covid-19 Grace Millo: But I really want to be respectful of the city, opening There are times even a noise machine or I have five do not cover the sound, especially live music.\nFrank Holozubiec, Co, Chair: They're, going to correct pages two and five of the Strip form to show that there are some outdoor seats within the property line, not on the sidewalk, and those seats will be closed and vacated no later than 10 pm.\nApplicant: Are, you doing I read Burt Inge, Ivchenko, BLP, Public, Member: My Frank Palillo: My work.\nMichael, taken over the old spoon Fed space on 51St Street, is opening Italian restaurant with his family, members.\nInge, Ivchenko, BLP, Public, Member,, Michael, Mastro- Applicant: We do hire, everybody.\nI just want to let you know, because these people do not seem responsible, Frank, Holozubiec, Michael, Mastro, Applicant: Going.\nFrank Palillo: That's an hour with their street have a problem with Inge If you're, going to use the street open street, which is good.\nInge, Ivchenko, BLP, Public Member: Keep, the sidewalks, completely open Frank Palillo: Whatever, you know, whatever the community board suggests, I'm, going to be good with Inge Ivchenko- BLP Public, Member, Thank, you.\n, Inge, Ivchenko, BLP, Public, Member, The, question I'm, 11 yeah 11 am to 12 Some issue.\nInge, Ivchenko, BLP, Public Member: It is Frank Holozubiec, Co, Chair, Steve also said he agreed to soundproof the second floor due to its proximity to residential units.\nIt's background music and 10 1112 o'clock or having people eating not Michael, Mastro , You know a bunch of kids rolling out of rolling out or wherever, and coming to make noise.\nYou leave a space if you use, for example, will insulation,, which is soundproof and fireproof and then, you know, Inge Ivchenko- BLP, Public Member: couple inches with the next layer of sheet rock.\nInge Ivchenko- BLP, Public, Member, I, thought that more space, you know, sort of room within a box within a box gives you more soundproofing, but Rob Walker, Committee, Member: Nobody it, BLP, Public, Member, Right., Rob, Walker, Committee, Member, Just basic app actually is good because it installation, as well as it stopped sound.\nIf the restaurant before had pose a problem or noise problem, we're doing Inge Ivchenko- BLP, Public, Member, Right,, right.\nInge, Ivchenko, BLP, Public, Member, Can. We, just add one thing with restaurant trash that it will be taken: care, of.\nInge Ivchenko- BLP, Public, Member: It's see it's not our space for renovating yet.\nGood, with the I'm good, with the landlord like Michael Mastro, Applicant,, You, think someone, nice Inge, Ivchenko- BLP, Public, Member: I'm, still going to follow Christine's motion and second.\nThis, is your first question, Kevin Marcel- Applicant: This is my first festival: Christine Berthet- Committee Member: He had operated and where it was closed down from the SLA Kevin.\nI want to say, not a stupid before after the sidewalk and stuff,, because I know, Your garden in Christine, Berthet, Committee, Member, The, front.\nOkay,, so we are moving to the front yard, and he said, Christine, Berthet, Committee, Member, sidewalk, cafe.\nSo, page six,, Frank Holozubiec, Co, Chair: Is, the sidewalk cafe page is Christine Berthet- Committee, Member, Fine.\nChristine, Berthet, Committee, Member, No, standing space.\nWhenever, there's music played inside and after 10 and 11 Inge Ivchenko- BLP Public, Member Right, any cost.\nThe SLA can Frank Holozubiec- They determined that it becomes a deny unless what Christine, Berthet- Committee Member: You should do the same.\nInge Ivchenko- BLP, Public, Member, Labor, right, Frank, Holozubiec, Co, Chair, I.\nInge Ivchenko, BLP, Public, Member: You should really try to look at why you you're agreeing to work with the DMV to figure out if the rear, Kevin, Marcel, Applicant, The, back.\nYou use the roadway only and there'll be no music whatsoever in any outdoor space for a Inge, Ivchenko- BLP, Public, Member, Second,, Burt, Lazarin- When you talk to your lawyer,, maybe have him reach out to Nelly and get my contact information, and maybe we can talk to him about some of these issues, just to make Last time on our agenda, some possible stipulations that we might want to consider for the open, dining Burt, Lazarin- Co, You may want to introduce them, Christine.\nMy, understanding that the open dining is no permanent,, which is what Bill De Blasio said, and the Christine Berthet- Committee Member: Understanding.\nJust like we're talking about Christine Berthet, Committee, Member, You know, outdoor space.\nThe tables on the sidewalk know: Curbside Christine, Berthet, Committee, Member: You leave eight feet of sidewalk.\nThe second one, with really limited number of table and chairs outdoors to a maximum number Christine Berthet- Committee Member: The recommendation would be no music outside at all and Christine Berthet-.\nLet's talk to the music My recommendation is new outdoor music, Christine, Berthet- Committee Member: This is something we have asked all the time.\nIt's very ambiguous when they have the Christine Berthet, Committee, Member, Open, dining,, but I think it's.\nWe might not care if they have about so music Christine Berthet, Committee, Member: You know on sidewalk, cafe.\nThe outdoor space is like 20 tables, You know, a hole in the wall.\nInge, Ivchenko, BLP, Public, Member: It's, the landlord space.\nInge, Ivchenko, BLP, Public, Member: They complain so much that the landlord.\nI mean,, Inge, Ivchenko, BLP, Public, Member, That's, none of our business.\nInge, Ivchenko, BLP, Public, Member, Because, I, think so.\nInge, Ivchenko, BLP, Public, Member, Because, I, think so.\nThere are just, you know, as we had the problems when we had, you know, the outdoor drinking Inge, Ivchenko- BLP, Public, Member, Mm, hmm.\nInge Ivchenko- BLP Public, Member, What about in front of their restaurant.\nFrank's, Inge, Ivchenko, BLP, Public, Member: hotdog stand while I'm waiting for my ramen.\nBUZZER Inge Ivchenko, BLP, Public, Member: We do not want to ask and the one we are going to be asking is the outdoor music and the other guys right, Frank Holozubiec, Co, Let's hear from other people.\nI think that the spirit of people not blocking a sidewalk is actually what I would, I do not know.\nI would just put it as a time like okay, Inge, Ivchenko, BLP, Public, Member, Do, it.\nThey say they're going to have live, music, Frank, Holozubiec, Co, Chair, You know,, we say, well,, when Sabrina Reveron, Committee Member: How many pieces.\nAs long as it's incidental to dining, Frank, Holozubiec, Co, Chair, showtimes and tickets, Inge Ivchenko, BLP, Public, Member, And, I.\nChristine Berthet- Committee Member: This issue.\nThe sidewalks are Inge Ivchenko, BLP, Public, Member, Terrible.\nInge, Ivchenko, BLP, Public, Member, Situation."
        }
    }
}