{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB5",
            "channelId": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "title": "August 25th",
            "publishDate": "2020-08-26",
            "shortDescription": "See agenda here:\\nhttps://www.cb5.org/cb5m/calendar/2020-september/#budget-education-city-services",
            "lengthSeconds": "1:56:38"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB5",
            "normalizedName": "Manhattan Community Board 5",
            "twitterName": "Community Board Five",
            "youtubeChannelName": "Manhattan Community Board Five",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "twitterHandle": "@ManhattanCB5",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "Z1YnL2Bq23U",
            "fillerWordCount": {
                "uh": 104,
                "um": 453
            },
            "readTimeFullTranscript": "63 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "budget": 99,
                "students": 42,
                "plans": 29,
                "pension": 28,
                "plan": 25,
                "university": 23,
                "dollars": 23,
                "agencies": 23,
                "employees": 21,
                "years": 20
            },
            "wordCountSummary": {
                "budget": 22,
                "students": 7,
                "university": 6,
                "facilities": 6,
                "dollars": 6,
                "safety": 5,
                "capital": 5,
                "hotel": 4,
                "agencies": 4,
                "accounting": 4
            },
            "fullTranscript": "Did I freeze on you, I think I did hello, hey you're frozen. Can you hear me? Yes, okay, you're back, hey, look, hey chuck, how's it going hey. Thank you happy summer, happy summer. Indeed, can you plug this in the other one to lift us on renee? Are you experiencing technical difficulties? I do not. Can you hear me we can yeah okay, yeah, there's something plug it in over there. Please yeah. Of course I am at this last minute. Yes, in time, let's see how that goes. Well, you can always stop your video and redo it hold on yeah. You can just press stop yeah and then you can retry whenever want. I do not know if I do not know if this is correlated, but I'm trying to stream this to youtube right now and it's not working. So I'm not sure if it's something with zoom or whatever my video is not is not coming on at all. Okay, that's! Okay! Let's just you know that should be fine. Should I should I try and go out and I'm sorry for the technical difficulties. Should I try and go out and come back in or should we start like this? I'm not sure what is the better, I'm not sure what the rules require. Julie. Do you want to advise? If you have any suggestions, I mean we can hear renee perfectly. I think it's just introducing our committee and introducing the first speaker. You know renee. If you'd you can exit and come back, I'm going to try and do that. I'm very sorry for the delay. I'm very sorry for the delay, I'm not quite sure I'm going to leave and come back. I'm very sorry I'll, be right back just for your knowledge. Laura Garcia is trying to enter the link, so I'm going to resend it hello, hi, I'm back vicki. I do not know what the protocol is for this. Can I continue or should I have Julie because you can see her? I think you can continue renee, I'm having trouble too. That must be one of those nights with cameras or something just yes, you can continue it's okay. I mean you know it's unavoidable, you're prepared to do it. You can run the meeting. Let's do it: okay, all right so Julie we have Quorum Luke that Julie, yes, okay, fabulous! Okay! I apologize. We will start. We will start right now. My name is renee kinsella, the person with difficulties and I'm the chair of the education and city services. Community five, which is Beck's for Short Julie Chu, is the is the co- chair of this committee and I'd like to thank all of you for attending this meeting, because traditionally CB5 you has no meetings in August. So I'm very grateful that you've made the time this evening. We have three items on the agenda. First is a presentation by New York University on its plan to temporarily house students in the W hotel at 201 park Avenue. Second, we have a discussion of the current budget and Community board budget requests. Our member Joe Mafia is going to present to us and finally, we have a discussion of sanitation in the district. Unfortunately, you may know that we've had to ha reschedule the small business initiatives that were to be presented, but this is going to be re- calendared and we're going to hear them at our next meeting. Brief overview of how we work, presenters are going to be introduced and they will have the opportunity to present to the committee and the public after their presentation is concluded. The committee will be permitted to ask questions of the presenter and, when all of the committee's questions have been answered, members of the public will be permitted to ask questions of the presenter. I'm going to do something a little different tonight for members of the public and ask that they put any and all of their questions into the chat function and we'll answer them in the order that they're received in the chat function. It will just make things easier and quicker and we can all see the questions and answer them once all of these questions have been addressed, the committee will go into business session and this is when only members of this, the Vex Committee discussed the issue amongst themselves and they determine what action to take. Bex is a little bit different from some of the other committees in that we do not have applications. So our determinations are not as straightforward. We may decide to draft a resolution or we may decide to seek further information or just simply use the presentation to inform our collective knowledge going forward with. This is what we're going to do tonight, for instance, in the case of Nyu, in the instances where the committee's the committee does decide to draft a resolution, it's then voted upon by all the present numbers of bex and then, if it passes, it's presented to the full Cb board for a vote and that vote is the final position of the board. As I mentioned, our next board is not until September 10th, so anything we do tonight will not be heard and actioned by CB5 until that time again, though, we do not have any resolutions for this evening. A few reminders there's only so much time we can stare at a screen so and I do not want to lose quorum. So if you have a question, that's already been asked, or if you agree with a particular position, there's no need to reiterate. It simply say you agree, please be respectful of everyone in the room and wait for acknowledgement from the chair before speaking. Thank you all we're going to start with New York University. We have with us Valentin the assistant director of Nyu, Community, Engagement and Christopher, the assistant director of Nyu government affairs. I very specifically did not say their last names in order not to mess them up they're going to introduce themselves so Valentina, I'm going to hand the meeting over to you wonderful. Well, thank you both thank you, Renee and Luke. So much for having us tonight. We're really excited to be able to share with you what the university is doing. My name is Valentine Goldstein and I'm the assistant director of community relations and I'm going to speak first, just kind of briefly about the university's reopening plans and then I'll pass it over to Chris who's, going to speak more specifically about the hotels program. I think, firstly, the term reopening or is a little bit misleading, because the university never officially closed. Even in March, when we sent students home, we still had about 11,000 employee, essential employees who remained on campus to work and who are still working today. So rather we're referring to this as nyu returns. Since we're not, we did not close and, as I said, I just want to provide a brief overview of the strategies that the university is implementing to safely bring back our students, faculty and staff to the community. We understand that no one intervention will be enough and have instead established layers of safety to prevent the spread of Covid-19. We appreciate the great work that New York has done to bring the numbers down, and we only want to add to that end in terms of external guidance. Nyu has consulted various state and national bodies to develop its strategies. These include the CDC, the New York State Governor's office and the commission on independent colleges and universities, among others, like all other higher education institutions in New, York State Nyu, is required to submit a plan to the governor's office for review. In order to return, a plan includes parameters for reopening monitoring, containment and shutdown. If need be, I'm returning to the layers of safety that I mentioned before Nyu has developed strategies to address the most pressing concerns which include Covid-19, testing, contact, tracing quarantine and isolation, face coverings, physical distancing, reducing density and Nyu facilities, symptoms, screening, enhanced cleaning, education, awareness and, lastly, compliance. So I'm just going to quickly or briefly go through each of those components. So you know a little bit more about what we're doing in order to achieve a positive result in each of those areas in terms of Covid-19 testing. Langone is managing testing for all employees who want to use them and they're providing results within 48 hours. As of August 25th, which happens to be today, all employees must submit a negative Covid-19 test before accessing any university facilities, as it relates to students all those residing in university. Housing facilities are required to get tested within 24 hours of arrival. We had a first group of students who arrived last week and we have another group arriving on the 31st and September 1st, so that will also pertain to these new students coming and then those residing outside of university housing are also required to present a negative test before entering any university facility, and we do have students living on campus, but the majority of our students do live off campus. So we are, you know, aware of the policies and procedures that we're putting in place and making sure they apply to all, not only those in our residence halls and then throughout the fall semester, the team will conduct ongoing testing. This will be randomized sample of students, faculty and staff, which will happen. Weekly participation is mandatory. This will allow the university to both identify asymptomatic community members and track cover 19 prevalence throughout the semester in terms of contact tracing the Nyu Kovic 19 prevention and response team will oversee the university's efforts to identify and isolate members of the Nyu community, with confirmed cases of coba 19 and find and quarantine their close contacts we'll be coordinating with the city's efforts and their own tracing program to make sure that everything we're doing is aligned with what others are also doing in regards to quarantine and isolation. The university is currently setting aside five percent of its housing stock in residence. Also, it does not pertain to the hotels to quarantine and isolate students who become infected throughout the course of the semester, and as I mentioned, we had a group of students who arrived last week from restricted states or from international locations, and they were all required to quarantine for 14 days. So we currently have a group of about 2,600 students who are quarantining in our residence halls and that quarantine will end at the beginning of next week, so that they're able to attend the first day of classes on the second, in terms of covering face coverings and masks like most facilities, individuals will be required to wear a mask when inside Nyu building masks will be made available to all students, but they've also been instructed and recommended to bring their own face coverings in addition to Nyu facilities, because I know a lot of the questions we've been getting are. How are we going to implement this in the community? The university is also emphasizing the importance of following these safety guidelines when outside of our facilities in order to protect the community at large, I think physical distancing is pretty clear. Individuals are required to maintain six feet of distance. We've also implemented wayfinding signage in and around our facilities, so that we can help direct pedestrian traffic and make sure that individuals are following those guidelines in terms of reducing density in our buildings, we're reducing classroom capacity by at least 50 percent. In many cases, it's more than that students will be required to keep the same seat all semester so that we can make sure that they're a following those safety guidelines around distancing, but it also allows us to better contact trace because we can know exactly where an individual was and who was around them at the given time. Also, all non- essential large in- person, events have been prohibited for the beginning of the semester and will reassess, as the semester goes on, to see where we stand and then also we are reducing our capacity within our residence halls by about 40 to 45 percent. So all of our housing stock currently is going to house our undergraduate students, whereas in the past we would have upperclassmen, but many of those individuals are now either living off campus or they're, choosing to stay home and take the entire semester virtually which has been made available in terms of symptom screenings. We have implemented a daily screener and all individuals who are entering Nyu facilities will be required to complete this daily screener, which tracks symptoms. It's a brief questionnaire and in order to gain access, you need to present a a cleared result, so either you'll be accepted or denied access for that day, and you need to show it to the state public safety officer in whichever building you're planning to enter, and this also goes for vendors and visitors of the university around enhanced cleaning. Our staff is working to sanitize high touch areas, we're also working to make sure that we're reducing the spread of cloven 19 through our HVAC system, so we're increasing fresh air inflow and reducing recirculated air around education and awareness. I touched on this briefly earlier, but a lot of what we're doing is not only geared towards those who are utilizing university facilities, but also those who are out in the community. So we've implemented a public safety campaign called keep each other safe, and this talks about strategies that can be used in the community to make sure that we're all following the safety guidelines have been put in place and that we're all doing what we can to keep each other safe and then. Lastly, in terms of compliance all nyu students, both those who are residing in our residence halls and those who are residing within the community, will be required to read and acknowledge a student code requirement and agree to behavioral standards set forth in the university- wide student conduct policy. Those who fail to comply will be subject to disciplinary action, and this pertains not only to our students but also to our faculty and our administrators and our staff. The above information explains how the university is tracking this very real and ever- changing situation. We want to work with the community and collaborate wherever possible to continue the great progress the state and the city have achieved. If there are ever any questions, our office will remain a resource, we're always happy to receive feedback. We've already started getting a lot of feedback from community members who, you know want to share their opinions and views about the various reopening strategies that we've implemented, so our office again will remain that space. If you ever want to contact someone from the university, I can leave you guys our email and our phone number. So you know how to get in touch, and then I think this is. I know I went fairly quickly. I wanted to give kind of a high level overview, I'm happy to answer any questions or delve more deeply into any one specific area, but I know that the area that you guys are most interested in is hotels, so I want to pass it over to Chris. You can speak about that, but again happy to answer questions. If there are not any. Thank you so much valentin. I think we can go to Chris and then we'll circle back for questions for you go perfect. Thank you all right great good evening. Everyone and thank you for having us here. My name is Chris Echeverria. I'm assistant director of government affairs at Nyu, so I'll be going over some of the details about the hotel arrangements. Why we chose the W hotel and what this will look like in the coming weeks. I'm going to sort of give you the full rundown. So if there are any questions that you have that, I do not have media answers to I'm more than happy to get the answers and get back to you as soon as I can with them. So I'll just get started by talking about how we got here so for us to meet the public health and safety protocols. We were faced with the need to densify and sort of reconfigure our student residence Hall, Residence Hall housing to less than half. This resulted in decreasing the number of students to a room to maintain physical distancing and to also reserve beds for quarantine purposes whenever that would be necessary. So we searched for a hotel that could safely accommodate the needs of our students and settled on the W hotel on 201 park avenue to help us temporarily meet our housing shortfall until we can return to full occupancy in our dorms. We settled on the W hotel because we needed a hotel that would allow us to fulfill our academic mission while helping us to prioritize the health and safety of our students in the local community. There were some important factors in why you considered in choosing the hotels which were included. Proximity to Nyu facilities and public transit options was an important one, compliance with all fire and safety requirements, quality and reliability of I.T services, since students are likely to be attending some of their classes, virtual, virtually or remotely residential life features like common areas or room sizes or kitchenettes, and that kind of thing and performance with DOB requirements on zoning and usage was an important one to us as well importantly, the university has laid out the health and safety protocols for our nyu community members temporarily living in this space, and there will be a constant communication with the with the hotel, so we'll get more into details about that in a second. So here are some important details about the sort of the meat of what you guys would want to know what we assume that you guys want to know. So we worked with the mayor's office to finalize the terms and parameters of this. The lease will run through December 20th, with an option only if needed, to renew first spring semester, but not extending beyond May 2021 DOB. The department of buildings is a cap on occupancy of 252 rooms. All students in the w will be assigned to single units. This should provide another layer of density densification for us an opportunity to maintain socially distant behavior hotel operators will be making staffing decisions as appropriate to meet the following services: 24:7 desk coverage, security, daily Cleaning and all the common areas, weekly house, cleaning of all the guest rooms and maintenance and, of course, repair staff. The hotel will retain 75 staff members to facilitate the Nyu transition. Nyu Residence life staff will also be present, we'll have Nyu will have five residence assistants or Ras assigned to the building additionally, similar to our other residence halls. There's a building leadership team that can consist of three professional staff that supervise the residence hall type operations of the community they'll, also liaison really closely with the hotel staff to ensure that Nyu Hall Center standards are being met. Importantly, I'd like to note that in a normal year we house over 3,000 students on or near union Square, so through our de- densification efforts in our halls. We have about half that number this year, so the 250 students there should really not cause too much of an upheaval in the area. There are several new policies that are also in effect, that includes the suspension of the guest policy. This will initially include other Nyu students visiting from other halls. There are also compulsory community meetings that will occur within the first few days with professional staff, where they'll reaffirm all the community expectations in terms of the hall community expectations. All students there will need to complete the community standards, fall, 2020 module, there's an attestation, as I think Valentine mentioned, that's required for all members of the community, Nyu's health and safety protocols for the community apply to all residence facilities, whether they're on or off campus, so that includes the hotel students will be held to the code of conduct that outlines behavior, both within and outside of university facilities. Another important thing to note is that the hotel will not be used as a quarantine facility. As Valentine mentioned, Nyu has reserved five percent of existing housing stock for those needing to quarantine or isolate, but it will it will not be in the in the W hotel. Lastly, if a student were to test positive at the hotel, there is a comprehensive response plan in place by the university led by the Covid-19 response team. This will include the initial testing of all residential students, as well as all as well as ongoing health monitoring. So if necessary, students will be relocated to isolation spaces within the university housing system. So just a little bit about want to talk a little bit about economic impact on the community. You know we're an anchor institution in New, York City. We recognize that and we're committed to New York City's revitalization, bringing back students as well as university faculty and staff that support the academic services will help spur economic community activities in the community surrounding Nyu facilities in the hotel. Nyu students contribute to the local economy during this during the school year, but also the majority of Nyu graduates remain in New York state following graduation, so for us creating and sort of retaining that talent pool here in New York will assist with it, which is assisted by the temporary arrangement with the hotel is going to help contribute long term to the city's overall economic recovery in the months and years ahead. So that's the general Rundown. I mean I that was kind of all the information that I have, but I'm happy to ask any ques answer any questions or clarify anything that you guy, that I just mentioned. Thank you. So much Christopher, I'm going to ask that members of the committee raise their hand for their questions for either Christopher Valentin. Does any of the committee have any questions? Mary, hey thanks, Chris and Valentine Chris you're, saying that you have usually a total of 3,000 students in Union square. I live a half a block from this proposed site: the union, the W Union square, I'm familiar with your dorm on union Square west. What are the other facilities? And are you saying that you're taking down the number from 3,000 to a total of 500 sorry, a total of 252 yeah? So it's not a total of 252 we're having where the half comes from the total amount that we usually have. The 252 is specifically for the W hotel and then for the other facilities that we have so the one you're familiar I think, you're mentioning is carlisle. We also have palladium and University Hall. Palladium is right, acrosss the street from Union Square. So not so it's just kind of like on the border line of CB5 and then University Hall as well Valentine. I do not know if we have any other. Those are the three residence halls, those sites down. What's the total number you're saying you're, taking it from 3,000 to what I the number I received was that where it's going down by about half in that area, so right now in total, in all of our residence halls, we're housing about 6,000 students. 2600 have already arrived. That's the first group that I mentioned, who are quarantining and the remaining students will be arriving at the end of the week yeah I'm concerned with union square in those facilities. It's because I live a half a block from that corner. It's already like running the gauntlet. Are you going to have 24-hour security out front because that's not the situation with your other facilities, so what I can do is I can get the numbers of how many are going to be at those three in those three residence halls around Union Square yeah, I'm asking if you're willing to commit to having 24-hour security outside the Union square facility, so that kids are not congregating out there, because it's already a congested crossroads at Park, Avenue, South and 17th street. I'm going to look into what public safety has in mind, and I can get back to you on that because that's definitely a question for public safety. That would be great if you could get back to us to. Let us understand how the sidewalk issue will be managed and people congregating there Mary do you have further questions about? No, I just want to note that the that W Hotel already has taken up much of the sidewalk space with their outdoor cafe. So that's there's just a lot of foot traffic, there's a lot of tables and so on and, like I said, it's already running a gauntlet there, just in terms of the public safety for the Us, the neighbors Valentine. Do you know if the outdoor cafe will continue once the students arrive I was at. I do not I'm not sure about that valentine. I do not know if you have the answer to that, I can find out from the W hotel yeah. We can get back to you on that, though yeah it's, the high- end, restaurant and they've invested a lot in that cafe. So I'd be surprised if it's going to go down, I'm not advocating for it to be closed in any way. We understand yeah, we'll look into it and we'll get back to you with those details. Thank you more questions from the committee. I'm not seeing any raised hands any further questions. Seeing none I'm going to ask members of the public to put their questions in the chat box. Any members of the public have questions to put them in the Chat Box Renee, I'm so sorry. Can I actually ask a quick question: absolutely Rachel yeah, I'm just wondering what the kind of rationale for having kids sorry, not kids, students come back to the city was, I mean, obviously I understand as someone who was in college pretty recently the kind of in- person experience and how important that is. But I know that Barnard and Columbia recently have decided to go fully remote for undergrads and just given the fact that I'm sure a lot of the students will be doing virtual classes anyway, just wondering if you could speak a little bit to know why it's worth all of the hassle and struggle sure I mean, I think the primary reason is you know, to maintain the academic integrity and to provide the services that the university usually provides. But, as you say, many students are choosing to be remote. We have a pretty large international population and the university has created programs that those who live abroad can actually study at their local campus. So we recognize that you know a lot of students are going to feel safer being at home and we've made accommodations to allow them to do that. But we also feel that there are students. You know here in the city and there are resources that we can offer in person and we want to make sure that we're doing it safely and that we're doing it in a calculated way and that we're following all the guidelines that have been set forth, and you know right now- that's our main concern is for those who are in person making sure that we are following everything and creating a safe environment not only for our students and our staff and faculty, but also for the community at large, and you said that 50 of this undergrad student body will be on campus or like here right. So yeah about 50 are going remote and then the other will be in and around the community, but we've reduced as Chris said. The density both in our residence halls in our classrooms, in our academic facilities, most non- essential employees like ourselves, are not in the office where we're working remotely we have been since March and will likely continue to be remote for the coming months. So you know, usually we have anywhere between like 50,000 students and 20,000 staff, and that's not what it's going to look like when we return those numbers are going to be greatly reduced, so we're really trying to put in place the best strategies and measures to create a safe environment. For all. Thank you any more questions from the committee. You can use the raised hand function, okay, seeing none I'm just going to thank you very much for attending Valentin and Chris, and I would ask that you contact Luke at our board office so that we can disseminate the answers to all the questions about the congregating on the sidewalk and what the public safety will look like and all the other questions that we had absolutely. Thank you so very much for being here. We really appreciate it. Thank you guys for having us thank you for having us absolutely have a good night good evening. Thank you, bye. We are next going to turn to Joe Mafia who's, a member of the Bex Committee Joe, and I were talking. I do not members of the committee long- term members of the committee will remember how Joe was able to break down the budget for us as we talked about it last year and he's. I know that his background lends itself to that, but he's been able to give us more of an insight to the budget that sometimes we've been able to glean ourselves. So at this point, I'm going to turn it over to Joe. Thank you, renee yeah. I think it was about two years ago or maybe three years ago renee. You asked me to look at the budget for the community boards themselves and we did an analysis, and I really want to thank you for asking me to look at the New York City budget, because this really was an opportunity for me to learn a lot about it. I have to say I went down. Many roads learned a lot of stuff read a lot of documents and it is a it's a fairly complex process. So I was going to I'm going to focus on the budget process and I'm going to share my screen and, let's see sorry good Ol, the Max asking me to yeah joe. If it asks you allow or do not allow just press allow for those things. I think we're having a technologically challenging evening. Apologies am I saying this right to Joe there he is. Can you hear me? Yes, unfortunately, when I tried to share my screen, the Mac had me shut log off. So let's try it again. Can you see my screen now? Yes, we can. Okay great. I have a lot of material that I'm going to cover. Do you see that? Are you seeing the presentation it's gone from my end now it was up and it's gone now. Okay, sorry about this. I should have ironed this out beforehand. I have three monitors and it I'm going to show it not in a full slide viewpoint, because it's switching monitors. Can you see this the presentation now? Yes, we can. Okay, so I'm going to, I have a lot to cover a half of the and I have a lot of slides to to cover, but I'm going to think of most of this as reference material hold on a second, and so it's really. If you need to look up something, it's something you could just refer to, but I'm going to cover some of the New York City Budget basics, the basic terms I'm going to try to put it in perspective, the New, York, City Budget, and talk about relative roles, and then I'm going to talk about the timeline, the takeaways from the budget. Basics. If you can understand the terms- and the timeline, I think, are the other key things that you should get out of this then unfortunately spent a little time on numbers and some analysis and a little deeper dive, and I fascinated stuff really did learn a lot and I want to share with you some of the things that I've learned now. I know a lot of you probably know this. The budget process better than I so please chime in and you know and add to the conversation, and then there were some really unique observations that I want to make that I learned about and then lastly, there's a ton of resource resources out there. A lot of great data sets analysis tools and I'll, just you know, cover those, as you know, at the end renee. How much time do I have? Should I spend as how many hours should I spend yeah as quickly as you can go through the material while making that digestible for people an understanding that we're going to ask you to share all your slides with us after the fact and make it and be available for the questions and to do this, because this is a really good way for people to think about when they're putting in their budget requests capital and expense and how to think about the budget, so all right so and I'll, just I'll try to speed along and renee. If I could see you, I sent you an email earlier saying, give me like baseball hand signals when you want me to you know to end it, but I can't see you okay. I will send them through Luke how's that all right all right. So, let's get let's get started since it's not on slide view, I'm just going to have to click all right, so we're going to cover the budget basics. First, I want to put the budget the New York City Budget in perspective. The next two slides are really mixing apples and oranges, but really I wanted to give some perspective on it. If you were to look at the Fortune 500 and the top for a company to make it into the listing of the top 500 corporations in America, you would need 5.6 billion dollars of revenues. Well, five New York city agencies have expenditures in there for revenues that exceed that amount and therefore would make it to the Fortune 500 five agencies, if you for the fortune 1000 it would be. Nine agencies would have made that list mixing apples and oranges. But I think you get the sense that it is really significant. Then I wanted to compare the New York City budget again. This is apples and oranges, but I'm trying to highlight the relative importance and significance of the New York City budget, comparing the New York City's budget to all 50 states, there's a horrible slide, but I think it drills home to the point that only California, Texas and Washington of Course New York state are larger than New York City, New, York City is larger than Florida and in every other state, its total budget expenditures compared to to all 50 states, not ideal. This is different fiscal years different, you know periods, but you get a sense that how significant New York City's budget is. Where does the money come from? This is a great slide that just does a little. You know analysis of the components Joe. Can I just interrupt you? Is there any way you could do a full screen on this, or that was part of the problem I could. If you bear with me, I will try, so you might be able to press play from current slide at the top left. The problem is, I have three monitors and it keeps wanting to go to a different monitor when I do that. But let's try it. Okay, if you would like you can always email it to me and I can share the screen yeah. It went to a different slide. So let's do that. Let me email it to. You can also, maybe just x out of the format background thing on the right and that would make it a little bit bigger and if you drag the actually, what I'm going to do is I'm going to shut off my other monitors and move this to the map to the imax, and that way it would be only one screen and it'd be no confusion. I probably won't see you guys, but bit with me a second and Luke I'm going to email you this, while I'm talking okay, let me share now. You guys see it. You see it now. Yes, that's great thanks! Yeah, okay, I got ta start the slideshow yeah with me. Is that better fabulous? Okay? Thank you sure. So, of the total revenues received, 64 comes from taxes, 27 from state and federal aid, and then fees and other charges is another 8 percent. The largest component of the tax revenue is the property taxes it's. This is. This is an older version and I have to apologize. Some of the data is from 17. Some is from 18. Some is from 19. Some is from 20. I just to make various comparisons. I had to use different periods, but it's all stayed relatively consistent. Property taxes is probably 30 is over 30 percent. At this point, no, you know significant takeaways. This is the fiscal year ending 17 budget, and where does the money go? Well? Education is the largest single component social services and then some of the larger programs and we'll spend a little time on some of the eight, the significant agencies and how much money is spent. I do want to point out to two items on this: debt service and pension and fringe benefits. Those really are not determined by any agency. It has to be calculated, it's really it's something. That's really outside of the control of the of the mayor's office. It's based upon either the amount of debt that we have or the amount of pension obligations that we've incurred so from year to year, there's very little ability to to alter that and that's about 25 of the total budget. We also prepare a capital budget, and this is a unique area because most of the money is borrowed loans to pay for this, and- and it's really split up into you- know major pro with different programs. So that's really all I wanted to say so budget basics. Some of the key terms here, you should make sure we'll go over the budget process, but on the timeline. But it's a year- long process, our fit the fiscal year begins. July 1st ends June 30th and we play a consulting role. We advise we evaluate, we conduct public hearings, we submit recommendations, we make priorities and- and we offer comment on the budget now- there's several budgets that we're talking about, although I think we only deal primarily with two of them. The revenue budget is what the city estimates they're going to collect. I did look at a comprehensive annual financial report that showed that the estimates in our in our various budget versions are pretty close to the actuals this year. I would expect you know more variation, but they relatively when they estimate how much revenue that got they're going to collect. You know there is some accuracy there. Now we're asked to comment on the expense budget and as well as the capital budget and the expense budget covers all the day- to- day operations of running the city. All the payroll supplies you know, rent all of those administrative expenses like I mentioned before, debt service, as well as pension and french benefits those costs. They call them central costs because they're determined outside of an agency and they're. They are allocated to the agency, but not to the agency's individual budgets. So there's really there's no discretion on it and it's calculated outside the agencies and those are funded by those revenue sources. We went over the taxes, the fees and the local and state aid. There's also capital budget and a capital item is anything over 35,000 that is going to have a useful life of five years or, more so, for purchasing large equipment or land there's a capital budget. When you look at the capital budget, I think it's around 800 pages and it literally lists every single by agency, every single capital item, how much it's, how much it's going to cost when what year it's going to apply to it's a very extensive capital item. When we look at capital budgets and rene correct me, if I'm wrong, I think we only we primarily we make recommendations and we try to prioritize it. That's correct, there's also something called a financial plan which I think is and we'll take a look at one of them. Financial plan is basically a multi- year forecast. Now this is not binding on the city. It does not say that you're going to they have to spend this, but it's their estimate of the next few years, next, five years, current years and and four other years, what the budget's going to look like and we'll take we'll take a look at it is done four times a year and to go back to the expense budget that the budget is actually modified throughout the year. So if there's any particular expense, you know something that changes they do. It does get modified throughout the year and then capital programs as part of the capital budget and there's a 10-year capital strategy. It's done every other year on the odd years and also all of these budgets are listed on the mayor's website and or the Office of Management and budget owing OMB, I'm not going to get into the accountability too much I'll start fly through a lot of screens. So if you have any questions on some of these slides, just let me know but New York state is still very involved with the New York's New York City's budget back from the 70s. When we had financial difficulties, the New York State Financial, Control Board through the control, the New York State Comptroller's office, offers a lot of analysis, feedback and oversight on the New, York City Budget. So all of these players, particularly the City Council and the city's controller's office, I will point out, if you have, if one of your silos in one of your silos, if there's a department, you have an interest in, you should know that the both the city controllers office and the New York State Controller's office. They do a lot of audits of those of various departments. So there may be some information in there about savings that they found that that may be of interest for you as you're doing your silos, and I could- and I have links to all this in the resources- and there are the mayor, the City Council and the community boards. All have you know respective roles. But let's talk about the timeline, I think there's three major buckets to put the timeline in there's a needs assessment or the budget preparation period which we're in now I mean that's from May to November and then from November to March. It's the drafting of the budget, the preliminary version of the budget and then in April to July. It's actual adoption of the budget and there's a lot of steps in the middle I'm going to pull out. I think what I viewed was the most important dates and I've also listed as a reference, and I won't go over there literally every month, there's pretty much some timeline or some deadline or some goal to be met. But I think the most important date- and this is really key for us- is November 1st by November 1st. We have to submit our final budget request with our priorities submitted through the Office of Management and budget. So that means that this committee has to discuss. Have hearings meet with constituents, gather information and make recommendations. Then the then we're all going to have to vote on. You know on the on this budget and which then is going to get sent to either the the full committee. If the timing of the next of the October meeting, if we're finished by the October meeting or the executive committee will have to vote it out, but we need to submit it by November 1st and then in Mid- November there's a city- wide statement of their needs is issued and then they're in Mid- December. The agency responds to the the budget request. So this the process of responding to our requests is starting and then so. The very next thing is in by January 16th of every year the mayor drafts a financial plan and the preliminary budget once he drafts the then the basically the city, council and everyone starts reviewing and have hearings and offer comments. So in February you're going to see you know the agencies start to respond to our request and by the 15th. Although I have not seen, I do not recall ever seeing this vicki or renee. If you, if you do, we actually get a letter or this is a letter. I'm sorry. This is a letter that is by us to the mayor on his preliminary budget. Yes, we do send that yes, okay and then on in April 26. The mayor has to issue the executive budget and that's basically he's gotten feedback. He's gotten comment after the initial draft he's now going to go and get get it adopted, try to get it adopted by the City Council and then we're also in it. This is in April. We get a response from all of our requests with you know, with our recommendations, whether they've incorporated into the budget or whether they've and a lot of the responses are needing further information need greater details, but they take each of our requests and they respond to it renee. How many requests are we limited to 40 capital and 25 expense? Okay, so I should. I should incorporate that into the to these slides and then by June 5th, the the budget gets adopted by the City Council and the very next day it gets certified by the mayor, the Controller and the city clerk and then June July 1st. The fiscal year begins so back in June. We just adopted the fiscal year ending 2021 budget, so this process our process. Now that's due by November 1st, is for the 2022 budget and I'm not. This is a list of all the actual dates in those three buckets that we talked about and you you'll have this for a reference. So I'm not going to go into detail on it. There's a lot of things on there that the community board is responsible for so let's go into a little deeper dive into some of the numbers. So I took some of the larger agencies. I said all right: let's look at agencies that are over one billion dollars in expenditures and let's see how many there are in the relative importance. Well, the Department of education is over 20, it's about 28 billion dollars a year in expenditures and then pension contributions and debt service are not an agency per se, but it's you know, budgeted separately and then the Department of Social services and the police department and Yada and all the other agencies after these top agencies anything over a billion dollars, totaled just over three billion dollars. You know I do not know how many agencies there are. I tried to count them and I think there are somewhere between 80 and 100 and something agencies. I could not distinguish between a department or an entity that gets budget funding versus an agency. I think the mayor only appoints 50 or 60 people to head agencies, so I really do not know, and I should probably find out how many actual agencies there are Joe can you can you just tell us what makes up miscellaneous, which is your third item there? I do not know. Let me get back to you. I do not know what that is, but it's very easy to find out. It was not assigned to a specific agency. So let me let me just make a note of that, and I will get back to you and by the way this data was just so easy to pull from some from one of the many websites that will go over from the city, so some of them will actually generate dashboards for you, the city controller's office will create dashboards on a whole myriad of information by agency. This is a financial plan. This is one of those budget documents that I talked about and it shows a multi- year version, so this was issued in June revised in July after the state commented as well as the controller's office commented on it. So there were some revisions, so this is recent, so this is factoring in Covid-19. I had to stretch it a little bit to get it to fit. So let me point out a few things that I thought were of interest the fiscal year that just ended. 2020 technically was balanced, you'll look at if you look at the top the total expenditure line, the 97 760. two lines above that there's something called General Reserve. What they. What they bury in here, is basically a contingency, so there's a billion dollars in the out in the later years, in 22:23 and 24 that they're basically saying just in case you know it's not a rainy day fund or which I think is prohibited, but it's a you know, let's see in case the revenues do not come in to what they should be we're going to put in a billion dollars. So what this financial plan did was took the billion dollars in fiscal in next fiscal year and reduced it by 900 million dollars so that they could basically balance the next fiscal year. So it's a you know, it's a it's an estimate, it's a guess. When the original version of this came out, the gap to be closed was higher and then the state you know made comment they, and so this was a little bit. This was reduced and that's how they did so. But this is an interesting document. It does. It definitely says: what's going to happen in the city, so the fiscal year 2021 it shows it's balanced. Let me let me ask you a question: if your teenage daughter, who does babysitting and makes money on the side says to you, hey, I want to buy a tesla, a brand new tesla and I could borrow the money. So can she afford that car? Can she afford? You know a model S a 90,000 tesla? Well, if she borrows the money, she can certainly get the car. Can she make the monthly payments? Can she so? I think a lot of that kind of thinking in is happening in the budget. We we're asked to comment on the expense and capital lines of the budget, but I'm submitting to you. It is really hard for us to make a an objective comment on a budget and what is a budget? We've said, it's a really, it's a how values are being placed and how we should spend money so someone's making it the city is making a determination on what is important to us and how we should spend the money, but I submit we really can't look at a budget just from the revenue and expense side. We have to know how much we have. What do we owe and can we afford it? I'm going to minimize this power point. I could not get this on a slide. How am I, with time renee you're? Fine. Okay, can everyone see this? I know the numbers are big. I can make it smaller. So let me do that this is you probably have seen this is called a balance sheet. This is a photograph. This is as of June 30th 2019. Well, I, what I did not mention was that the the controller's office is, you know he has. He does his own audit audits of various departments he's also responsible for hiring the outside auditors, which is Grant Thornton and grant Thornton. So by October of this year they will have finished the audit of the June 2020 financial statements. So this is the financial statements for the city of New York. For the last time it was audited, which is June 2019.. If you look at the this is how much cash we have. We have six billion seven billion dollars of cash and I do not want government accounting is complex enough. I'm you know I do not want to confuse the matter. I want to just show you how much we have who do we? How much do we owe? Can we afford the budget? We have total assets of 105 billion dollars, which makes up cash investments, people that owe us money and all the property and all the other assets that we owe. Then, if you look at the liabilities who do we, who we owe we have liabilities of 291 billion dollars, assets are 105, liabilities are 291 billion dollars. That means that we have a deficit that we've accumulated year in and year out of 200 billion dollars. Pretty substantial. None of the budget process addresses this part of the equation. Can your teenage daughter afford that tesla? Well, if they're borrowing money, yes, they can but they've got to pay back the loan. Is the income sufficient to pay back and afford it? I so I just wanted to throw that in there and we'll spend just a few more minutes on that topic, but let me get back to the powerpoint if I could find it, so this is also from the same audited report. This is a summary of from the income and expense side. Now I learned that the budget that we're going to be looking at is on something called a modified accrual basis. It means it's not purely accrual basis. These financial statements are on gaap, which is purely accrual basis. So that means that- and I do not know which items some items in the in the budget are cash in some agencies within the budget are on a cash basis, just fyi. So it's kind of hard to compare certain things, but this is also showing that the fiscal year 6:30 19, factoring in the government activities. There are other businesses or corporations that are quasi government. That might not be included in this, but it shows that there was a loss of seven billion dollars for the last fiscal year for 6:30 2019, which just basically added to our deficit. Excellent resource is the one of the offices in the city. Is the independent budget office and they're, a non- partisan agency that evaluates the budget provides information. I spent time on the phone with the the gentleman on this and lots of emails and he was very helpful. They'll come and speak to the to the committee. If you know, if we, if we would like there these, they have a lot of reports, they analyze, they ask the question: well, what did the mayor's you know cutting a billion dollars from the New York City? The police department was it did that actually happen, and you know they wrote a report basically said. No, it was a. It was not near a billion dollars and a lot of it was changing changes in estimates of overtime and what have you, but so they're an excellent resource, and all I wanted to show here is a history of some of the city's tax revenue and the other revenue, and it just shows a normal, regular increase, nothing to go to go into that. So what I, what I did learn from going through this process, that there are two drivers, I think in the New York City Budget on the expense side. One is the number of employees 52 or more of total expenditures relates to personnel. When you go when you go into a specific agency and you could dive in you really you get the budgeted head count the amount that's to be spent on and on salaries, and you really dive into a lot of details on expense categories and really how that agency is going to spend money. So, let's talk about New York's employees in New, York City. This is taking 1980 to 2019. This is only full- time. Employees there's over 300,000 right now, full- time, employees, if you add in full- time equivalents, you know interns and what have you it's closer to 320,325 000 employees in New, York City and I think, there's been you know, definitely has been growth and there's been growth in the last few years. You know some people thought that there was a lot of growth in in employees under the current administration. I wanted to take a look at and see how you know. How is that true? Is it accurate? So I took the growth in employees, compare it to the percentage change in growth and there were some spikes, and then there were some negative growth as well. There's some reduction in payroll, negative growth. There was some reduction in the number of employees as well throughout the years, and the trend has been actually that there's been less the percentage- wise there's been a reduction in the in the growth rate of employees. The independent budget office did you, I think, another analysis. They compared full- time employees to total expenditures by the by the city, and you can see that the growth and total expenditures by the agencies appears to be a higher increase than the actual growth in the number of employees. So we're spending more on total agencies than we are in terms of employees and which I thought was interesting and then one more analysis of employees. The independent budget office took compared an analysis of three time periods. They took it total employees at 2008 pre, you know, downturn, 2012 and 2019, and they then they showed by agency or the significant agencies that there was overall, a five, almost a six percent decrease in employees from eight 2008 to 2012, which sounds reasonable because we had you know an economic crisis and then from 2008. Comparing that to 2019 there was a almost a 5 increase. However acrosss the agencies. That change was not consistent. If you- and I think this was you know- was fairly significant- the department assault, I highlighted anything that I thought was a significant change, so the Department of Social services actually saw a 10 percent decrease from 2008 to 2019 in head Count. Health and mental hygiene saw a 52 percent, increase fire, Civilian sort, almost a 30 increase, and then housing preservation and development saw a 10, almost 11 decrease in employees from 2008 to 2009, and then I highlighted some of the other agencies, so the change was not even acrosss all departments. All agencies, some went up significantly. Some went down significantly. The next biggest driver, in my opinion, was the pension plans, not maybe on an annual budget perspective, but certainly on a total aggregate impact. The New York City pension plans, in my opinion, has this largest significant influence on the New York City budget. When we talked about assets of 105 billion liabilities of over 200 billion, those liabilities include a lot of pension plan items. So let's talk about the pension plans, they're, basically five plans. I've got a lot of information here. Most of it is, you know, for your reference about the plans and you know there are charts on each of those five plans, but here's the takeaway that I that I'm seeing the plans you know whether they're generous or not. These are the fine benefit plans. People, you guys know what the fine benefit plans are versus defined contribution or anything else. Would you explain it to us sure, so the defined benefit and defined contribution are probably the two most popular plans or popular type of plan. There are other types of plans as well. Defined contribution is a plan that the amount that is contributed to the pension is determined by a formula or it has a determination, so the contribution is determined, so it's usually a percentage of your salary. So if there's a profit sharing plan, it's you know, 10 of the profits you know whatever, so the amount of the contributions determined versus a defined benefit plan, the benefit to the to the participant is determined by a formula. So, usually, it's based upon your length of employment, your your final average salary and whether you invested or not so taking these five retirement plans, and I went over these quickly, but I should at least say that they're the teachers retirement plan there's basically the New York City Employees Retirement plan, which pretty much covers all of the employees. There's the police department, the fire department and then there's another education plan which deals with people who are not covered by the teacher's plan. So if you're an admin or in you know, you might you'd be covered by those plans, and it would basically this they all have different investing periods for those that are the most dangerous they have tend to have the shortest. So police and fire tend to have like a five- year vesting period but to maximize the payment. You either have to be there 10 years for some of the plans or 30 years. So if you're, a teacher you'll max out, if you're, if you're there for 30 years and if you're there for 30 years, you'll, basically get 60 percent of your salary. Your final average salary, if you're police you're going to get 50 of your salary if you're there for 22 years, if you're firemen, if you're there for 20 years you're going to get 50 of your salary, then there's all kinds of differences. If you're not there for that full period, there's some reductions. These are technically defined, benefit plans, but there is a component to some of these where the employee, the employee, actually contributes as well. So these pension plans covers approximately 800,000 people participants. The benefits are actually determined, but you know it's based upon age income, your average salary and length of period. These pension plans have a pension obligation well over a hundred billion dollars, but luckily it's mostly funded meaning that in the pension plan itself, there are assets to cover most of this obligation, so those plans are 75 funded, so the pension unfunded liability, that's on our the the city's financial statement is 43 billion dollars, which is good, but not so bad. I have to say what is bad is the other benefit plans, the other post employment benefit plans, opeb and that covers health, insurance, Medicare Part, B, Welfare Fund and that's another 600,000 participants in those plans. Those numbers are totally different. So if you meet the requirements that I did not analyze, what's the requirement to qualify for health insurance in your retirement, but as of now there's about a hundred and twelve billion dollar liability, our, I should say yeah liability for benefits and there's only almost 5 billion in assets, so there's an unfunded liability of 107 billion, that is on the balance sheet of the city of New York. So the four percent funding is not good, not ideal. Everyone's still with me we're here all right. Stop me ask questions I'm going to. I do not have to actually does not. This is a good time. Anybody on the committee that has questions before we get to the observations. If you use the Joseph yeah thanks Joe, this is this is great. I've been, I saw it on one of the charts you showed and then you were you just brought it up again. Oped, can you just clarify that I mean it seems like it's some sort of health insurance, but can you just clarify that is this? Is this health insurance that is for retirees of basically New York City employees who are retired and they get this health insurance benefit apart from their pension benefit and in addition to Medicaid or Medicare yeah, good excellent questions? I did not dive into all of the plans, but yes, this is in addition to their pension. This is in addition, they've met. Whatever the requirements are for eligibility are it's going to I'm going to? I would imagine it's very similar. If you're invested in the pension plan, chances are you're going to be invested in the retirement, so in your retirement you would get health benefits okay. So it's totally. In addition, it's health benefits and there was a Medicare part, B reimbursement. Some of these plans will reimburse you for your the premiums that you're paying for Medicare Part B, so so they can. They are generous and if you look at the pension obligation it's over 100 billion, if you look at the post, the these other, it's over also over 100 billion, so it's fairly generous, okay, thanks sure more questions. I should go back and mention one thing: when I listed the when you look at, if you look at the the pension plans, you'll notice that a lot of the pension plans have different tiers, I was describing the latest here. I so if you're a teacher- and I think, they're up to tier four right now tier one, if you're a teacher and you retired, on a tier one, pension you've got it made. I know, there's been every year, there's an article that comes out about a New York, City teacher, making over four hundred thousand dollars in their pensions or three hundred thousand or two hundred thousand or one hundred thousand. I do not know the number. Oh I do know. I do recall the number there are over 3,000 teachers making over a hundred thousand dollars in retirement benefits in New. York City do not get me wrong. They deserve it, but I I'm just observing how generous the plan, the plans are substantially less generous. Now you would make 60 of your salary. Is the Max? I'm sorry any other questions chuck you raised your hand. I did I just wanted to say Joe. This is an amazing presentation. You've done a lot of work on this and you've presented the material in a very effective way. Thank you, you're welcome. I was worried. You know you must be an accounting groupie, so I hate you ai, not understand great. So I absolutely second that, because the budget sometimes for us is hard to digest right and we do not always understand all the moving parts and you're making this very accessible to us Joseph. Thank you, you're welcome, and please now that I know how to get this. Some of this data is you're going through your silos and your groups. If you need anything for any department or agency, I can quickly get you the raw data or and certainly show you where it is. I stumbled acrosss a resource. It's called truth in accounting, they're based in Chicago. I do not know. I spoke to one of the founders and very interesting and they do a an analysis of the top most populous cities in the country, and I'm going to talk to you about the findings that they had in their data is back as of fiscal year. 2018 of the 75 most populous cities. 63 did not have enough money to pay their bills, 323 billion in unfunded debt. Now you can imagine New York City makes up the bulk of this the overall pension debt and is a 176 and the other pension and post employment and benefits is a 150 billion dollars. So a lot of cities are problematic on their website. They use this website data, z, org, and you could pick what city you want to compare and all kinds of data splice and dice it. You could throw in economic data for this for that city and population, and what have you so? I wanted to compare us to Boston Chicago Dallas Los Angeles New, York City, and this is a chart of the past fiscal past. Three fiscal years 16:17 and 18 New York by far, is the largest and, with the one exception for those you know account. You know I'm an accountant. If you have, you can't tell, but I'm an accountant, an accounting just so people know what accounting really is accounting is think of it as the grammar that allows us to communicate economic activity. So it is the it's the grammatical rules. How can I? How can I communicate to you how I measured something and when I recorded something and and that's what that's, what accounting really is? The grammar is not perfect. The grammar is actually problematic in a lot of cases and you know probably not. I do not I'm not to go off on a tangent, but give me 30 seconds more. The grammar it can't keep up with business. It can you know new products, technologies industries come up, counting has not caught up with it yet. But, having said that, that's for the commercial side, the grammar for for state, local and federal government is ridiculous. It is horrible, it is nonsensical. It is really behind the times, so the accounting standards that tells people how to report. So I pulled out this slide and I said oh New, York City is the worst and on the you'll see that we got a failing grade, we got an f grade. We were ranked 75th the worst, but then digging into the details. I found out that Chicago ranked better than us. Why? Because they do not their accounting interpretation of the accounting standards, their use of the grammar allowed them to obey the school system. New York City includes the school system and that's a big component. That's 28 of our budget. They excluded the school system, how they can do that. How any you know, accounting rules could do that. It makes no sense to me. Had you included the school system in Chicago into this? The Good News is New. York would have not been last. We would have been 74th, so a ranking of all the schools. So it's just. It just goes to show that this is a an area that needs to be improved, but we are. We are based upon the accounting rules as they were interpreted. We were actually last and this analysis. They say that every taxpayer, based upon the population in New York in the fiscal year, 2018 their burden. Their share of this deficit is 63,000 per taxpayer and I'm almost coming down to it again, and so yes, the New York City. The charter does say that New York City has to balance their budget, but I submit how can we have a? How can we have had a balanced budget with an accumulated deficit of over 200 billion dollars? Well, this is how we, these are the following ways that a city can spend more than show a balanced budget, but yet be actually in a deficit. Well, I gave you the example of your teenage daughter buying a tesla. Well, if you're borrowing the money, we have to pay it back at some point, so it's going to affect our budget debt service, but yet that liability is showing that we're balanced the capital. We may have balanced the capital budget, but guess what we owe a lot of money on there playing with revenue assumptions some subsidies. I do not know if New York, I have not dug into enough detail. I do not know if New York some agencies might be counting borrowed money as income, and then I told you that the budget is on a modified account basis, so the timing of bill payments from one period to the next would in would impact. So if all sudden, we stop paying the bills in the month of June or deferred bills and push it off to the following year. Well, that might inf that, might you know, go a long way in balancing the budgets but or influencing either the current budget or the past the future budget, but so that shifting of large payments can really be possibility and then, of course, the pension, the unfunded pension plans, you know basically, the large employee compensation hiding it from outside the you know: the healthcare costs, the life insurance and whatever else, and then there's another accounting gimmick I won't even bore you and it's it defies. It defies logic, deferred, outflows and inflows. So there's a lot of methods. Well, beyond my experience in the government accounting world, where the New York City budget can be played with an accounting trips can happen, we do get audited, we got a clean opinion last time we were audited, but let me just talk about some of the great resources and I have the links in here and I will as soon as we I get off here. I will share this. The the ibo is excellent. They want to speak in front of us. They have an actual guide. It's based on 2000 fiscal year 17., it's an excellent guy, the controller issues, a comprehensive annual report, annual financial reports, 400 pages chock, full of information. It's a great read the citizens Budget Commission. They spoke at the committee before it's. They have a lot of stuff on their website. Also great analysis: the Office of Budget of Management and budget, the ones that issue the budget they've got a whole bunch of data. There's data on the New York City, Open, Data portal, lots of information, truth in accounting. They have all kinds of you can compare like. I said different cities, the Checkbook New York, the Controller's office- has a this is probably I thought the best. The easiest way you can create dashboards. You can create charts. You know to take a look. The link I provided is actually for a chart, but if you can look at all kinds of information, excellent resource and, of course, the charter, I pulled out those sections of the charter, those chapters that will really relate to the Community Board and the budget process. And then all the actual budgets are on are on. You know: New York City.Gov, and these are the actual pension plans. If you want to read the pension plan summaries, where I pulled all you know all of this information from you know, please feel free and do not email me with questions but Joe. That was amazing. That was so comprehensive. Thank you very much for making that so understandable to us. I want to ask there'll be a quiz later I want to ask if the committee has questions I see. Rachel is kicking off the questions. Go ahead, Rachel, oh, I did not mean to raise my hand if I accidentally did. I was just saying thank you in the chat. Okay, sorry, questions by anyone. No questions from the committee renee! It's chuck! Yes, hey joe! If you were, if you were the controller, what would you do first or if you were, if you were the budget czar? What would you do? First good question: there's a lot that a lot to tackle there really has to be some sort of truth in in reporting or consistency possible. You know we have not. The controller has the comprehensive annual financial report. There should be some reconciliation to the budget so that things can't get buried and there has to be a focus on retiring. This unfunded debt, this deficit. You know we have a balanced budget but- and you know we're not- the budget process is focused on. Oh these, the expenses yeah, your teenage daughter's got a babysitting. You know salary and these are her expenses. But what about that? The car note for the tesla. You know no one's, no one's. Looking at that, one factor that factoring that in I I do not inject it, I we could probably spend you know a whole lot of time trying to figure it out. I'm sure. That's just there's a whole lot of things opportunities here, July, I see your hand. Thank you, renee, Joe, gravel! This is very comprehensive and so insightful. Thank you so much for taking the time and and presented so just skillfully and very much enjoyed it. I am curious if, in your research and reading, if you've been able to discover how has the city been able to pay for the huge deficit or shortfall on the liability, or is that just all unpaid? Is it just all being rolled over to the future about the unfounded debt? Excellent question? There was a slide in there that showed the growth of the unfunded debt each year. So it's not it's not going down it's getting it's going up each year because of the way we're you know, how's this being I'm going to say this hidden. How is this being covered up or hidden or disguised because we're paying as we go on? You know we're paying the interest on the loan and you know: there's we're borrowing, money, we're paying it back the interest and the principal through the current budget. So that, and like I said, 25 of the budget goes to those items that are not the actual ex and here's the thing that I have not figured out the actual expense. The pension expense on the budget is far less than the unfunded amounts. Obviously so the way they got it on the books it's so this only happened since 2010. By the way the accounting rules thought they were catching up and they said. Okay, you know you got these unfunded liabilities, get them on the books. Well, guess what they did, not expense. It was massaged into the numbers. So we have a liability, the hit the expense the charge did not happen in one year. It was not you know, otherwise we would have had to raise money to cover or done something cut expenses, other expenses. So the way we're structured, it's hidden because we pay as we go and it's you know it's buried in the budget and it's increasing every year. Thanks joe more questions from the committee, I'm not seeing any hands how about from attendees anyone in the audience with any questions, any members of the public, I'm not seeing any luke. Are you seeing any hands nope members of the public? You can always press the raise hand button at the center of your screen. Are they still awake is the question this is. This is just a joke, but this is. This is so incredibly helpful to us and it provides a perspective as committee members when we work on our silos and think about the budget requests that we have to make and when we think about the agencies and we think about the budget as a whole. I think this really gave us a very good context that maybe we would not have had, except for your presentation, so thank you. I'm just going to give one more call to any of the the members of the committee any more questions, I'm not seeing any so joe. I'm going to. Thank you, I'm going to ask you to share your presentation so that I can send it out to all of the all of the committee members and I'm going to direct them straight to you with these questions that they have afterwards please, and if you need help getting anything any of the data. Let me know not. You know we really can deep dive into this stuff. Thank you so much. I just sent it to you luke. So last week I sent out a bunch more tools to the committee. I trust that you all receive them. That should be helpful. In particular, the 2022 CD needs statement is a good document to work through in each silo that helps to identify your primary need and the most important needs and there's also a document in there that provided tips for strengthening submissions and how to write your requests in a clear and straightforward way. I also sent today some of the requests we've received from actual stakeholders in the community asking for things like monies to fix things say in Union Square park, the water things of that nature and they and the library traditionally they give us their requests so that we can include them in our priorities when we discuss next month. I just want to make sure that no one has any questions about that. Anybody have any questions about that process. Our borough consultations are going to occur in September and I'm going to share all the agency responses to that. So that will also help you formulate the budget requests. That's all I think we have on the budget tonight. Is everyone big sign now at this stage and I'm going to move on to the last issue, which is sanitation, issue discussion, a quick discussion of sanitation? I think that everyone has been aware of some of the press. That's been out there about sanitation, we've all been hearing about the garbage on the streets. We've seen the newspaper articles about the rats the department of sanitation has had their budget cut by 106 million, and so that naturally led to a reduction in collections. My understanding is that there's no Sunday basket collections at this point. There's fewer weekday and holiday basket collections and the trash is just leading to a lot more mice. Rats, cockroaches, all those fun friends we're starting to eat outside, as you all know, in Manhattan, and that also tends to create trash. So the thought was to send a letter to the department of sanitation and our electeds to ask them to really fix this or look at some ways to address the issues that are showing up because of the trash and the rats. I'm saying a letter simply because we do not have our next meeting until until September, and so I wanted to do something quickly, and I wanted to get your sense of what you think about a letter on this topic. So if I could ask the committee members to service to sort of what's a sort of way, sort of weigh in on anybody have any thoughts about a letter regarding sanitation. I just have a question rene renee. What what role do the bids have with sanitation? The bids are also asking so the bids also ask for their own. You know they work with the sanitation department. I mean they have baskets, but they do not do their own. I think are you asking if they do their own sanitation collection? No yeah like I know that they have a role in sanitation in general within their district, and I'm just wondering like I'm, assuming. Maybe their funding in different areas has been impacted as well, but just wondering like what role they play here in terms of the department of sanitation that would be separate and apart so to the extent that a bid might have their own sanitation. You know people, you know, I know they have their own homeless outreach. They have their own. You know people coming around cleaning trash, but it's not. If that's not. This is we're talking about street baskets and we're talking about collection. You know our ordinary collection that you get at your apartment, okay, so totally separate, because I'm thinking more about like the general cleanliness of the streets, which I feel like would be kind of both the cleanliness rene. It's chuck, I think the bids the bids pick up trash generally Rachel in their areas, but the department of sanitation, empties, the baskets the bid. That's the best way to ask okay, that's the better way of putting it yes, Luke. Also, businesses are required to have a private car, crucial coding, yeah commercial cars, so there's residential pickups, there's commercial, private cargo pickups and then there's this street baskets that are done by DSNY and the street cleaning pickups that you see you know on 34th street right, so Chuck is exactly right, which is, I very clumsily tried to convey that it's they're not doing their own personal traffic, they're cleaning, but not doing the trash collection, which is what we're talking about July yeah. I just want to ask the fellow committee members, if you have you know in the past months, seen any sanitation trucks cleaning the street, because I have not. I have not either. I have along the avenues like 8Th Avenue, 9Th Avenue. I do not know the routes, particularly, but I've seen some and I've heard them, so one thing is periodically throughout the pandemic, the mayor has suspended alternate side parking which allows for street cleaning to occur. So that might be why I do not know exactly the current status of alternate side parking, but I know it's been suspended a couple times right. So if the street cleaning is not happening, are not we saving money from that? Why do we have to cut the weekend and holiday garbage pickups? So one of the reasons thank you for that July. One of the reasons this is just sort of a down and dirty we are getting some and Luke can speak to this. Some complaints about cleanliness, we're hearing about the sanitation issues. You can see it when you walk around the streets, or at least I can. I had three rats in my bike lane the other day, so this was a way to write a letter to say: please address the uncleanliness we're seeing on the streets, we can do a deeper dive and in fact, I sort of flagged that to chuck and zach who have it in their silo. I I'm just suggesting a letter at this stage and we may want to do something look at it more closely later and look at those expenses that you're talking about and savings, then recommendations and all of that. But for right now we're just asking- or we may ask I'm putting this to the committee- I it might be a good idea to write a letter to say you know we really would like to see the cleanliness increased. You know there's a lot of rats, there's a lot of garbage on the street, we're hoping that something can be done. Does anybody have any thought about? That is any everyone in agreement with that they have a reservation about doing that. Right now I see you Joe Joseph, hey yeah. I would support a letter expressing that sentiment and I do not know if a letter is the right time to do this, but I saw an idea I forgot where I found it. I could always find the source, but an idea for trying to reduce how much vermin is on the street. You know we've been taking up parking spaces for restaurants and cafes lately, so I saw an idea that I thought was a good one that the city could provide. You know locking receptacles, you know, maybe one or two every block that could take up. You know part of a parking space or you know a parking space. You know. So, if we're having fewer pickups, you know you could at least require buildings to put their trash in a secure location where the rats are not going to be attracted to it. You know between the pickups. I just thought: if we do not, we still do not have a lot of people. Parking might be a good use of that space got it. I understand I hear you any other thoughts about that thoughts about a letter. Do I have support generally for a letter, and I think that Joseph idea is a good one. I do not know that it would be in the in this letter specifically because I think we want to look at that more closely. This is just very general to say: we'd, like the city to consider ways to decrease the trash and the vermin any thoughts. Renee, it's chuck again, I'm oh there's a raisin. Yes, I think that we could make a. We could point out that the effect of the department's cuts is so readily visible and has such an effect on the quality of life that the savings, especially given the information that Joe's given us that the savings to the overall budget and the contribution of that particular program to the overall deficit does not seem to be worth the disruption in street life. We could. We could make that point and still be still keep open. The notion of how we're going to pursue all this later and asking the department's department that'd, be the department of sanitation and the Department of Transportation to Joe's point to cooperate to figure out some other way to address traffic issues I think, would be appropriate as well. I like that Luke. I see you just wanted to provide some helpful information that we got from the Department of Health and mental hygiene which, as you may know, is responsible for rodent outreach, and you know rodent issues. They informed us that, during the height of the pandemic, they slowed down inspections for the protection of their workers. You know, obviously the Department of Health was concerned for their inspectors catching coronavirus, and, since you know, the rates in New, York, City have decreased with Coronavirus Department of Health and mental hygiene have increased in are getting back to normal the volume of outreach that they have for rodent control. Thank you. Have they look? Did they give you any information about whether the increased trash on the street due to the fact that there's limited pickups has increased the number of rodents? Because that's where we're seeing a lot of complaints right, I do not think so. We also have not we work with one department of health liaison and we have not really talked too much about. You know trash issues, but you know, as with a lot of things, the more trash the more rats, but that's not that's, not an agency, endorsed recommendation or comment. Thank you comments. Any more comments from the committee any more thoughts from the committee rachel. Do you have any view on on a letter? I would definitely support a letter tristan. Do you think it's a good idea? What do you think yeah, I'm also supportive of a letter and again we can do a deeper dive and I think it deserves a deeper dive to really look at what's going on, but just right now we know it's bad and given our time frame a letter, I believe, would be useful Mary. Do you have any thoughts about that or no, I totally agree. We should do a letter and I'm with you, I'm a biker and I'm running the rat gauntlet myself every night, so they're definitely up in number and I'm sure, we've all read the reports in the newspaper that, ironically, it's because there's less food for them that they've become more aggressive. Maybe that's why we're seeing them? It's not just numbers it's more complicated, but we should do a letter. Thank you. Anybody else, Luke, sorry to keep on butting in here, but one thing that we sometimes use to analyze. Trends in the district is open data that Joe has pointed out earlier. We can track sanitation complaints that have been made to open data, so that might be a good way to evaluate how much trash complaints have increased or changed at all fabulous. Thank you. We can use that to inform the letter. So what I'm hearing is generally we're in support of a letter, and we will, as a committee, do a deeper dive later on the issue, but just as a first as a first first step, a letter to sort of look at this and say: look we're noticing this we'd, like the city to address. You know the increase in rodents, the increase in trash that we're seeing on the streets. Okay, members of the public. I do not know if there's any more questions about anything for this evening. I think we might have. I think that is it unless any of the members of the committee also have questions anyone, Mary yeah, I'm new, so I'm confused about the process. Is there any way to do a more formal communication back with nyu, insisting on 24-hour security presence in front of the w, because how to do that before they move forward? Okay, so what we can do is the lines of the communication are now open between Valentine and Christopher, and so we will follow up I'll. Make sure that I follow up with them to find out what their plan is. First and then we can take it, you know the next step forward in communicating with them. If, in fact, they come and say, there's no plan or this is the plan or- and we can have that conversation with them, so I will make sure to follow up with you with them with you know the committee right, I appreciate it any other questions with that. I will just thank Joe one more time for his incredible presentation. I will thank you all for attending tonight and I will see you all in September thanks renee. Thank you very much good night. Thank you good night.",
            "summary": "First is a presentation by New York University on its plan to temporarily house students in the W hotel at 201 park, Avenue.\nI'm going to do something a little different tonight for members of the public and ask that they put any and all of their questions into the chat function and we'll answer them in the order that they're received in the chat, function.\nAnd I'm, the assistant director of community relations, And I'm, going to speak first, just kind of briefly about the university's reopening plans, I think, firstly, the term reopening or is a little bit misleading, because the university never officially closed.\nWe did not close and, as I said, I just want to provide a brief overview of the strategies that the university is implementing to safely bring back our students, faculty and staff to the community.\nIf need be, I'm returning to the layers of safety that I mentioned before Nyu has developed strategies to address the most pressing concerns which include Covid-19, testing, contact, tracing quarantine and isolation, face coverings, physical distancing, reducing density and Nyu facilities, symptoms, screening, enhanced cleaning, education, awareness, and, lastly, compliance.\nWe currently have a group of about 2,600 students who are quarantining in our residence halls and that quarantine will end at the beginning of next week, so that they're able to attend the first day of classes on the second, in terms of covering face coverings and masks like most facilities, individuals will be required to wear a mask when inside Nyu building masks will be made available to all students, but they've also been instructed and recommended to bring their own face coverings.\nThe university is also emphasizing the importance of following these safety guidelines when outside of our facilities in order to protect the community at large, I think physical distancing is pretty clear.\nProximity to Nyu facilities and public transit options was an important one, compliance with all fire and safety, requirements, quality and reliability of I.T services, since students are likely to be attending some of their classes, virtual, virtually or remotely residential life features like common areas or room sizes or kitchenettes, and that kind of thing and performance with DOB requirements on zoning and usage was an important one to us as well importantly.\nThere will need to complete the community standards, fall, 2020 module, there's an attestation, as I think Valentine mentioned, that's required for all members of the community, Nyu's health and safety protocols for the community apply to all residence facilities, whether they're on or off campus, so that includes the hotel students will be held to the code of conduct that outlines behavior, both within and outside of university.\nWe recognize that and we're committed to New York City's revitalization, bringing back students as well as university faculty and staff that support the academic services will help spur economic community activities in the community surrounding Nyu facilities in the hotel.\nStudents contribute to the local economy during this during the school year, but also the majority of Nyu graduates remain in New York state following graduation, so for us creating and sort of retaining that talent pool here in New, York will assist with it, which is assisted by the temporary arrangement with the hotel is going to help contribute long term to the city's overall economic recovery.\nSo much Christopher, I'm going to ask that members of the committee raise their hand for their questions for either Christopher Valentin.\nThank you very much for attending Valentin and Chris, and I would ask that you contact Luke at our board office so that we can disseminate the answers to all the questions about the congregating on the sidewalk and what the public safety will look like and all the other questions that we had absolutely.\nYou asked me to look at the budget for the community boards themselves and we did an analysis, and I really want to.\nThank you for asking me to look at the New York City budget, because this really was an opportunity for me to learn a lot about.\nRead a lot of documents, I'm going to focus on the budget process, But I'm, going to think of most of this as reference material hold on a second, If, you need to look up something, it's something you could just refer to, but I'm, going to cover some of the New York City Budget, basics, Then I'm going to talk about the timeline, the takeaways from the budget.\nYou know and add to the conversation, and then there were some really unique observations that I want to make that I learned about and A lot of great data sets analysis tools Yeah as quickly as you can go through the material while making that digestible for people An understanding that we're going to ask you to share all your slides with us after the fact and make it and be available for the questions and to do this, because this is a really good way for people to think about when they're putting in their budget requests capital and expense and how to think about the budget.\nThen I wanted to compare the New York City budget.\nYou know periods, but you get a sense that how significant New York City's budget is.\nI did look at a comprehensive annual financial report that showed that the estimates in our in our various budget versions are pretty close to the actuals.\nThere's, also capital budget and a capital item, is anything over 35,000 that is going to have a useful life of five years: or, more so, for purchasing large equipment or land.\nYou look at the capital, budget, I think it's around 800 pages It literally lists every single by agency,, every single capital item.\nIt's done every other year on the odd years, and also all of these budgets are listed on the mayor's website and or the Office of Management and budget owing OMB, I'm not going to get into the accountability too much If you have any questions on some of these slides, just let me know, but New York state is still very involved with the New York's New York City's budget.\nWhen, we had financial difficulties, the New York State Financial, Control Board through the control, the New York State Comptroller's office, offers a lot of analysis, feedback and oversight on the New, York City Budget.\nYou should know that the both the city controllers office and the New York State Controller's office.\nYou know on the on this budget and Which, then is going to get sent to either the the full committee.\nVery next thing is in by January 16th of every year the mayor drafts a financial plan and the preliminary budget once he drafts The Then, the basically the city, council and everyone starts reviewing and have hearings and offer comments.\nWe get a response from all of our requests with you, know, with our recommendations, whether they've incorporated into the budget or whether they've and a lot of the responses are needing.\nNow, that's due by November 1st, is for the 2022 budget There's a lot of things on there that the community board is responsible for So I took some of the larger agencies.\nWell, the Department of education is over 20, it's about 28 billion dollars a year in expenditures and then pension contributions and debt service are not an agency per se, but it's you know, budgeted separately And, then the Department of Social services and the police department and Yada and all the other agencies after these top agencies, anything over a billion dollars, totaled, just over three billion dollars.\nWhat I did learn from going through this process, that there are two drivers, I think in the New York City Budget on the expense side.\nYou get the budgeted head count the amount that's to be spent on and on salaries, and you really dive into a lot of details on expense categories and really how that agency is going to spend money.\nSo those plans are 75 funded, so the pension unfunded liability , that's on our the the city's financial statement is 43 billion dollars, which is good, but not so bad.\n, there's an article that comes out about a New, York, City teacher, making over four hundred thousand dollars in their pensions or three hundred thousand or two hundred thousand or one hundred thousand.\nI do recall the number there are over 3,000 teachers making over a hundred thousand dollars in retirement benefits in New. You've done a lot of work on this You know you must be an accounting groupie, So I hate you ai, not understand great.\nThe charter does say that New York City has to balance their budget, but I submit.\nThis is how we, these are the following ways: that a city can spend more than show a balanced budget, but yet be actually in a deficit.\nIf you're borrowing the money, we have to pay it back at some point, so it's going to affect our budget debt service, but yet that liability is showing that we're balanced.\nI do not know if New York some agencies might be counting borrowed money as income, And, then I told you that the budget is on a modified account basis.\nBeyond my experience in the government, accounting world, where the New York City budget can be played with an accounting trips can happen, we do get audited, we got a clean opinion.\nThere's data on the New York City, Open, Data portal, lots of information, truth in accounting.\nYou know: New York City.\nThank you, I'm, going to ask you to share your presentation so that I can send it out to all of the all of the committee members If you need help getting anything any of the data.\nThe thought was to send a letter to the department of sanitation and our electeds to ask them to really fix this or look at some ways to address the issues that are showing up because of the trash and the rats.\nIf I could ask the committee members to service to sort of what's a sort of way, sort of weigh in on anybody have any thoughts about a letter regarding sanitation.\nI do not know that it would be in the in this letter, specifically because I think we want to look at that.\nSince you know, the rates in New, York, City have decreased with Coronavirus Department of Health and mental hygiene have increased in are getting back to normal the volume of outreach that they have for rodent control."
        }
    }
}