{
    "YoutubeMetadata": {
        "author": "MCB10",
        "channelId": "https://www.youtube.com/channel/UCaXkIU1QidjPwiAYu6GcHjg",
        "title": "Exonerated Five Central Park Exhibit Public Panel Discussion #1",
        "publishDate": "2020-07-10",
        "shortDescription": ""
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "MCB10",
        "normalizedName": "Manhattan Community Board 10",
        "twitterName": "Manhattan CB 10",
        "youtubeChannelName": "Manhattan CB10",
        "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
        "twitterHandle": "@mancb10",
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": "changed live 9/13/2020"
    },
    "properties": {
        "fullTranscript": "You hey Benson, are you good? How are you good? What's new I mean what is it? I was just telling a friend. I was like you know if somebody told me last year this time that we would all be stuck in our houses for six months and that people would be on the streets on about police brutality, I'd be like you're, crazy, great I'm, so happy about the second part, and it's just been really interesting. It's just you know we're thinking so much about like how sustainable this is like how I mean it's just been so interesting. You know we're working around the country on these different police accountability proposals and just it's wild, like they're doing things like introducing databases of bad cops, but then they're not lifting the secrecy on police disciplinary record. So it's like what are you filling your database with just like cosmetic we're trying to get this cosmetic use? It's like cleaning the street Oh a I mean it's like their way, so it's just been we're trying to get into all these state houses now to be like. You can't do this if you're not doing like 50 a repeal, you know, but it's just, but it's why I mean II saw Colorado got rid of qualified immunity, basically exciting. It was, and you know a really interesting element of the law. I don't know if you saw was that 5% of the settlement has to come out of the cops pocket. I did see that which is what I loved like they might not. They might think twice. I, don't know you know it's like. It's certainly gonna be a vast improvement over what's happening now, I mean we I mean honestly. We have to scrap the whole thing and start over, but it's you know that's where we're at. But how is your work going? What have you even up to it's good? It's good busy doing a lot of like trainings and presentations and we're following in amicus brief in this and the 92-minute already Metro activity case. We have found that in a couple weeks and trying to just kind of sort through new stuff for the upcoming academic year right get like you know, everything's on you know so, like you can't do any little programming. That's not gonna be around like what we want doing in that way and then work with these advocates. You know we do. We do some work around like parole accrual like trying to eat away. The parole system operates in New, York State, so we've been doing some work there yeah exactly so. We've been we've been kind of with networking with them for the last few months, especially kind of trying to get people out of harm's way with Kobe we've been doing, and it's like Cuomo is it's so ridiculous, so ridiculous, yes hi! This is the captioner Renata Reid, you see it there. Oh I should have put captioner I'm just waiting, honey, -, Anderson I believe is the host. She has to sign me at the captioner. So just so you know I'm waiting for her and I'm here and I. Guess she's not here yet right nice to see you again, hi karen is on just wait for one unit to host. Okay. In fact, I was really happy to see Christina so excited I can't even there are no words like we are so ready. The perfect person it's gonna, be amazing, I'm, so thrilled. You know, because I've been sort of forever been trying to move our brand from actual innocence to presumption of innocence, which is by the way the first question. I'm gonna turn to you around tonight. But yes, but you know, and that would just open up everything for us right. We could get into so much more if we kind of push past that kind of tight, actual innocence brand, which I believe is you know we don't have to be so literal so and I'm pretty sure, she'll be embracing that so I so excited yeah. Do you have you work closely with her and other things? Yes, you know work together for like six or seven years at LD yeah. Yes, she ran the when we know the effect practice groups. She ran a formal justice group which I was part of, so she was my direct supervisor and then she became and then the practice with walls kind of were taken down and she was I guess she was litigation director for a little while when I was there before I left CSI worked with her for really closely for a long time. Yes, great yeah, we're counting the minutes. Yes, we actually cannot wait. So it's gonna be great yeah, it's thrilling, I mean I was just you know, reading about her work on buck 2, which was just extraordinary, and it's just thrilling, yeah, wonderful, yep, I, said it'll be good stuff I. Think Youssef is just a little bit. Gonna be joining us a little bit later tonight, so I think I'm gonna help moderate, which is sad for everyone involved, but we just have some people were having trouble with the link, so we're helping them to get on. Welcome everyone I think we can. Yes, this is the captioner talking. Would you be able to assign me as a captioner? Please? Yes, I've spoken to the two Rubin and let me just double check on that. Be right back sure. I can show you how to do it. If you want yeah well hi, this is Reuben yeah. If you don't mind walking me through that I'm happy to sign here where it says it says a sign. Captioner and I'll take it from there. Unfortunately, that is not an option over here. Yeah I'm, next to your name, and but there isn't an option under more yes, no I can see make host make co-host. Allow record rename input in waiting room, nothing about captioner yeah. Maybe you don't have you haven't uploaded the latest zoom so before I upload it, the latest zoom I had it. So let me see if I can try another way. I can try another way and but all my captioning will come up in the chat box and for anybody who wants to see it? Okay. So that's what I have to do. This isn't the first time where I see that I'm. So sorry that happened: alright, yeah I'm! Sorry, we weren't more aware of it, but yeah I think putting it in the chat. If that works for everyone, it's probably the best way forward. Okay, you'll just have to give me a second, because then I have to make some changes here with my writer. Okay, we're waiting for a few more of the panelists. If this works I think we're waiting for Cynthia :. Oh there, she is okay. So we have everyone here, we're just waiting for Sharif to arrive, he's I'm! Sorry, not! Surely that's his brother Yousef to arrive he's running a little late, I'm just going to share just yes! I can hear you Cynthia just a second I'm, just mute for a minute. So when we get started, if anybody who is hosting this, could let everybody and he let people know that if they want the captioning, they just have to go to chat and they'll, see it I. Think you see it right! Yeah! It's in it's in chat, bot, okay, great thanks, yeah Karen! This is Terry. Wisdom is Adam Ola in yes he's. He I see him as a participant. Okay, I, don't see him, but I see him his cameras off so animal. If you can turn on your camera, that would be great I. Guess you Ruben Kim. Can you turn on animal? Is camera and a microphone I, don't see is mic here. I can unmute people or request that they underneath themselves, but I do not turn on those cameras. Okay, let me see if I can send him a text. I just saw him on camera. Okay, I'll see him: okay, hi, Adam, Ola, okay, now we'll get started now. So let me just share my screen. Reuben I can I go ahead and do that. Let me make you a co-host. Okay, all right, you should be able to share now. Carrie. Okay, can you let me know if you can see it, I started it again. You can see it. Oh okay, and can you I don't know if anybody can hear me I? Think I'm! Okay, well, welcome everyone. So this evening we have a panel discussion presented by Manhattan community for ten, our Parks and Recreation, Committee of which informed the subcommittee. So we're here this evening to discuss the exonerated five in a permanent exhibit in Central Park. So at the outset of this discussion, we, which came about back in November of last year, we began to meet around the issue around March, so we've been discussing it in great detail since March, so the discussion was prefaced with information that was garnered from the just from the meetings and we came up with priorities that would like to have which is whatever the exhibit is. It must be respectful of the families and consists of what matters to them. So that's very important. We would like to have a very diverse dialogue and include as a broader group of stakeholders as possible. This discourse should exemplify a strong community and get engagement around any possible themes and social justice concepts, and then we want to bring the abstract to the concrete in the form of a permanent exhibit, which may mean an interim exhibit before we get to an permanent exhibit, and we also would like to respect how that exhibit will meld with the countryside intent of Central Park. So we want to keep it in context, and this meeting this evening is to engage people in thinking together how to work through the message to be conveyed by the exhibit and how can voice is and opinions be reconciled, because there will be pros and cons so as a focus of a guiding question during tonight's panel discussion. We would like to think about what is the type of pathology that occurs when the presumption of innocence is denied. So that's our focus question to help us in reaching some sort of conclusions or consensus about things so looking at an exhibit in Central, Park I'm, going to be a public art exhibit and any art exhibit is a place, a venue by which we meet an audience. So we have to keep that in mind. Who is the audience that we're addressing? This is the issue of the Central Park five brings to my mind, local issues, national issues and international issues. So this is like this is a global consideration and we're looking at a permanent exhibit. But we do understand that this may mean a temporary exhibit in the interim, which would inform a permanent exhibit. The exhibit well in terms of art can exist in pictures, drawings, video, sound installation, performance, interactive or new media art or sculptures has even been talk of holograms that are being used in some museums currently, and it could be by an individual artists or groups of artists who work together to develop the art piece and we have to in terms of the audience. Central Park has 42 million visitors each year. So there is a lot of a lot of traffic in the park and a lot of opportunities to educate people around this vital issue. This evenings guests are Rebecca. Brown was the director of policy of the Innocence Project. We also have Vincent Sutherland, who is the inaugural executive director of the Center on race, inequality and the law at NYU Law. We have Cynthia Copeland, who is president of the Institute for the exploration of Seneca, village, history and she's, also a professor of applied psychology at NYU, and we have at Imola a la bouff ola. Who is the vice president and co-founder of the Harlan Dwyre Cultural Center, and this evening's moderator is dr.: Yusef Salaam, a member of The Exonerated 5. He is delayed as I said earlier, but he will be joining us. So I'd like to again just well just go over out the format of our meeting, so we are we're having a planner a panel discussion which will run from 6:00 to 7:00, oh hello, we will have a panel discussion which will run from 6:00 to 7:00 and we'll include a 15-minute Q&A, which will be done through questions that our text texted and then we will be going from 7:00 to 7:30 and to breakout groups. One group is we'll deal with the message. That's to be conveyed. Another group is art medium. Another group is exhibit design and another, and the fourth group is one of the largest groups. It is to discuss Seneca village, which is an example of art and art, exhibit that was installed in Central Park. Is there right now it's a temporary installation, but there we're leading to a permanent installation of an exhibit and at the end of that, after these breakout groups will come back as a whole group and we will share and begin to talk about next steps. This is only one of three panel discussions. The next two panel discussions are scheduled for Thursday, July, 16th and Thursday July 23rd for those people who have would like to see the panel discussion. You can see it on you'll, be able to see it on YouTube and make comments, and we welcome any comments. So thank you and now I'm gonna stop sharing my screen and I'm not sure how to do that Reuben. What do I need to do to come out of this I'll just go back to zoom, okay, yeah, okay, it's not stopping the broadcast! It stopped it for us. She's gonna lead us and, as we said, Youssef will be joining us as soon as you can Thank You. Rebecca. Sorry hear me NAT! Oh yes, thank you so much for having me tonight. It's really a pleasure to see many of you again and since the Yousef is running a few minutes behind I'm gonna try to help to fill his very big shoes, so bear with me, but I'm sure he will take over and everyone will be happy for that. But I thought I would just start with a few remarks. Just sort of you know from the Innocence Project and really to talk a little bit about. You know just the incredible opportunity that this offers not only the city but the country in the world. So you know, as I, was thinking about this and sort of the protests that are right now, calling for police accountability and criminal justice reform, and it's really sweeping the nation. This is just an incredible moment to really have tonight's conversation and we have the unique opportunity to really memorialize the experiences of the exonerated five and to educate the public at the site of this incredible huge miscarriage of justice, but also to educate the public about. You know a very broken criminal justice system, I. Think in this moment, it's especially important to consider how the treatment of black and Latin X Americans, how they're treated on the on our streets and how that often sort of that police violence translates also into wrongful convictions. I brought a stat which is pretty staggering. There are 274 people in New, York State that have been exonerated and 74% of those people were black or Latin X. So just an unbelievable number. The first step in a path to wrongful conviction is often the development of a suspect by law enforcement and racial bias or just straight-up. Racism has been shown to influence the process. You know leading law enforcement, often to pursue and develop a case around the wrong suspect for a crime, and it's not uncommon for officers with a history of misconduct which can include incidents of racial bias to be connected with cases of wrongful conviction. You know often when police misconduct is uncovered in a wrongful conviction case. When you do a subsequent review of that officer, you find a ton of other cases involving misconduct or wrongful conviction. Ton of complaints against that officer and the story of the exonerated v is perhaps the most notorious example here of police misconduct in our city. But it's certainly only one of many and I think you know just having this exhibit really presents an opportunity to tell this larger story. You know and I wanted to just give you an example of one which is there was a police detective in Brooklyn Luis Garcia, who pressured witnesses into falsely identifying suspects, fabricating and coercing confessions and manufacturing evidence which led into inquiries into dozens of his cases and already 14 people have been shown to have been wrongfully convicted by this one detective. So this memorial, really I think holds the promise of educating visitors from New York with the rest of the country and indeed the world about our broken and very racist criminal justice system and I. Think it's also a great opportunity to really feature the work of the exonerated five helping to change that system. Yousef Raymond Kevin we're all involved in doing advocacy with the Innocence Project to pass a law in New York a few years ago, that forced law enforcement to record interrogations, we're continuing to work with Yousef and other members of the exonerated five on a bill that would bar deception. Police are allowed to lie during interrogations right now, creating just feelings of complete hopelessness and inevitability for people that are being interrogated so we're working together on trying to ban that as a practice by law here in New, York and so I. Think it's a really nice opportunity to also feature a lot of the work that Yousef Kevin, Raymond, Corey and Ron have done around. You know changing the system and so I think there are just a ton of opportunities here. We're just thrilled to be a part of this and to be invited to be here tonight and I thought. It would be wonderful to hear a bit from Vincent Sutherland about sort of his perspective. On kind of this focused question which is really kind of what happens when the presumption of innocence is denied. So Vincent we'd love to hear from you sure thanks Rebecca, thanks for having me here tonight and I, just want to echo kind of all the sentiments that Rebecca just laid out about the incredible importance of this effort and of the effort to concretize and build a monument to the types of things that we see happening in our criminal legal system day in and day out and in the incredible miscarriage of justice and the incredible tragedy. I think that really defines what happened to the exonerated five so many years ago, and all the effort sedale undertaken to help change this system for the better, and you know, I think when I think of that question about kind of what happens. Almost the pathology that flows from us not team, seriously. The presumption of innocence, I. Think the first thing that comes to mind to me is that you know the criminal legal system that we have right now is one that thing has always failed to give credence to that notion of a presumption of innocence, particularly thinking about people with black and brown skin and, in fact, I think. The reality is that we have a criminal legal system that presumes that attaches is a production of guilt to your race in to your skin color, a presumption of dangerousness, a presumption of criminality, I'm an assumption that you must have done something wrong or must be guilty of something or must be deserving at some punishment. Some harsh control in some way and I think a lot of that and I'd say you know almost all of it really is part and parcel the way in which our criminal legal system came to be built in this nation. If you think about it, all the laws and all the rules and regulations that were put in place to enforce enslavement, determining whether or not you can learn to read we could gather with without you could have children to become get married. If you could eat in a particular place when that system fell, they devolved into Jim Crow all the laws that were dealt with when we think about segregation, although that kind of architecture was all enforced and all upheld and propagated by the criminal legal system. The first kind of police officers and modern-day policing evolved from people who were deputized to try and catch people who were trying to escape and in to freedom along racial lines, and so the entire criminal legal system is really wrapped up and rooted in this effort to control and marginalize people colored with black and brown people and that ideology, even though you know many of us of course, rejected it's still so intimately woven into the fabric of our country. And it's such a part of the way in which people view the world today, I'm a particularly law enforcement views the world today and views the people who were they are interacting with on a day to day basis that think that presumption of innocence innocent that notion that there is a production of innocence on this Solberg is often overcome by those ideologies that really have helped to build this country and I think you know part of the value of a monument or anything. That's gonna, that's gonna kind of memorialize. What happened to the exonerated vibe and what's happening with respect to criminal legal system and thinking about race, is that it helps people understand and confront the fact that we live in a country that was go on genocide and enslavement. You know the land that black people were forced to work for hundreds and hundreds of years was, you know, cleared of the native people who were there before any bus were brought here and America doesn't acknowledge that doesn't want to confront that reality doesn't want to confront that truth, and you know the fact that matter is that if you, if you fail to confront your past, then you just relive it I think if you never live it over and over and over again and I, think that's what we saw in the case of the United eight of five as we see happy and are comin legal assistance, we see happening even those people who are who are arrested and convicted and sense for things that they actually may have done, where we have a system that punish that people bar guevara for far too long confuses vengeance with justice, confuses retribution and anger and rage with the need to actually help people move forward and advance in their lives, and so I think you know it's really the notion that there is this token of innocence. You know it's this completely overcome by all these other factors. All those are forces that have really helped to shape the nation that we live in today and as part of its reflecting reflected by all the outrage and anger you see in the streets- and you know where we're on the zoom culprit, because we're in the midst of a global pandemic. It's important to recognize that it's also reflected by the incredible distortion impacted that pandemic black and brown communities. Were you seeing by people and Latin X people dying at a rate of two to one compared to everybody white counterparts? That's not because black I'm, not next people, are our disease problem. That's because of all these other things that we have failed to invest in our communities: health, education, employment, housing, all the types of things that we know that people need in order to avoid any interaction with the criminal ecosystem, but also to live, productive, happy and healthy lives. And so to me, this monument, this memorial or whatever the project kind of eventually evolves into all, can speak to go those forces and need for us to really think about. How do we want to build a society? That's actually gonna live up to the ideals their little set forth in our founding documents, and the book to notion there is a presumption of innocence, live the notion that justice is something that we're all entitled to and think critically about. How do you? How do you repair the harms you've done when you have a system that run roughshod over so many people's rights, so in Google's lies and it's really destroyed communities and families without any public safety benefit, how they might define those words for anyone, and so for me, there's an incredibly important conversation and I'm really just too old to be a part of it and grateful that folks have undertaken this effort. I think you know it's. We have these kind of monuments to Confederacy that marked the iconography across the South, giving real credence to what people value and what people think is important and so I think. As those types of monuments are torn down and pulled down, it's incredibly important for us to build up new monuments to demonstrate what we actually think is important and will in the kind of feature we want to build for the legacy. That's gonna be left behind us, that's so yeah well put in and I you know. Just as you were speaking, you know, it really made me think a lot about. You know the opportunity that this monument has you know, sort of. As we were talking about. You know the iconic icon, I kind of I'm not gonna, be able to say that. Well, the monuments are torn down right as they're being torn down. That gives us the opportunity to kind of reimagine the kinds of monuments that we want to build like this one and sort of next to that is sort of an opportunity, I think at this very monument or exhibit to kind of reimagine a criminal justice system, and what that might look like- and you know mention you were just touching- on sort of a lot of these themes, right sort of all of the kind of unaddressed, social ills that we don't want to kind of deal with in our society that end up being kind of thrown into a criminal justice system and I am just interested in your thoughts a little bit about kind of what that might look like what a reimagined criminal justice system might look like and what kinds of themes might we want to sort of? You know celebrate in a reimagine system at a monument like this yeah. So that's a great question. I think you know part of the challenges, we're looking something we've never had in this country before and so when I think of a reimagine system. I think that what we're trying to do is not only shrink the footprint of law, enforcement of police and prosecutors in people's lives, eliminate the need for prisons and jails, and you know stop putting people in cages as though they're animals trying to figure out like what are the needs that people have or to ensure that they're gonna build amid the type of lives that we all drive for describe. How do we ensure that people are a little bit we're thinking, you're treated with dignity? How do we ensure that, when people have to be separated from society for some reason that one day able to rejoin society after they've gotten the help or the assistance that they need, that they're able to rejoin without encountering the types of barriers and hurdle that so many people have had to deal with whether it's not the only good job or not be able to find housing got? You know, return to education or not be able to get adequate health care, adequate mental health care? You know so those are some incredible things and I think there's also this real there's this critically important piece of how do we help the community determine what public safety means? How do we have the community to determine how we want to hold somebody accountable for some harm that they have may visit it upon someone else? How do we allow the community or help the community determine what that relationship looks like? How do we restore that relationship between the individual and the person or persons that they may have harmed? How do we? How do we get to the point of forgiveness? You know, and it's not as though, if we, if we eliminated prisons and jails and all these apparatus, all these all these features of the criminal evils of tomorrow that there would never be any type of violent crime there never be any type of violence that harm would never come to anybody at all, and so I think there I think there's part ilysm. We need to reckon with that as well. One of the things that kind of that'd be two interactions that turn violent or harmful. How do we kind of drill down into the psyche of individuals and work with them to deal with the trauma that they've been dealing with, which is often really the root cause of the types of interactions that most readily give rise to a lot of outrage from the public and others as someone who's been traumatized in their life, and that trauma has been carried on and passed on generation to the point where their response to some stimulus is fight-or-flight, miss Allah, so reckoning and dealing with the individual trauma that people who fell over the course of their lifetimes, so I think you know part of it to me is when I think about a criminal legal system, I think about system, it's gonna rather than kind of separate harm and denigrate and kind of do more damage, I, think of a system. That's gonna. Try and how do we help to repair people, because I think we have in a criminal legal system is a system that is essentially a warehouse for all the people who are broken and we take people out of their communities, take people out of their families. That has a ripple effect on their keys on their families and it breaks them as well. It harms them as well, and so what I think about is how do you repair those types of harms and individuals? And it's not easy work? It's challenging work. This is really difficult work, but I think for so long. We have taken kind of the easy way out. It's much easier for us to lock someone away for decades on end, then, to try and intervene at some point early on in their life, invest in their community, invest in the types of things that we know that they might need it's much easier to say. You know what we're not gonna deal with the problems they might have, and so it's I think part of it. What why I vision is something that's gonna be more restorative, more reparative, then what we have right now, which is at the complete opposite end of the spectrum. It's kind of like this: let's just throw this person away and forget about them until they until they eventually leave their place of incarceration and then we'll just deal with whatever consequences come from them being dropped back into society or that I need two types of supports. We know that we need nor to survive right. I mean you know, I struck by so much that you said I, think one of the key points was really sort of the idea of communities also driving the kind of society that they want to live in, and you know as somebody who does criminal justice policy work. You know I'm struck so often by how many tools are used in the criminal justice system to hold communities down that involve absolutely no input from the community and I'm thinking about blanket surveillance technologies that are supposed to predict where crime is supposed to happen and algorithms that are totally racist that are used to you know, ensnare entire communities and I think you know it's just a wonderful theme, I think too, of kind of bringing the community in to determine the kind of reimagine criminal justice system and world that they want to live in, and so I think it's a great theme to think about, and Cynthia I'm, not sure I there you are hi Cynthia I, just thought. You know in terms of the theme of community- and you know, I know that you were just an incredible leader on the Seneca village project and really sort of navigated. You know building something before the sort of the process of getting an exhibit displayed in Central, Park and work with Central Park and the Central Park Conservancy. So we would just love to hear from you a bit about that experience. What that process was like and really any advice you have for us, -, I'm, sorry, I, think you're, muted still, and you hear yeah I'm actually using my landline, so there might be some feedback because the systems not working so the process of creating the exhibition in Central Park was a very long process. It started with the unveiling or the reveal of the Seneca village project and the that started at the New York Historical Society started as a as an exhibition back in 1997. It was also I, think told I being told turn off my cell, but it's not my cell, it's my landline. So can you hear me through the phone through the speaker? You can actually hear you just fine right now, because if I hang up on the landline I, don't think you'll be able to hear me right. Whatever you're doing right now seems to be working so, okay. Well, it's still echoing for me, because I've got these two devices going so and I can't hear you all through my computer. So, let's see if I can start again, so the New York Historical Society created an exhibition on Seneca village. The story of the village revealed itself around the time that the African burial ground was revealed in lower Manhattan and it seemed like suddenly the story of the early African presence in New York was being revealed all over the city and so through a lot of research work that was inspired by the historical documentation and reveal by Roy rosensweig and see Blackmar, who wrote the book the park and the people within that book. There is a section on the story of Seneca village and at that time they were using all kinds of repositories throughout the city, including the New York Historical Society, and at that time I was an education curator and a colleague of mine, Grady, Turner and I, and other members of the Historical Society decided that it would be very useful for people to you tell the learn about Seneca village through an exhibition, and so as we hope that story. The community was very perplexed and dumps gobsmacked because they thought they knew everything about New York City history. But you know when they heard that they said. Oh, my goodness. There-There must be lots of stories like Seneca village around, and we need to do something about that. To learn more and you know, people were angered because they didn't know the story of Seneca village. So the exhibition went up and it gained a lot of notice and people wanted to hear more and be a part of it. And so the idea of creating more opportunities for education came up and there was an effort to bring the community on board to sort of see what would be of interest to them and advisory board was a staff. Was that included people from academia, as well as churches and from the local communities to sort of guide us in what could possibly be a way forward to help people to learn more about the community? And so once we did that he reconnected with the shield school students to barky ology at NYU, and excuse me at City, University and also at Barnard, and we Diana wall was at City, College and she's an archaeologist and anthropologist as well as nan Rothschild up at Barnard, and we started to think about what is it possible that we could do an archeological excavation and, of course, those ideas came up during the time of the exhibition. That was on display at the New York Historical, Society long story short and moving forward after many years of working with community to sort of guide us as to how we might establish and develop more of a relationship with the New York City Parks, Department, Parks and Recreation, as well as the Central Park Conservancy, that we might be able to approach them to offer up research design and an effort. Proof evidence that we should do an archaeological excavation, and so we did that excavation in 2011, but prior to the actual digging in the in the area. We were able to do several test pits to see if we could indeed find factual remains of the village and of the community prior to the actual digging, though it took steps to do that, we had to do ground-penetrating radar. We had to you, know, to sort of determine if there was a reason for going in the ground. We had to do soil coring to find out if we could hit on the original soil and the original landscapes, because when they created the park, they brought in a lot of landfill to build up the park. So we were trying to make sure that we were hitting the right levels where the community would have lived if that were at all possible, and so through a lot of mapping through a lot of geophysics, we were able to determine that we had identified locations that were likely to produce artifacts of the village, and so we had faced a few more obstacles, both the fumer requirements by the powers that be the city powers-that-be, but eventually as partners, because we brought them in along the way to keep them aware of what was going on and by bringing in members of the greater community the surrounding community. We were granted the right to do this excavation, so the excavation took place in the summer. Actually right around this time. In 2011 we invited students from City College and, from you know, local universities, my you barnard. We had a host of individuals. We looked specifically for people of color who maybe were not even aware of the prospects of archeology as a career and invited them into the process of learning the techniques really basic techniques of archaeology. But we were out there for six weeks the students got a stipend. We were able to get grant money from a variety of spaces, including the National Science Foundation and from national geographic and from the university's Barnard City College, and why you kicked in a little bit as well, and we were able to uncover all of these wonderful artifacts that now rest in the repository of the New York City has an archeology repository. It's also known as the nan Rothschild archeology lab located in Midtown, and they are now the stewards of all of the artifacts that we uncovered. The work has been examined. The objects have been examined and cataloged and there's still a lot of work to do in terms of sort of telling stories about the people that lived in Seneca Village because, prior to our exploration and our continued research, the people who were represented in that area from the mid nineteen to the mid nineteenth century were often described, as you know, basically tramp squatters and thieves that were living off the landscape and it had to be there when, in fact, we, through our discoveries, found that people actually paid for their land. They were landowners, they were settlers. It was important for them to have land because they wanted to be involved in the political and requirements in order for black men in particular, to be able to vote, and so that was why the land was purchased in great numbers. There was a high representation of black males, purchasable Zion Church, nickel truth, that is an integrated Church. There was a school that was there, as you know, and so, as a result of all that work in forward to 2018 the historian at the central Conservancy, Murray, wolf, great, a better relationship and recognized the value of telling the story of Seneca village, and so she really took it upon herself to push for a an exhibition and so working with the members of the Seneca village advisory team that Seneca village project, and we now call ourselves the Institute for the exploration of Seneca village history. Working with us. We kind of helped to inform how the panel's could be exhibited as a temporary exhibit, which it is at this point, the Seneca Village project had always wanted to gate, who you know puts for an excavation and also to have some point of memories, and once we were able have evidence that we had found. All of these artifacts could tell a richer and a better story, and although we only excavated a very small portion of the village, we still yielded quite expansive bit of material culture. That can help to tell the story a little bit better. So that was the process. It took a while for the signage that you see in the park now for it to be developed and we brought in the community board. They had some say in how they wanted used to appear, but I would say that I process from concept to actual implementation, probably it's about a little over a year because two into eighteen months, once you got all the images together once you got the story going once the determination of where items would be placed to tell the story. So that has been the very long process of creating and realizing an outdoor form of commemoration and exhibition. You help to educate, New Yorkers. Now, I can't hear you guys anymore. So I have to call again to hear you, okay, I, think just because we've just might need a minute to reconnect with Cynthia I'm, not sure by the way. Also, if you SEF has been able to join us yet because I don't want to overstay my moderator. Welcome I, don't see him I, don't see him yet Rebecca. But okay, while we are waiting for Cynthia to come back on, we can hear from Adam Ola. Can you hear me yes, okay, that would be great, and you know I understand that you had done or dedicated some artwork to The Exonerated five I just heard it very briefly in passing, so forgive me if I'm getting that wrong, but I would we would love to hear about your involvement in that and whatever you want to share well. I was unfortunate that the excuse me the how many everybody knows your about the hello. Can everybody hear me, can you hear me yeah, okay, the greater Queens chapter of the links, which is a social educational organization of professional women who do all kinds of wonderful things for youth and for the community in general they decided last October during their annual gala to celebrate and honor the exonerated five dr. Yusef, who I haven't heard from, is you doctor? Are you there I think he's not here yet, although his mother, they commissioned me to because I created something many years ago, where, instead of going to the trophy store and buying a prefabricated mass for Deus, Pro trophy or a piece of crystal that, I would begin to incorporate art into giving as a excuse me as a tribute to any particular person. So what I did was took one of my wood cuts, which was called confrontation and I. Crafted that image into an award that was then presented created for all five of the exonerated five now dr., Salaam and Cory were actually present at the event, the other three gentlemen were not able to make it, but we were able to send the awards to them. So it was a wonderful event by the this group of women. Again, it's the great Queen chapter of the links and the moderator was the young lady on spectrum. One like her name slips me right now, but she was the moderator, long story short. We incorporated something that was significant created during the 60s and it was called confrontation and regrettably, I don't have to aim. Is to show you but I could share it or you can go online and see that what I'm listening to is the wonderful input from so many of panelists here and what came to mine in terms of what would hopefully be a permanent monument and educational experience that monument has to be majestic. It speaks of victory. It speaks of rising above adversity. We I can't even begin to imagine what that is now, but I think that is the feeling that I get and that's one of the reasons that I've been invited, so that I can give a creative literal view on what this monument or exhibit should be. So that is really the thinking at this point. I was way too early because I know we're gonna have two other discussions, but to incorporate all of the your concerns is going to be the challenge and the ultimate challenge is creating. That is going to engage the public in a creative, dynamic way when they come upon this monument plus exhibit that's what I hope. We will eventually come to where you have an actual physical piece of sculpture, or some three-dimensional object, and then you also have panels or maybe even something, more creative that engages the public. It's very important that anybody who comes upon this, that it becomes an experience, and it should be an experience that of course, speaks to the core issue, which is much of the impression innocent people being sent to jail and their life being ruined. Along with that reality is about the. What do we do going forward? I think whatever was the exhibit we finally come up with, should also be offering solutions and offering a sense of hope and always a sense of unity will ultimately create victory and little unity will suppress and defeat evil things that are being perpetuated on innocent people. So again it's a little early to speak more specifically, but those are the kind of components creatively that me and others that I would want to engage other creative people so that whatever we come up with, that it is dynamic, very engaging and speaks to not only the empty. The importance of what has happened but going into the future. What must happen so that that's the creative challenge that myself and whatever team I pulled together along with community board ten and all of you, that's the creative challenge that I'm absorbing as I. Listen to all of you, I love that, because I think it really does be to sort of also this notion of real what this could be, what this world could be and I think that's just probably a great theme to maybe end on Karen I want to be really mindful of the time. I know that this panel is an hour and simply so many questions for you too. So I was fascinated by what you were sharing so I, but I think that we're a little out of time and I should probably turn it over to Karen at this point to move us into just. Let me just in closing the whole idea of what living experience. Reimagining is very important. I hear that coming from you and others, and as the history of resistance is important and again it's all about doing it creatively that so that a person does not feel that they're being beat over the head, but that they want to be involved. They it's easy to understand that a child as well as an adult, will walk away from that more enlightened. That's really helpful, and you know- and some of our conversations here have already been about how we can engage young people in this, so I think it's a great theme too to end on and I'm, so grateful, and thanks for everyone, for you, know just participating in the panel for indulging me as your sad moderator for the night, but I'm so happy to be with you all and very excited to participate in the breakout sessions and I just couldn't be more energized by this project. I think it's just it's a long time coming. It's overdue and it's gonna be a wonderful moment for our city and we need it now more than ever so absolutely well. Thank you. Rebecca and you've been a fantastic moderator. Thank you. So much excellent operator, and now and I just like to say now, we will go ahead. We're gonna not do this Q&A right now and we're gonna go ahead into the breakout group so that we can put our heads together and come up with some of some ideas around the message to be conveyed: the medium of art that might be used, the exhibit design. And then we have another group for just to take a look at the Seneca village project and what that entail. So tejani I'm gonna ask if you could just kind of get maybe five points or more from your group, which would be message to convey and if you could share your screen or just verbalize it. That would be great and you'll be made you'll, be a beginning capability to do that and just kind of get five points or more in your group and if you can share a screen share. That would be great. If not, we can just verbalize that and again the group on exhibit design Karen Dixon are you here and Stephanie Palmer I'm here. So if you could just do the same thing in your group, which would be exhibit design and then we're going to have a fourth group for the Seneca village, okay, so Reuben is gonna, break us up into groups now and then for about thirty minutes or less and come back to share. Excuse me carry this is Stephanie before we go into the groups. I see you such alarm, others on the phone. You were like a year from her before we go into the groups. Is that possible? Yes, if she's like yes, that's fine, yeah she's on she's on a call I see her on a call, yes I'm sure on. Would you like to say something Reuben? Can you and unmute? Okay, there you go I. Did it well, I'm glad to see this process starting, not starting, but moving more forward than it has been moving before and you know, I do agree with some of the comments that were made with many of them really of the comments that were made and I. Imagine one of the important things for us is a piece that speaks to the changes within our community and how we can make African American people as humane as possible, because you know part of these issues that relate to justice. Gears taught us being seen as less than human and therefore very easily, to be convicted and vilified within the eyes of other people, and when we looked at these types of exhibits and see what we can get out of, because one of the things we do want is for people to walk away with a lasting impression, a lasting experience of whatever it is, whatever the final product is, and an example of that lasting expert expression to me is a street for should I, say out a street out exhibit in Birmingham Alabama and that exhibit is across the street from the church that was bombed where they bombed those four children and on the side of it. They have a museum, African American Museum regarding that period of time, but they show within this park, setting a number of statues and they show a number of dialogues between people who were representing in this particular climate of fighting for civil rights, and it was very interesting when you see it and you see like first is there's one of the exhibit where you see a statue of this dog and it's in full attack mode, and you can see the chain behind it. But it's no one holding the chain, but when you see it and you walk away, it makes you feel, like you know, and somehow that the dog is real and that everything that you sing around it is real. And this learning experience really puts you into that moment. But it's also in to take away something in the learning experience behind it that talks to how we move forward as a community. How we move forward to make sure that this doesn't happen again, how we educate our people going forward as well. So it's very interesting and how you do it, but even with the piece where you have the kids going into prison, and then you have them coming like you have a in Africa. They have this thing called the door of no return, and then they have a door of return. So it goes through the gamut and you can humanize the family members that are in this type of situation, because as black people I do feel that we are a dehumanized group and it helps people to think that different types of things can happen to us and be done to us because that's who we are- and we accept these types of behavior and we live with it every day, but we are more than that and the exhibit should express itself in a way that says these people and this community are more than that. They cry also. If their children are hurt, they love, they, you know, rely on each other, they support each other, even if they are the same as other times communities, and you want all of that type of stuff. I, don't know how you're going to get all of it right at this moment, but you want all of that stuff to become a real part of what's coming out of this face, which also includes the learning experience. But you know people might walk around and see something about their rights or whatever it is going forward that they can walk away with and think about and move forward. So I'm hoping that we've moved forward and you know get some more stuff done. Some wonderful stuff I see Youssef is on you set this on. Yes, everybody hey! How are you not bad? Not that welcome thanks mom the would you like an say, a couple of words to the rupiah and because we're getting ready to break out into the breakout session, but Cameron and Rebecca and the rest of those people that I've been presenting have been doing an excellent job and it's moving forward. I'm gonna beat that night yeah I'm I'm a little late to the party, but I'm glad to see everybody on it. I hope. That's not me. I hear a lot of air somewhere, but I'm happy that I see so many familiar faces and friends on the call and some places that I don't know, but I'm sure one is familiar with the case and the importance really of us being able to be in a position now to teach people you know through imagery, through structure. You know through example, because I think that's one of the things that speaks to the reality of what dr. Angela Davis said when she said we as a people, have historical amnesia and I think the reality of that. Isn't that we have that because we decide we decided to not know, or rather because of how we've been socialized, they've trained and taught- and you know it's like the education of the Negro biology Woodson. But it's also like the mis-education of the negro by cottagey Woodson. You know so I'm glad to see you all and happy that you are all participating in this great effort and I can't wait for it to happen. Yeah look Thank You, you stuff and we're gonna go into the breakout route groups and I just want to thank mrs. Salaam for that. For those wonderful words of wisdom and that advice found advice that you give so Reuben. Are we ready to go into the breakout rooms pretty much they're, just three people it? They might have dialed in and so I'm, not sure who they are in which groups they belong to you for group. Okay, I just want to make sure it's not someone who is in another group, but because of audio issues. Okay, so I'll just assign people to the fourth group, those who have dialed in and if there is a mistake, please reach out to Karen or myself via the chat option and we'll get you into the right group. So all right, I'm, gonna, open them right now and people will be sorted into their various groups. One sec. Are we supposed to click? This thing that says joined breakout room? Yes, ma'am Sir, Winston, yeah I found here hi, so we've started the breakout rooms and you should have gotten a prompt that says join breakout room regarding the art medium. Did you did you get that yep? No I did I'm late for the party too. Okay, let's figure this out, I'm learning. Okay, did you get a notification now? Well, I can join it just by pressing this. Yes, hello, everyone! We have returned abruptly to the main panel discussion, so we were in the midst of you. In the midst of answering a question or asking a question, we will try to address that more lengthily, so we'd like to ask the co-hosts to share just very briefly what you got out of your groups. So we can start with message. The message to be conveyed group, so can we hear from the group leader would be from your side? So categorizing are human and we are starting from a place where from slavery in there after so that was the first. The second message was that up. This is not history. There is absence of african-american education in the curriculum and the life experience of black people has been one of criminal justice and prosecution that has consistently in different forms. It was some kind of voter disenfranchisement or separate but equal, and then your mass participation, mass personalization every thereafter, whether its economic, educational and then the last one which we didn't get to, because that 43 second talk came and kicked everyone out. I think we were about to pay forward and something needs to be done to help the community or some kind of emotion that evokes those four witness from which this atrocity happened to feel hope and expect that there is a way forward and something will be done, and so that's what we have for the beginning of the message to be conveyed. Thank you, too, honey. That's fantastic and I just like to ask you that can be submitted in writing. If you could just send that over to me, that would be great okay. Thank you. So much. We would like to hear next from Barbara exhibit design. Okay, so I'm gonna try and share my screen. So Karen yes can Dickson. My group was exhibit design and medium art medium. Okay, all right, we'll come back to you Karen, so Barbara's is art, medium I'm! Sorry, oh, can you guys see my screen? Not yet? Okay, sharing, okay, I, don't know why it's not coming out, but I'll, just read really Rubin! Let me just ask Ruby: can we fix that problem? The issue with Barbara's screen? Are you on an iPad, no I'm on my laptop Barbara? Can you try it? Okay, let's see. Okay, there we go. Can everyone see that? Yes, thank you, okay, so what we talked about first, was the you heard from everyone speaking, which was resistance. It needs to be something that represents humanity and humanism that we're all should be seen as humans. It needs to also experience young boys, particularly how our system feeds fed it's fed by or was fed by african-american and Latinos, as referred to as x-ray, and do we need it to be educational and learning so that even a child could learn, walk away, learning something about not just experience and we also talked about community social justice. The vision that was discussed was a monument of exonerated five, possibly showing my peepee and very little tiny vision, a vision of them at the bottom, because for so many years they were, and today their place, they're given too much control and power. We also talked about something: that's digital and a touchscreen, so that people can I'm sorry for the noise so that people can touch the screen and use it in terms of being able to touch and answer a question or a query about it actually is in a multi fashion. We wanted to be inspirational. We wanted it to be something that also says it is not the direction we wanted to go. You know, I show what actually happened and how do we? Educational and how do we prevent these things from happening and explain that you know that's something that we're gonna work on once we get the basics in place and mr. Gilbert was adamant along with youssef sister. We talked about how important it is, have a support system in place for anyone listening car serrated, because not all had not all of the exonerated five had the family support and unity to help them through this trauma, because it was a traumatic experience and that's basically Thank You Barbara welcome, and so. Lastly, if we could hear from someone from the Seneca village group I know, we were in the midst of that answering a question for Donna guilt. Donna. Would you like to just share with us what you gathered from the viewing the Seneca village, video and Karen, just a friendly reminder, yeah, I'm, sorry and then I'll speak up? Okay, all right! That's fine! Thank you! Thank you! Karen, oh okay. So after such a wonderful presentation, Thank You Barbara for showing us up, please our group had some technical issues, but we did have hearty discussion. I think we agree with all of these things outline around what the design should look like, but at Imola also had some concerns around what would be the timeline? What would be the potential costs? What would be the budget so that's to determine whether you know moving from a temporary to a permanent exhibition. Ind I explained to the group that initially it'll be a temporary installation and then we would move towards a secured and a permanent installation, and so that was a lot of the discussion. So the issues around cost and fundraising, Daniel Patterson, suggested that the Central Park Conservancy. Definitely we know at Seneca village dit was fundraising around there was fundraising around certain activities and so that, whether it's GoFundMe, what are the different types of fundraising strategies that would be looked at, including if even couldn't looking at any SBA loans or and we started to hash that out. But we didn't get time because we were at the three-second moment as well, and we all were thrusted back in the other thing that was raised was that on the construction side, the building of whatever installment installation is going to be placed there. That black and brown builders be a part of that project, absent the regulate the requirements of the city in the state's MWBE enterprises going way above and beyond that, and that was again reiterated by prince woods, joined us previously on all of our committee meetings and then finally, mr. Patterson recommended that we look at Frederick, Law Olmstead said who built the part of the park to talk about the fact that the New York City went from having a thriving community that was contributed into the economic outlook of the city and they built Central Park. They decided to build a park over this village and displace all of these people, and that was in 1850 seven, and here we are we're still talking about the same type of behaviour. The same type of views towards people of color in this city, gentlemen, did I accurately care get all of that thumbs up would be fine. Thank you Karen. Thank you very much so now Donna. Would you like to present sure? Basically what we did was we looked at Seneca village Cynthia has a great video of the Seneca village. What happened? What's going on and I think everyone should take a look at it if they haven't seen it as yet now. My question to Cynthia was the fact that it is temporary at this time and she was in the middle of answering the question when we were thrust back. Seneca village represents something of a thriving african-american community and it wasn't just African Americans I mean there were other ethnic people as well in the village, so it shows unity. So I think that if we have something like that, I want to really know about the permanency of it and the way that we can show that the community is actually what I Donna you're on mute Donna if you're still there. You need to tell me yourself I apologize for that. My computer acts crazy. Sometimes so what I was saying if I don't know, if everybody heard me was that we want to really exhibit something that shows that unity and that the community is invested in this because the community was not, the community was not consulted. The community was actually stigmatized and we want to get beyond that stigma. To show that this tragedy happened and we've met remind people that this is what happens when you are a marginalized community and that's what I just like. Did you have something else? No, that's it I'm finished. Okay. Cynthia did you want to respond briefly to that? Yeah I just wanted to say that the community was or the exhibition is currently a temporary exhibition, but the Central Park Conservancy is having conversations about somehow turning it into a more permanent exhibition. I, don't know what that means, because, as the so called gatekeepers of the park, they have ideas about what is to be and what will remain in the park and I would caution that, whatever we end up doing with this particular with the exhibition that we want to have when thinking about Interactive's and things of that sort, we have to really think about the elements. If it's going to be out there and it's going to be permanent, how that will affect the use in the winter and the rain and the snow, and that sort of thing so I don't know if it might be more to our thinking of doing something. A little bit more sort of low-tech or maybe integrating the cellphones and using QR codes, and you call up a number and you get more information or you can do things that way, technologically speaking, but I think to actually have it in the space we might be up for some grave disappointments. Based upon the elements the dogs running around and doing their business I mean we have to think about all those things right when we are trying to determine what will happen. I know as part of the Seneca village story and the as I mentioned the advisory group. We've always wanted to have this idea of the possibility of excavation which we, you know, have checked off, and then we were also hoping that we could continue to educate education was the main focus of what it is that we wanted to do, but then also this idea of commemoration and when we first came up with the idea again back in the late 1990s in the early 2000s, there was a lot of pushback because exactly for what's happening now, you know they put these things up and now they're thinking. Oh other groups are gonna, come in and they're gonna want to do something, and so, and so is gonna want to do something right, and so you know how do you address all of those needs and be fair, but I do think that it is time for black folk to be able to have serious, say. One of the things that we were suggesting is for our purposes for Seneca village, as a more permanent space for commemoration is to think about working something into the current aesthetics of the park so that it could be maybe a garden that is specifically addressed to the people of Seneca village and finding the original flora and the fauna and the kinds of vegetables and things that were grown there. When the village was in place. Maybe we can figure out a way to do something really beautiful that speaks to the community and you can go in and you can rest and you can look back and you can reflect, and then you don't have so much of a pushback against the so-called gatekeepers of the park. So I think it's really important for us to kind of think about what exists in the park at the moment and then try to take our leads from that, because otherwise you're gonna, you will get a lot of pushback. They will say this isn't possible or that's not. You know what we do so we have to kind of you know you be like we do right, be really creative, innovative, but get our way right in how we're doing and work with that which is out there. So that would be my suggestion. Thank You, Cynthia Karen I just want to say that some people have questions. They've got their hand raised. How do you want to handle that? Okay, I'm Yusef right now and let's see if we can get a couple of questions in? If not we can answer them offline as well, but we would so well. We could do it that way, but I just like to hand it over to Yusef right now sounds good, okay, everybody so I like the way that this is going definitely a great step in the right direction as we envision and visualize. This great outcome that we're looking at it's crazy because I was looking online earlier and they were talking about how money was defunded or that's not the word they used, but it was talking about how money kind of came out of the Harlem area and went down to build the structure. That's all yes sounds like wow. That's a lot of money that we could have probably used and put to great use up here, Harlem for the purposes of just all this stuff right and yeah. Looking at looking at where we are and envisioning some next steps, I think the next meeting that we're gonna be having two is gonna, be next Thursday. Is that right or two? Is it two from now so next door is ever gonna have another meeting next Thursday, okay, great back to back yeah I, know where I know we're coming up on time, so I just want to kind of get to some of the questions quickly that were raised. I see, Prince had his hand raised. Yes, okay, can you hear me now yeah? We can hear you. Yes, just expand one, the last two things that had actually Yusuf said and I think it was Cynthia prior to about the Seneca village. Well, first I want to thank miss aurélie for pulling such a large and a group diverse group together, and why that's so important to speak to what a scent yeah I'm, not looking at your last thing so far me for using your first name. This is why it's so important that you have large diverse group at the table to address those kind of things when they, when you do all, come to the push back, for instance. This is why I'm saying that we should have minority developers and builders as a part of that conversation so that when they put things in front of you like, oh you can't do this. First, that's just dealing with the elements. I, don't know if you notice the kiosks that they put up on each corner where you can charge your phone and but it's miss a multi-purpose thing, and that was built to withstand elements. So things like that do exist. But if you're not a part of construction and development- and you know you're not experiencing that, if they tell you it can't be done, we what we refer to that and the speaker. Would you say that Hudson Yards he's referring to Hudson Yards that whole thing? It was a carve-out literally that went all the way up to Harlem that allowed them to access tax-free bonds to build that, and yet it excluded the very heart of Harlem. That is in most need of that kind of investment. So again, if we don't have people at the table that understand this stuff, then we can very easily be. You know, worked around in these situations. So again, I wanted a I'm, sorry for pulling a diverse school together, so that when these things come up that we have somebody at the table that can address them, because that's how you counter that you have people in five minutes. You have people in the phone. You have people that can address these issues because trust me they're going to have a wide array of people in minds that can speak to all of this stuff. We just have to be in a position to match that. Thank you I, like that. That's definitely that's definitely important, especially the especially the part of making sure that we have folks that look like us be a part of this project, because it's about empowering and it's about not just talking about and giving life to this wrong to right this wrong, but also empowering people as well to make sure that we move in the right direction. So I'm not sure if there were any other questions there are. We've got two hands raised at least okay, so I'm sorry I did not see which order people raise their hands, but Folly be I, apologize if I mispronounce that, but, yes, believe me levy. Thank you. My question was to see how this can everything that you're doing is can be added into like schools specifically and our education system. I, like I, told my group I was very lucky to have a black real teacher. He was able to teach me everything from this on rate of five to the village that was in such a part and I wanted to know. How is there any way that we can be able to teach that in the week? And that is instead of me having to go to a teacher? It's just straight in the curriculum I like that I like that idea, because at one point inside of the curriculum they taught about the Central Park five and it was a very negative teaching. It was a teaching that spoke to there's this. This false information that Donald Trump put out there that the seeds about us and about the families and what they did was they just never corrected that wrong, and so those people that went to school that learned about that false history. They went off with that. You know and I think to your point. It's important to not only to just have it be somewhere that people can see and experience, but also, as history is told and taught in school that is corrected, and that speaks to what Prince was saying. He was. You have to have the people that look like us who have the expertise to be at the table, to insist that this stuff gets put into the curriculum and if they don't, then we have to put it in ourselves and we have to create our own curriculum. You know we have to take advantage of social media and all the tools that are out there and push out our own stuff, making sure that what we put out is, you know, totally accurate. You know, but our narrative that is often overlooked. You have to do that. Yes, so Terry you has, you had your hand raised and then Aisha I'll go to you next, okay, hey can everybody hear me yes and if you're not and one second, please Terry. If you're, not speaking, I ask that you please mute your mic. There is a lot of background noise. That's interfering with our speakers. I just want to make sure everyone is heard. Clearly so I think that I'm part of the subcommittee and Community Board, ten but I, think that we are at a very historic time in terms of rolling out with this project and I. Think that whatever our vision is, we should keep to that and have a vision that involves. Culture involves the history so that we're telling our story- and it involves the art that is representative of that and I. Like the idea of like we said there are these billboards that have information that are able to withstand the weather, maybe there's even a building structure that can happen so I think that whatever the thoughts are, we should project those, but we have just gone through a public art situation right here in Harlem. That's been very interesting with the black lives matter being painted on both sides of Adam Clayton Powell, jr. Boulevard, and it was a collective project. I've interviewed many of them through my programming and pollen Network news, and it was a collective project which was very powerful and each artist brought their thoughts and their concepts to the tables. I think that we are in a time period where doors are open for us and we must keep those doors open and bring that culture and that history and it also what I saw in the black lives matter. Project was a great sense of ownership. A great sense of pride that is a temporary exhibit. However, there's even discussion about keeping that mall as a hard-on and, interestingly enough, just in terms of how we are completely marginalized. The initial black lives matter, projects that were funded by the city and the mayor. One is downtown, which is great, it's near to the African burial ground, but the other is in front of Trump but they're. The people who put this together Holland Park to park in it another nonprofit with the support, not the financial support it was completely community paid for. But the fact is that the borough president and the state senator went to bat so that this could happen because they felt well. If you're gonna do a black lives matter, it should be in Harlem. So I think that we must take a stand on whatever is going to happen and hold our thing hold our guard. We are taxpayers and there may be gatekeepers, but we have to claim it and we have to stand strong and even a mitts of what happened with this black lives matter. There are people who came up four thousand bikers to denigrate this property so of the black lives matter. So we really have to take the stand and understand where we are and what is going on and tell the truth in many ways, I think we've gotta stick with the culture. I think we've gotta stick with the history and I think we've got to transcend all of the pain that has happened and in the pain of incarceration as it impacts families and everybody. We have to speak so that our youth can understand because we're still dealing with a lot where you're having to really educate the people, because everything around is missing. It's missing. So that's what I have to say, I think we're a great start, and we need to really be the creative people and the brilliant people that we are so thank you and I'd love to have yourself and your mom and anybody else to do an interview. So we can have a more extended conversation. Thank you said I just like to say: Winston Gilchrist has his hand raised as well. So if you could just call on him after Oh, are you sure yeah? Yes, I'm gonna make mine short I just wanted to ask for BIA. Where did the name Seneca come from, because every time you say, Seneca I, think of a Native American tribe, great, that's still under investigation. We don't know. We know that we found some evidence that in the church register of the all angels church, they referred to the people at Seneca village, we famous paper article from the 1930s or early 1900s. That said that this the place called Seneca where people used to live. But those are the only two contemporary references that we have for that space. There are thoughts that it was either there were Native American trails that were a little bit for other east that ran through that area in the 1500s and 1600s. They are also thinking hist, all the historical community, thinking that it could have been referred to because it was so far away from the population. Thinking of it as a form of this idea of manifest destiny, where the white people were trying to move people out, but the people of color would stand in the way to say no, you can't move us, and so they saw this as sort of attention, and so they might refer to them as those you know as a derogatory term and then finally, there is a philosopher, a Greek Roman philosopher, Lucius Seneca, who wrote a book on Senecas morals and talked about this idea of you know. Slavery is a bad thing, but if you have enslaved people, you need to teach treat them like X, Y & Z, and when the race, men and women were trying to fight for the suffrage of black people and trying to gain our liberation, a lot of the race men and women were reading Senecas morals and we're referring to that so frederick law olmsted. When he went down to the southern border to understand what was happening with the ideas of enslavement, he noticed that a lot of the black people were who were in, who were the activists and who were the abolitionists and who were fighting for the rights of black people were using that as a means to understand. So these are the ideas that are floating around, but we really have no idea why it was called Seneca. Thank you, okay, Winston. It I think you had your hand raised as well. My question is to Yousef. You said after hearing all this I love to hear in your vision of what you think should be done and where it should be, and what lessons you've learned from this exposure. I know what I've learned from you all right: how to be tolerant and understanding and forgiving. Can you hear me? Yes, yeah, you know I'm thinking of some type of visual representation, but also a space that also allows people to come in to connect this particular business with the greater injustice is that we've been seeing around the country and around the nation, because what happens is there's a tendency, I think to teach things in a way where people believe that this is an anomaly as opposed to the norm, Malcolm X said I think he was alluding to I think was either him or both he and dr. Martin Luther King jr.. But if we're talking about the American dream, but I know that Malcolm is often referenced to have said, we woke up to the American Nightmare. You know, I understand it from that perspective is to is to capture this moment in time, not significant, but also connected to all of the other things that Emma tells of the world. You know the stuff that's going on now, that's being videotaped and all of the atrocities that are happening and the stuff that are not being told. You know the fact that they're still young men and people being hung around a nation. Whatever reason you know that this still becomes ok, you know the noose that was found in bubble Wallace's, you know his garage so to speak at the carport and all of the symbol, isms and all that stuff, that's connected with it all, but I think as a good thing in terms of us being able to be in his spaces was talked about. Is that we're in a position now? Where we're? We can't just talk about it from a one or two perspective. It's really about changing the whole thing. It's about making sure that change is significant enough so that, as a part of what I've been calling breaking generational curses mm-hmm come on ancestors wildest dreams right. We have this baton and understand that it's a marathon like nipsey talked about, but at the same time we know that we have to do our part. We have to do everything that we were given and what our purpose is to do so that we push things forward. You know I like you to teach people how not to be bitter. That's what you taught me. That is not oh yeah, but that's the other thing too I think part of being part of justice is restorative. Okay, part of justice and the part that I'm thinking about is what Malcolm talked about when he said. If you pull a knife out of my back six inches that doesn't it doesn't really do anything, you know what does something is taking it all the way out and healing the wall and the people who put the knife in the back in the first place right, hmm, it has to be understood like this whole thing is a concerted effort. You know I'm looking at some of these social media, depictions and they're talking about just atrocities that have happened. You know we know about the third right, but what about King Leopold and what he did and all of the others that have been kind of swept under the rug you know, and so all of this stuff is kind of now we're at this point now, where we're awakening all right. This is the this is the woke state. This is what people are awakening, and you know, the other part is what James Baldwin said. Mmm said to be a black person and relatively conscious in America is to be in a fit of rage at all times, and we've been playing, we've been playing those two worlds, but you got over that very well. Over now, I mean some folks is part of. It is because we've been taught the mis-education. How do we get over Trump all that evil that he stowed on? One of the things that I've personally I would say come to terms with. Is that everything that happens to you I stood for you. This is God's plan. Well, what that, but to describe it, is that, if you need, if you like one of my mother, sent me two more to learn, martial arts I hated that I hate the teachers I just hated their methods because they taught us I was I, was being trained by master Little, John Davis and instead of us having to break boards that had scores on it. You know we had to break boys that didn't have no score. It was like a real piece of piece of plywood that we had at the break, and you know we were doing push-ups on our knuckles and things of that nature, and one of the things I found out was that he and dr. Moses Powell we're talking about needing to teach people real life. We can't we can't. We can't play with it right when you hit something you have to have the calluses of life in order to be able to take the hit, take the blow and so being run over by the spiked wheels of justice. Back then introduced me to the evil right, but, prior to that, my mother could tell you prior to that. We would walk around the neighborhood and sometimes we would see officers walking around a neighborhood and my mother will pop my hand if I said, hey how you doing mr. officer I had no I had no physical understanding of what she was teaching me. You know my sister's here too, but she was telling us often she said she was raised in the Jim Crow South I didn't know what that meant right. All right welcome to America and this becomes as American as apple pie. But what we're doing, which is which is important and which is a blessing, is we are trying to get true freedom, justice and equality mm-hmm and just to say it, it's a it's a it's a it's a blessing that we don't want revenge. That's right! That's right! That makes you eight! Absolutely all right boy- and this is the this is the last thing I want to say before I think maybe we may have. We may have another armed hand up but I gotta echo the words of dr. Maya Angelou, because she's really the one who taught us how not to be bitter, because what she said was she said you should be angry right. She said you should be angry because anger changes you when you get angry about something you say man I, don't like that anymore. I want to do something about it. Anger changes you. She said you should be angry, but you must not be bitter right. She said bitterness is like a cancer it eats upon the host. It doesn't do anything to the object of his displeasure or attracting your enemy to die right, but this is no alchemists all right. If the alchemy is what we do with the anger she says, so your anger, she said you watch it. You dance, it voted. You do everything about it. You talk it never stop talking. It I think the ability to get it out right almost by any means necessary, but in a positive way the ability to get it out is what cures us and it cures us as a people. It cures humanity, you know no, well, you can't. You got to put God in there. You know that's the most important part, yeah learning to love the guy that lets in a guy to me loves the God in you, I'm, not sure. If they have there been any other hands raised, I know: we've gone over sometime I, don't see any other ends either on video or in the participant screen. Does anyone else have any question? Yeah, yes, I had my hand sometime now it wasn't terms of a question. It was for the young man. Phillippi right am I saying correctly: I apologize if I just believe so sofa levy, I'm trying not to tell my well but many for many of us. We were taking taken out of the books and it was an intentional education so that you didn't identify with who you your strengths, the fact that we're descendents of kings and Queens and that we have more power, that's why our power has been, let's just say, taken away by the lack of the teaching. So you said: how does how do you bring it to the school I? Think you're about the youngest person on this panel. You may perhaps begin to think about writing a children's book about your experiences as well as what you're participating in now, not just a children's book I'm just saying that it's something many of us are documenting, but you may have a different perspective documentation, because what you're living is now and now is different for you than it's been for us, because some of us are very tainted because we live and you're in the process of living it. So that's all I wanted to say. Thank you. Just a quick question and statement Tina duck Lee I wanted to acknowledge that I was invited this evening to observe and listen to the project. Yusef and I met you at my exhibition in Atlanta, where they interviewed you for the AJC Lana journal-constitution. So this is a this is a very powerful project and given my background and experience with public sitting on panels for public art and it's a it's a major undertaking that I think will definitely come to fruition. I think but Cynthia was saying relative to the quote-unquote gatekeepers and the interaction that the group will be having with regards to the works that will be presented or concepts that would be presented. This is something that I think I mean I, don't know how all of whom is going to be involved in that engagement, but I know that's that will be a challenge. Forthcoming and I was curious to know. If there is there, will there be a jury? Will there be a an invitational type exhibition or artists, commitment or solicitations to specific artists that have produced works in for certain projects or I'm? Just I was just trying to get a sense of how that was going to roll out, or maybe that's a question for another meeting, but that's the question that I had sorry miss Tina I need to end to all to everyone involved in our panel. We also talked about the possibility of a contest on an international and global level, my perspective of other people's depicting it in whatever format. Thank you see my mom. My mom has a handout. Okay, well I'm, going to say something very quick, because I think I might be last one. Oh, let me say two things: we're probably discuss what you are, what you were talking about, China later on down the road to solidify how that process is going to work, but also right now we need to reach out to as many people that's possible and I'm. Looking here and at one point there was 30 people on the line, so a couple of people have dropped off, but I'm going to just say to each one here, the next time we have our meeting bring somebody else to the table, because we need to build an awareness regarding this project so that we can get success and the only way that that's going to happen is. We need a large group of people of cadre of people coming forward. Who feel the need to have this happen? Who support us and not only support us support us within this community. Okay, bring! Your friends brings your neighbors when the flyer goes out with the correct information regarding how to get in on this call, share it and tell somebody to come on in and be a part of this revolutionary piece, because you know anything that shows up in a good us and a good leg as a revolution. That's it for me, I, don't know if we've come to the end, but I would say this has been a great call. A great meeting and I look forward to seeing everybody on the next one and wits with a friend right. So therefore, we should have twice or triple the numbers next time, and it's probably going to be folks watching this is this: is this going out on the Internet as well right now, yes, it'll, be on YouTube, okay, great, that's perfect! So I would say everybody be safe. I know a lot of the places are going against Trump and people are being told that we should put our face. Masks on I think that's a great practice so that we could stem this tide of being number one in the world now of kovat 19 cases. Well, thank you see you surf and I just like to say to everyone. Thank you. So much for coming I want to take thank our great support person, Rob Rubin, Raman and Beau present president's office for making this platform available and all of our wonderful panelists. Thank you so very much we're going to meet same time next week and we will get our information out a lot quicker this time. Okay, so thank you everyone. This has been wonderful, excellent, Thank, You Youssef for your moderation and Rebecca for pitching it. Thank you so much timing on the meaning be like 6:30 instead of six o'clock. If that's, if that's more convenient, we could do that. Thank you and I didn't introduce myself I'm chair of the Parks and Recreation Committee on that CB 10, so you're welcome. So with that we can promote. Thank you so much.",
        "summary": "This discourse should exemplify a strong community and get engagement around any possible themes and social justice concepts, and then we want to bring the abstract to the concrete in the form of a permanent exhibit, which may mean an interim exhibit before we get to an permanent exhibit, and we also would like to respect how that exhibit will meld with the countryside intent of Central Park We want to keep it in context, and this meeting this evening is to engage people in thinking together how to work through the message to be conveyed by the exhibit and how can voice is and opinions be reconciled, because there will be pros and cons so as a focus of a guiding question during tonight's panel discussion So. That's our focus question to help us in reaching some sort of conclusions or consensus about things so looking at an exhibit in Central, Park I'm, going to be a public art exhibit and any art exhibit is a place.\nFor those people who have would like to see the panel discussion So, you know as I was thinking about this and sort of the protests that are right now, calling for police accountability and criminal justice reform, and it's really sweeping the nation.\nPolice are allowed to lie during interrogations right now, creating just feelings of complete hopelessness and inevitability for people that are being interrogated so we're working together on trying to ban that as a practice by law here in New, York and and I just want to echo kind of all the sentiments that Rebecca just laid out about the incredible importance of this effort and of the effort to concretize and build a monument to the types of things that we see happening in our criminal legal system day in and day out and in the incredible miscarriage of justice and the incredible tragedy.\nThe first thing that comes to mind to me is that you know the criminal legal system that we have right now is one that thing has always failed to give credence to that notion of a presumption of innocence, particularly thinking about people with black and brown skin and Reality is that we have a criminal legal system that presumes that attaches is a production of guilt to your race in to your skin color, a presumption of dangerousness, a presumption of criminality Some, harsh control in some way and I'd say you know almost all of it really is part and parcel the way in which our criminal legal system came to be built in this nation All the laws and all the rules and regulations that were put in place to enforce enslavement, determining whether or not you can learn to read we could gather with without you could have children to become get married If you could eat in a particular place when that system fell, they devolved into Jim Crow all the laws that were dealt with when we think about segregation, although that kind of architecture was all enforced and all upheld and propagated by the criminal legal system.\nThe first kind of police officers and modern-day policing evolved from people who were deputized to try and catch people who were trying to escape and in to freedom along racial lines, and so the entire criminal legal system is really wrapped up and rooted in this effort to control and marginalize people colored with black and brown people and that ideology, even though you know many of us of course, rejected it's still so intimately woven into the fabric of our country It's such a part of the way in which people view the world today I'm a particularly law enforcement views the world today and views the people who were they are interacting with on a day to day basis that think that presumption of innocence innocent that notion that there is a production of innocence on this Solberg is often overcome by those ideologies that really have helped to build.\nWhere we have a system that punish that people bar guevara for far too long confuses vengeance with justice, confuses retribution and anger and rage with the need to actually help people move forward and advance in their lives, and you know where we're on the zoom culprit, because we're in the midst of a global pandemic, It's important to recognize that it's also reflected by the incredible distortion impacted that pandemic black and brown communities.\nThink one of the key points was really sort of the idea of communities also driving the kind of society that they want to live in, and you know, as somebody who does criminal justice policy work.\nIt's just a wonderful theme, I think too, of kind of bringing the community in to determine the kind of reimagine criminal justice system and world that they want to live in, and you know, I know that you were just an incredible leader on the Seneca village project and really sort of navigated It started with the unveiling or the reveal of the Seneca village project and the that started at the New York Historical Society The story of the village revealed itself around the time that the African burial ground was revealed in lower Manhattan and it seemed like suddenly the story of the early African presence in New York was being revealed all over the city and so through a lot of research work that was inspired by the historical documentation and reveal by Roy rosensweig and see Blackmar, who wrote the book the park and the people within that book.\nThe community was very perplexed and dumps gobsmacked because they thought they knew everything about New, York, City, history and you know people were angered because they didn't know the story of Seneca village The exhibition went up and it gained a lot of notice and people wanted to hear more and be a part of it So the idea of creating more opportunities for education came up and there was an effort to bring the community on board to sort of see what would be of interest to them and advisory board was a staff Was that included people from academia, as well as churches and from the local communities to sort of guide us in what could possibly be a way forward to help people to learn more about the community?\nWe were able to do several test pits to see if we could indeed find factual remains of the village and of the community prior to the actual digging, though it took steps to do that, we had to do ground-penetrating radar We had to do soil coring to find out if we could hit on the original soil and the original landscapes, because when they created the park, they brought in a lot of landfill to build up the park So, we were trying to make sure that we were hitting the right levels where the community would have lived if that were at all possible, and so through a lot of mapping through a lot of geophysics, we were able to determine that we had identified locations that were likely to produce artifacts of the village, and so we had faced a few more obstacles, both the fumer requirements by the powers that be the city powers-that-be, but eventually as partners, because we brought them in along the way to keep them aware of what was going on and by bringing in members of the greater community.\nI. Think, whatever was the exhibit we finally come up with, should also be offering solutions and offering a sense of hope and always a sense of unity will ultimately create victory and little unity will suppress and defeat evil things that are being perpetuated on innocent people that me and others that I would want to engage other creative people so that whatever we come up with, that it is dynamic, very engaging and speaks to not only the empty What must happen so that that's the creative challenge that myself and whatever team I pulled together along with community board.\nOne of the important things for us is a piece that speaks to the changes within our community and how we can make African American people as humane as possible, because you know part of these issues that relate to justice.\nThey have a museum, African American Museum regarding that period of time, but they show within this park, setting a number of statues and they show a number of dialogues between people who were representing in this particular climate of fighting for civil rights, and it was very interesting when you see it and you see like first That talks to how we move forward as a community How, we move forward to make sure that this doesn't happen again, how we educate our people going forward as well.\nThey have this thing called the door of no return, and then they have a door of return So. It goes through the gamut and you can humanize the family members that are in this type of situation, because as black people I do feel that we are a dehumanized group and it helps people to think that different types of things can happen to us and be done to us because that's who we are, we are more than that and the exhibit should express itself in a way that says these people and this community are more than that.\nAfter so that was the first Second message was that up: There is absence of african-american education in the curriculum and the life experience of black people has been one of criminal justice and prosecution that has consistently in different forms, whether its economic, educational and then the last one which we didn't get to, because that 43 second talk came and kicked everyone out, I think we were about to pay forward and something needs to be done to help the community or some kind of emotion that evokes those four witness from which this atrocity happened to feel hope and expect that there is a way forward and something will be done, and so that's what we have for the beginning of the message to be conveyed.\nThat black and brown builders be a part of that project, absent the regulate the requirements of the city in the state's MWBE enterprises going way above and beyond that, and that was again reiterated by prince woods, joined us previously on all of our committee meetings and then finally, mr Patterson recommended that we look at Frederick, Law Olmstead said who built the part of the park to talk about the fact that the New York City went from having a thriving community that was contributed into the economic outlook of the city and they built Central Park They decided to build a park over this village and displace all of these people, and that was in 1850 seven, and here we are we're still talking about the same type of behaviour."
    }
}