{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "Manhattan - Parks Committee Meeting",
            "publishDate": "2020-12-11",
            "shortDescription": "Agenda\\n\\n1.    Approval of previous month's minutes\\n2.    DDC: East Side Coastal Resiliency Update\\n3.    DDC: ESCR Signage and Wayfinding Design (withdrawn)\\n4.    Parks Manager Update\\n5.    NYC Soccer Initiative: proposal for soccer pitch at Lillian Wald Playground at PS 188 / Island School\\n6.    Vote to adjourn",
            "lengthSeconds": "2:10:07"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "Z_yOt2TGd5Q",
            "fillerWordCount": {
                "uh": 239,
                "um": 332
            },
            "readTimeFullTranscript": "84 min read",
            "readTimeSummary": "12 min read",
            "wordCountFullTranscript": {
                "school": 51,
                "project": 49,
                "park": 48,
                "parks": 42,
                "soccer": 38,
                "space": 30,
                "pitch": 26,
                "kids": 25,
                "construction": 22,
                "program": 21
            },
            "wordCountSummary": {
                "school": 18,
                "park": 15,
                "parks": 11,
                "project": 7,
                "space": 6,
                "department": 5,
                "program": 5,
                "kids": 5,
                "organization": 4,
                "spaces": 4
            },
            "fullTranscript": "All right folks, good evening and welcome to the December meeting of the parks and Waterfront Resiliency Committee. If you are a member of the public, if you can use the chat feature to sign in for attendance purposes, we ask for your name and any affiliation if you are affiliated with an organization or community group, if you're not, you can just put your name and neighborhood. If you want whatever you'd like to do, we are only using the chat for attendance purposes as well as technical issues. So, if you are having any technical issues with zoom, just put a message in the chat and I will try to help you as best I can for tonight's meeting. The way the chair typically runs, the meeting and I am not. The chair. Trevor Holland is that after each presentation by the city agency, there will be a time for question and answer from community board. Members first will be the committee. The members of the community board that are on the Parks committee then, will be any other community board members at large who may be attending tonight's meeting and then after Community board member question and answers, we will open it up to the public for questions and comments. As usual, we ask that everyone keep their questions and comments to two minutes. You will be timed and keep the questions and comments on the topic at hand and not to go off topic or try to bring up something. That's not on the agenda. We use the raise hand feature for this function. So if you don't know where the raised hand feature is, if you open the participants screen in zoom, you will see the raised hand feature there. That's how we will take it. Take questions. Typically, we take them in the order that people have raised their hand. If you are on the phone, it is star nine to raise your hand and star sits to mute and unmute yourself on the phone and just a reminder. We are recording this meeting for compliance with open meeting law and the meeting will be posted on our website within the next 24 to 48 hours. I, believe I've covered everything Trevor. Thank you Michael, for that introduction. Just gonna add a couple more things. Typically, we try and move as efficiently as we can as fit efficiently as we can. Although we do run into issues at times the agenda that you see posted we're going to move things a little bit around, but those are the topics that we're going to discuss tonight. If you are here to speak on an item that is not on the agenda, we ask you to put that notification in the chat box. Michael can take a list of the folks who want to speak, but if you're here to speak on one of the agenda items, we ask for you to wait until we get to the legend item. As Michael has stated, we will take the questions in the order of Community Board Committee members. Then community board members in the public. That being said, we're going to start with the approval of previous month minutes, which is also the way we take attendance. The minutes are also deemed approved that there are no objections from committee members and I see. Ryan is here so I'm going to put down my notepad since I want to take notes and Ryan. Can you do the roll call Trevor Holland? Yes, we're here technically Kay Webster, here, David Adams, here your own altman you're on Altman Carlin Chan, here Ryan Gillum present Valentina Jones, yeah, Michael Mourinho, here Carolyn Ratcliffe, Robin Chatel, here, Josephine, Velez, okay, it's just Cheers Troy Velez! He is here thanks! That's it! Thank you! Ryan! Before we get to the parks manager, update, I, see two people who have requested to speak on an agenda non-agenda item and they are Michelle Cooper, Smith and Kimberly Tran. So Michelle you want to go first Michael. You want to put the clock, there's two more Trevor as well sure go ahead. Michelle thanks is Trevor. Clock start sorry mine, I'm getting there hold on. Oh here we go the all-important clock. Yes, extremely important. All right go ahead! Michelle! Thank you, hi, I'm Michelle Cooper Smith, I'm a member of Cv3, but I'm not on the parks committee. I, live on Essex and Delancey, and I noticed this week that Seward Park was closing earlier than it typically has since I, don't know, Covid-19 I guess I haven't really enjoyed having that space during this terrible time, I don't have a outdoor space in my own apartment, I typically go there after work, which unfortunately ends later than 6, and so I checked with the office about what was going on and I just asked. If there had been any issues there to you know predicate closing the park earlier than normal and Susan told me that she asked the district services and the seventh precinct didn't have any particular complaints about the park and there were no three-on-one calls and then nothing that comes into the office, so I'm just wondering what's going on and if the park could be open as late as possible. Just you know, especially during this difficult time when so many of us are struggling to meet people in public spaces, when we don't have outdoor spaces of our own. So, thank you, the committee for your time and your consideration about this matter. Thank you. Michelle Michael, who's, next Tren I believe wanted to speak on the same Kim Tran. I'm sorry wanted to speak on the same topic: Jim hi, yes hi! So I'm Kim Tran, I'm a resident at Penn, Rutgers Street, and I'm also here to speak about the Seward Park closure. So I moved to the neighborhood from the East village during Covid-19 and Stewart Park's become like a daily part. I mean a part of my daily life, especially since I adopted a dog on the fall, and so when I noticed the gates were closing at six pm. I just really wanted to understand what was going on similar to what Michelle said. 6 P.M is really tough for somebody who works until 6 p.m, and I really don't think closing the park early is like in the best interest of the community. It serves I think that you know I when I am there past 6 p.m. Usually, when I'm seeing our groups of people taking laps people playing basketball, potentially people walking their dogs. Today, when I was, there were groups, doing you know Tai, Chi and so I. Just think that you know I've never seen any issues and I see I'm sure, there's other who others who need an open space in the city even later at night. So I was really sad, disappointed to see it closed. Even you know before a later time. Yeah. Thank you for your time and that's just what I wanted to raise today. Thank you, Kimberly Michelle, for keeping that to a minute, I appreciate that Michael Wendy and then Val. It's two years from now, December 2022 you decide to go for a walk and head over to the East River. It's your way to relax and stay fit and to get out without spending any money after crossing through an active construction zone. You finally get to the brand new, pier 42 and you notice a few tennis, basketball and soccer players behind sixteen foot fences. You can join the people walking along the corridors between these sports fields, but there's no way to take a Riverside stroll or walk all the way to the public, pier 36, where you can escape the assassin sound of FDR traffic and the massive Bmcr and Esker construction, there's a few tables and benches, but there's no shade no comfort station and with all the chain-link fences blocking your view, there's not much relief from the concrete city, knowing that the time to act is short. I sent a draft resolution to this committee about the interim recreation deck planned for pier 42. This draft prioritizes health and equitable access, along with shaded benzes and a toilet, I included some cost-effective amenities suggested at recent public meetings like low-cost or no cost court access for prioritized, Les resident, tennis players, a water play area, barbecues a shed for park, stewardship, etc. We know fresh air reduces the impacts of Covid-19, so let's encourage local people to stay longer and return. Often, let's extend the passive recreation space by opening 10 percent of the public space currently used by DOT for an ADA, accessible, 2,000 foot, long path with an unobstructed river view linking pier 42 and pier 35. I'm hoping this committee will edit my draft with alacrity and pass a healthy resolution for pier 42 immediately. It's all we will have and CB3 can make it better by the way I'm Wendy Barry resident. Thank you, Wendy Val's next Michael, yes Val and we have a new hand up if you want to honor it from Tommy. Now go ahead. Okay, my name is Valentino Jones, I'm here on behalf of the lower East side, power partnership, I'm a retired, registered nurse. We have concerns about pier 42 interim plans, the tennis courts, basketball courts, public bathrooms and interim timing. We recently were at a community public meeting and there was much good expressions concerning the tennis courts, basketball courts and whether this was the best use of space. So we support the voices in the community, but if the basketball court, the tennis courts as proposed, are implemented. This is what we encourage. One of the things that was said at the meeting was that the cause for attendance permit at East River park. This was at the lesppp meeting. The court for tennis permit at East, River Park is a hundred dollars and someone stated that cost may prevent many, low-income residents of zip 102 from using the tennis courts. So Lesvp advocates that the tennis court fee be waived for residents of zip 102 who receive Medicare, Medicaid snap or public assistance, as well as health care professionals, and we advocate okay. The other thing is the Las Pp resident was at one of the meetings on bmcr and it was stated that the residents wanted to wanted basketball courts, especially for the team, and they were concerned about them moving. So at the meeting at the community construction meeting concerning pier 42 fencing height was raised. Lasbp advocates for fencing similar to the fencing in the slide on the bmcr, which is on page 10, stated basketball courts in terms of bass in terms of bathrooms, Lespp advocates for considering we are presently in a pandemic and that health and safety for the present and future should be taken into consideration when thinking about bathrooms. That's it I'm going to our last speaker and I assume this is Michael who's. The last one. That's just Tommy hi I just want to raise a quick issue. Tonight's, the first night of Hanukkah, and somebody should have checked the schedule to make sure that this meeting was probably not held on the first night of Hanukkah. It's an important night in the jewish community and I think it was a mistake thanks. Thank you, Tommy, I'm going to ask you to refer that to the Community Board office. What a good point thanks! Next up the parks managers update good evening everyone. The first part of my update, is previously in before Sunday. We, the parks commissioner selected several parks throughout district. Three that we will leave open. Suet was one of them. So for months time we left it open due to staffing issues and concerns we have throughout all the Parks Department Stuart. Currently, right now is being open, I'm sorry he's being locked up. So typically, it gets locked up an hour after the library to compensate, because we lock up the whole borough of Manhattan out of district. Three, so I know there's a lot of concerns that either we lock it up too early or too late. It's very difficult for us, because we are currently 30 staff down from where we were last year. So when we lock up at night, we lock it up from the south to east and the west, and typically I have two drivers and I have a staff support person that goes with them. So it's not it's very difficult at this point. So usually, when we get to sue it, I try to arrange it closer to eight o'clock just to maximize people the possibility to go out after work and utilize. The park also Stanton playground is going to be reopened again. We're going to open it from 10 to 2, pep and PD are going to be notified and we're going to monitor the heavy drug use in the homeless issues we have around the playground sewer park. It finally has gas. It is it's we're working on the final punch list to get the park house ready for use. Call this dog one is open and that's currently everything I have to present hi. I'm not going to keep you on too long. But I will ask a couple questions. Just for clarification. You said that the commissioner wanted for several parks to stay open, I, think you meant I, think you're, saying 24 7, which part 24 7 correct yeah, which parks are those I know for district 3. We had Henry Jackson, we had the fields and a lot of the parts were selected because they were so accessible and people could get access, even if we did lock it. Stuart was one the fields on East River, one two, three and four were also selected. Henry Jackson was another one and I believe also so lane I can get you a more I. Don't have it in front of me, but I can afford it to the community board if you could forward that list to the community board. That would be fine and just clarification, you're, saying you're down 30 staff. So it's difficult for you to yeah. Currently right now we have I'm sorry, no you're going to go there. So you're, I'm just trying to get an idea of how you're able to close all these parks within a reasonable time if you're, so we they start at five o'clock in the evening. So before the pandemic, we had 74 70, plus staff, currently right now around 35, so I've reduced the my lockup it's about. Typically, we have a range of four drivers and six support staff. Typically, it's two drivers that do the whole borough. They start at five o'clock and it's difficult, because I have some staff who have chronic attendance issues and they don't come in, but we're trying to make our best to make sure we lock things up, and you know we give people assume enough amount of time to utilize the park in the evening hours. Okay and what was it? What was the closure time? You said after the library closed. What was the closing closure very quickly? It typically closes at six and on Wednesday it closes at seven. So we've been trying to find a balance. I'm trying to push closer to eight o'clock, I checked it before we started. We left it open, it was being closed. Around 7:30 nightly Trevor we've got three hands up and I also have a question too. So all right, so we're gonna go to the four people and we're gonna make this just be brief. So Michael, can you call out whoever you saw first? That would be Kay. Okay. First of all, thank you. Jimmel for the Stanton playground being open from 10 to two and the extra staffing to curb the drug use and all the other things that happened. There really appreciate it. You know I wrote today and the commissioner said he would respond. We need those needle exchange boxes. The community board has signed on to it. We've have volunteers working now, trying to put the park back together and they're finding needles and there's no readily available place to put them, and I'm hearing from people that some of the workers who are encountering them who are working on the MTA project are burying them in the soil, which is probably not a good idea. So it's somewhat urgent and also for people who use who would like a place to dispose of the of their needles it they have no place to put them. So anything you can do to expedite that really appreciate it. The community board is signed on to all of it where the coalition does. So. Thank you, I'll voice, your concerns to see Simon, who will give it to Castro I. I'm just surprised you haven't heard yet, because Castro said he was looking good asap so anyway, thank you. No worries, yeah. My question is similar to that: I am a retired drug, counselor and so I want to know. How do you plan to monitor the drugs and don't tell me those boxes because I, you know, I, don't believe that you just finished getting high you're going to get up and be concerned about where you put some needles after you get high so well, how do they plan to monitor the drug use? I mean I. Don't really have an answer for you, for that one I mean me walking around Saturday. Honestly, it's been it's gotten very bad I mean that's something. That's very honest. I know first park. We recently cleaned it up. A week ago we found numerous needles. We have a mobile crew that goes out. We give them needle boxes to collect it, while they're working the people that, with the boxes that you said collecting the needles, do they have those gloves that are like puncture proof, because I couldn't imagine somebody huh, but the staff is trying to have the needles and to have the I've got what you call them to pick up the needles and put them inside the box, so they have those special gloves. Yes, they do. Oh, okay, all right, but anyway, next time, if you could like share how they plan to monitor you know it sounds like heroin use here, so how you plan to monitor it. Thank you, Troy. Thank you, hey Jamil, how you doing just some information on the park staying open, I know. You mentioned the park that I run, and here Henry M Jackson. You know that we have storage shed. There. Are you guys since the park is gonna designate it to be open 24 hours? Is there some type of security? That's going to be in aren't in these parks. I know we have a pep unit, that's on later to 12 o'clock and they do a extensive tour around the district to check on you know: people loitering in the playgrounds and issues of smoking, so they've been doing that, but again I would what I would recommend people to do? Is they write a letter? It gets the park re-reviewed and like we did with seward we opened. We started closing to it: okay, Troy, I'm just gonna, because I'm familiar with the Stewart Park situation. If you have some opinions about the closure or opening of that park, because you afford it to the community Board or Susan I hear you on that storage shed, so I would, if you could write it today or tomorrow, would be really helpful. Okay, great I will thanks sorry yeah we're gonna go to Michael and then Carl will be the last one and then we're gonna move on Michael Jamal. I'm just wondering if you have an update for me about our conversation this morning about the new fences that are supposedly going up in Corlier's. You know: I spoke to mark for Carl this afternoon about it. There's supposed to be a meeting tomorrow to get some more clarity, they're saying that from the FARi division, that areas are supposed to be blocked off, so I haven't got a I, haven't gotten a really concrete answer, or what they're going to do? I'll try to reach out to mark tomorrow morning they get a better answer for you, I'll reach out to you. I'll call you tomorrow during the day, all right sorry I thought you said the meeting was today. That's why I asked no it's day we didn't I didn't meet with the people who took it down, they're, saying they're, gonna put it back up, you know, and we, our chief who was not in today, did send the emails for more clarity from all the parties to get. Why was it? Why was the fence taken down and does it need to be put back up? Okay, well, I know this is being recorded and I don't care, but if it goes back up we're gonna take it back down. I'm just telling you that right now, so you can tell whoever needs to know that, but they're wasting their time, putting it back. Dude, that's a tough day, jeremel last one Carla. Okay, can you hear me? Okay, now yeah, okay, I'd like to address the issue about Columbus park. It hasn't been locked up in over a week now I go up here. Every morning, around five o'clock and negative. The gates have opened on the northern sector of the park. All right, some of the gates are closed halfway, but they definitely are not locked. I would suggest, maybe locking these gates a little bit earlier closer to seven, because there are only several working lights within Columbus Park Thomas, Payne Park has no working lights and Foley Square has no working lights. Those two parts are in total darkness, so yeah, I'm speaking for the three parts that are near me but Columbus park is not safe and neither is Thomas Payne or Foley Square after Sundown. I've addressed this lighting for two years now and it's they're, not district 3 parks but they're. All part of our lock-up part of the issue. I know with Columbus when I read the report nightly is typically because of the homeless encampments inside the park. We can't lock them in the other two parts. What I can do is I can speak to my staff and do a light outage report and then I can forward it up to doc to address the lights that are out. Okay, thank you. Jamil, we're going to follow up. I didn't realize that situation with the lockup that's interesting, and the lights really yeah. You don't want to give video. You need to do this. You need to do the lighting study at Columbus park too they're only about five lights out of 22. and a lot of the lights in the parks are very dim, and we've been also asking for this for quite a while and with Govid. It's gotten very bad. As you said, with Sarah, D and I know, you don't have much power over that, but please do convey. So we just recently did one for Sarah D not too long ago and the lights that were out. We pushed the work order to DOT to address the issue. Thank you all right, Robin I did say: Carl was the last one, but you're going to be last one because we really got to move on so go ahead. Hi. Can you hear me? Yes, yeah I just want to mention the new Ghoulick Park on Delancey is really beautiful, but you know I, guess it's because it's new and the system of keeping it clean on the green areas of plantings that are along the antecedent are actually now becoming collectors of dirt and garbage, and so I don't know if that's the responsibility of parks or if that's D.O.T, but I want to just make a note of that as well. If you thanks Jamil on a set now one of the staff that we dedicated that parked recently got a appointment to a year-round position, but it's not in district three's in district 10, so we lost them so that dedicated staff we have for the park is lost. So it's the common trend, unfortunately us losing staff. What I can do tomorrow is I'll, send two gardeners there to clean up the hot areas inside the park. Yeah. Thank you. I mean it's a beautiful new park and we would hate for that to for it to you know, lose that thanks. So much. Thank you and thank you Jamil for that update and first item well foreign first, not the first time for the next item on our agenda. Folks understand that DDC EDC and the entire ESCR team comes here every single month and they've been coming for years. We're trying to keep the presentation to updates because there's a obviously a lot to discuss with this park or this brand new park. So we're going to look at an update which will deal we're going to find out what it deals with, but we really want to stay on topic here and keep the discussion to the topic at hand, so Desiree you're giving the presentation. Yes, if you want to introduce yourself and you can start, you need to unmute yourself. Okay, can you hear me and see my screen? Yes, okay, perfect great! Thank you all right so good evening. Everyone thank you for having us here tonight. My name is Desiree Gazzo community engagement with Hntb Liro for the Eastside coastal resiliency project. I have presented before so I'm sure most of you are familiar with me. I am here with a limited team tonight, some of our parks and EDC representatives could not make it, so they were the ones that would answer some of the questions that are typically asked. So I just wanted to give everyone a heads up about that to start off with so tonight. Okay, there we go so tonight we're going to go over an overview of contracts, bicycle and pedestrian access communications. We have a few points on what we've heard and then a very quick recap of soil and environmental and section 3 and M/ WBE, just quick reminders, one slides there. We do not have very many updates for Pa1, so we did try to keep the presentation short. However, we did want to provide an update on project area 2 as well again. It will be brief, so quick project area overview. We always put this up just in case. We need to speak to anything and then just the overview of contracts so for project area one the procurement is in process once that process is completed, then the mass mailing will be sent to elected officials and community boards, and then the Ccl will on board early next year for project area. Two, as everyone is aware, the contractor received ntp on November 16th. So we are, you know, still in this mobilization and site prep phase. You know they've only been on board for a couple of weeks, so they are getting all their ducks in a row they're still making submittals, which includes the construction, safety and environmental plans which I know everyone is very anxious about, but they are still. You know within that process of submitting things for us to review DDC and the pmcm team. Again, the mass mailings for pa2 have been sent to elected officials on the community boards and we have our Ccl many Dean on board, which I'm sure again, if you've been on the site up at Aster, Levy and then north end of Zykov Park, you've probably seen her out there for a parallel conveyance again. The bid opening is scheduled for the beginning of 20-21 and then the Ccl to onboard kind of later in the year, so just a very quick overview of some of the activities that you could expect to see. If you go up to astrolevy playground and around solar one, I'm sure you know anyone who's been up. There has seen the fencing that has gone up again. The submittal review is underway. We have started with the bike, rerouting signage, which I will talk to you about in the here. They are doing test fits and minor demolition, and then we are looking to again once those submittals are reviewed and approved. The air monitoring, equipment and installation will move forward so just to review the pedestrian access up in project area 2, the Aster, Levy, Handball and track are open. The access is on East 25th street, around solar 1 area. Where you see the fences going up, that's for the construction of the flood wall, adjacent to the solar one area and most of the work up there will not inhibit pedestrian circulation. There will be days when, due to heavy equipment in the area, the pedestrian access will be either enclosed temporarily with flaggers or it may be, shut down and again for those detours. We will, you know, do our best to communicate and advance the closures in that area. But right now we are looking to maintain pedestrian access through Steicov Park past that solar one area and to continue connecting to the greenway to the north and again pedestrian circulation will be detoured starting in fall of 2021, when the main portion of Stuyvesant cove park takes place so for the Greenway detour. I'm sure many of you have received the community advisory which I have here on the and we wanted to issue a community advisory in advance of the closure of the greenway. The detour that is in the mass mailing package is the Houston Street detour, which, if anyone was at the CB6 transportation meeting, you would have seen the East Houston Street to first and second avenues and then to 38th street. We are actively working with DOT and the contractor to create a more localized detour since the portion of the work. That is happening right now, for the next few months is only around the solar one area. So we wanted to get the notification of the upcoming detour out, so everyone was aware, and then, as soon as we have that route finalized with DOT on the contractor, we will send an updated advisory. So I am expecting questions on that. I do want to practice it with. It is actively in the works. I was on the phone today, so you know we're looking to make that better for you. So again the detours are subject to change as we move along with construction. Pa1 will start up in the beginning of the year and then the detour will change and then once Pa2 again that main part of Stycov Park kicks in next fall. The detours will change as well. There will always be access to open portions of the park for Pa-1 and Pa2. If a part of the park is open, we have, we will maintain access, so you know we put out the detours. However, the detour is not the only route that you have to the park. You know that is for the greenway, it's the main thoroughfare, the greenway. If you have local, you know if you're riding or biking or running locally your detour, you know you may choose to take a different detour. This is the detour that we're coordinating for the greenway in coordination with D.O.T, so I just you know. We just wanted to put that out there and again, all detours are subject to change based on the work that is at hand again. The safety of the community of our contractors of the work area is first and foremost, and this is a this- will be an active, a very active construction site up here in project area two and then, as everyone is well aware down in PA mpa1, so again, just a review of the communications. The bulletins go out. Weekly we've been getting them out on fridays or again, if it's a holiday, we get it out before the holiday weekend, I'm sure in some cases it may get pushed to Monday, but we are really trying our best to get that out before the weekend. The community advisory again I think most of you. If you subscribe to the newsletter and communications did receive the East River Greenway I think this morning we sent that out. There will be a follow-up to that with a route, so we are again working on that, so that it is not the Houston Street to first and second Avenue, so again, actively coordinating with D.O.T and then everything gets posted to the website and we're looking to put some of the maps again once these detours get posted kind of on the website. So that way you can see them and not have to click all around. So we are working through that. We've also received a few questions and I think it was from CB6, but I will mention it here. The DOT street closure advisory. That's on the home page of our Esker website. That kind of when you click to that it clicks of all five boroughs. So we are looking to try to make that click to somewhere more localized within the project area. And so, if you do have you know any feedback on the communications the website links. You know we are trying to make this easier for you. So please reach out through the inquiry tool, and you know we will take you into consideration. You know your thoughts. What we've heard so again, we do have a limited team here today: the compost, relocation. Unfortunately, there are no updates at this point again. If you want to voice your concerns, that's perfectly fine and we can take them back. However, there won't be anyone here tonight to speak to it, the solar one coordination. We have been asked that at several meetings- and we are coordinating with EDC and solar one on the work that they're doing again we're looking to get into solar one to get the construction wall to get the flood wall built and then get out so that way, solar one can go in and construct their facility. So signage. We've also had a couple of comments about signage. There is standard, DOT, detour, signage in place in the contract, as well as several custom signage for the detours in place, and then we are looking at a more pedestrian level, signage as well, especially around the ferry areas and then throughout the parks. So again, that is in progress as the detours are changing. The signage would change emergency access, so we have been, or the team has been coordinating, with FDNY, NYPD, etc throughout this project, from the design phases and now into the construction phase. So you know the preliminary plans that were discussed in the design phase as far as emergency access was concerned is now being realized through the construction phase, as we are now speaking with the contractor and again learning how they propose to phase all the projects. So there are and will be depending on you know where we are in the project active on-site conversations with FDNY with NYPD. They are alerted in advance of road closures or park closures and alerted to what that emergency route would look like. So it's not just you know, here's the plan and we give it to fcny NYPD. We have, you know active conversations. You know the project is very fluid and these conversations go on between our pmcm team and the contractor, and you know all boots on the ground for the emergency access. It's very important to the city and very important for us on this project: the parks site material, reuse, Trevor, I know you had asked this at the last meeting and unfortunately parks is not with us, but I believe you got an answer at the Cag meeting and basically the coordination for any type of parks, materials, benches, etc. That coordination would go through the parks department. They have salvaged several things from the parks. However, anything that is a community need or a community ask. We do direct I, ask that you direct that to the parks department and then just I guess on site safety. Here there have been some questions about the homeless and for Pa1 Pa2 pc it. You know it doesn't matter what project area we're on it's. You know very important to make sure folks are relocated safely. So for Pa2 the contractor has contacted 311. They did when they first started the project and when they first received notice to proceed, and then our Ccl Nadine has also contacted the department of Homeless services DHS to discuss that with them, and the same thing will happen when Pa1 kicks. You know comes on board the Ccl. There will do the same steps and again have ongoing conversations with DHS as needed. You know our contractors here are used to working in the city and this is a pretty common affair that they have to deal with. If there are any issues that you the community sees, there is the DHS homestead program we provided the link here and that is 24 7 outreach across all five boroughs. So you know that is something that a resource on their page- okay, so soils and environment. So this is a very brief slide. You know, basically, we have presented on this before, but we did just want to bring it up again, because we have been receiving several questions on the environmental monitoring so for Pa1 again, the contractor is still in the site, mobilization phase he or they have been or will be submitting their monitoring plan. They are gathering all of that information up and then the DDC construction, DDC safety and the pmcm team will review those the plans. The noise monitoring plans, the air quality plans, the site safety plans to assure that they are in compliance with the city regulations which we have presented in previous meetings. Excuse me so just to reinforce kind of the enforcement portion of this. The monitoring plans, like I said, would be approved by Dtc. The monitoring equipment has kind of an alerting system when thresholds are exceeded and the there is oversight of the construction activities. So there are on-site inspectors which will monitor the work and there's an environmental specialist that will oversee the compliance and again you know we will come back with more information on that. So for section 3 and M/ WBE we last week we had a very comprehensive meeting with the DDC office of diversity and industry relations. We do have our M/ WBE section 3 subconsoled in tranbui, on the call, if there are questions that come up in the Q&A session, but we are working to advance the preliminary strategy that we had begun in the pre-construction. We are now advancing that with these departments at DDC to create these outreach events, small events with non-profits elected officials, NYCHA residents, as mentioned previously at past presentations. You know we have contacted the partnering organizations, Workforce Juan Matrice hire NYC. These conversations have been ongoing again, a big part of the you know, section three and M/ WBE is the contractor's work plan, which again is in this. You know month or so review process of him onboarding and then us reviewing all of the plans. So we are actively working again to bring some of the ideas that we had presented again in previous presentations to fruition now with the contractor on board and when we hope to have a better understanding or when we will have a better understanding of what his needs are on the project, and you know just to reiterate: the contractor is aware of the section 3 and mwpe goals when he accepts the contract, that language is in the contract and he or she is aware of that. So they already have. You know M/ WBE folks on their team and they have already started. You know what this team is, that they are, so I'm not going to go into all of the goals. Again. Train did a great job of presenting that the last time we were here, but if there are any questions she is on the call and then again just if you have any questions and again we really appreciate people using the inquiry tool. Some of the questions do involve a little bit more interagency coordination to get the right information to you. So we do appreciate you know bearing with us as we answer your questions, so that is our hopefully short presentation for tonight and Trevor. We can take any questions. Thank you, Desiree for that presentation, I think that's the shortest one we've had in two and a half years. Let's see if we can get the questions in that same type of expediency. I think. Let me just start by saying there is an additional community advisory group meeting which is open to everyone where they go into a little more depth about these questions, and I'm going to echo what Desiree said to use that website to ask questions. That might have a little more complexity, because you look at an answer and they do compile all the questions and try and answer them, but just want to plug that in because there are, you know just about two meetings every month on this particular on the construction issues. That being said, let's start with Kate yeah thanks Trevor and thanks Desiree I did go to the website and it says I should go to the next community board meeting for an update on the lower East side, ecology, center and I got to tell you- and this is not to you personally, but I really do feel like we're being stonewalled and I. Don't want to go to an advisory group because we're a governmental body and we're the ones who are supposed to hear things so that we convey that to the rest of the community and that's our due diligence, and we can't do it because we don't know we don't seem to ever be getting a report on what is the status of the compost yard is its return assured. Have you met with the lorry side, ecology, center and frankly, I? Think one somebody from the community board should really be there. So I would like you to convey that and it's not gone unnoticed with the composting community that there this parks department is attempting to close another compost yard in Queens, and it starts to look like and I know: you're not parks department, but if they don't show up, who do we talk to? Who do we ask and where do we get answers? So it looks to us the parks department, unbelievably, in the middle of a climate emergency, you know, I mean all this is swell, but we're doing nothing that actually pushes back against climate change. I mean we could mitigate from now till doomsday. That's not the same thing as actually deciding we're going to do something to change the outcome of what is going to be a disaster and already has been for many people, so I don't understand how this city does this and I have to say it makes me a little uncomfortable also that an organization that's been here for decades that has been entirely successful by any measure in getting community engagement in Parks, Department staff has been slashed. This brings people volunteers into a park to help care for it, and we don't have the luxury of turning away volunteers or dissing community groups that have done their very best to make this community a better place and a resilient one, and one that's actually forward thinking and considered a pilot for other cities across the United States. So you know to keep coming here and saying: there's nobody here who can competently respond to a real question to guarantee the return of this and frankly, I. Don't care if I take forever on this topic, because it matters to the people here. So you know, love the presentation, but I feel it isn't answering any of the questions that I certainly have, as somebody who's engaged in a park cares about. Climate resiliency cares about a park being accessible and good for people. This doesn't do it, so that is for you to convey, in my in as nice to terms as you want to or as crinkly as I did. But I do appreciate. Your presentation and I do appreciate you and I'm sorry. You have to bear the brunt of this because you shouldn't okay, thank you for your comment and if you know that's, okay, I will take it back. I'm I, I'm taking notes so I will take that back. I appreciate that Desiree. Thank you. I think the foul was next I. Thank you for the presentation. I keep getting these emails that the project is being delayed in project area one. So can you just speak to that because my concern is always protection, because when you talk project area, one you're talking next to Baruch, Lillian Wall, Jacob Reese, which is low-income, NYCHA housing, which is a lot of african Americans, Latinos, etc. So I always get concerned when the delay is in the portion that concerns low-income housing. So in terms of project area of one, is there a delay now, and can you explain that and then just the other comment that I have? Is that in terms of doing outreach for jobs? What about outdoors and nature parks, because you know we're going to be in mask and whatnot? You need like 80 to 90 percent of people vaccinated in order to have herd immunity, so this is going to be a long time. So one of the things I would think to think about is outdoor Niger parks for outreach, but in terms of and I think every time you come because this just seems to be something I constantly get info about is that the project area one is being delayed, not two where there's Peter, Cooper, Village and Stuyvesant town, but one next to Baruch, Lillian Wall, Jacob Reese. So that's my question: is there a delay? What's the timeline sure thank you Valentina and I'm going to answer the second part first and then the first part, so for the Mwb outreach that you know, we are exploring all options, both virtual and in person, for these again kind of smaller outreach opportunities. So that way we can be cognizant of you know the Covid-19 pandemic and we can keep everyone safe. You know virtual would give us a little bit more opportunity to have more people. However, we do understand the boots on the ground. Outreach is extremely important, so we are looking at both alternatives. For that and again, we will come back with more information on that and then, as far as the PA one schedule, the bid was received and the project is still moving forward and we are in the procurement phase. I will turn it over to DDC if there is anything more to say otherwise again, as we have been saying, it is still on schedule is so on schedule. Hi everyone can you? Can everyone hear me? Yes go ahead? Oh great yeah I was having trouble with playing new button. Hi Val, it's cue from DDC yeah, our ddc's procurement phase for project area. One is still ongoing that process and we'll come back with more details and information as soon as it becomes available on schedule. That's what keeps going out is that it's been delayed, we're still in our procurement phase. The procurement process is still ongoing. That's what's happening right now, as it has been so we'll come back and give you more information when it's wrapped up, okay and I- guess the okay I guess when you come back the issue that everybody wants to hear, is it on schedule or not that that's it? Okay, q I. I'm curious to the answer to this now because I've heard for the last three meetings that it's on schedule and the articles were and I'm not getting that same definitive answer so I guess. My question to you is this project on schedule? As of now again, it's we're still in our procurement phase. Now I understand procurement. I don't want to get on a procurement. I'm just asking a really simple question: the procurement is fine. I just want to know if it's on schedule, as of today, we are on schedule again. This was our procurement schedule and we're on our procurement schedule. Okay, that's what I need to hear! Okay! Thank you. The next person do I have any more committee members who'd like to ask a question: Robin go ahead. Hi, you know I feel like I'm, not I, don't know if my head's in the sand or something but every time you know, there's talk about po things being posted and the emails and newsletters and all this stuff going on I, don't know any of it. So I mentioned this in the last meeting. It's a queue about the fact that you know to not think of each section as its own thing and that it's one whole, and so, when you're, closing and doing notices about the pedestrian pathway and bike path have been closing up and start by stuyvesting, which is community board six. You know it affects us down here in community board three, so you know to think about the whole bikeway you know from as one big unit and so it'd be helpful and certainly I would hate to be and I think I've seen this before with even DOT how they close streets. You know you drive on a block two blocks, all of a sudden, the streets close and you have to leave it'd be great. If all these signs that you're talking about and these notices can go up, you know all up and down the river from you know: Montgomery North, so that where people aren't surprised when they're, walking or biking and all of a sudden, they get up to you know the detour, and maybe they could have done something else earlier. So that kind of thing just to keep in mind and if there's any way to you know, I mentioned it to Q2 that you know, please don't think that you know Stuyvesant cove people just in that area, should get a notice that everyone you know up and from everyone should be getting notices. You know before you answered Robin, I'm gonna, ask the question: are you getting the email, notices? No okay, I think that's one of the main problems from DDC. Yes, because we got a notification and I'm getting a bunch of notifications, so I think if they can start with that either Q&A Desiree or how she needs to sign up to get those notifications, it's not very clear on the website how to sign up, for that should be the first thing on the website saying sign up for email blasts. You know it's hidden away and also you know to maybe think of you know- and this is just for people who are- who you know are connected that way. There are, you know, lots of seniors in our communities, all in Stuyvesant town, all the way down who do not use the internet. You know and snail mail is a way to go. Post things up and fires up in buildings is the way to go. I think that you guys were looking for somebody to do some firing down here. I mean that's the way to go. You know, and also you know, but for those of us that are connected, you know it would be really good to have an app perhaps that we can get notifications on our phones. A lot of people have phones and getting notifications. That way, it would be great something to think about. Okay, great, so thank you, Robin! If you, if from what I have up here on the you can still, can you still see my screen? No or oh okay? Well, if you look on the oh can I share my video yeah. You can bring it up now, okay, great! So, if you look, this is the home page of the website here and if you go to the contacts, I don't see your screen, but yeah! Oh sorry, okay, can you see it now? Okay? So this is the home page and right here where it says contact here. If you click there, then you there's a place to sign up for the newsletter. There's two things: there's a contact us where you could leave an inquiry if you have an inquiry or comment and then I believe the second link down is to sign up for the project information. So you would go to that contact page and I will tell you I agree that we need a bigger button on that page. That says like click here, so if I'm an informed community member on the community board on the parks and Waterfront, Committee and I, you know and I'm not knowing what's going on. Imagine all of the people who are not as informed as me, who have no clue. What's going on sure and I will add that as a comment from the last CB3 parks meeting, there was a comment to add all of the block associations to the distribution list. So we did coordinate with Trevor and Susan to make sure that all of the block associations were added. So if you are a block association and your name or your email is on the CB3 community website- and you are not getting a notification, please do let us know, or if or you know, someone else needs to be receiving it, because we can, you could reach out to us directly and we could update that information in the system here. So I will say that we did update that to include all the block associations if there are specific buildings that you know, you want to get emailed the notification so that it can be posted. We could do that again in regards to the posting along the greenway that was kind of the pedestrian scale, notifications that we are looking to do so that way, it isn't just the DOT level signage that it is more localized and that's something that we do in coordination with the Ccl. So again you know, as the detours take place and again we don't have a detour yet so once we do it, then we could start building. I'm just suggesting you expand your definition of what local means you know and that you know it since it's a bike way a walkway, a runner's way. People are coming from both directions, so yeah I. Can we completely understand? Thank you for that and if there's any anything else that we can do, I will look at the button on the contact screen because I agree, I think it could be a little bit bigger. It could simply say what all arts organizations do and that's my field, you know, sign up for our emails boom and then it's very clear thanks a lot. Thank you. I'm gonna ask if there's any more committee members with some brief questions and then I see three people who have their hands raised from the community who'd like to ask a question and the timer clock is already put up, but I'm going to circle back to the committee members. First, if not I, think I saw Christine first, so Christine. If you want I, think it's called Iphone Christine but I think it's Christine yeah! Thank you, Trevor yeah! That's me, Christina! That's Romero from the lower East side, ecology, center and I just have a comment. Obviously there is no update about the compost yard, which is really very disconcerting. We don't know when construction is starting. We have no place to go and we absolutely have no communications with parks over the mayor's office to sit down and to resolve this issue, and you know it's just really hard to plan anything for your future as a group as an organization and not have any answers for any assistance and the way forward, so especially for our composting program, which is a very important program for this for our organization and for this city, and it's very disappointing that we're not seem to get any movement there. The other question that I have which I'm very confused about, is and that's directly to queue because he's saying procurement phase is still ongoing. Is there a contractor that you have picked now or are you still bidding out the construction work for the area for East River park, thanks sure, hi Christine? So, on the last question, no, the contractor has not been selected yet this again, the selection, the procurement process for project area, one is still ongoing. So once we reach that milestone we'll be sure to inform everybody here, I think you. It might be helpful if you explain to people what is what the procurement process is like. What are you doing during Workfield? Well, I think we I believe we had a pretty in-depth slide or presentation a few months back. That was a step-by-step explanation. I don't want to get too far into details with that with that's up on the website as and we really added a lot of information to that particular presentation that time to for folks to use as a resource and a reference to go back and read, but essentially in a nutshell, a package. A bit package is finalized by the design team is reviewed by multiple units at DDC and it's put out to bid it's public to contractors out there they review it they within a certain period of time they sent back some questions and requests for clarifications. Ddc works to answer those questions and clarification. So there's a period of back and forth there to clarify any of the any areas of that bid package that was not clear with drawings and specifications that was sent out and towards the end of that period, the contractors submit their bids DDC receives them. After a little bit of time. Those bids are opened, we go into bid analysis and we pull in our expert experts within the agency and from our consultant teams, both on the design and construction side. Collectively we all review it and make sure it's in compliance with what's required and they they've submitted all the documents that was asked to and they the lowest bidder from that pool, gets selected and awarded the contract once that award is announced, then we go into the last phase of this procurement phase, which include, which means which entails registering the contract, so our contracts and aqua team within the agency. They start working to register the contract, which takes a certain period of time and then towards the end of that, a notice of perceive is issued and that notice that proceeds gives the green light to the contractor to begin, initiate their first steps of preparing to get their staff together and their work plans and everything and then with Ddc's green light. Their very first day of construction is determined and given to the contractor. So that's a pretty high level, step-by-step process and right now, with project area one we were at that juncture of still receiving the bid review bids being coming in and receiving bids. We haven't finalized that bit process that bid phase yet okay. Thank you. We have one other item on our agenda: the New York City Soccer Initiative, but before we go to that item, I see two last questions on this particular agenda item. So I'm gonna go to Tommy and fanny. You can cue yourself after Tommy starts after Tommy finishes. Thank you Trevor. First of all, I want to let people know at the Cag which would we had. Last week. The borough president announced that commissioner silver of the Parks Department has said no way for composting in the park. She repeated that several times so I think it's time that the community board put some pressure on the local elected officials who all made commitments on the composting to put some pressure on the city, because that's what she said. Secondly, they didn't put up the slide of the temporary bike lane detour, which I find interesting because the community board six, you know all bike traffic is going to be rerouted on Houston, Street and then up first and second avenues and they for some reason, didn't show you guys that slide and I'm wondering why not and lastly, Q five times the bids have not been opened and the bid period has been extended. When will the next? When will the bids actually be opened? And can you please tell us what is being negotiated? What accommodations or what issues are the contractors raising with you, because all we get is the bid has been delayed? The bid has been delayed, you're discussing issues with the contractor, what issues and when will the bid? So you keep saying the project is not delayed. When will a bid be opened so going backwards? The again I can't give you any more details than I already have I know those were not details, but we're still in the procurement and bid process, and once I have more information to provide you we'll come back and do so and we're not negotiating with contractors. There is no negotiation going on right now, because the contractors have not put in their bids that we have we're not there. Yet we don't negotiate with contractors. During the bid process, they submit a clarification request for something that may have not been clear enough in the drawings or in the bid package or in the specifications and we're legally required to respond to that to clarify, so they can put in their bid accordingly. So there's no direct negotiations going on with the contractor and then to your second point with the bike lane that there's no reason why we're not hiding anything that bike lane that by detour that you're referencing is on the community board, six presentation that we provided to them on Monday and it's up on the website, happy to pull it up right now and show everybody it's a public document, but it's a community board six area specific okay I could take over if you want so yeah, go ahead. Sorry, if you want to me to share my screen again, I certainly can pull that up. However, we do mentioned in this presentation that sorry, that route is being reconsidered to sorry I lost. My share screen button out. Okay at the bottom yep got it okay, so backwards. So this is the bike lane slide in our presentation, so I have here the Houston Street to 38th street via first and second avenue, which is what we presented at the CB6. So it was Houston up here and then first and second avenue and then East 38th street I can certainly bring that up again. If you would like to see it is the first bullet here, though, that is the greenway detour that is in the mass mailing and in the Pa2 drawings. That was that again during the design phase right now, since the greenway is only this local closure here, we're reconsidering this in coordination with DOT and the contractor to kind of make that again make that closure a little bit more localized that reroute more localized to the specific project area, so that folks don't have to take that longer route. So the advisory again. Just a reminder. The advisory went out yesterday and today to alert people that the there will be a detour and we are again actively literally calls with D.O.T and with the contractor figuring out and discussing what that safest, new detour could be for this kind of localized shutdown or closure of the greenway. So I Tommy I, hope that answered your question. I could certainly pull up the other one. If you want me to, but it is, we did show that at CB6 and then since then, we have been you know, coordinating with got so I'm going to leave it there, since there are two more and we're going to close it after that. But I do think that in January we probably have to have a little more in-depth discussion on the progress of ESCR overall I know. There's some outstanding questions about procurement. I, don't want another lesson in the procurement process, but we just need to know where this project is so I know. That's where you do a pretty good job of taking. We do a good job, not pretty good, a good job of taking back our concerns, so that is a concern to construct the next presentation on where for PA one we are. I'm gonna end this with, because we need to go to the soccer pitch with Fannie and then Kay from the community board and we're going to end it there so fan. If you want to go ahead and ask your question: yeah hi I have a really quick question so for project area one we noticed that bid is no longer listed in the open bids. Page I mean it's we're just curious like what happened to it and you know, especially since Q just finished, saying that you're not in negotiations with any contractors. So we just want to know what happened to it. Sure and I mean you can jump on again, but I think we really don't have anything else to say about the bid for Pa1 right now. I think Q has probably exhausted all. He does need to say for that right now. So I again, we will take all of this back. We do understand your concerns and Trevor unless you want us to go on more about it. I I'll, just I mean fanny hold on I, understand what you're saying and I'm gonna based on this discussion. We're gonna move this into a little bit more detail for next month and I, hear you and I see other hands, we're going to go to k and then we're going to the next agenda. Okay, yeah I think I've moved from concern to Defcon 3. to hear that at a at an advisory board, Meeting advisory board we're the community board we're supposed to hear what's going on. So it lends credence to the idea that this parks department, your partner, you know you're the city you're, the administration, you know I would like to have us request. Elected officials show up here and tell us what is going on with the compost. You know this. You know we deserve to have a straight answer of a community resource. That's been here since before some people were born here. So you know it's. This is insulting to this body, because we have due diligence that we're supposed to do and we don't have direct straight information from this administration and I gotta tell you on the lower east side. This doesn't play well, and this hasn't been playing well for a whole lot of things that this administration has done, having nothing to do with you, but it it's not. This is not going well, and if this you know, we have had run-ins with this. Commissioner, before on issues that the community said don't lower. Our fences I happen to be the president of a coalition of a park that has an open, no fences and it's a nightmare. You heard Jamel talking about the shape of that park, so we keep getting ignored for the things that we know. This community knows things and the arrogance to come here and tell us not tell us that there is no there's no plan for a compost to be returned, and here it's secondhand innuendo from our borough president and not from the Parks Department, your partner. You have a responsibility. If these were my partners, you better believe I'd make them show up next time. So please do that. Trevor Katie Lowe from Council member Rivera's office is here Chantal from Senator Kavanaugh's office, and they both want to speak Mike very quickly. I'm sorry to cut in here, but just on behalf of our colleagues from parks, one of our colleagues was planning to join us tonight and to their defense. She had a last minute family emergency that literally came up an hour before this. Don't do that! You can show up here, no okay, let's hold on because I think we don't even have parks here and I think it's unfair, but what work? What I'd like? What I like to do, because we've written a number of resolutions on this side of and I, don't know how much more we can do as a community board. I know. Most of us on this call are some form of activists in their own way that it might require some other action. I think I, know. Christine is well aware of. You know different things to do, but I'm not going to suggest other action, but I think that might be necessary. But Michael you mentioned it. There were two Katie Loeb from Council member Rivera's office can't speak, but she sent me a link to the city council hearing on composting and so I just sent that out to everybody else in the chat council hearing on composting and the link is in the chat box. But Chantel from Senator Kavanaugh's office doesn't want to say something: hi Chantal, I'm going to give you a couple of minutes just because we really need to move on to our next agenda item and I think we need to think about the next steps for the issue with the compost yard. What's Chantal go ahead. Sure I will make this quick and I apologize for toy story. 2 blasting in the background I in concert with our government partners, our City Council partner, Katie Low who's on the call. We have asked repeatedly to get some resolution over this as soon as seven days ago, 10 days ago and 30 days ago, we're still awaiting a response, in addition to a letter that our office sent back in August, that we are still waiting a response for so it is not only the community board who is being stonewalled and we are working together to try and resolve that issue, and we've been working with Christine in concert as well. So I just want to know that your grievances are heard and your frustration is heard and we are experiencing them as well. Thank you I believe that Katie mentioned that she can talk. I'm not sure if she can talk now, but if Kate, if you want to make a brief statement, I don't think she can okay. So I'm going to ask the team she's, muted, no she's, she can't talk wherever she is. She literally in the text, said to me. I'm sorry, I can't talk. Okay, let's do this so there's some issues that we need to bring to our January parks and waterfront meeting, but we really need to get to the next item, which I'm sure everyone is here for and that's the New York City Soccer Initiative proposal for a soccer pitch at the Lillian Wall Playground at Ps188, I, don't know who's presenting Michael Dino is presenting for this front. I'm Ed hello, hi everybody! You can hear me hi. How are you guys doing such a pleasure to be back at your community board and I look forward to presenting this pitch I hope we approach it with fresh minds. I know it's been a really ruckus evening, so I'll look forward to presenting this. Let me begin by should I share my screen to show the presentation. Give me two seconds and you'll be able to he's giving you two seconds. Can you introduce yourself in front? Oh I'm! So sorry, yes, so my name is Erfana met, I'm the senior programs policy manager at the mayor's fund, advanced New, York City and I'm the lead of the New York City Soccer initiative. I'm joined with our partner Paul Jeffries from the New York City football club Paul. Do you introduce yourself hi good evening? Everyone yeah Paul, Jeffries I oversee the club's community department, as well as the executive director of the foundation city in the community. Lovely thank you and we also have I, believe parks, Department Jameel's there, maybe not, and the principal on the call okay Jamil is still on by the way. Jamil's there I see him. Okay, great, so it's okay am I ready to go. Yes, you are lovely! Thank you. Let me just share this right here: go to the top okay. So can everyone see it? Yes, sir fantastic I'll get started. My goal is to beat the race clock so see. If I can get this presentation through quickly, so the New York City Soccer initiative. What is it so? We started this initiative in 2016. The goal is to build 50 acrylic mini soccer pitches throughout the city of New York, in partnership with five of these guys. So we've got my office. The Osaka Foundation New, York City football club who's with us today, indeed, is the ninth Airways. All of this is private funding. It's not city funding, it's a charitable donation in support of the residents of the city of New York. So these are our partners. The initiative is to build 50 soccer fields. That is over the course of five years we have now entered the final year of the initiative, comes with a maintenance fund of 600,000, which means that when the pitch is used, we draw down on these funds repair and maintain the fields per the request of the city agency partner or the school in which the pitch sits. Back with that said, these are the city partners, our lovely amazing partners, parks, Department, who's been amazing to us. For the past four years, the New York City Housing Authority and the New York City Department of education. These are the people with the largest share of public land and therefore we work with them. We list again a gift for the people of New York, so the initiative would be fun with the amenity, but it's also not an initiative if it doesn't come with something special and I think the special thing is the programming. Now the programming I have up here is from one of the partners, which is the U.S soccer foundation, who is not here with us today, which is fine, but essentially they offer free after school programming in partnership with DYCD. They call it soccer for success. It's a free program where kids get training free care and, as you can see, it happens three days per week, 24 weeks per year, but we also have Europe, I'm sorry. We also have the New York City football club, who also offers so we not only have one free after school program offered by the U.S soccer foundation, but we have the amazing partners at the New York City football club, who also offer their program and services and I want to pass it up for a few minutes to talk a little bit about their programming, the stuff they've been doing in the community and their impact yeah. No, so through our foundation, we've been delivering free in-school after school programs for over 10 years and through this initiative, I know that there's a desperate need for safe spaces to play in creating those spaces enabling other local community based organizations to deliver their programs. But we do offer a number of programs that are free from as young as 5 up to 24, I suppose the main focus for this community and this school, the local schools, is the health and education programs. One is there's a free, 10-week program that provides free instruction for soccer, but also is more intentional, with its health and nutrition education through a workbook and curriculum. We also have a robotics program, a soccer robotics program where we donate robots to local schools. In some cases, we've helped them launch a stem after school club. This teaches kids gives them exposure to stem, but they build the robots. They code the robots. They then compete against other schools to train the robots to do a variety of skills or play one-on-one soccer on a mini soccer pitch. But there's I could share a link in this chat room just to with videos for a number of these different initiatives, but ultimately we're very focused on providing free access to soccer and using the power of the game to connect kids into opportunities to inspire them to for academic and college and career readiness. Thank you very much. Paul I really appreciate that I'm gonna keep moving along. So this is why we're here right. So we've been doing this for five years and we're so happy to have worked with you in the past in year, one which is 2017. We came and presented to your community board for Ps184 Shuang Wen, there's a little issue with showing when, because there was a capital project already in process, the capital project is done and therefore we can resume our work and our goals to finish showing when this year we've got the green light, we're ready to go, but in 2018 or 2019 sorry, we came back and we presented Ps142 Emalio Castro, which we got unanimous support from your community board. Thank you again for that. We know this is a separate pitch, but we just want to thank you for that. The principal was so kind to save and share a space for the pitch, so we were so happy to do it for them and we held a beautiful ribbon. Cutting I, don't know if you guys had a chance to see it, but here we are again propose space for a mini pitch. It's at Wall playground, which is a jointly operated playground with Ps188 the island school. Now when we went out here we obviously this is a proposal to the community board. You know we want to get your support in order to move forward with this, but just to give you a description what's happening on the ground. We visited this area. There's a basketball court. I, don't know if you can see my mouse, but there's a basketball court right around there see that right there. That's where it is the corner. I, don't know if you can see my mouse going over it, but essentially there is a basketball court. There we're going to preserve the basketball court. We asked the school what's happening in this area. What's going on, they said they don't really use the running track. They really don't. They just really run around a lot, but a soccer field would be a great asset for our kids. Now this is a school that has a large population of his children. According to them, and the letter of support that I provided to your school I hope your team I hope you guys got it I sent it by email, if not, I can resend it again, but the letter support indicates the need of their children in this neighborhood in this community and the moment this was presented to them. They said absolutely. We love it and the opportunity to get the kids into the wonderful after school programs. We just mentioned we went out here. We look obviously for empty asphalt spaces because our fields are composed of acrylic. It's not turf. It's not grass. It's acrylic. It's actually the best way to build urban soccer pitches in small areas in tight areas like this. Essentially we will utilize. The existing fencing will probably be the back fence where this yellow line is down here. If you can see my mouse right around here, we're gonna build a little back fence there for eight feet. We will indeed cover the running track because it's really underutilized barely anyone uses it and we will cover the rest of the. We will paint over the rest of the running track for aesthetic reasons, but we will build that fence and we will bolt down the gold poles on opposite ends. I can give it that look, it's safe because number one, that's a requirement has to be bolted down and two it will have an acrylic overlay which is blue with the cars and the parks logo. So the goal is that we can do this project. The school absolutely wants it and is begging for it. Actually, we didn't expect such excitement, but it's very interesting that you guys talk about drugs and syringes in your community, because when we speak schools in the areas across the boroughs they often mention. If there's activity you can prevent those things from happening. This is from their perspectives, so I found that interesting and I see a connection between the two with this pitch anyway. Here it is here's the goalpost, it'll take us three weeks. That's all. We need three weeks warm weather and we can knock it out. This is the final year of the initiative. We are very gung-hoo by making this happen through all the hell that we've been living through for the past year. We really want to make this possible for you and your community. This is the before and after the good News is you're not really losing anything. In some cases we unfortunately have to give up a basketball court, but in this case, as you can see up here, it's just an empty space. The basketball court on the side here will remain which the kids love. So that's good news we'll run a four foot fence this way to protect from ball. Splash, it's a safety thing, but you'll have a soccer amenity in this empty space and women you'll have the basketball court, so I hope that it's I hope that is helpful. That is the end of this presentation and I hope. I broke as a race record, but anyway, look forward to questioning the answers. Look forward to working with you guys, thank you for that and for that presentation, just a couple of things: I, don't know! If we got that letter of support from the school or the principal, who did you send that to just a community board, yeah I sent it to the community board along with the presentation, but I can resend it again. I send to Susan Stetzer yeah I. Just we didn't I didn't get it. I can check with Susan, but we didn't get that. I'm sorry, I'm very helpful. I'm sorry I'll, send it again right and are you seeking a resolution tonight? Yes, we'd love to have your resolution, your backing to make this happen again. It's the final year of the initiative. So thank you yeah! It's just that I don't have any material and your timing for this is right. So if, let's just assume the community board supports this- and you give me a lot of support by January, I can get the drawings into the public. Design commission in February be approved by March and we can get started as early as April and the goal is to get started as soon as possible. Yes, go ahead, okay, so first let me get I. Have some more questions but I see some community members have raised their hand. The first one I see you Michael. First one is Troy Carlin and then Michael. Yes, thank you for the pitch. I have a question. I know we talked about going to the schools and getting information from the schools on the kids and the after-school centers. How about the kids that play in that park from the community I know on the weekends that park is heavily used by the local community. Do you have any programs in place for the local community? Our programs are really just for soccer I, don't know of anything else. That happens there. That's a parks department question because they permit that space out. We just follow their lead and say this could be a good place to do it so I hope to answer your question. Our programs will be I. Think what he's saying or asking is, if there can be outreach done to the community there, you have outreach and support to the school- oh yeah, yes, and the programming for just local youth who might want to use it because sometimes it appears that this is only for the school children. Oh yes, I'm so sorry yeah. So the goal of this project isn't just a limited the school. That's a great question: we would love to connect with the community board and any other organizations in the area that you we should work with to recruit those kids and Paul, and his organization could also lead on that effort. Do you have any thoughts on that? Yeah? No, absolutely, and actually I'm glad that you raised that, because, if you've got any thoughts and ideas about what programming and for what age groups and at what times and days, we'd love to design something that is really tailored for that community. But, yes, there is something in the summer which is called soccer block. We actually train and develop high school kids to work alongside our coaches, so it's summer employment program to help deliver free programs in the community on park sites. It's also a partnership with city parks foundation. That is a five-week program that happens from nine to three. But if that is of interest to the community, then there's a offering I could speak a lot about the different programs, but the feedback and the needs would be really helpful for us to see how we can best tailor and allocate the resources and, what's what will make the most impact? Well, I think there's a connection right there with Troy, but if you could send all also your information to the community board I know Troy is very well connected in the community and this might be next with programming so that we have that information. Thank you guys. Thank you, Troy Sorry Troy, to add another program to your schedule, but no, we need to stop her in my park. I think Carla was next. Yes, Carlin yeah, hi, I haven't I, missed the first minute of your presentation, but this the soccer field pitch, is going to be open to the public, all right outside of school hours, and it's going to be the ground itself is ministered by New York City, Parks, Department yeah, so, okay, so it our league's going to be allowed to apply for playing time. It is I mean I know you have no control over, but previously anytime, a soccer field is installed anywhere parks department always leases out the leaks which kind of takes away from community use who do not play soccer. So I have serious concern about that. That's a great question. That is a definitely a price department question for us, it's a gift, and we know that at least for the limited hours that the school has access to it. We know that those kids will be using it. The Good News is that we have other pitches in the area. So indeed you know there's a load management issue. Those pictures can take that up, but the good News is that the hours are limited. So you know we can talk to the products department about you know prioritizing. You know our programming as well. To give you know the direct services to the children of your community and hopefully with Troy's organizations. We can also work with them to further program that area. So you know this is our first step. Let's give it a chance and see where we can take it from there. Thank you, Carl, I'm gonna mention something like well. I have a follow-up now that he mentioned something about them, having other pictures in the media area. Yes, what does have? What has to be the history of the use of those pitch has been, has dipping permitted leaks playing in there dominating the time and kind of more or less monopolizing that space? Thank you, Carl. That's a great question. So we've only built two pitches in your neighborhood. We actually sorry one pitch at your neighborhood. The other pitch is one eight four shung when we couldn't proceed with Chuang Wen in 2017, because there's another construction project happening simultaneously, so we had to put our project on hold, but we're still committed to doing it and we will actually get started a21 we're clear to go, but that's great news, but as far as usage there I don't know, but what I've been told by the every school that we built at. He said that we offer permits local Cpos that want to use it. So if that's the it's a Doa site, it's not park, so he's a little bit more restrictive. According to my experience, which I've been throughout the city looking at and they have that way of doing things, we don't change, rules or policies. That's just the way. It is the other one is 142 Emilio Castro the two offer permits, but I haven't seen. Leagues use it to be honest with you. It's always been just local kids and local nonprofits that operate out of the school. That's what I've seen you heard. Thank you. Thank your phone fellow team, Jones, yeah, I. Guess, following up on what they're saying one of the things that has often been said here about the different activities in these parks is a concern for priority for local youth and a concern for it being affordable to local youth. And the other thing is when you talk about reaching out you're going to be in Lillian Wall houses across the street, from Baruch houses and across the street from Jacob Reese. So I would hope that you would reach out to the management and resident leaders of the developments that are right over there. So that was that's really. My suggestion is reach out to them and that the youth in this community have a priority and that the fees, if there's any fees, that they'd be waiting for. Okay. Thank you. No that's a great point actually and thank you for bringing that up. It's funny enough. We actually are talking tonight a lot and what happened with NYCHA in the past couple years. If you haven't been watching in terms of his leadership, there's been a lot of turnover a lot. It's been hard to keep up with them, but okay yeah. So but in terms of recently, we've been working very closely with them and they know if they know our work. They love our work, and so we know about that space and we brought that to their attention. We're like hey we're working with the school but we're also working. We also are working with Nike leadership. To say: hey can we engage those residents and there are no fees just to be clear, all free! Thank you. Michael I, didn't forget you, but I did but go ahead. That's all right! So I want to change the topic a little bit, because what I'm concerned about is the loss of the track and the fact that the what you're relying on to decide that track is not usable, is the school and not the way the community is using that track. I know, you know when the East River track was under construction, that track got used heavily and we're going to lose that East River track again, for who knows how long of a period of time and people are going to be looking for another track. So I love this program. I'm not saying a soccer field shouldn't go there, but what I would love to see is what's done? A lot of other playgrounds is that a track be wrapped around the soccer field, so that there is something that people can run if the soccer field isn't being used. For other reasons, I think that's a great question. You know. One of the biggest problems with this project is that we try our best to look for empty asphalt, spaces that have the perfect surface for us to work, and sometimes it's unfortunate. We have to propose this is a proposal to propose things that I know could conflict with other amenities in the area, but what our hope is that you can see that, based on the people on the ground, not us, we learn from the people on the ground, which is the school that uses it the most. That's to us hey, it's worth it, because the impact that will it will have on the children which, by the way, are mostly children living in shelters, I, don't know if people knew that there's a lot of kids living in shelters. So we were very moved by that and we felt a sense of mission to do this. The principal also made the point that you know people can also run around the playground itself, because, just because there's fences that doesn't mean you can't run around it as well and just because there's in line. So that was the point that she made and I thought that was interesting. I wish I was on the call to make that point, but that's what she made to me so I get it and we're just hoping that you could see the benefits of this project. Yeah no I totally see the benefits of it. What I'm asking is that you know so if there is a path that people can run around, that the principal has identified, if you know, as an extra gift to the community with the soccer field, if you can spend you know a couple hundred extra dollars and maybe paint whatever that path is so people know hey here's a path you can run because people might not be as imaginative as that principle is and see to see that as a running path. It's a fair point. It's a totally fair point. I'm glad you're asking that question because I'm a fundraiser and we would do the same. Unfortunately, the dollars have to be allocated to soccer because it is a donation. I, just wanna go back to something that was just said by Michael and I'm out. There is no run space outside of that park. Both sides of the gate when you go to Houston Street when the school is closed, they're closed, it's not even a walking path anymore, so Michael's correct. If we could probably put the track back somehow I know that there's hundreds of kids on the weekends in that park and even after school, if you go there, four or five o'clock, especially in this climate, with the pandemic they're utilizing that park heavily you know, and to take that much space away from them is probably going to be a detriment to that park. You know I know we're adding something. Sorry, let me ask you a quick question, because my impression of these fields is that it doesn't take away it's just it's still space, it's not something they can't use yeah. But right now is that correct? If it's completely fenced in well? Yes, because for safety reasons, but is it open for use or is it locked? Oh no, you can it's totally open if you access that playground, you want to play roller hockey on it. We're not here to monitor what you're doing you know. This is a gift, I'm just going to go I from our experience, I mean these have been gifts to our neighborhood and it's really hard to and I understand it's a change of space, but it's still open that we kind of want to see these in our neighborhood and usually the schools and the surrounding community are in favor of this. So I hear folks concerned. But if there is letters of support, it's really hard to say no to something they want to put in our community, which it doesn't I mean it affects the space, but it gives the kids in that and that school an opportunity to have a different type of field. Okay, I see you unmuted yourself. Did you have a question yeah, I'm just wondering if we could have that letter forwarded right now to you right, because the letter of support we actually don't have in front of us right so yeah I mean it's. You know this is similar to another case. You know I can't remember the playground, but you know that we had about a year or so ago, where all of the support came from the school and there was no outreach or support from the community, and we asked them to go back and bring us support from the community, and so you know if we're making a decision based on what the school wants, rather than what the school and the community wants. Then I can't I mean as great of a project as I think this is then I can't support it. If it's just for school, if Ron are you I mean we can do a conditional type of resolution based on you getting support from the local community? I'm I know that valve mentioned some of the natural projects which are around that area. I know that might be difficult in a pandemic to get support, but are you willing to do that? Yes, I mean we're not here to make things difficult. We want to talk today. This is our. This is why we're here we're trying to learn about what your connections are. So if you want to connect us to people that we should talk to we're happy to talk to them, we also will work with NYCHA to connect with the local residency and I report. You that letter support from the school all right so I think the first step would be to connect with NYCHA to get the folks who are in leadership. There I noticed some folks on this call who could probably help with that reach out or at least give you names. They're not gonna, make the phone calls, and that might give you a start, but we can do something conditional on that. Thank you Michael for that point and remembering that a particular resolution that we wrote, Val, yeah I, was just going to say that, in terms of nature that you're in Lillian Wall, so you would connect with them and then across the street is the Baruch and then the next project up is Jacob. Reese, so I mean I. Think those three if you're talking to NYCHA those are the three that you definitely want to get. Thank you. Okay. The other issue I have- and this is relating to 184, which I know- had a capital construction project which actually finished. Unfortunately, it has not been opened to the public. Since it's finished, it's a brand new Tbl playground. It is not open to the public, it hasn't been there's a big chain with the big fancy lock on it. We're probably going to talk about that in next month's community board. I know I, remember the pitch for that particular school. It was received well principal and the kids wanted it and the community was in support of it. Unfortunately, that came with a locked gate so and I know this. That's not your particular area, but it is a concern of the neighborhood that this soccer pitch is installed and that the school locks it for just private use. But this is a different type of playground, so I hope that doesn't happen here. Absolutely not. We would encourage parks not to do that and it's a different land so definitely correct different yeah, I'm going to go to the two questions from our community members and then we're going to see if we can fashion some more I wasn't expecting to do this on the spot and then see if I can drop. Some bullet points for us to draft into a resolution, but I'm going to go to Wendy first and then there's someone on the phone ending in 719. If you want to prep yourself but wait for Wendy to finish her question, it's David, my office is half a block from where you're talking about so my office is on East 3rd Street between Avenue C and D, and I walk through Lillian Wald several times a week going to East River park, I come and I'm wondering exactly where this is it right by the school that playground right? Next, that's right! Next to the school! Yes, okay, I want to say right now, it's a miserable experience to walk through Lillian, Wald and all of Baruch and Reese because of the fencing for all the female work. That's underway right now, so anything would be better than what we have right now and I know it's going to be someday restored, but people have no green space and right so and we've lost so many trees, especially at Baruch. So I want to say that if there can be some planting that comes along with it, so shade will be important for soccer players in the future, and you know make it is make it a green space as well. I am concerned also I want to say this year. I broke my hip a little bit and I walked more slowly and I noticed how many other people are using. Canes have walkers there's a lot of people right there like their senior homes on the other side of Avenue D lots of people who come through there so I want to say that the runners need space they're on the sidewalk, with the walkers and especially around that area as I walk on Houston. Often too. It's very tight D.O.T right now is planning bike lanes on Houston Street. Maybe this community board can get behind the idea of there being a running lane on the street as well. We have parking lining. We have cars stored there. We have other options. Yes, thank you. The two minute clock is in the red, so I see it. Thank you for letting me speak on this I feel really strongly about it that we have to be thinking about everything we can do like case said about climate change, so every project should have a green benefit to it. Thank you, David I would have picked you first, but I think Michael just changed your name, so David go ahead. David is a community board member right, I'll fight for the weak Wi-Fi, so I keep losing connections. The question is: he said something about a timeline that he has to that he wants to follow, has to follow and if we want the community to support, will that affect the timeline or, if we put into the resolution depending upon- and it only has a week before the full board to get the community support. Let me answer yes, okay, thank you, David, that's a great question and thank you Wendy for your point. Can I just respond to Wendy's point real, quick? If that's okay, you know the thing is that you have funders in your backyard. This is really important funders who care, and so you have nycfc who just talked about programming and stem. So the idea of greenwork and green planting and anything like that. You can find innovative ways to work with our partners to put those ideas together. I'm just leaving it out there all right so think about it. That way. The Bronx always loves this idea, and that's where they are. You know the Bronx has done so many innovative ideas out there, so I want to just mention the design. Trust had a whole project at Lillian, Wald I, moved in here five years ago and I went to the community meetings about a green space right next to the school that has never been completed. It's never even been started, so the design is there, there's a whole community visioning around it. It's between third and fourth street- or maybe it's a fourth and fifth but right over here, so maybe there's a way to get that going at the same time. Who knows since you have such a good line on funders? Why nonprofit does not, but we do green work all over and I'd be delighted to talk with you. So I'll put my I can see your name here. I'll give you my email. Thank you very much. I used to be a green gorilla. I! Don't know people know what that is, but we used to go around planting yeah. So you guys know as a youth, so I know where you're coming from and trust me. If I have the opportunity to push this or I meet the right people I'll push that idea forward. I got you yeah there you go Steven, so real, quick. Yes, so with your resolution, let's say: I will absolutely follow through and whatever was recommended here we will talk to the night. Show those three nightshift places will absolutely do that. But if you give me a resolution that says hey we're for it, we wanna we want you to move forward on this. We can get the drawings into Pdc, January February they take a month and take a sweet month. I, don't know why approved by March and then when April hits when the weather gets better, we want to be out there and get the project done. The reason why I move so quickly is that this is the final year of the administration. I, don't know. What's going to happen to my future, I'll be honest, I don't know what's going on, but I do know that if the time that I have I want to move quickly and get the job done, that's why we did 37 fields in four years and we're going to get 15 more done to hit 50, I'm going to make sure they're all programmed, and you guys are happy with the end product and I would just like to say. If you question me on any of these points feel free to reach out to the community boards. We've been active in working with them, getting their support and getting the job done wherever there's been, vandalism we've been responsive and we've only had one case of vandalism out in Queens I. Don't know why, but anyway, so. Thank you very much. I hope that answered your question David. Well, it depends if we do put a resolution for a community of support by the 17th. Is it possible I find you mute it yourself? I'm sorry, yes for sure, if I can get that by the 17th, we're looking good in terms of timing, very good, all right! I'm going to go ahead and do this because I just wrote down as many bullet points as I could from listening to folks about concerns. But these are generally good for our neighborhood, especially for the schools and especially for a school that type in the programming that we'll bring for a lot of those kids who do live in shelters that and I'm just going to read these off, because we're going to have to technically vote on this that and I'm just going to call the team, meaning Efron and Paul, and their groups will need to go to the surrounding natural properties. We can identify them later with the surrounding nitro properties, including tenant leaders, to get a lot of support and do some outreach they're going to also and I'll check with Susan to get the lot of support from the principal and the and I know it's not called the PTA someone correct me. What's it called now, I called the PTA. It depends it's parent's associations or say it again: I think it's still the PTA okay PTA the parents and the teachers or the parents in media. It might just be a parent's association, they've parents, association, yeah, we'll get the right wording. I'm just doing this and I'm hoping I need for a commitment getting members to listen that EPA still PTA yeah that the there is priority for local community youth I. Think that's very important and I think the team can make sure that's highlighted. It is free and it remains free for the students you mentioned that you have a maintenance budget, I think of 600,000. We want all that money to be spent in community board. Three, I'm just kidding but we'd like we have challenging playgrounds in this area and Kay can tell you all about them. So I think the maintenance will really need to shift this way. Just to let you know- and we really like I mean I. We don't want the space programmed at all times, but I think it's important for there to be a balance of programming for kids. I know: I grew up playing sports and I. Think it's critical to have some programming gives you some structure something to do, but also for kids to just play. You know, use the space and it's a new space, so they will use it. I will talk to you offline about another particular space which I think could be programmed and used for use. It's underneath the FDR by the way it's a new pitch, but it's not used at all Trevor I would add that the programming needs to be for the students in the community, as well as the students from the school yeah. I'm just trying to think of a better way to say that the program needs to be for local youth in the neighborhood for all children. That's all for all children, regardless of whether or not they go to that school, regardless for all local children, regardless of whether they attend that school or they attend any school in the district. Is there anything anyone sure I also think that one of the issues becomes prioritizing children in this particular district, because that's been one of the big issues with the whole East River Park already huh. You said that already. That was a bullet already it's in there. What did this neighborhood is probably arbitrage. Yes, oh okay, all right, like that's, probably the first and the largest bullet, we're gonna, write because I think it's important, especially considering that school itself yeah, because that school a lot comes from not this area so Trevor. If you're. If we're asking that this be available to kids, who aren't in school- and this is a school property, then the question about access would have to be part of this. Somehow I believe this is just a parks playground, so they, oh okay, so as opposed to some of the other ones like 184, which is a joint playground. We're like Ps4,110, open and close it. Okay, exactly I will ask this refund and I know. There's limits on budget and funding that you work with local partners, such as choice group, to not only look at programming, but also to find ways to green that area. I know it's difficult on concrete and that's not what the donations are for, but a couple of plants or some way to green that air would be nice if we could find a way and I know, there's some folks who might be willing to be part of that connection. So we can get some green in that particular area, so we don't have to throw giant mud bombs into the little bit of green space, that there is totally fine and just one good question for me and I should know this. But what is a pitch? It is just a smaller soccer field because we keep saying soccer pitch and I'm sitting here and I should know what that really means. But is it just a small soccer field? It's a british word so Paul. Do you wanna explain that one to us no you're right, it's a core! It's a pitch. We call a thing but yeah. It's a court, but particularly though it's not just a small pitch. This is in internationally. These footstyle courts are perfect for kids to develop their skills. They get more touches on the ball. They get more shots and goals more chances to defend, so it's better for them, it's more inclusive for them, it's not just dependent on someone who is so physical and fast and tall. It's also great for old people who just don't want to run around so far on the field. So it's the perfect pitch for a huge field for a urban environment. Okay, that's an excellent description. Thank you for talking about Trevor, see there you go I'm playing on a real soccer field. I think we need to put in the resolution that the first game on the pitch needs to be the Parks committee versus the transportation committee versus transportation. Now that's mean that they we'd kill them or we need four ambulances sitting by either rock. So does anyone have any more bullet points? They want to add I, don't know whether you said this Trevor, but I do think that the fact that this school is a 50 or so young people I think that's a really important point for us. Is it okay? Is it 50 or so that's what their website says, but perhaps Efron knows better, but that's an important point and I think you know not pitting locals people who are housed here with students who are living in shelter, I think it's a generous donation I think we want to be very supportive of that piece of it and the welcoming nature of the lower east side traditionally historically to everybody. So yes, I just like to make one point: when we put the pitches down, this is a long-term partnership as impactful as a soccer field can be. There are so many different elements of where a partnership with our club can happen. We have our staff, volunteering, there's college and career opportunities, there's really a connection with our organization and our people and all of our different partners that we bring on. So this is not a one-and-done. We really see this we're not going anywhere for the next hundred years. We hope we're the New York City's professional soccer team, but our workers goes back and 12 years when we built a rooftop soccer pitch in east Harlem, and we've still got kids involved from that program towards this day, we're on our youth, Leadership Council, and it's the only elementary public school in the New York City Department of Education Street, platinum for health and wellness three years in a row. So we see the impact, the values, the really great questions about it. But you can trust us that we're not going there and there's a long-term commitment to helping them. We want to get the kids gardening someday. That's great. That would be great to include that what you just said in our resolution- and yes, we know we'll find out where you live so we'll know if you do what's wrong. So I just wanted to confirm your point. Yes, 50 of the children are in shelters and that's what moved us and really made motivated us to come forward and say: hey guys. We got to do this for those children and we hope that number goes down. We really hope that happens, and hopefully they'll explore the sport of soccer I just want to say one more thing. This is not the end of the initiative. It is just the end of the construction of the initiative. If the initiative really begins next year, when they are built programmed and deployed as we go to a very important date, which is 2026, 2026 is a very important date and Paul is smiling because he knows what that date is and I wonder. If anyone on this committee board knows what that date is for our country know the year 2026 what's happening changing the pitch. Now we get the milk, the state, someone said who's that we got the world cup that year, the world Cup comes to the United States it's connected to Mexico and Canada. So you need to look at this from a big perspective. A lot of these partners that are involved in this project, David you're, very muffled, okay, I'll just say very quickly. Just the partners are involved in this project. They're also very close to that project as well. So just think about the connection there. Thank you and okay. I didn't get all that of what he said before, but if you can send that to me, it'd be perfect, I! Think if Paul, if you could send that or if Ron, if you could send that because you I'm sure you have that somewhere written yes, what Paul just said about the commitment beyond this project? Yeah can I just throw in because I'm trying to take notes here the commitment that it's a long term commitment of programming and also that the programming does works beyond soccer. So it's working with academic support that will probably have some nice language about that. Yeah. Okay, no problem yeah, I'd like to suggest that you know if the Parks Department does issue permits that they should prioritize local, nonprofits or cbos, and also limit the time permitted play is allowed per day because I have Columbus park here, and this soccer field here is, if they have leagues playing here all day long, the kids can't get into the Mclean. So you know we don't want what they call permanent play to dominate that space, so they should limit it to maybe two or three hours in the mornings right, maybe we should add something in there. Well, what I'm going to add is that they do a balance and number one prioritizing our local, youth and Cbo's, but there be a balance of program play and open time, because I do think program play is important. I, don't like to see parks that are completely programmed to your point Carlin, because then they can't use them, but I think in districts like this, especially when 50 percent of the population is homeless, that I know growing up that I needed some program play, but I agree with you that there needs to be a balance. I don't know if it's 50 or specific hours, but they need to make sure it's balanced, but I will add that in does anyone else have anything else they want to add to this. I have I just want to say back to Carlin's point that I really don't want us to look like if some of these students are in shelter. Not in our neighborhood I, don't think we want to pit people against each other I, don't think we need to and I think we can trust this organization which is- or you know just think about that issue and I like your language of balance. Okay, these kids have no one to advocate for them and when you talk about the parents association, you know that's another. You know who is in the parents association, but anyway, you I think you've got it. Yeah I wanted to ask another quick question. Just how many hours of programming is the organization planning to utilize the space for on a daily or a weekly basis? I think it really depends on what the community wants and the needs if the school has an existing after school program or there's an existing CBO that would love to utilize the space, then by all means we're not there to insist that this program happens. It's really a collaborative process with the local community leaders and what they see happen and if there's nothing existing already, then we'd happy to step in and offer this I think the U.S Soccer Foundation Socrates has more structure in terms of it's three times a week. It's 19 minutes and it lasts for 12 weeks in the spring and the fall, but that's something that we would we'd be happy. If the community says look we'd love to have after school problem there three times a week from 2:30 to five. Yes, we can but we're not in a position to mandate that this happens. So if you've got guidance on how to create and develop the problem, who are the people we should be speaking to the organizations we should be speaking to then, please put me in touch by email shared in the chat room, sure and I'm sure folks will do that and I don't want to mandate. Any type of programming. I know that some of the pictures are not used. They're just used for open play. If the community wants more programming they can ask for. But you don't come in with the slate of programming and take over whatever the community desires. If it's a lot of, nothing is what you typically provide yeah. Well, that being said folks, anything else I was trying to get off a good time tonight, there's still two hours anything else. You want to add to the bullet points. Michael. Sorry, no, but you said no more four-hour meetings, so we're doing pretty good I would like a motion just to ask Michael where he got his hat, but we'll wait. He got it from 20 century 21, five years ago off the clearance black. While he was shopping with a younger member of his family, they are no longer available. That hat is now worth 647 on Ebay, because there's only three left with the actual train model on the lid of the pack, and that is actually very true. You were almost correct. It was forever 21 forever something but Kay. You want to continue your motion, so we can get off. This call. I just would like to add both of them. May they rest in peace. That's true, I can't remember what I was doing motion to accept this resolution and I have a second, and these are the bullet points and keep in mind that we're going to add some whereases and sometimes second Ryan. You want to take a roll call vote for this. Let's do this. We're gonna, take a roll call vote for this and a motion to adjourn at the same time. So wake up folks wake up what the heck wake up. It's hanukkah, oh I, wouldn't have gotten that connection. Sorry go ahead right! It's getting late, governor Holland before they go! Thank you for that presentation. We're gonna end the meeting by taking a vote and joining, but thank you for the presentation. Yes, K, Webster, yes and happy. Hanukkah, David, Adams I approve the pending resolution. Your own Altman Carlin Chan; yes, Ryan Gillum, yes, Valentina Jones, yes, Michael, yes and happy Hanukkah, Carolyn, Ratcliffe, Robin Chateau! Oh sorry, I'm tired! Yes, Josephine, Velez, Troy, Velez! Yes, okay! That's it goodnight! All right! Thank you! Thanks! Everyone happy Hanukkah, Happy holidays be safe and good night see you next month.",
            "summary": "All right folks, good evening and welcome to the December meeting of the parks and Waterfront Resiliency Committee.\nYou are a member of the public, If you can use the chat feature to sign in for attendance purposes, we ask for your name and any affiliation if you are affiliated with an organization or community group, if you're not, you can just put your name and neighborhood.\nTrevor Holland is that after each presentation by the city agency, there will be a time for question and answer from community board.\nThe members of the community board that are on the Parks committee.\nThen after Community board member question and answers, we will open it up to the public for questions and comments.\nAs Michael has stated, We will take the questions in the order of Community Board Committee members.\nI, live on Essex and Delancey, and I noticed this week that Seward Park was closing earlier than it typically has since I, don't know.\nThere had been any issues there to you know predicate closing the park earlier than normal and Susan told me that she asked the district services and the seventh precinct didn't have any particular complaints about the park, and there were no three-on-one calls and.\nJust, you know, especially during this difficult time when so many of us are struggling to meet people in public spaces, when we don't have outdoor spaces of our own.\n6 P.M is really tough for somebody who works until 6, p.m, and I really don't think closing the park early is like in the best interest of the community.\nIt serves I, think that you know I when I am there past 6 p.m. Usually, when I'm seeing our groups of people taking laps people playing basketball, potentially people walking their dogs.\nThank you, Kimberly Michelle, for keeping that to a minute, I appreciate that Michael Wendy and then Val. It's, two years from now, December 2022, you decide to go for a walk and head over to the East River.\nThis draft prioritizes health and equitable access, along with shaded benzes and a toilet, I included some cost-effective amenities suggested at recent public meetings like low-cost or no cost court access for prioritized, Les, resident, tennis, players, a water play area, barbecues, a shed for park, stewardship, etc.\nWe recently were at a community public meeting, and there was much good expressions concerning the tennis, courts, basketball courts and whether this was the best use of space.\nOne of the things that was said at the meeting was that the cause for attendance permit at East, River park.\nThank, you, Tommy, I'm, going to ask you to refer that to the Community Board office.\nAnd we're going to monitor the heavy drug use in the homeless issues we have around the playground, sewer, park.\nI'm just trying to get an idea of how you're able to close all these parks within a reasonable time if you're, So we they start at five o'clock in the evening.\nYou know we give people assume enough amount of time to utilize the park in the evening hours.\nThere's no readily available place to put them, and I'm hearing from people that some of the workers who are encountering them who are working on the MTA project are burying them in the soil, which is probably not a good idea.\nYou have some opinions about the closure or opening of that park, because you afford it to the community, Board or Susan.\nThere's supposed to be a meeting tomorrow to get some more clarity, they're saying that from the FARi division, that areas are supposed to be blocked, off, so I haven't got a I, haven't gotten a really concrete answer, or what they're going to do.\nThe system of keeping it clean on the green areas of plantings that are along the antecedent are actually now becoming collectors of dirt and garbage, and so I don't know if that's the responsibility of parks or if that's D.O.T, but I want to just make a note of that.\nI am here with a limited team tonight, some of our parks and EDC representatives could not make it, So they were the ones that would answer some of the questions that are typically asked.\nOnce that process is completed, then the mass mailing will be sent to elected officials and community boards, and then the Ccl will on board early next year for project area.\nAgain, The mass mailings for pa2 have been sent to elected officials on the community boards and we have our Ccl many Dean on board, which I'm sure again, If you've been on the site up at Aster, Levy and then north end of Zykov, Park, you've probably seen her out there for a parallel conveyance, again.\nWe will, you know, do our best to communicate and advance the closures in that area.\nBut right now we are looking to maintain pedestrian access through Steicov Park past that solar one area and to continue connecting to the greenway to the north and again pedestrian circulation will be detoured starting in fall of 2021, when the main portion of Stuyvesant cove park takes place so for the Greenway detour.\nThe safety of the community of our contractors of the work area is first and foremost, and this is a this- will be an active, a very active construction site up here in project area.\nI know you had asked this at the last meeting and unfortunately, parks is not with us, but.\nYou know, basically, We have presented on this before, but we did just want to bring it up again, because we have been receiving several questions on the environmental monitoring so for Pa1 again.\nWe are actively working again to bring some of the ideas that we had presented again in previous presentations to fruition now with the contractor on board and when we hope to have a better understanding or when we will have a better understanding of what his needs are on the project, and you know just to reiterate.\nLet me just start by saying there is an additional community advisory group meeting which is open to everyone where they go into a little more depth about these questions, and I'm.\nIt says: I should go to the next community board meeting for an update on the lower East side, ecology, center.\nIt's not gone unnoticed with the composting community that there this parks department is attempting to close another compost yard in Queens, and it starts to look like.\nIt looks to us the parks, department, unbelievably, in the middle of a climate emergency, you know, I mean all this is swell, but we're doing nothing that actually pushes back against climate change.\nThat has been entirely successful by any measure in getting community engagement in Parks, Department staff has been slashed, This brings people volunteers into a park to help care for it, and we don't have the luxury of turning away volunteers or dissing community groups that have done their very best to make this community a better place and a resilient one, and one that's actually forward thinking and considered a pilot for other cities across the United States.\nSo, you know, love the presentation, but I feel it isn't answering any of the questions that I certainly have.\nWhat about outdoors and nature parks, because you know we're going to be in mask and whatnot.\nIf there's any way to you, know, I mentioned it to Q2 that you know, Please don't think that you know Stuyvesant cove people just in that area, should get a notice that everyone.\nYou know before you answered Robin, I'm gonna, ask the question.\nYes, because we got a notification and I'm getting a bunch of notifications, so I think if they can start with that either Q&A Desiree or how she needs to sign up to get those notifications, It's not very clear on the website how to sign up, for that should be the first thing on the website saying sign up for email, blasts.\nThat says: like click here, So if I'm an informed community member on the community board on the parks and Waterfront, Committee and I, you know.\nYou know it's just really hard to plan anything for your future as a group as an organization and not have any answers for any assistance and the way forward, so especially for our composting program, which is a very important program for this for our organization and for this city, and it's very disappointing that we're not seem to get any movement there.\nYou still bidding out the construction work for the area for East River park, thanks sure, hi Christine.\nFirst of all, I want to let people know at the Cag which would we had.\nShe repeated that several times so I think it's time that the community board put some pressure on the local elected officials who all made commitments on the composting to put some pressure on the city, because that's what she said.\nSecondly, they didn't put up the slide of the temporary bike lane detour, which I find interesting because the community board six, You know all bike traffic is going to be rerouted on Houston, Street and then up first and second avenues and they for some reason, didn't show you guys that slide.\nThere's no direct negotiations going on with the contractor and then to your second point with the bike lane that there's no reason why we're not hiding anything that bike lane that by detour that you're referencing is on the community board, six presentation that we provided to them on Monday.\nI, Don't want another lesson in the procurement process, but we just need to know where this project is.\nIt lends credence to the idea that this parks department, your partner, You know you're the city you're.\nYou heard Jamel talking about the shape of that park, So we keep getting ignored for the things that we know.\nWhat I like to do, because we've written a number of resolutions on this side of and I, don't know how much more we can do as a community, board.\nYou know different things to do, but I'm not going to suggest other action, but I think that might be necessary.\nWe have now entered the final year of the initiative, comes with a maintenance fund of 600,000, which means that when the pitch is used, we draw down on these funds repair and maintain the fields per the request of the city agency partner or the school in which the pitch sits.\nAnd I want to pass it up for a few minutes to talk a little bit about their programming, the stuff they've been doing in the community and their impact.\nNo, So through our foundation, we've been delivering free in-school after school programs for over 10 years and through this initiative, I know that there's a desperate need for safe spaces to play in creating those spaces enabling other local community based organizations to deliver their programs.\nWe came and presented to your community board for Ps184 Shuang Wen, there's a little issue with showing when, because there was a capital project already in process, The capital project is done and therefore we can resume our work and our goals to finish showing when this year we've got the green light, In, 2018 or 2019.\nYou know we want to get your support in order to move forward with this, but just to give you a description what's happening on the ground.\nLook forward to working with you guys, Thank you for that and for that presentation, Just a couple of things: I, don't know.\nI know we talked about going to the schools and getting information from the schools on the kids and the after-school centers.\nHow about the kids that play in that park from the community.\nI know on the weekends that park is heavily used by the local community.\nWhat he's saying or asking is, if there can be outreach done to the community there, you have outreach and support to the school.\nOh yeah, yes, and the programming for just local youth who might want to use it because sometimes it appears that this is only for the school children.\nThat's a great question: We would love to connect with the community board and any other organizations in the area that you we should work with to recruit those kids and Paul, and his organization could also lead on that.\nAnd actually I'm glad that you raised that, because, if you've got any thoughts and ideas about what programming and for what age groups and at what times and days, we'd love to design something that is really tailored for that community.\nWell, I think there's a connection right there with Troy, but if you could send all also your information to the community board.\nI, missed the first minute of your presentation, but this the soccer field pitch, is going to be open to the public, all right outside of school hours, and it's going to be.\nParks department always leases out the leaks which kind of takes away from community use who do not play soccer.\nThat is a definitely a price department question for us, it's a gift, and we know that at least for the limited hours that the school has access to it.\nSo I want to change the topic a little bit, because what I'm concerned about is the loss of the track and the fact that the what you're relying on to decide that track is not usable, is the school and not the way the community is using that track.\nThis is a proposal to propose things that I know could conflict with other amenities in the area, But what our hope is that you can see that, based on the people on the ground, not us, We learn from the people on the ground, which is the school that uses it.\nIf there is letters of support, it's really hard to say no to something they want to put in our community, which it doesn't I mean it affects the space, but it gives the kids in that and that school an opportunity to have a different type of field.\nIf, it's just for school, If Ron are you I mean we can do a conditional type of resolution based on you getting support from the local community.\nIt was received well principal and, The kids wanted it and the community was in support of it.\nThat's, not your particular area, but it is a concern of the neighborhood that this soccer pitch is installed and that the school locks it for just private use.\nI'm going to go to the two questions from our community members.\nSeveral times a week going to East River park.\nAnd I know it's going to be someday restored, but people have no green space and.\nSo I want to say that if there can be some planting that comes along with it, so shade will be important for soccer players in the future, and you know make it is make it a green space as well.\nAnd I went to the community meetings about a green space right next to the school that has never been completed, It's, never even been started, so.\nWhat's going to happen to my future, I'll be honest, I, don't know what's going on, but I do know that if the time that I have I want to move quickly and get the job done, that's why we did 37 fields in four years and we're going to get 15 more done to hit 50, I'm going to make sure they're all programmed, and you guys are happy with the end.\nI'm, just trying to think of a better way to say that the program needs to be for local youth in the neighborhood for all children.\nThere's limits on budget and funding that you work with local partners, such as choice, group, to not only look at programming, but also to find ways to green that area.\nThey want to add I, don't know whether you said this Trevor, but I do think that the fact that this school is a 50 or so young people I think that's a really important point for us.\nYou know we don't want what they call permanent play to dominate that space, so they should limit it to maybe two or three hours in the mornings right, Maybe we should add something in there.\nI, don't like to see parks that are completely programmed to your point Carlin, because then they can't use them, but I.\nThink in districts like this, especially when 50 percent of the population is homeless, that I know growing up that I needed some program.\nYou, know who is in the parents association, but anyway, You I, think you've got it.\nI think it really depends on what the community wants and the needs if the school has an existing after school program or there's an existing CBO that would love to utilize.\nThe community says, look we'd love to have after school problem there, three times a week from 2:30 to five."
        }
    }
}