{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "CB 3 Manhattan - April Full Board Meeting",
            "publishDate": "2020-04-29",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 4,
            "um": 9
        },
        "wordCountFullTranscript": {
            "people": 128,
            "lot": 75,
            "time": 43,
            "things": 43,
            "money": 42,
            "community": 41,
            "program": 40,
            "state": 39,
            "rent": 39,
            "budget": 38
        },
        "wordCountSummary": {
            "people": 25,
            "money": 11,
            "community": 10,
            "lot": 9,
            "governor": 8,
            "businesses": 8,
            "health": 6,
            "things": 6,
            "office": 6,
            "rent": 6
        },
        "fullTranscript": "All right so we're going to get this show on the road. Just a few reminders. The meeting is being recorded. So just keep that in mind. The other thing that gets recorded is the chat box. So just keep that in mind too, if you think you're having a private conversation with somebody you're, not it gets recorded and downloaded as part of the transcript of the meeting for those of you joining us with the video reminder to keep yourself muted while you're not talking and when you need to talk, you can either click on the microphone icon or just hold down the space bar, and you need to hold down the space bar the whole time. You're talking when you release it will mute you again for joining us on the telephone, a star six to mute and unmute and star nine. To raise your hand if you meet you, we have a couple of items of public testimony that I'm going to share on the screen and then read aloud for you. So at least should just nod your head. If you can see that hold on one second I'm having some technical difficulty that I don't know, if you can see me you, okay, you see me. Okay, yes, I see that okay, all right so public testimony and the first one is from Wendy Brower from Green map system. Yesterday DoD announced an open streets plan that will help people keep their distance hats off to council, member or Rivera for her leadership on this timely policy. As I understand it. Do tea will soon be opening applications to community groups, to request barricades and set hours to welcome local residents to walk and cycle safely on open Street streets. I urge cb3 to encourage this effort. I also request that cb3, you know to indemnify all of the open streets projects, making it far more equitable for block associations, lower-income and smaller groups to participate in this important community health initiative. Thank you. The second item, public testimony comes from Joe, Kern's and states. I am running a non-profit to help deliver non-medical PPE to New Yorkers. We provide PvE to the communities who need it most during the fight. Oh, the website is Courvoisier. We provide PPE to the communities who need it most. During the fight against kovin 19 started by a New York City native, been weigh-in on March 12th 2020. The foundation aims to become a platform for PPE distribution, funding efforts, partnerships and exchanges on issues related to covert 19. It is a registered 501, C, 3, non-profit and it is 100% volunteer run. We launched a million masks campaign which has raised six hundred six hundred thousand dollars today and donated 15,000 searchable and 95, and K n95 respirators to 25 of New York City's, most overwhelmed hospitals to protect frontline hospital workers. There ask is that we'd love any volunteers to help us with the F and for any electeds to partner with them in finding distribution partners. There's no contact information in this, but I will say that this public testimony is being done by a board member in a pub as a private citizen. So, as many of you know, Joe is a cb3 board member, so other cb3 board members can contact him that way if they are interested in helping out with this effort. So that is the end of the public. Testimony session- and so we are going to move now to the electives reports and before we get started with that, I just want to say that we have I should say: Susan has spent a immense amount of time over the past couple of days trying to coordinate the electives. We don't want to get into a situation like we were in last month where the electeds reports took over two and a half hours, so we are going to be starting, so we've organized them the best way we can, and unfortunately things change. Everyone has other meetings to get to and other town halls that they're holding and you know the past hour, we've been dealing with emails coming in from people asking for their time to change and we're just going to do the best I can and if they're still on the talk to us, they're still going to talk to us, but we have asked East elected official to keep their report to ten minutes and those ten minutes include the Q&A session. So they take their whole. Ten minutes to talk to us, then we're not going to be doing Q&A. For that elected official, if they talk and then there's still time, we will take some questions. I do also want to point out, but since we are running this as a webinar, there is a Q&A function attached to this, you should see an icon for it at the bottom of your screen. If you are on a computer, so we can use that function if, for some reason, you're not able to ask a question to an elected official, you can type it in there and hopefully the elected will keep an eye on the Q&A box and they'll type in their responses to you so again we're keeping each elected to ten minutes their reps or getting five minutes again. That includes Q&A session and we going to start with Congress member carolyn maloney. Thank you, I'm honored, to join. You I. Think one thing that's going to happen is we're gonna, be communicating this way in the future. A lot more before I start I want to say that I hope everyone on the call is safe at home and well. I want to begin by asking everyone. Have you filled out your census form? It's very important: you can go to the web. You can go to the internet and put in my 2020 census. Fill it out online. They you can do it by phone. You can they've mailed them to your home. It's important because it is the formula that is used to dispense over 800 billion dollars a year for schools, hospitals and job training and other essential services. I did a study this week that showed that if we are under counted by 1%, it will be a loss of over 650,000 to our neighborhood schools over 250,000 for our job training. Also, the census numbers determine your representation on the city, state and federal level. So it's important. Please get your community to fill them out and it's for 10 years. So if we mess it up this time it will be 10 years where we're underfunded. I do want to say that imagine if we've been underfunded right now with all of the hospital workers and people that we need. The average return rate for the country is now 52 percent, but our district, the 12th district, it's a roughly 40 percent and we are under what we were 10 years ago. So we have a lot of work to get our numbers up. We have been at working incredibly hard in Washington. We have passed for different relief packages to help with disaster. The largest one was the largest in history: 2.2 trillion dollars. It had 350 billion for this small business relief front, funded, paychecks, Protection Act within 10 days. All that money was gone, so we just voted recently an additional four hundred and eighty four billion package again a lot of money for small businesses, but money's also for our hospitals and for testing, not enough. It's never enough. But if we don't test and do follow-up on who's testing positive and not and we'll never be able to open up a game. We were supposed to go back into session on May 4th, but the medical community really complained and said it wasn't safe to have 435 people going back to Washington when we are still in the epidemic. So we are now scheduled to go back on May 15th, the one piece that was left out, that is very important with funding for state and local governments. Both the mayor and the governor have pleaded with us that their revenues are down, they have gaps in their budget and if they don't get city and state funding, then they will have to start layoffs, which is going to be a terrible thing for our people, so that is the top priority. We're already working on the next package to make that happen. As the chair of the Oversight Committee I have a responsibility for the post office and where they're going to run out of money this summer, can you imagine how many people are getting their medicines by mail, communicating by mail? And now our government governor tells us we're going to be voting by mail, so we have to save the post office and make sure that it is funded. Unbelievably, the Republicans are not supporting it. So it is a real emergency to make sure that it gets the funds it desperately needs the paycheck top protection program and the emergency injury disaster. Loans are very popular in our district people. Many people are applying for it. This I'm sure that we'll run out of money, probably by the end of the week and the 1200 individual repay the IRS, will be distributing the rebates to all Americans who earned under ninety nine thousand and households, which earned under one hundred ninety thousand based on their 2019 and 2018 filings. So if you did pay your filings and meet that criteria, you don't have to do anything. The IRS will be mailing out these there's this grant to you and you will receive one thousand two hundred as an individual, two thousand four hundred for joining filers, plus five hundred for each child under seventeen, and that will be coming to you in the mail and for individuals on Social, Security or Social Security, disability insurance, the Social Security Administration is working with the IRS to make sure they get your rebate to you and for other non filers. You are also eligible but may need to take additional steps. The IRS will be doing outreach and you can contact my office for questions. The bill also established a paycheck protection program and made it eligible for sole proprietors, independent contractors, gig economy workers like artists and others, and self-employed individuals they're all eligible to apply I'm, proud of the Democratic Party for expanding the eligibility to include these other categories, and this is a loan program for businesses with less than 500 employees. It provides cash flow assistance with a hundred percent federally guaranteed loans. It is not hearing all the activity in the room before the meeting. Okay. In any event, this program is more than a loan. It's a grant program if you pay 75 percent of the total loan to directly to your employees, to keep them on board and just keep them receiving money, and you will get an twenty five percent for your rent and other expenses up. You'll get a hundred percent loan forgiveness. So that's a really a grant that we've had some difficulties with it. It's supposed to be open to everyone, who's, an SBA lender, but some banks are writing their own rules. Let me know if they are doing so. One constituent told me they went to the bank. They said they're. Only doing loans over $100,000 and to call him you don't get to write the rules it's supposed to be eligible to everyone, but in this new round we funded or siphoned off or courted off, sixty billion for really small businesses, and this money will be distributed through credit unions, a minority institutions CDFIs which were created for unbanked, low-income people and micro lenders that are participating in the program, and this will be protected and used ugly for small businesses and I know. There are a lot of allegations about misuse already in this program and as the chair of the Oversight Committee, we are sending out letters for accountability tracking where these loans are going and I call the SBA today, I want to listing up those getting loans in my district I want to make sure that we are treated fairly under this program. I also wrote a letter to expand the eligibility of this loan program so that non-profits and carrot of all organizations of all sizes can participate, and we have many of those in our community. The economic injury disaster loans is also available. It's up to 2 million with payment plans as long as 30 years and a deferment on interest payments for 4 years. So these are a very gentle with us about two minutes left in case. You wanted to leave time. There's all kinds of activity going on I have so much more to tell you what I've been doing, but I'd rather hear from you. So thank you for informing me and I opened myself up to any questions or comments, and what do you want to see in this next package? Where are on it? So Olympia you had your hand up first I'm going to go to you. It looks like you're, probably the only question so thank you fundamentally I know you're trying to do a lot and it's very good that you segregated those sixty billion for real small businesses because they really didn't get to access any of the loans. That's what we're hearing the issue is that, right now, a lot of the federal funds are not yet available. People who applied for the pandemic unemployment- they haven't yet seen a penny most of them, and the reality is that the rent was due on April 1st. The rent is due on May 1st. So since there is this difficulty of accessing the relief in the various forms that it exists out there for the people who are really most in need, and then there is no movement yet on the legislation, even though I know it has been introduced now, even at the federal level about rent suspension. I think you need to try to focus to help more than once more in need and in the next cares Act passage. You also need somehow to address the people that are left out so far. They're dreamers and all these other casts economy. People who are not going to be perceiving the 1200 bucks each and to be honest, New York rents, that's not going to go very far with unemployment for 3 6 8 months and more first of all, we need to. We tried to get in the rent relief and the rent freeze, I'm on the Banking Committee too, and I got a letter and I got people up the Congress people to support it, where they're freezing any mortgage foreclosure under federal mortgages so that they won't be moving in that area. But most of people in our district are renters. 70% are, and we pushed hard for that we were not able to achieve it. We pushed hard for the state and federal a long program. I didn't know that the state unemployment has been flooded. We are all teleworking from home in my office. We're all practicing the health it guidelines. They gave us, but you can call my office. We can get a caseworker on your individual cases and any abuses that you have or stories on the long program being misused. As I said some constituents told me they just told me we're not going to do a loan that small, that's they're, not supposed to make those decisions they're supposed to give it for everybody, but they gained it and gave it to the bigger people, some of them we sort of shamed. So much they gave back the money and got out of it. It's not supposed to be for hedge funds and large corporations and I think we'll be adjusting that or asking them to give it back, because it's unfair and not what the program was for so a lot of it. We move very quickly because people are in need now the dreamers we tried to help the dreamers and undocumented I'm talking about Democrats I'm, a Democrat. The Republicans would not have anything to do it with it, but one of the ways that we did provide money, the small, the Paycheck Protection Act- is largely for employees. 75% of that money has to go for employees and there's no thing that says it can't go to dreamers or other people. So that's one way to get money to people who desperately need it. As you know, we have to work with the Senate and it's not easy. Already. Mitch McConnell has told us under no circumstances will he allow state and city aid. Yet our mayor and governor are telling me and the delegation that, if we don't get it they're going to be serious layoffs because there's a huge gap in revenues and then because of this pandemic has been overwhelming. As we all know, the pain, the suffering the death so I hope that answered your question. If you have more I have one person working totally on the PPP program, because it's in such up so many problems with it and in any. In any event, it's not enough, but with 26,000 people unemployed, we have more people unemployed than the Great Depression. The economic shocks are greater than the Great Depression, so we have a challenge and a half ahead of us and we've already lost more people than 911 the South, the Korean War and Vietnam. It's been a deadly disease, the worst challenge, I faced since I've, been in office and it's I've been through a lot of difficult times with all of you with Sandy and economic downturn and, of course, 9/11 I just want to mention one of my signature bills was the 9/11 health and Compensation bill to help take care of the workers took me a long time to pass it. It's now law thank God but I'm, putting in a bill to do the same type of thing for the pandemic workers, our nurses and our doctors. Many of them are sick. Many of people on the front lines helping people I'd say our postal workers are mention emergency, brick workers who are out there. You know interacting with koban people every day and oftentimes becoming sick themselves. We have to take care of them and that's a priority of mine legislatively I yield back so Thank, You, congresswoman I think we're having some issues with the QA function and there are former hands raised, but we're already at 20 minutes for the first elected official, so I really want to move on here. Send me your questions to my office and we'll answer them: okay, yeah, all of the all of the elected officials, are also doing newsletters on a regular basis. You know some of them daily, so I encourage you to subscribe to those you can and I'm. Really sorry, we don't have more time from them, but we're trying to get this I have a newsletter goes out daily on everything on the federal level. Thank you. Okay! Thank you. Thank you so much my honor to be with you. Thank you. I know better. Thank you. Thank you. So we're going to there are two people that one at an earlier time and one the later time so we're just going to swap them. So we're going to go to Brad, hoylman next and Marga Ching that Deborah Glick Ben Brian Kavanaugh than Harvey Epstein, and then you Lee, Neal I, will be super brief. Michael I appreciate the fact that you're trying to get through this meeting quickly, I just wanted to thank congressman Maloney first for her efforts in which I joined and attempting to really repeal the discriminatory and homophobic FDA gay men blood ban. You know if you're gay man you cannot, but you cannot donate blood unless you've been celibate for a year. I sent a letter to the FDA, so did congressman Maloney. The FDA has since reduced that to three months. So now you can't have sex for three months. If you want to donate blood in your gay man, I guess that's progress, but there's still more work to be done, especially since plasma is so important when folks, who have recovered from Covid-19 19 can contribute, and hopefully aid to people's health and research. My colleague Kara Caroline, is on the zoom with us. She's been doing an amazing job I. We have been inundated with unemployment insurance requests, as we should be. That is totally our job. Each one of us, including me, are doing casework. It seems every hour of the day right, Caroline and we've made some progress. I know some of you have heard back recently from the Department of Labor. Let us know please contact us. Mike Carolina put our email in the chat function. We can help I know, other elected officials are doing it too I'm working every channel, just so happens, David Krueger, who used to work in my office I, know. Susan knows him now works for the Department of Labor. So just saying that I am working that connection as much as I can. We've also been working with our colleagues each and every one of them in coordinating volunteers. I want to thank them for all their work, including distributing meals using you know, leveraging different parts of our districts like the management company at Stuy, Town Peter Cooper, which is owned by Blackstone they've, been donated. You know, multi-billion dollar company they've been donating meal so which you know has been amazing and hardly Epstein, and in Keith powers and Carlina have worked. You know to distribute those meals and I'm very happy to be part of that, and then I wanted to tell you about one bill and then I'll, then I'll go which is I, think top of mind for so many people in our district, as the congresswoman noted, so many renters is how you gonna pay the rent. Are you gonna pay? The rent, if you're sick, are you gonna pay the rent if you've lost your job, how you gonna pay the rent if you've got two kids at home, who are being homeschooled and you have a loved one, who's on a respirator I mean I, can't imagine just how grim it is for so many of our neighbors, so I'm in strong support of the cancel rent movement, along with our sibling members, who are on the line, some member yulie, new and Harvey Epstein, among others, of course, Deborah Glick, and we not only are pushing that. But I introduced a bill with Senator Krueger called the New York State Senate, safe, harbor act, which would which we add to the governor's evictions. His eviction moratorium only lasts until June 18th and the problem is on June, 19th landlords could file for evictions and we could see massive Ixion's across the city. What I proposed to this attendant safe harbor act is to give the tenants six months, not just beyond June 18th beyond the end of the state of emergency, where they can get back on their feet, get healthy, get their jobs back and then be responsible for rent, so I hope we can move that legislation along with the canceled rent movement and then I've been hosting virtual town halls. With a number of my colleagues last, this two weeks was on the canceled right movement with Senator Mike June. Ours I encourage you to tune in Sundays at 9:00, 8:00 p.m. 8:00 to 9:00. But in the meantime please contact our office for any constituent concerns really appreciate the opportunity to speak to you tonight. Hope everyone as well and thank you Michael and it's seven o'clock. Do you haven't heard I was just going to say that so that's all clapping to the first responders delivery, man and postal worker and everybody else, that's keeping the city running for us. So senator we do have some questions for you, the first ones coming from Megan joy, hi, we're taking the question so I mean instead of this canceled rent policy yeah. Can we not make the PPP or loan more flexible on the percentage that we could use for rent because I mean I? Think if we had more flexibility, when we received that loan we wouldn't have to not pay the landlord's their rent, we could give them. You know a percentage of their rent, maybe it's 50 percent, maybe it's 75 percent, but the way it's structured. Now it's 25 percent of a small loan and unless you know you know what this turns are so I just want to advocate for one moving the deadline for the PPP to the end of the year and to having greater flexibility on the amount that we can spend on rent versus payroll. Maybe it's 50/50! You know. That's a great point. I raised that issue in congressman, Maloney and I have been talking about that, particularly for small businesses and our restaurants. I know she's looking into it. You know we also. You know this is a food chain right, we're talking about. You know not just tenants, but you know talking about businesses, small landlords, you know banks, financial institutions. It goes all the way up the ladder or down the ladder. Depending on how you look at this and so you're absolutely right. We have to do something. So this is the time for idea, generation and so I appreciate your comments and any suggestions. We will accept. I'm on I've been appointed to the revenue-raising committee for the state Senate we're going to look at ideas to you know the governor's proposing 10 billion dollars worth of cuts in the absence of any aid from the feds. So we got to figure out what we're gonna do. Obviously we have to tax the wealthiest, but you know we got to think of creative solutions like who's making money during this kind emic. You know that's what we need to focus on, because a lot of us are not, and a lot of us should not be paying any more in taxes. So it is a very difficult problem, but I appreciate your comments, senator and our next and final questions coming from okay: what's there, okay, are you there yep hi yeah? Can you hear me? Yes? Can you hear me? Okay, thanks hi senator thank you for the for all the work up there I had to. There were two bills that were voted on, that I thought were particularly problematic, regardless of your opinion on them, because there were no watchdog groups who could be there during in attendance to give testimony or to bring a differing opinions. So I wanted your thoughts on that I'll say the two one gave immunity: the hospital and nursing homes owners, not just the staff- and there was some point to some of that, but essentially it's pretty hard to prove negligence as it is, and that really jeopardize the does, jeopardize future lawsuits etc and the other one allowed for commercial surrogacy. When we have altruistic certainty already, which threatens the life potentially and health of financially insecure women, while enabling the purchasing class to access. You know, bodies for their private needs and you and I have discussed this and yes, you know any child who's here belongs is good, but this I think really opens the door for a very different industry with which does not have altruism as its goal so thoughts on that. Thank you sure. No I really pre Kathleen I. Really. You know we have spoken about it. On the latter issue surrogacy you know, I had to chew or through surrogacy. I would argue. This is my position that the door is already open. It's open in 47 states, so what New York has done is close the door to the extent that women of who our disadvantage have been exploited. We now require a whole host of protections for women who want to act as servants, including their own medical care, health insurance, life insurance, independent legal counsel, ensuring that they have counseling make sure that they have every medical decision is made by themselves, including whether to carry a child through term or not so I believe we're raising the standard for surrogacy, because so many states in this country and, frankly, the world have no laws whatsoever and that's where women and parents who are well intentioned and egg donors get taken advantage of. So you know I'm happy to share more information about that bill. You know I think it gives some couples: individuals, LGBTQ people struggling with infertility, cancer survivors, some hope and God knows. We need a little bit of hope during this time. So you can't the bill will not go into effect until next year and certainly won't go into effect until all these restrictions are lifted. So I would be happy to talk to you about the bill. If you have suggestions for it, you know there's opportunities for the Department of Health to impose new regulations and make it the best most stringent, most protective bill in the country. In terms of your first question regarding the issue of medical liability, I share your concerns about that. On the chair of the Judiciary Committee, you know, I carry the legislation that would finally allow New York to enter the world of wrongful death. You know where individuals who can prove that a loved one has been killed due to some negligence on the part of a physician or Hospital, can sue for beyond just the actual monetary damages, but pain and suffering, which has limited their recovery for so many people, particularly women people of color and people who are low income, because the estimate of your worth is based on how much you are able to earn according to a formula and if you're a baby or if you're somebody who works in construction, they will limit your. They will limit your family's recovery based on the fact that you are not viewed as equal to say a investment banker who's earning a hell of a lot more. So it's an issue that we need to follow closely I hope I can pass the wrongful death I think it'll be important as part of this larger concept. I guess my original question really had to do with, regardless of where you sit on the surrogacy issue. It was done without watchdog groups and there was really no reason for it to happen at this point in time during a pandemic, so that that's my objection just on the on the face of it and there probably you don't need to take up more time here, but I would say in terms of the nursing home issues that really what we need are stronger standards and public health and Health Planning Council. That has a half consumer representatives instead of one who was just named after years of waiting and some budgetary. But that's my final point. My legislation with Assemblymember Godfrey to add consumer representation, additional consumer representation to the public policy and Health Planning Board, has passed again the governor vetoed last year. We hope to get it passed and I will say that I had a public hearing on surrogacy. They simply had one and we had multiple forms. But let's talk more about the issue, thanks Thank You senator we're going to move on now to councilmember Carlito Rivera hi, everyone very nice to see you so he's good to get together even virtually so I'm gonna cover a few things that I'm just gonna, be very honest. That Susan's. That sir told me to make sure that we have a couple minutes for questions since I do have to skate in a few, so I guess I'll. Just give you a very brief ketchup is that the City Council met for the first time. In weeks, virtually we had a virtual stated. We passed the number of land use, applications related to preserving, affordable housing, including a former squat building on 7th Street and buildings within the Cooper square, mutual Housing Association portfolio. We also introduced a package of copán 19 related relief bills about 11 bills in the package, everything from New York, City, essential workers, Bill of Rights in terms of premiums just cause paid sick leave for gig workers resolution on this classification, -, protecting New, York, City, renter, renters, extending time for all New, York, City, renters to repay rent blocking evictions and the collection of debts, and that would be essentially delaying evictions until April 20-21, protecting tenants from harassment prioritizing our public health in terms of providing safe shelter. This would provide rooms who are homeless, New Yorkers, one of my bills, to mandate that we open streets to promote safe social distancing and then protecting New Yorkers small businesses, commercial tenant harassment says my bill, which is suspending personal liability on commercial leases and then suspending sidewalk. Cafe fees so again we're trying to do what we can considering I guess, our power and our jurisdiction. We can't regulate the rents, but we can certainly try to figure out how to provide some relief for New Yorkers, who you know in the last few weeks, I've seen all kinds of that all there's. Really. The spectrum from people that have a lot to people that really have basically nothing and families, are just struggling with food security and trying to figure out how to pay the rent, which is due in three days, and it has been really troubling just to see how hard it is for so many families and I know that this is an unprecedented time and we're trying to move as quickly as possible. Pressuring the mayor and repression, pressuring the governor, a lot of decisions made by the mayor's office is happening in somewhat of a vacuum. There was a very large announcement for task forces to address how we can recover and, of course, what the relief has been like for different populations, and we were not included at all in the creation of those task. Force's I think time would be better spent. You know with one commission that can kind of look at the response overall and have those people be appointed. I know the City. Council does not have the capacity to do that right now, as I have hundreds of cases in my office we're coordinating a large network, along with other elected officials who are on this, call to deliver meals and pharmacy runs and to take care of each other, so it has been very challenging, but I think the first virtual stated when office as well as it could and I know that some of you have participated in some of the hearings that we've held transportation general welfare. Today we had housing and buildings to look at that rent bill that I mentioned, and tomorrow we will have a small business hearing on the legislation that I also mentioned so just to cover the list in terms of hospitals. What can I say for those of you who know the public healthcare system it is. It is the system that is serving the most vulnerable. The sick is the poorest, our immigrant and undocumented, and they have been carrying so much water through this that the one system description that we're getting from the governor's office is really more in theory than practice. There has not been a seamless coordination between the private hospitals and the Elmhurst Linkens and wood halls of the world and unfortunately, as Health and Hospitals is asking for monetary donations. Our voluntary hospital system, who is very well connected, has been able to tap into rich donors and other individuals to figure things out. So it is really the haves and have-nots and I think that those disparities have not only been brought to light in terms of what we already know that food housing, health care and education, which are basic human rights specially in this city, are not accessible to everyone, but that we also see that in the fatality numbers, which have been absolutely heartbreaking. So in terms of the budget and how we're going to recover, we've been served about seven billion dollars in cuts from the mayor's office. That's two billion in this fiscal year and about five with more coming five billion and more on the way in fiscal year. 2021, a lot of our nonprofits received kind of a pretty troubling letter, saying that any services provided after March 22nd would have to be deemed essential for them to be paid in discretionary funding. Clearly we're fighting to make sure that those that are providing essential services receive every penny that they are. Oats is historically, we have not been so good at paying those contracts out on time, and that's very unfair. I could say that coming from a former small nonprofit and making sure that we're saving things like the Summer Youth Employment Program, when our pools are going to be closed, we don't know about what's gonna happen in their parks in our beaches and our young people need something to do. These are typically, you know low-income individuals from black and brown communities- and this is certainly one of my priorities on top of everything else. I guess I should take some questions. Susan had asked me for the cuts to the to the parks budget. Is that something that somebody wanted? Okay, so Carlina just before we get into the questions just a couple of things. So just a reminder. During the elected reports, questions can only come from board members, so I know that there's a couple of people who are in the attendee list that have their hands raised. So I'm not going to be able to call on you to my fellow board members. I will say we have a load of hands raised for Carlina and we're not going to get to all of you and I'm going to prioritize people who have not asked questions yet so we're going to start with Trevor and I'm asking everyone to please keep their questions as brief as possible, so try to get to as many as possible. Trevor go ahead. I currently know thank you for everything, you're doing I'm gonna leave the parks question for probably someone else. I just wanna ask a question on the track on the street closures, understanding that it was needed and the city's pushing through a lot of initiatives. But how is the community going to be able to participate or recommend which streets a thinker can should be closed or turned into open streets? You mentioned the task forces and a lot of these decisions seem you made fairly quickly and without public input. So how is the public can have input on those Street closures? Well, you know our bill, which we introduced and had a hearing for in the same week, we then heard from the mayor which the Department of Transportation that NYPD had pretty much testified in opposition of this bill. Now they're kind of on board and I think we can use this open streets program so creatively in terms of even saving some of our restaurants. But it's really for promoting social distancing. How can you be involved? Well, one is in terms of the task force. I thought it was pretty interesting that in the mayor's numerous task forces that transportation was not one of them, but in order for everyone to be involved, we truly do want to make this a community lead process. I know the mayor kind of did his big announcement and many people think that we might not go through with the bill, but until we see a real plan from the mayor, not just an allocation of how many miles are going to be determined by the NYPD. We're gonna keep going forward because we do want it to be community driven to work with the Business Improvement Districts to work with civic and block associations. The community board there actually is an allocation of miles that is specifically supposed to be determined by the community board, but I don't think we should piecemeal. It I think it should be comprehensive and as holistic as possible. Considering what we're talking about. I have already received recommendations from community members from other elected officials and certainly from community groups. So I would say, send those recommendations to me, but how we can do it, we're kind of still figuring out the process to make sure that people do feel included, because you all know your communities best and that's what happens when you're kind of you know trying to operate in the midst of a pandemic. It's kind of been like an ax rolling basis, so the short answer is we take recommendations and we'll also try to be a little bit more forthcoming when we have them on details as to how everyone can be involved. Thank You, council members, I know you have another Town Hall to get to so we're going to do one more last question from you from Valentina Jones. What I will say for the rest of the board members that want to ask questions? What we can do is if you want to type your questions into the chat box and make sure to specify who they're for when I download the transcript tomorrow from the chat box, I will highlight the questions that are for the certain elected officials and send them to the elected officials, great okay, here's a question in terms of the people that are working whenever I hear these presentations. It's like everything is okay in the hospital and then, when I talk to people that are working, it's like the total opposite. So my question is: who is going to talk to the workers, the workers, with just a variety of issues that, like I, said whenever I hear most officials talk and people from the hospital sector? It's like everything is okay and everybody has everything. And then, when you talk to the workers, it is the total opposite. I get a call this morning from somebody crying about the situation in the hospital and I'm, not even working anymore. So anyway, in terms of the workers who are going to talk to the workers to get the actual frontline story, because I think that's what we're not hearing is the actual people that are out there working and what this situation is like and what their concerns are, especially because rules have basically changed and they know that they've changed no who's going to talk to the workers. Well, by the way we talk to them all the time and we flag numerous issues to executives. We're also working to make sure that will protect whistleblow, because that is how a lot of the information got out to the public into the world as to the conditions that were going on in some of our hospitals, I mean look at Elmhurst alone, what went down in Elmhurst Hospital and how that news got out the people who were working inside. We certainly want to protect the workers. We talk to them all the time. Doctors, nurses, OBGYNs, doulas midwives. They all actually do email or text or somehow get in touch with me, and we have daily check-in calls with hospital teams with whether they're intergovernmental and even executives. I know that many of us don't trust some of the executives at some of these larger hospitals. So that's why we make sure that we have the relationships for the people that are actually on the frontline you've, seen tons of expose and really damaging articles in some of these systems on what people are going through. We saw trash bags as surgical, gowns and people in these conditions without masks. Nothing is perfect right now and really there are a lot of situations where I don't feel like. There is substantial PPE. You might hear the words adequate, but we never did get a definition of what adequate and which guidelines were you to judge them. So just so you know, if you have anything that you want to flag, please let us know we're always looking for information as to how to improve a system or, quite frankly, if we have to shame them if they are not doing what they're supposed to do, I think, what's going to be the hardest one of the hardest things that we haven't quite had to grapple with? Well, two things: one is how many healthcare workers we will find out ultimately died during this pandemic and to the mental trauma that we are all going through, that we have not quite yet processed that the nurses and doctors who were previously doing surgery or they were in Pediatrics. Seeing you know dozens of people die every night and in addition to the teachers and the students and the families and everyone else who are in homes where there is domestic violence, there needs to be a mental health program implemented. That includes art therapy, to include our cultural institutions to really address some of these issues. It's short answer, Valentina. Let me know what you hear: I'm always interested I'm, always checking with workers as well as people like a dr., Katz and I want to make sure that people feel safe when they're inside what we deem as one of the spaces in New York City, which is a hospital okay. So that's what I'm gonna do tell them that they can contact you and it won't be discussed because you'd be surprised, I, think a lot of hospitals have policies that everybody has to sign off on about how they communicate outside of that hospital, and your hospital said that he does not have that policy. I asked them directly that they are allowed to talk to whoever they want. But, let's be clear, I'm sure there are some sort of you know hints as to oh just let us know we'll take care of it again. We want to protect whistleblowers, they're, doing the right thing and letting people know of the conditions, and it is because of them that many of the terrible conditions that existed in some of our systems early on were eventually rectified. So thank you. Let me know and thank thanks. Good luck on your Town Hall tonight. Oh thanks join us if you can, if you're doing the people's work. Oh. Thank you sure. Okay, hi everyone and I'm hope that everyone is healthy and safe I'm on the iPhone, because my iPad and my computer is not working I think I used too much today the morning you know straight through because we had a hearing today, as my colleague Karina was talking about housing and building meeting and we're starting to have hearings about some of the package, a bill that she talked about earlier. I really want to focus on our senior population, because I know that my office has been getting a lot of calls from our seniors. In the beginning of the shutdown people who were supposed to be getting, you know home-delivered meal from the senior centers, and that was going well for a while. Then, all of a sudden, it was taken away from the Department for the aging and got centralized under the food Tsar and there's still a lot of problem of people getting food. They were always told to call 3-1-1. It's long, wait and there's grab-and-go. You know from the school it's helpful, but they still got to work out a lot of the kinks. But one of the things that we want to focus on is that we want to make sure that, coming out of this crisis, that our Senior Center are kept home because they are so crucial in our community because, right now they don't really have any part in it. They are calling out senior doing wellness check, but I also want to make sure that they have the capacity going forward to really look at what the Senior Center should look like after this crisis. How do we use technology and how do we make sure that the food quality that we have fought for the ethnic food, the kosher food, the halal food that is not gonna, be lost. So that is something that we want to make sure that in this budget, the ten million that was promised for our Senior Center. It was not in the executive budget and I was not happy with that, and we also want to make sure that the money for the home deliver meal program, which is really the only program, does continue to service our homebound senior beautifully. And we want to make sure that program continued to grow, because the need will continue to grow and, as you heard from my colleague earlier, the budget cut is gonna, be it's devastating and that's why we need help from our federal government and in some of the calls that we have with the congressional delegation and our congressional leader. They were trying to help. You know fight for money for the city and the state. It did not happen in this 3.5 and has to happen in the next one, because otherwise New York City the whole could be up to eight billion dollars and, like we're, gonna lose a lot of the safety net program that we fought so hard for the other one is our youth program there's no way that we could just get rid of summer youth program and we're working with provider to figure out a creative way of providing services to our youth during the summer the mayor has set up. You know all these specialized task force did not involve the council so going forward. We will work with community board neighborhood group to figure out after crisis. What would these programs look like so that we make sure that our seniors, I'll, dudes homeless, our families in need are not lost? The other thing is that I know there's a lot of discussion about small businesses and sadly it's like our small business got left out. You know the big banks we're not helping them and by the time people apply. They ran out of money. Now they put in more money in this 3.5, and the good news is that from the discussion with council, congresswoman Maloney, there's 60 billion dollars, set aside for women and minority-owned business, and also to allow smaller bank and credit union and Community Development Fund to help small businesses. So I really urge the small businesses in our area to reach out to these support groups happy Renison. They are CDFI the louis I credit union. We also have LaGuardia Community College, a small business center and Pace University, a small business development center. That could be helpful to help small businesses apply for these loans, and hopefully they will come out of this, and but we still got a lot of work to do so. I'm open to some questions, we're gonna, okay, yeah, hi Margaret. Thank you. Thank you for all of that. I just wanted to hear any thoughts you have about the devastation that has happened in New, York, City, nursing homes that you know as the governor and the and the industry blame each other. For you know a decades-long problem. Is there any thought going forward of a task force or something that could really with people who don't have skin in the game? Who aren't making money off of this? Who might be able to come up with a set of guidelines? Requirements demands asks for nursing homes going forward because I think there are media things which are being done, the best they can, but in the future it looks like there were things that could have would have gone better. I definitely agree with you. Okay, my mom right now is in the nursing, skilled nursing facility, I company R, and it's such a big difference between the City one and the private ones, and so we really have to figure out how to you know, support nursing. You know skilled nursing facility, because we're gonna need a lot more. That and that's why I think for the council. We have to take the lead on some of these issue. That's not being addressed council member trainer, myself, councilmember, Rivera and then councilmember Mark Levine. We also, you know, send a letter to the governor and the mayor that they should really utilize. You know the Javits Center Hospital to help you know nursing home resident who had was infected. You know with the virus, always recovering, so you know get them out of that situation and it's like they've forgotten so I think going forward. We also need to look at well. How would these facility and what are some of the creative models out there? So I really look forward to working with you on that, so I just wrote it also, but sadly, I had from a dear friend who lost someone who was living in a nursing home that he has something to report because he had from other person there what was happening. Where should we be directing this kind of reports when we know that you know something? Horrible is happening, definitely reach out to us, because a lot of the councilmember like councilmember Trager, councilman cosgood, called around to some of the nursing home and some we were able to get. We respond and some even pick up the phone, so I think we need to really push for more oversight from the state because they are under state jurisdiction. So we need to work with our state elected and the governor I mean they cannot abandon our frail seniors. I mean those are the most vulnerable singer. So the more cases that we hear we will definitely continue to advocate. I haven't worked in one in ages, but one of the things I always remember it was that their patient nurse ratio was terrible, and so that to me is like one of the issues to look at what is the nurse patient ratio? I mean hospitals in terms of seniors out. Here is computer literacy, I'm heard from almost everybody? That's a senior citizen is the whole concept that when we go back to whatever is going to be the new normal, it's going to be as minimal person-to-person contact as possible and most seniors did not grow up computer literate and are very uncomfortable. So hopefully, one of the things that will happen will computer literacy and help for seniors in terms of dealing with various aspect of our lives, where we have no choice but to go paperless and go computer. The I agree, eval I mean I, think that's something that Department of Aging was working on and I will make sure that we fight for the funding. For that, because we cannot to say: oh, you know no new needs, so we will definitely continue to do that. The other thing is that that's how the seniors gonna be connected, because going forward, they will not be able to gather to 300 senior in one big room with a congregate meal so going forward. We have to figure out like how do we keep senior in touch and I know that you know we have a lot of computer programs while senior in the senior center. We just gotta get everybody involved and when nursing home I think we have to work to really elevate home health aides, nurses, a they are the caregiver and we gotta make sure they get paid better, that they are treated with respect and so that, because they are so critically needed, but if we don't even pay the minimum wage, how do we attract most people to go into that field? So that's something going forward. We have to make sure that we fight to make sure that they are taken care of and the nurse patient ratio is better yeah. I. Think that's we're here, for these problems comes from council member Jim. Thank you very much. Thank you. Everybody stay safe and healthy. All right see you soon. So we have next Deborah Glick, followed by Cavanaugh and Harvey Epstein and UV knew so Assemblymember Blake I've been contact. This is really terrific. Just a reminder that the census Manhattan is losing the Battle of filling out the census. Our borough president told us the other day. Staten Island is beating Manhattan, that's terrible. We have to do more. We well. The state has said that it will send out a an absentee ballot to everyone for the June 23rd primary everybody should take available of the absentee ballot, but you can download it ahead of time. It's not like I, don't trust the state and the Board of Elections to actually do that accurately, but I think that it would be good for you to download and get your application for an absentee ballot in before there is quote a rush assuming that they actually get those paid. That paperwork out to us. A few things that I hope that has come up in other conversations that I wanted to address. The state has included 25 point five million dollars in summer youth funds and we I've written a letter to the mayor to say utilize. These resources, especially before the governor, doesn't send the cheque and on the we added 25 million dollars in emergency food aid, which is going directly to food banks. So if there is a food bank locally that is not getting resources, we know that it is going we're reviewing. We know that the governor has and the head- and the speaker have mentioned to us- the larger food banks, food NYC and Catholic Charities, but we want to make certain that the smaller food banks are also being able to access those resources on nursing homes. Yes, they've always been understaffed and in many instances workers are under trained. So the nurse to patient or client definitely is an issue. We have raised a couple of specific nursing homes with the governor's office. Every afternoon we have a conversation with their the governor's staff -. It's essentially troubleshooting. We we've raised a couple of specific nursing homes with them and they have indicated that they're going to do a review of nursing homes, but I've signed on to a bill that assembly mentor Kim from Queens has put out. That would essentially say that not only would there be oversight, but in an instance where there is a number of fatalities and confirmed infection one, they would have to be clear about reporting that and in the worst cases of negligence, the state should take it over, so that we do not have frail elderly people or disabled people at the mercy of a nurse, a private nursing home operator that is making a decent living for themselves, but doing it by poor care to their clients. I have two bills that I've put out one. That would stay for those once where the courts are actually back in session. That people could get an additional postponement if they're over 70 until this pandemic is over until there's a vaccine, because people do not want to congregate. I would urge everybody to also use their absentee ballot that you know I know. Some people are upset about the loss of a senator Sanders Joe, Biden Prime, but those primaries bring out an enormous amount of people and we don't want to be Wisconsin where people were forced to vote in person and had these long lines and some people got sick. So there are down ballot races, sometimes having a larger number people vote is a good thing, but not when we're still in the middle of a pandemic. We also have a bill that would require all employers to maintain PPE for all of their employees. A month's supply. Now right now it's hard to acquire that, but, as things get better, we want those materials are available. We want every employer, we saw people working in supermarkets without masks without gloves and have no access to it unacceptable. We know, even if there's a dip, that we will have a resurgence and until there is a vaccine on this particular pathogen, we aren't safe. So that's number one number two. We also know that this won't be the last time that we have some infectious disease that for which we have little or no immunity. So that's important I. Also, just want to say that the senior centers are it's very important for them, as Margaret said for them to survive, but they were doing a great job on food distribution until the city stepped in and screwed it up. So sometimes you know we should all do the do no harm, that's what medical professionals are supposed to do, and maybe government could take a cue from that. So some of them, some of our senior centers on the Qt, are helping us because the city doesn't have it together on that on the streets. I think it's good to have in your neighborhood a safety valve someplace where we will be able to get out on to the streets, especially as the weather gets warmer and where there is area downtown, doesn't have enough parks. I mean where we're not like, where I grew up in Queens huge big parks where the governor grew up. We had big parks. We don't have that in Manhattan, so we need to have some of these streets, but I want it to remind people, go out with a mask, wear a mask for the foreseeable future. This is a nasty thing and we don't know if asymptomatic people, whether they're carriers, how long their cares. We don't know if people who've recovered, are still infectious. We know nothing so protect yourself. Your health is irreplaceable. We're just tired in truck we've got about three minutes left. If you wanted to leave time, hey we'll just close by saying that we heard from the governor's folks that they might entertain yet an extension on the moratorium of evictions, we're going to push for that and we're going to push them to allow us to use security deposits for rent that's a way of actually getting money, not out of someone's pocket but into the hands of some of the smaller landlords that really they too are struggling. Thank you, I everything that you're doing and so I just want to bring up, because in I understand, you're the chair of the Higher Education Committee and I had a conversation with Epstein about this as well so testing standardized tests are, you know, there's a lot of inequity in them, as it is personally I've. Huw juniors, who are who are very anxious about this and I, have one of my one of my children actually needs accommodations and is not able to take the tests at the regular time that all their students are able to take it right now. Looking at the fact that she's, probably gonna have to really have a high-stakes test in late September and so I'm wondering if suni is discussing or if you can raise it with suni, just like these schools and a lot of other schools that are dropping the requirement for a CT and SATs for the upcoming admissions yeah I think that I will make a note. You should also call the office two one, two, seven, four, five one, five three, so we can work directly with you on any accommodation if, in fact, tests are actually going to take place and the colleges really don't know what they're going to do about online learning. I talked to the CUNY Chancellor today, thinking about hybrid classes, some online and some in a classroom, they're concerned about density. It's a work in progress, but I do know that some of the schools are dumping, that I don't know that they have come to a conclusion. Some of the boards are meeting in this next week to figure out what they're doing going forward. I will raise that both with SUNY and CUNY and with keikyu, which is the operating which is sort of the lobbying on for the private colleges. Okay, great, thank you very much got one last question from Robin shoot out. I am Deborah thanks again for all the work you're doing, I wanted to touch upon what you had said about food distribution and how the city is taken over that from the community, centers and I'm. Just wondering I, don't know! If that's if it's that black and white or is there a collaboration and if it's not working so well as your way to wrestle that back and if so, what can the general public do to make that happen? Well, I actually think do we has been doing a decent job with the grab-and-go and they said that is going to continue through the summer. So that's a good thing. What we are working with the city- you know they don't listen to us, because they, you know we're just state reps, but we're working with some individual senior centers that are still providing meals on their own and the city is struggling. I mean I. We go on these calls and you know they tell us what they're doing and it's like the hospital's. Everything is great. They're working, there's been a couple of hiccups, but the reality is that the hiccups are pretty damn big and people have been left with that. So we focused on the seniors because most of them can't go out and shouldn't go out. Community groups, food banks are doing a great job, even though they're very stressed so I call the office two one, two, six, seven, four five one, five three: if there's a community center that is having a food distribution, trouble that we can work through with the city but the it's, the seniors we've been focusing on because they literally should not be going out, he's actually trying to get on now. Okay, so we're gonna, skip him then and go to the next person Harvey Epstein. Please hi good evening, everyone you guys hear me, that's we can't. Thank you great, so I know you have our report I'll, just kind of briefly talk about things that we haven't touched on. I know, Debra mentioned, know, I. Think Brad mentioned the issue of the primary, never mention the primary to. Obviously the primary on June 23rd, not canceled presidential primaries, canceled and I. Again. I was disappointed by that and I voted against provision in the budget, but you know that's what we agreed to in the budget. The other thing that we should be thinking about is the state budget itself. Carney talked a lot about the city budget and you know the state budgets impact. If the governor Scott city's proposals going forward, we're gonna see serious additional cuts in the city budget. The additional eight point, two billion couldn't reflect all localities and unfortunately, in our but the state passed, we gave the governor the authority to do quarterly adjustments for the budget, and you know it's I think it's troubling that we gave up that authority but move forward. It is the reality we are in this year, so we could see rolling cuts every quarter over the neck of the fiscal year so on something to keep it to keep your eye out for I know we're all doing coronavirus response and we've heard a lot from Brad and Deborah and Carlene about what we're all trying to do. Clearly, you know the issues I've seen Yankee is that Deborah mention are severe and I. Think they've taken some leadership. Keaney's done a great job, especially with students who can do you know credit. No credit. Suny has a much more like campus by campus program, but if you have problems or you're here, students are having problems about that. We shall let it snow on the eviction moratorium. You know. Obviously, Brian I have a bail around fiction, more terms disasters and he leans, leading on the bill around canceled ranked we have a couple other provisions around terminating people's leases if they need to, in the middle of this getting a rent freeze from the rent guidelines board. Instead of having rent guidelines for hearing, we know that everyone's suffering and they don't really need to have hearings and say whether they should have raised to write their feet at least a rent freeze over the next year. Well, everyone hopefully, is able to recover through a lot from folks around prescription medication and we're trying to during the pandemic to live coverage for 120 days, so people aren't freaked about getting their medication and small business issues are just you know. You know every day we're seeing them. Carlina mentioned some of the stuff on that state level, a bunch of bills that we're moving forward on the state level as well. If you can, you know, you know the things that you hear the things you want to work on, we're happy to coordinate you know. Volunteers are always necessary to help with the food distribution, calling constituents calling me assistance, getting flyer information up in the neighborhood crisis that we're hearing about unemployment. If you hear people having concerns about getting unemployment, benefit officers they're having daily conversations with the governor's office- and we can get you that information and if they're you know every week, there's events we're doing I'm doing a town hall along with Deborah Glick tomorrow night around, you know, with the young Invincibles or on Keeney SUNY issues, I'm doing when they Creek around small businesses, I think we're all trying to catch as many people as we possibly can on these issues. You know it's a crisis, that's not gonna, be obeyed at anytime soon, but we're all growing together. I think we are lucky to have such great colleagues on the east side with the assembly and send in the council I'm lucky to be able to be able to work with them, and if we think we can get something done, we can figure it out together early today, we you know yes, a or two days ago, the governor's office dropped a lot of hand. Sanitizer nature develops their neighborhood, but these are ten gallon jugs that we need to get all creatively. Thinking about how we get it out to people or create that we think you know, we get food out good people and we have a strong, nonprofit and goals of doing God does about every street vision Ravana. You know Grant Street they're all doing as much as they can in this crisis. You know we can do that for patients and help that together we can make this all work nothing's going to change overnight. We're not going to see you know as we slowly come out of this New York is not going to be the same. The question is how we're going to be able to keep as much we can ensure that we have real budget justice, we're really focusing on in Albany, and it isn't just about cuts. It's about how we get bringing revenue. There's a lot of bills that we all have around new revenue, whether it's taxing you know, the high income earner more. The mezzanine debt bill, with lots of legislation to talk about having resources at the table because the antics but can't just be cuts, could be cuts but also gotta, be we do doing really well need to put more on the table. That's 112 billionaires in New York and tens of thousands of millionaires who live here. We've gotten real bonuses from the federal government from the tax cuts from Trump. Even in the stimulus package, billionaires got money back, so we need to take some of that back from them. Where are they gonna experience with a 1 or 2 percent increase? Don't even notice- and this is billions of dollars for our budget- that we need to get back. So hopefully you will support the idea of taxing people who have more income. So we all don't suffer and I'm happy to take a question. If people have any yeah, we do got a couple for you remember. We got first Michael perlis hi Assemblymember. Thank you. So much for everything, you're doing I just had a question on the rent freeze from what I understand it's only for rent stabilized apartments right because through the RGB and the term they're voting on is from October 1st 2022. You know for the next year. So is there any? If that's true, then, is there anything we can do about leases that are renewed between now and October, 1st, where they still have the one and a half and two and a half percent increase. So there couple things that just that's a very good question and it's true, the Wren freezer legislation I introduced is just a rent, regulated apartment. We also have another bill that some of them hunter and Senator Salazar has introduced around good cause eviction and that would cover all the no unregulated unit. So that's you know, that's really important for the non-regulated stock. What we really need to do is go back to Albany get those bills passed. The second thing is, and we've all been asking I've sent dollars to the governor's office now, probably a month ago. Yes, the authority under executive power to freeze all the runs now and we've told them to do it no reason to wait legislatively. We can't do it unless, through the guidelines or you're doing it through the structures that we have, but he has the authority today to do it. We've asked them. You know some people won't be able to use their security deposit. Is the authority to let us do that. Even if flameless don't agree, he's got the authority to do to do the things we care about. Some people might question, cancel right, I, think it's legal, especially with putting a hardship fun together for those difficult landlords, but he's in a lot of power today and you should be exercising it instead of doing cuts, helping regular people. Our next question is coming from Jackie wah Jackie go ahead, Jackie make me not gonna gimme, oh I'm, so sorry I'm, so senator in terms of generating new revenues. I just want to make us more suggestions. Maybe you could consider testing for as who owns an occupied allostery condos in New, York I. Think that as proposals have made in the past, but I, don't think it has any legislation. So maybe you this is a good timing to pronoun. Well, luckily, some woman click is here on this. She's got a Pierre Terre tax that I'm a co-sponsor of, and that's exactly what you talking about most high in real estate, developments that they need. Resources from Deborah has been leading that charge now for a few years. We are trying to get it in a budget this year and unfortunately didn't happen and I know that she will continue to fight for her fyodor tear tax, and she knows I'll be right by her side as that moves forward. We want to make sure those people who are high income earners, people who are not New York residents pay additional they're not paying into our paying income tax. They should pay more for their real estate. Exactly thank you. So much Joe I, don't know if Debra wants to add anything to that but question for you from megan joy mm hi. Thanks for all your work, just instead of focusing on regarding commercial rents, instead of focusing on cancelling rents, which I think would require some sort of federal backstop of money or some sort of real estate tax concession, can we put the power in the hands of actual commercial tenants, and you know make some of these I know you're, not SBA, but if you give, if we're able to pay the rent and give us the funds to pay the rent, then the power is with us. You know whether it's giving us more freedom and the PPP loans- or maybe it's you know, our portion of real estate taxes gets cut whatever it is. But you know we understand that, like the more we understand that the landlords are small businesses as well and they need to get their rents as well. We just want the ability to pay the rents and have some money to do that. The loans from the federal government aren't allowing us to do that right now, not enough yeah and so just unfortunately, New York State, even if we were pushing New York State to have a loan program as well for the governor. Yes, you know we don't have money in New, York State I have a bill to allow commercial tenants to basically create like a scree tree type program for their small commercial businesses to say the landlord gives some portion of the rent that can be as a real estate production of real estate taxes. That's you know, idea. We've been pushing and the other idea that we're pushing it to say if we can't get it cancelled, can we make sure it can be collected but can't be a subject to an addiction so making sure that then maybe the commercial tenant might have to pay. Hopefully they will be able to figure something else out, but making sure that cost doesn't result in addiction. So it might be a judgment, but at least the people can keep their businesses well just to talk about two other things. Meghan then we've talked about the fair. A lot from small businesses that the value, and especially in bars and restaurants, one is the liquor license and if the landlord couldn't get a new business in that location to also get a liquor license, they could get bargaining power to that small business. That's already there and so to say to limit the number of liquor licenses for in existing locations for new business could give additional bargaining power to those small businesses. I. Think the idea of having more alone and good elbow from the stake every would be great. I. Just don't see it coming, because the governor is not really interested in moving that think over it at all and I hear you're concerned about the cancelling around that's. Why we're trying to make sure there's a find available and that's why? We've also asked the federal government to have funds I signed on with that I think probably 200, my colleagues to ask for federal money to pay the rent for those both residents on commercial businesses. Yeah, there's already a six month, backlog in SLA, so I, don't think I would worry about them. Getting a liquor license in a hurry right, but it's all about getting additional bargaining power for small businesses. That's all we're trying to do to give them as much leverage as they can to negotiate with Thailand, so they can stay Thank, You Assemblymember. We appreciate it. We're gonna go back now because State Senator Cavanaugh, are you with us now? Can you hear me? Yes? Thank you great. Thank you very much. So I know you've heard from a lot of us and we are all working very closely together, as we should be so there's a lot of overlap in the work we're doing it. So I've heard some of my you know. Grier from my staff has been there the whole time and so I understand you've heard quite a bit about you, know: unemployment and food and many other issues we're working collaboratively with all of them and with Elias ready on those things and I'm. So I'll I guess not focused too much on that work. Right now, but just to say, you know some the chair of that Senate Housing, Committee and I've been particularly focused on the housing questions and I know. You've heard some. You know some about that, particularly just from Harvey just now, but we are pushing for a comprehensive program that really is intended to do what Harvey was just talking about, which is actually get federal, funding and pay rent to the extent that residential tenants have an inability to pay. So it would be kind of loosely modeling such an eight, but we cover rents that are higher than governmental programs. Typically covered. We've got two hundred and fifty percent of what's called fair market rent which, in New York City, would cover rents potentially up to around forty eight hundred dollars depending on the number of bedrooms, and it would be available to people who have lost income or jobs probably have a range of criteria that would allow people to qualify and the goal would be since this is emergency to create a relatively smooth process for people to get that assistance and again that I think that you know we. Our idea is to do it as a piece of state legislation that would design a program and work out the kinks so that, to the extent this federal money bill what we get move as soon as possible. We are looking at the cares that did have some housing money we're looking at how much of that may be available for rental assistance. But we know there's going to be a need for a lot more. So as Harvey noted about 200 of us legislators and other government officials, as well as lots of advocates, have called for a hundred billion dollar national figure, with ten billion of it going for New York, and that was addressed to our compression on New York congressional delegation and our two senators, and some of them have responded favorably and have actually put in writing their desire to try to make sure that is funded in the next stimulus. So we're working on that and I would urge people who are concerned. I think there are a lot of ideas out there, but I bet the surest route to addressing. That would be to get a real infusion of federal money, and you know in a world where the federal government is so far allocated 2.7 trillion dollars with a T getting a hundred billion dollars nationally for housing, which is obviously essential per ticket. This time and ten billion dollars from New York doesn't seem like an unreasonable ask. So again we work out the details of that program and working jointly with the assembly and having conversations with a state executive branch as well for homeowners, we have a proposal as a pure. All of you know, there is a forbearance in place that basically prevents banks lenders from collecting mortgage. If you, if you miss payments during the period we would like to, we have a bill that we're working on with again there's a federal and a state component to this, the state level. We believed we could regulate state chartered banks and some institutions that service mortgages in New York that are New, York regulated and what we would do is basically say that for the duration of the parents, however month much payments accrue during that period would have to be would be required to be put at the end of the mortgage. So if you have, you know three months forbearance now, because you can't pay for three months, you would, and your mortgage fix ends in January of 2020. It would now end in April of 2020, and we think that is the and you know with no penalty and interest added. We think it effectively. That would make it such that your mortgage doesn't really exist during the forbearance period, as opposed to the current situation, which is really a temporary fix, which, basically all of them as the law stands now all of those payments will become due as soon as the forbearance period ends so and we think that's a lot of people can have trouble paying that I again. I know you've heard a lot from a lot of your electeds tonight, so think. Maybe I will stop there but I'm happy to take questions or comments or concerns about any of this hi centenary. Thank you for all your hard work on this. What I'm wondering about is the existing funds that have already been allocated through the canaries, Act and the coronavirus really fun, I think it's like 8.1 billion dollars and I've heard the governor, saying and also governor use. It I'm wondering if there have been any discussions about creative ways to use that for incurred costs or and policy issues are what's not being able to use it. I didn't hear the last for you here the last part of your question. I'm. Sorry, oh just I know that money has already been allocated through the cares act to the states, but I've heard that the governors are saying you know and a lot of senators also saying we can't actually use this money because of all those in place on it, including through the new Treasury guidelines. So I'm wondering if you know how the state I potentially use that money or if their creative ways to do it, and if there are, you know any machination going on to rectify that in the future. Yeah I think I mean honestly like there is a widespread expectation that Congress will be back at this. You know the effort of providing relief through stimulus bills that are going to cost additional money, so I think one option is, to the extent that they are going back to the drawing board, it's probably easier for them to modify the terms of some of the things they've done already than it is to. You know, come up with additional money, although additional money is very much needed. So I think that we have been on various issues. We have been pushing federal executive agencies to interpret things in a way and broadly in a way to construe things that have been done to allow whatever waivers they can provide for obstacles, and this is across all different programs. There is some of this money had constraints that were you know. This was a very complicated set of the legislation that was put together, so there are constraints that I think. Probably people didn't fully appreciate how difficult it would be for people to draw down the money. So I think that I think to some extent we can ask Congress. You know: ask the executive branch, through its discretion, to change the terms of some of these things, that we can also ask Congress to go back to the drawing board and modify these programs to the extent they're, not working as they seem to have been intended to be and again. In addition, putting they should be putting more money in the pot for small business and I would say, especially for housing, as well as for fiscal relief for states and city governments, so that they can continue to provide basic services, because the state budget situation and city budget situation are really pretty desperate and so to also offering open-ended stimulus package like physical stability would be very helpful. Hi senator hi, so I'm wondering how the voucher system would work with people who are roommates or people who aren't on a lease or people who are on or just people who can't prove that their income was lost one way or another, and then also I'm wondering if there's any other bills that could that could be potentially introduced because, like you said, the mortgage would basically not exist for homeowners, but renters, even with this voucher program, would still have to pay 30 percent of their income towards rent. So and then you know obviously, there's been a huge wait list for section 8 and it can be really hard for tenants and low income people to jump through the hoops to get that so I'm wondering if there, if there are like pieces in the legislation or I, guess just how that would sort of find it. So, just in terms of parity, it is true that and I. We think that the homeowner provision is generous and will help a lot of people. It just should be noted that a mortgage is not the only housing expense of somebody who is a homeowner, so we're not covering all of the expenses related to a home, but we are making sure that the mortgage and foreclosure doesn't become a problem. We also did I should note. We put, we made sure there was 20 million dollars in the state budget to provide advice and counsel through a program called the homeowner protection program which has been around for a while and actually came into the last mortgage crisis. So we are really making sure that people don't lose their homes as a result of Anila to pay their mortgage. There obviously also a lot of efforts to make sure unemployment and other programs are providing cash to people for various expenses, including housing, with respect to tenants the goal. We believe that the program with, let me take, let me take the two different, the categories you took differently, people who, like the question of how you prove a loss of income, we would say that we would likely to explain how the bill says if you had a substantial loss of income and it's subject to rules that would be put in place by the agency administering the program, which is the state HCR, and we are probably gonna, expand that to specify that certain things, what can it would automatically qualify if you qualify for unemployment if you are certified as facing eviction, if you have had significant, if you lost a job and I would remind you that I remind you, because I would make I would note that proving that you had a job, and now you don't have a job is easier than a lot of the programs that normally your you're trying to document. Very specifically I had this amount of money and now I have that amount of money. If you had income, you were working say in a restaurant, and now that restaurant has been closed by the government. It's not too difficult to show that you were on the payroll of that restaurant I mean a letter from the restaurant saying. Yes, this person was employed here, Amanda Lynn Moss should be sufficient and there aren't. There are programs that use that kind of documentation, sometimes in a sort of a judoka Tory process, but to where they're challenging a denial. But we think that demonstrating you've had a loss of income in this context, may not be so hard with respect to undocumented the status laws. A little tricky. There is a federal law that says you cannot use state or local resources to provide benefits to people who are undocumented unless the legislature expressly provides. That is the intent, and so the bill I have expressly provides that, to the extent that state money could be used to cover the cost of this program with respect to undocumented immigrants that they be fully eligible, we unfortunately don't get to set the eligibility for federal money. If the federal government grants the money in a manner that makes it available for undocumented, then we would certainly use it for that and I think that this administration and Albany would use it for that. They're icing fist. It's going to take a bit of a lobbying effort on as we're lobbying for ten billion dollars. We should also be lobbying to make sure that it is available for our needs, which certainly include documented immigrants and I am committed and I've said this I've had a lot of conversations with advocates are on this issue. I am committed to making sure that undocumented immigrants, and also roommates our bill deals with a potential where two different roommates are can be treated as separate households if they're really independent. Obviously you don't want. You know people who are roommates or a long-term couple to just be able to announce that there are two separate households in the same apartment, but yet it does. It does have criteria to specify when people should be considered separate households, even though they're living in the same apartment. So it's intended to be Jenner and broad and relatively easy to qualify for, but we will be amending it as we get feedback from people who know how these programs play out to accomplish them. Thank You senator. We don't have time for any more questions. So I'm just going to remind my fellow board members that there's a question you wanted to ask, and you have time to just type it into the chat box and when I move along to the electors and if I can just one more quick plug, we have a we're also having a town hall. It is Thursday. The details are available, but NY Senate governor website, and it is it's going to be an hour on housing issues with some experts from legal aid and another hour on business issues, and we have the Commissioner of the city, small business services department, as well as somebody from the pace. Small business assistant program pace university. So it should be good and again it's a zoomable event, and you know people can join a side of that move on to something member yulie knew and then are going to have joined us recently. I just wanted to say hello. Everyone also because I'm, like the last on all of the different levels, besides scale I, didn't even know she said on I'm so excited but I just wanted to say many thoughts, and so many things I type into the chat already, but we cannot be losing this battle against Staten Island. Okay, that's like that's like silly and stupid. We have to win. We have to win with to get everybody excited and then, on top of that, so I want yeah shout out to Deb. Click on that and I also wanted to remind people that I'm having my Town Hall on Sunday I know that it moved from Friday it's a little confusing I apologize. My Town Hall is now on Sunday, because we had a kind of surprise assembly, conference meeting and I had to move that so I want everybody to join in we're gonna talk about the budget and it's gonna be the after budget aftermath and what it all means for us, and hopefully we can get some input on that. We also are right now arranging between all of our different two offices. A another Town Hall on 70, Mulberry, Street I, know that a lot of folks have a lot of concerns about it. I want to make sure that we're actually talking about it and I want to make sure that, where were actually addressing a lot of the community concerns that we have and the other thing I wanted to talk about really quickly was that you know. As a lot of you know, we had talked about the need for absentee ballot applications, so folks probably know that I had made sure to ask for our absentee ballots to be mailed. I also found out that you know we wanted to have expanded access to absentee ballots for our safety and that also we wanted to make sure we found out that a lot of different municipalities were allowing online applications, but our city wasn't our city, BOE wasn't, and now it is, and so we raised those issues and we luckily got like a lot of phone calls and then things moved along and we actually won. So that was a really big deal. Thank you and I and I just wanted to also talk a little bit about unemployment. We have obviously worked endlessly on some of the unemployment issues throughout the district. I will tell you that the questions at Olympia ass were like top of mind. We are definitely trying to make sure that folks can navigate the system a lot easier. A lot of other reps have already talked about that our office has been trying to make sure that you know whether or not it's you can't get on the site. Whether or not it's you know the site froze on you, whether or not it's you know language translation, whether or not it's help trying to access these things, we're always trying to make sure that we can help people wherever they're at on it. One of the things that was brought up was the CDFI program a couple of times it was brought up by other legislators, but one of the things that folks didn't bring up was the fact that you know so one of the biggest fights that I've had in Albany for the last. However, many years was to actually fund our New York CDFI program, and we were one of the only states in the entire name that has New York CDFI fund, like has its own statewide CDFI fund, but we've never funded it, and this is the first time that has been funded. It's twenty five million dollars and we were able to fight for it. So that was a big win, but the thing is it's like a little late for our state to actually be able to utilize it in the best and effective way, and you look a little bit of a runway for our credit unions for our Community Development financial institutions. That's what CDFI means to be able to really fully utilize it in this time. This is the mechanism in which we would be able to actually dole out, for example, the PPP program that has been kind of launched much more successfully. I think that we raise that issue with our congresswoman and I think that we need to continue to raise that issue with our Congress people and I. Think that the PPP issue, for example, is really about making sure that we have strings attached to the funding right. We have to make sure that the state you know that the right barriers are put into place and that certain folks can really be able to. You know fight for the things that we need on the ground. I'm very worried personally about our small businesses, especially in Chinatown, because of some of the things that have been happening. You know it's been, it's been very hard and due to you know racism and due to the xenophobia, that's been going on. You know our Chinatown businesses started to suffer starting in like early February, and we really need help and I started to ask on the state level for help since then, since end of January, because I start coming and I just I really fear that we're not providing the help that we need, and so we had to think outside of the box, and we have been trying to raise different funds for revolving loans. We've been trying to do different things to help out and we've also been trying to start different programs. But you know it's been. It's been really upsetting to kind of think about what would happen if we don't find a solution for folks- and you know, there's six different programs right now and I will tell you. None of my small businesses have been able to apply and successfully get any of the resources that were promised and it's very hard to figure out what would be the best way for us to actually even access those things. I, don't think that it should come at like. Oh, if a kind, bigger business is able to return their money, maybe it can come to us, but if that's not the way, I think it should work. I think that we need to make sure that we are guaranteeing that it's coming to us. The other thing that I wanted to talk about is the fact that we do need to raise revenue. I think that that's a conversation that we'll have in our budget Town Hall, but you know the Pieta tear tax- is one that we can all agree on. My stock buyback, transfer, tax I think is awesome right. It's only 0.5% on like not that not even 1% I never really talked about its point. Five percent on when a big company buys back its own stock. You know, and that doesn't really you know, hurt anyone or not. It doesn't even like impact a person you know, and so I think that it's really a big deal. I wanted to say that also for to Val, we have been such huge supporters. Every single one of the legislators here has been a huge supporter of the state's the safe staffing bill. I think that one is such a huge bill and I appreciate you bringing it up, because my mom is also it was also a nurse. I was a CNA, and one of the reasons why she actually injured herself was because of the lack of safe staffing and so with a lifting bill and wanted to make sure that we have a safe staffing going well, I'm, also on Ron Kim's bill with Deborah Glick, on making sure that we're protecting our nursing homes and also their clients, and then one more thing that I wanted to say was that we got a lot of PPEs for all over the district and we also got a lot of food supplies, etc. But it's just it's not enough and I want I want folks to. Let me know if there are times that they need things and we just need to have the information, because we can't help unless we know right. So please call in please help. You know. Let us know how to help you, because right now, I know that there's a lot of folks who still have a lot of pride on things and I just want to just want to say that now is not. You know, it's not shameful at all right to ask for help and I also want to talk about my rent forgiveness bill reven forgiveness bill that a lot of folks are talking about people talk about as hashtag cancel, rent but I think that it's not as it's not so much as like. Oh the run scandal, but thank you thank you and I will make sure to leave some time for questions, but the bill itself is, you know it's about making sure that there is some cushion and we, as the government should be making that cushion, and this is a mess. This is the same mechanism that we use to make sure that folks, during Hurricane sandy who are injured, could have the same kind of help. So it's through dhcr, it's gonna, be a fun there's a tax bill for small landlords and it actually helps commercial rents, residential rents, mortgages and also make sure that folks are who are in NYCHA are covered as well as anybody who you know who has you know any kind of rent, etc. The only the only question I would have is probably for coops for maintenance right. So a lot of people are like. Oh the maintenance and so I will try to think about what kind of mechanism for that. But everything else would be. You know basically covered and I just wanted to kind of end on that and give you some time for questions. Oh hello morning, good morning, yeah I want to go to sleep soon, but listen. I. Have a quick question about the SLA. Is the SLA still processing legal license applications or is there freeze on it because I know we're all gonna wake up to a new reality when a lockdown at a party the pause period is over? We don't want to be waking up to a rude awakening, Farzin nightlife now being approved when the community has no input. - I hear that so right now we know that there's been like folks who had applied before Co vid and they haven't had any replies. I, don't know, what's going on with what, whether or not that's actually happening or not, but then I haven't heard anything about a technical freeze, but I think that we can do a little bit of a check up on that we've. We wrote a letter for sure we will have an SLA committee meeting report later on. So our chair of that committee can probably speak to that as well. Thank You, Assemblymember Jackie. Unfortunately, we're not gonna have time for your question. If you want to type it into the chat, we'll make sure to get it to the assembly member we're going to move on now to our borough. President Gale Brewer, thank you very much and I will be quick, as you have a wonderful meeting ahead of you. The first thing I want to say, is, of course, about community board appointments and they will be done by Friday May 1st. We are getting the information out. The hard part is many, wonderful people apply the board 3, and we only have a certain number of opening, so it's always a hard decision, but they will be done. The second issue I want to mention is something that Carla just talked about. My understanding, and this is where I would love to see the community boards involved. Is that the industries that would be bars? That would be restaurants. That would be hotels, etc. Will have a lot of say about what social distancing or recovery looks like. So it's an example of where the community board can say for nightlife prefer bars. This is what I think exist so, and the governor and the mayor each have their own individuals who are making up the recovery committee and I want to tell all the community boards. You should say this is what you think so something to think about across boards. Maybe a Varro board discussion, but it is something Manhattan is like no other far off, and so we really need to have our own suggestions as to what recovery looks like I, also just want to mention. We've been working on food issues, we're really delighted that Fresh Direct is now paid by the city of New York to work with NYCHA from the top of Manhattan to the bottom and on Friday were on the Lower East Side working with all the nights just to get them. Food Fresh Direct is now doing 500 packets per day as opposed to 400, and we had a lot to do but making sure they come back. I want to also mention open streets. I worked with the bids and it was the bids who said we want the streets to be open. I know the city council pressured the mayor and I think there's another example of what does the community board in your case 4-3? Think and where should there be if any open streets in your community? The mayor I talked about 40 up to a hundred near parks, but you decide you make a suggestion: the solid waste advisory board we also appoint. We have appointed their full 38 for the 2022 term. People live or work in I have to be really I'm very proud of them. This is the most active, solid waste advisory board of all five boroughs, and we are working really hard on the issues that they care about. There was a discussion earlier about undocumented workers, and housing. I have paying a lot of attention to the philanthropy that is being proposed by different organizations and with on our website, we will be putting out in our very popular daily newsletters, but you should know that the surahs foundation, headed up by Patrick Gaspard, has 25 million for undocumented workers. So if there's a housing situation or an unemployed in this situation, definitely you let us know. I think you already know that yes, er the East River Park is certainly a topic. We've been working with Pratt Center they're, trying to figure out how to have an effective community advisory group. I assume this projects going to go forward, but I want you to know that we've been working with them. I think you have also- and that's going to be a very large project and last time I wanted to talk about Chinatown for a minute. We I know that there's some state money to be used for economic development and we hope that Chinatown gets it. So we'd be working with the community board and different stakeholders to do that without getting into lots of specifics. I also want to just mention the future is happening very quickly and part of it is how does technology work, I? Think as a board? You have done exceptionally well, but we're going to have tomorrow. At 6:30 we have a YouTube working with Columbia University they've been fabulous. We've done one on education, we've done one on small business, we're doing one tomorrow night at 6:30 on technology and then the next one's going to be on tracing I know if you saw 60 minutes, but California has got it down, they are tracing for better or for worse. Some people may have a challenge with it. Every neighborhood to find out who's, staying and who's, not and guess what people are not dying and it's a very different approach. So there are different companies that are looking at that issue, we'll be talking about that and just education, community boards, digital divide and everything else. Obviously, it's a topic that I love and know a bit about, and we're also doing something more tomorrow at two o'clock: women's suffrage. As you know, this is a hundredth anniversary and there will be a August 26 unveiling of a statue of suffragists in Central Park. So make sure you talk to Brian Lewis in our office. We will have masks, we have many being delivered to our office on Friday, not they don't go for everywhere, they're, not going to take care of all of Manhattan. But if you have some specific needs, please let Brian know because we will try to address them and get them delivered, and thank you very much hope you read our newsletter and congratulations to your amazing virtual community board meeting. Thank you for a puzzling, for we appreciate it. We've got a couple of questions for you, we're going to start with Trevor Holland's I know. Thank you for that report. This is a question about open space streets parks in Manhattan. Obviously, we're constrained for space and the city has announced severe cuts to parks, and it seems a little odd because that's where people are going to go for recreation with pools being closed and we don't know what's gonna happen with beaches in other areas. Is there I didn't see a task force from the city about this particular issue and I'm wondering how do we raise this issue about funding for parks so that we could make sure that the areas are going to be heavily used? Have the maintenance and staff take care of these areas? I would do two things. Sharpe is a very good question. I mean we're dealing with Summer, Youth, Employment, Program and organics and parks, and it's a City Council and the mayor. So that's one focus what you've done for years. There will be cuts, but I can think of a whole lot of other ones. Personally, have you worked on the budget for many years? Besides parks, so that's one! The second is the mayor: has I, don't have it in front of me, but he it's on his website. He has appointed about ten I, think or twelve individuals to be part of recovery, and it seems to me that part should be part of recovery. So that's another place to put focus as team who you know or just make sure that as a board or as a community, you tell them the same thing and then the third thing is the mayor said: open streets will be near parks. So if there's a street that you think should be open, that's near a park. I know you don't have a lot of heart, but that would be another place to say: we need the park open and we need the street open and they should work together. That would be my suggestion, so City Council mayor's advisory, the governor also has an advisory three pages long. A lot of it is upstate, but that would be replace the foot presser and then, of course, trying to figure out locally about open streets. Thank you. Thank you. Our next question is coming from Robin Chatel, yes, hi, Gayle Robin, all the work you're doing like your newsletters are just so amazing I wanted to ask you about the East River I know that there's plans to put this community up together, but is there been any changes to the timeframe for that? Park and I know that there's a big concern, of course, if parks are closing, that is one Park in our area during this crisis that is really needed. More than ever, I haven't heard about any change. Obviously the Advisory Group could say this is different than before, but we can let you know you mean the community board will hear about anything. At the same time, we do sure. Thank you. Thank you. Last questions coming from Valentina jobs in terms of the bars and clubs and whatnot. My concern is that you have somebody in terms of health care, because the bottom line is this. Virus has like known amounts of time that it sits in the air. It has known amounts of times of transmission and that's a health situation. So I would hope that this is not just determined by you know nice people or whatever they. You have some health, so people that know health care and know about this virus, because the transmission of this virus is known. This is not something that's not known. Droplet infection is known, so I hope that you have some health people on there and that is taken into consideration. The transmission of this virus, the amount of time it stays in the air. That is one thing, no I, think it's a great point. I was just stating I, mean I'm nervous about everything, but now I'm nervous about what does recovery include and I want the community board, saheb, say and so I would say: you've got it. I feel very strongly about the health, but I am sure that, as we sit here today, the governor, who will decide what's essential and what's nine when it gets rolled out so on, he said the next couple of weeks is going to be construction and manufacturing and then they'll be you know, an assessment and then the next one and the next one he did say that the industries are gonna rule. In other words, the bars will decide and then he'll look at it or the restaurants off the side. 50 chairs I'm, making this up instead of a hundred so I'm just saying I want the community boards to have a say: that's what I was trying to get across, and so a health is a huge number one in my book. But if things are gonna be rolled out, I want you to have a say. Okay. Thank you. Thank you for president. We appreciate you joining us tonight. We are going to move on to reports from representatives some elected officials who were not able to join us tonight. I, do not see Andrew from the mayor's office on I, don't see Lila from Public Advocate romani Williams office on and I, don't see lingsha Nydia Velazquez office on. If anybody is on from any of those offices, if you'd, please raise your hand and we will go straight to Michael Stinson from controllers rostrum, there's office hi, everybody I, hope. Next week we can or next month we can turn this into a telethon, because this meeting has been very long. I just have three quick updates from the comptroller's office. Just today we announced a new telephone campaign to return over 2.5 million dollars in unclaimed prevailing wages. The workers cheated out of their pay by contractors on city funded projects. The comptroller's, a bureau of labor law, enforces prevailing wage and benefit rates for construction and building service workers employed by contractors on City public work projects. The phone calls notifying workers are going to be made by, and many of these, that are immigrant workers they're being made by employees of our Bureau of labor law, who are conducting recent sense of research on to find telephone numbers and email addresses for workers with unclaimed wages. Anecdotal evidence indicates many workers are afraid to respond so calls emails because they fear it as a scam making widespread public awareness essential to connect employees with their prevailing wage awards. So we are doing some heavy press on this to try to get the word out and if you guys could help us get. The word out on this would be greatly appreciated. Another thing we have going on every Tuesday and Thursday: we are having presentations via zoom on resources, from federal state and government city government, on the private sector, available to small businesses and mwbes impacted by Kovan. 19 presentations are taking place every Tuesday and Thursday again, as I said at 10 a.m. until at least May 14th interpretation is available in sign language, Arabic, Bengali, Cantonese, French, Haitian, Creole, Korean, Mandarin, polish Russian Spanish and oh, do please share that as well. We've had I think four or five of them so far, all of them have had over 200 people and we just want to get those word out to as many small businesses as we can to help as much as we can. And finally, we released to try to compete with the borough presidents daily newsletter. We have our own online resource center to support New Yorkers through the pandemic. The hub was crucial information on available government programs. Recent policy changes options for financial support and organizations. You can look to for additional help, whether your homeowner or tenant want resources for nonprofits, small businesses or freelancers are concerned about New, York's, seniors students or immigrant communities. Our resource centers information you can use please contact kovat update at comptroller, DOT, NYC, gov and I'll share this in the chat group. If you have any questions about the information presented in the Resource Center or would like to submit a resource to be included, and that's all I got, thank you guys for doing this again, Michael and I'm sure. If you review the tape from last month, we got you on earlier this time so willing to bet dinner on that. Are there any questions for the controller's office, seeing none? We are going to move on to our roll call vote and we're going to do this. The same way we did last time. Eric will call roll call and each member will just unmute themselves to vote and then mute yourselves right away. Hey David, Adams! Yes, sir! Here was you here, not there, but I'm. Here, oh you're, on Altman you're on okay, Jesse Beck, just Jesse Beck! Yes got you domina your bar, your rooms here, sorry about that! Okay, that's you here! Ma'am Dominic burns! Yeah! We got you domina Lieberman, yes, Carl in Chains, yes, I'm here, Jonathan, Chiu, Jonathan, Schoop, okay, absolutely David, Crane, David, Crane, cream absence. David gave it. You need to press the spacebar there. You go Felicia Cruikshank Felicia there. It is yes, Alastair! I can imagine yes, okay, surely fantasy, okay, she's, not there anymore. She was in as the as an attendee, but I promoted her and then she dropped off. Okay, Ryan Gilliam, Ryan, Gilliam, Deborah glass, yes, okay, Herman, Hewitt, yes, okay, Trevor, Holland, yes, Linda Jones; yes, Vala, Tina, Jones, yes, okay, Tatyana, Jory, oh yes, okay, Megan, joy; yes, all right, Lisa, Kaplan, Lisa, Kaplan, yeah, sorry, I couldn't undo myself doing it the hard way. Just one question: are we just doing attendance or a we voting on minutes, attendance and minutes? Thank you. There wasn't made clear so just thank you. Yeah, okay, Olympia cars. Yes, okay, Joseph Kern's, yes, Michelle, Cooper, Smith, yes, Meili. Yes, all right, Alisha, Lewis, Coleman, yes, gadget, Ellen, Liu, okay, Michael, Moreno, yes, and why wasn't I invited to the dance party Alexandra with it sound? Oh, yes, all right, Michael pearl, it's yes! Paul Rangel! Yes, shout out to polar angle, only says she's back. Okay, I'll look for it. She keeps joining as an attendee, so I'll move her back over all right. I love the sugar Carolyn Ratcliffe. Here, yes, the Maris ray is here: Richard Roe PA. Here, yes, hey, Thomas Rosa! Yes, Robin should tell yes Heidi Schmidt, Heidi, Schmidt right, Larissa, Sheinberg, Heidi, yeah I. Don't know why she can't speak, but she's here hold on, she might be in the attendee Larissa Sheinberg Larissa flint's Meltzer, yes, okay, Anisha, Stephanie, yes, okay, Congrats, Anisha, Sandra, stronger, yes, Josephine, Velez, okay, Rodney, Washington, Rodney Washington on this stuff. Over here, oh good, you got me all right, Thank, You, Kathleen, Webster, here Jackie Wong, yes, okay, Eric. We should have Shirley fantasy, David, Crane and punishment on they can probably underneath themselves now. Okay, you hear me now. Yes, thank you. This is crazy. I got on the meeting at the first and I couldn't hear anything apparently I could speak then got you all right. Our names have been okay good evening. Everyone thank you for. Can everyone see me? Yes, okay, I have a weird screen in front of me: okay well good evening. Everyone and thank you all for attending tonight's full board. Meeting I want to first start off by congratulating all our newly appointed full board members, as they will come on as a Friday. Hopefully they will all get their announcement letters and they will be appointed on Friday and if there are any members, any new full board members that are on the line at the moment, I want to encourage you to attend upcoming, make committee meetings check out our website and if you haven't been there already, please make sure you are checking in on the community board three website. Okay, also I want to thank our elected officials for being on the front lines, distributing meals, checking in on our community and doing the hard work as we are dealing with this epidemic and this pandemic. At the moment, business community board goodbye to make enjoy I want everyone to give her a standing ovation, a hand, clap and applaud, because she has done an exceptional job as our economic development chair. She is now passing on the baton to Anisha Stephen. Thank you so much for Anisha for stepping up to be our new economic development. Chairperson. We look forward to working closely with you, as you have already done, a great job of sitting on various committee and meetings that will affect economic development for our community. Thank you so very much. We've decided during exact executive meeting of this month. We decided that we were going to add additional executive meetings to deal with concerns and issues that may arise before the end of the month. So we will be having at least two executive committee meetings. So you're welcome to attend those if you wish, but this is to just make sure that we're checking in if we don't need them, then we will eliminate one of them, but definitely we will definitely be checking in to make sure that we're doing okay and if there's anything that arises, we will deal with it as needed. I want to encourage all of you to please continue to check in on seniors disabled members of our community and single parents, as they may be in need of support. Many people do not have extended family nearby and if you are a concerned, neighbor or citizen I encourage you to please look out for fellow board. Community members in your area, in your building or wherever you may live to, please just be a good neighbor, be a good friend and check in on people. Meals are being distributed, as you know, for people that can't get out if they call 3-1-1, they answer no to everything and they will get meals delivered to their doors. School foods is definitely doing a daily Monday through Friday mill distribution. You can get a breakfast and two lunches per person in your household. No questions asked no ID needed and some other local organizations shout out to Eric's organization. We want to thank Eric for being on the front line as well he's an example. Him and I do know. Damaris and I do know that Sondra Struthers I believe all of you guys have been out there distributing meals in the community. I apologize if there are others and I haven't seen you, but I want to thank those three members for doing an exceptional job of going out to the development and making sure that there's food being distributed to our seniors and our very vulnerable community. If you have any need to reach out to me, I encourage you to please contact me through the CB three chair at gmail.com. You're all welcome to send me an email of any issues or concerns. You feel like we need to address and have not addressed and during this time. Thank you so very much and I believe that's it for my chairs reports. Now we're going to move on to the district managers report Susan. Okay, thank you. I'm on you can hear. Thank you. So the staff has been working remotely for about five weeks now we have access through a program to our office, computers and to city agency functions, but it's all very slow, so we're trying to work on the most prioritized issues. We expect that the committees will all have meetings in June and that will have the district need statement on the agenda. We, the district managers, have already started working with office of management and budget on budget priorities for September budget consultations and I will be asking the committee's in June for any questions they want to put on the Jen does and now work more with the chairs on this. Under the heading of don't believe everything you read, I wanted to correct a report about SDR soccer fields that I read. It was recorded that fields were now being open in response to local complaints. What really happened is the park has been having a lot of problems with lack of social distancing with many homeless and people involved with drugs and the soccer fields are closed for a few days and are now open, but they're being opened later than usual in the day because of a staffing shortage. There are also more police now assigned to this Park, so I'm glad the elected officials talked about some of their work because there is such an amazing amount of work from our local nonprofits and our elected officials that has been going on. You know, feeding people, hundreds and hundreds of calls for wellness checks and new groups have formed such as even a East Village neighbors. Some of the agencies are having weekly calls I've been on to get food calls, which is a coordination of all food activities under Catherine, Garcia and Department of homeless services is also having weekly calls, and you know there are a lot of gaps. A lot of things are falling through there. A lot of problems, but I can I am also, at the same time very impressed by the tremendous amount of work being done and people both at the agencies and nonprofits that are doing everything they can and care very much. There are also been a few calls about 70 Mulberry Street, which is a fire damaged building and as a result of those calls that will be on the land-use committee agenda for May and I think there will probably be a request for a vote on that and I just would like. Lastly, to make sure that our for particularly for newer members in the community to understand how our community is organized to respond to disaster, we have a unique history in Lower East Side of creating collaborative models for the nonprofits to work together and not compete blow aside. Employment network is an example, so is Lower East Side ready, which is a coalition of over 30 community 3 based organizations and groups that coordinate a joint response. They formed in response to the disaster after superstorm sandy that was happened, informally and kind of spontaneously after a second Avenue explosion. They responded formally in partnership with the mayor's office and there now have been working for several weeks with elected officials with agencies and other groups to coordinate their work. One of the things they've done, which we have posted on social media, is a volunteer form that all the organizations and all the elected officials can pull from that one form and you able to match people interior interest. The organization the Coalition is chaired by Damaris Reyes and their board. Member and IO Harrington and I found their weekly calls with everyone to share information. Incredibly productive I just want to comment. There's been some questions about the SLA. The SLA was backlog by six months before the coab it before coab in 19. I, don't know if they're worse now, but it was a six month backlog before what has changed now, they're still having their meetings, but the public can submit testimony. They cannot appear, there's no opportunity to ask and answer questions, which is why I think many of the are frustrated and that's it unless there's questions, okay, no raise hand, so we can my hand was raised. I put it in the chat because the feature has disappeared. This is Olympia. Okay, well, I'm, sharing the agenda on the screen, which is why your pictures probably disappeared, but you can set it up so that you can see the pictures on the side, but I did not see any raised hand, so I apologize. So my question Susan is about the district needs. You know we I, don't know how many have seen. Sadly, there are crazy cuts that this year's budget has so our district needs may look very different than other years. So I was wondering if the district office is in a place to share updates about what is the mayor actually cutting? And this way we can have more informed decisions. Okay, so the district needs are not about the current budget cuts. The current budget cut and I should have added that we have just had four thousand dollars taken out of our current budget and eight thousand out of the ones starting the budget starting in July, so the current budget cuts they are from the executive budget are for the year starting July 1st. We have already voted on what we want. What we are doing now in response to some of the cuts, particularly for parks and for SYEP, is writing letters. We've already voted so we're writing letters. The things we've already voted for the budget, starting in July to advocate for them not being cut the district needs is not first of all, it's not bunch of priorities that happens in September. The district needs which is for the year starting in July 2021, and you know, I with you, it's going to be very different. You know we're going to be coming from a completely not another place that we've never known before and I think the committee's are going to have to figure out how you know how they're going to respond. It's gonna be very difficult. Any other questions from people I do so how to say that the committee chairs have all received of the executive budget, but I assume everybody pretty much has seen the executive budget and budget cuts for this. Coming for this coming July Thank You Susan Alicia. Do you want to move on to committee reports, Alicia, muted, again, you're good? Now you can okay, so yes, I'm, sorry, just to remind everybody when you're done talking, I am muting you if you're, not muting yourself, because background noise messes up the recording. Thank you Michael. So yes, so we have executive I already covered it in my chairs report. So we'll go on to transportation, which I believe had no meeting this month. We had no meeting this month and welcome back. We didn't meet and again we'd like to thank Megan for her service parks, recreational waterfront we did meet and we had one vote it's attached to on the agenda, its support plans for the Thompson Square Park, Fieldhouse reconstruction. Any questions. Thank you. A question for off four parks. If I can later I Trevor, just wonder if there's any update on the interim flood protection study for ESC are, there is no update. We've been told that it's on Paul's like every other project, but we don't have any other updates. Unfortunately, thank you, okay of mirin services hi, so we actually did not meet this past month. However, we did raft a letter for the full restoration of Summer Youth Employment Program. It was the mayor announced. You know some early announced that it would be canceled this summer and the nonprofit's received 48 hours notice, so we wrote a letter for full restoration of the program for this summer. Many of the nonprofit's already have ideas about how to implement this program this summer. You know, even in spite of all the social distancing requirements. Many of the other community boards are also writing letters just about the district needs. I think I mean I work for a non-profit, I know some of the committee members and board members do, and you know right now. The nonprofit's are just dealing with what's happening right now and dealing with any budget cuts for this coming fiscal year, but they are, some of them are thinking about the next fiscal year right now they don't have it. Is that concrete idea, but may I think that maybe in a month or a little bit more than a month, they will have or start thinking about it more after this fiscal year starts and then also I went to the community education council meeting, which deals with the New York City Department of Education. They are getting a lot of budget cuts, but also we will work with the CEC to find out what the needs are in terms of BOE and in terms of budget priorities, so that will also be like a little later, so hopefully in August we can well in August we will vote on something or July Oh. Any questions. That's the end of my report: Thank You, Man. Okay, that's how I. There are three resolutions from the meaning this month, there's also one item of old business. The item of old business was a hotel liquor license that we approved last month, but they subsequently told us that they weren't going to sign the stipulations regarding their operator. That's it any questions for SLA David Adams go ahead, hi, I, gotta, cut out and hear what you said was the result of the of the what happened with the change that they didn't sign. I didn't hear the full report. Sure the item of old business is at the end of the vote sheet. It's for a hotel. If you're licensed on Orchard Street, we voted to approve them, but they just decided not to so it's just a vote to deny, based on the fact that we, you know, created the stipulations based on their application and they didn't sign them. Okay, thank you. I thought, that's what you said, but I want them to be sure. Okay, bye, thank you! Landmarks, Linda, I, can't unmute. Other landmarks did not meet. We didn't meet. Okay! Is there any old business? Sorry I raised my hand for land use that didn't meet I'm, just saying that now so my question is they just started voting again at City Council for your lips and stuff, like that and I know that we were scheduled when of the crisis hit. We were scheduled to have a presentation about the two bridges rezoning from the applicants and I mean I, don't know what is happening, but there is some movement with the there are committee hearings now at City, Council, etc. So since we didn't see the calendar for next month, I heard Alicia said we have two executives, but it's monitoring that we are we going to have land-use like because there is movement there, so yeah stretch it out right, Jackie, yeah, so actually I'm. The DCP have gave as given as some response on the two bridges rezoning effort made by the co applicants and I think we were trying to make a presentation back in March, but because of the pandemic issue, there was not able to be held, but we are talking with the co applicants. I think we're gonna regroup. We talked about recouping in early May, so to see what we can report add to the community board so that I understand correctly you're saying there is gonna, be a meeting or that is not gonna, be a land use meeting may for me. For me, there is going to be a land use meeting, but the agenda would be on 70 Mulberry Street, as susan has mentioned before in terms of two bridges applications I think I'm, not sure if I want to put that on the May agenda, yet after I would discuss with the coop against hand raised and then Carl just clarification, and this relates to two bridges, because I thought we weren't going to have anything on the agenda that did not require the or immediate actions. That's still the case, or we mean that's a discussion, that's supposed to vote, but not that I don't want to see online needs, but we were holding off because it's not a vote. It's more of an update. That is correct. Each other I said I quit for some reason. I can't raise my hand anymore, so I just wanted you to know to call on me: okay, yeah. This is a question for land use, the meeting on 70 Mulberry. What is that about future use of the site or something is that the decide what to build up the site after they do a felt demo? So city agency is planning to come to us to talk about what they wanted to do with the site, whether because there are different opinions about the site and they're gonna, give us a presentation on that on the update. Also, if the site need to be demolished or we can keep it, as is okay, I have the nonprofit's that were residing inside 70 mobile. They received notice from the city that the full demolition has been approved. All right, the HD hadn't dance company made a public announcement about it, I caught with it three weeks ago, but you know since I don't have to email. You know I couldn't say anything about it, but the tenants have received notice from the city ready. Are they? Is this a planning meeting for a 20-story tower, or something did you know and if it is shouldn't it be held off until the public has a chance to weigh in on it and not buy a zoo, okay, I think they are gonna. Look for a vote. We're certainly gonna want everybody to come community and the nonprofit's that are still in there and I. Don't think we have to continue having meetings. We have no idea when Zoo meetings are going to stop and you we don't want to lose our opportunity to be able to make comments. So there will be presentation. Dca is going to lead the presentation. They will bring other agencies to weigh in as far as other agenda items, it's kind of late. To that you know. If you look at our you know, our procedures is kind of late doesn't seem like an issue, but it we usually put things on the agenda before the full board. But yes, I expect I expect there will be a lot of people coming to a in the 70, mulberry and I. Will you know certainly do it outreach and ask others such as you know, Carlin -, please help do outreach for that. Robin, no I'm, just trying to confirm the date for this meeting so I mean there's a May 14th, May 14th and the full schedule of meetings for we'll be released by the office. I believe tomorrow. Any other questions all right so back to the end of our agenda. Okay, so that was any old, any old business. Any new business I just want to make a quick reminder that we are going to adjourn this meeting and then we will have a brief meeting regarding friends of cb3 afterwards. So if you are interested in hearing more about that, you should stay on to the zoom after we adjourn this meeting. Thank you. Thank you Michael for that reminder. So that being said, if there's nothing else to address again, we want to send an extended welcome to Anisha Steven as the new economic development, chairperson, and also to the new members that are coming on board as it may. First, hopefully, everyone will get an opportunity to attend a committee meeting. There are five new members: I encourage everyone as they come on board. I will be looking for mentors. It is an extremely important to have a mentor the first couple of months on the community board. So if you're interested and being a mentor, please let me know it should be someone that is a little more seasoned as a board member someone, preferably that has no issues with attendance or anything of that sort. So please, let me know if you are interested in being a member mentor for our new members. Thank you all now we will have a vote. Roll call vote, Eric, yeah, sorry, my son just had a little episode, ready, David Adams yeah here: okay you're wrong out: yes, okay, Jesse Beck, yes, okay, Dominique's, Berg, yes, Lieberman, yeah, all right Karlin chain; yes, all right: Jonathan, -, Jonathan, choo, David, Greene, I'm; sorry, all right: okay, David Crane; yes, all right, Felicia, Cruikshank, Felicia, all right! Moving on air Diaz, yes, Alastair, economicus, yes, okay, surely fantasy; yes, okay, Ryan, Gilliam, Bryan, Gilliam, okay, Debra glass; yes, Herman, Hewitt; yes, okay, Trevor, Holly, Trevor; yes, Linda, Jones, Linda, Jones; yes, okay, buddy, Vala, Tina, Jones; yes, okay, tatianna, georeo; yes, okay, Megan, joy, yes, Thank, You, Megan, Lisa, Kathleen; yes, Olimpia, Kazi; yes, okay, Joseph, Kern's, Joseph, Kearns, I'm; sorry, yes, okay, God, hello, Cooper, Smith; yes, okay, Meili, yes, okay, Alicia, Lewis, Coleman; yes, Alan Liu; yes, okay, Michael, Moreno; yes, Alexandra mirliton; oh yes, okay, Michael, Perlis; yes, Paul Rangel; yes, all right, Carolyn, Radcliffe! Yes, okay, the marriage is the marriage. Trades Damaris; okay got you Richard rope, yeah, just Thomas Rosa; yes, Robin Chatel, all right: Heidi, Schmidt, okay, Larissa, Sheinberg, nope, Clint Smeltzer; yes, okay, Anisha, stiffened, Anisha; yes got you Sandra Strother, Sandra, Strother, okay, Josephine Velez; yes, okay, Rodney, Washington, Rodney, Washington; yes, got you Kathleen Webster yep and Jackie Wong, Jackie Wong, yes, okay! Thank you! Eric! Okay! So that concludes really quickly. I'm. Sorry I should have given a thank you to our social media, so joke crimes. Thank you, Thank! You tatianna! Thank you! So much thank you Michael. Thank you, everyone who has been involved in keeping us all abreast in our social media page and that concludes our meeting. So can we have a motion to adjourn motion? Okay, be safe. Let's stay on the meeting. If you want to hear about.",
        "summary": "I also request that cb3, you know to indemnify all of the open streets projects, making it far more equitable for block associations, lower-income and smaller groups to participate in this important community health, initiative.\nDon't want to get into a situation like we were in last month where the electeds reports took over two and a half hours, so we are going to be starting, so we've organized them the best way we can, and unfortunately things change.\nYou know the past hour, we've been dealing with emails coming in from people asking for their time to change And if they're still on the talk to us, they're still going to talk to us, but we have asked East elected official to keep their report to ten minutes, and those ten minutes include the Q&A session.\nThey have gaps in their budget and if they don't get city and state funding, then they will have to start layoffs, which is going to be a terrible thing for our people.\nAs the chair of the Oversight Committee I, have a responsibility for the post office and where they're going to run out of money, this summer, can you imagine how many people are getting their medicines by mail, communicating by mail?\nNow our government governor tells us we're going to be voting by mail, so we have to save the post office and make sure that it is funded.\nOnly doing loans over $100,000 and to call him you don't get to write the rules it's supposed to be eligible to everyone, but in this new round we funded or siphoned off or courted off, sixty billion for really small businesses, and this money will be distributed through credit unions, a minority institutions CDFIs which were created for unbanked, low-income people and micro lenders that are participating in the program, and this will be protected and used ugly for small businesses.\nSince there is this difficulty of accessing the relief in the various forms that it exists out there for the people who are really most in need, and then there is no movement yet on the legislation, even though I know it has been introduced, now, even at the federal level about rent suspension.\nSend me your questions to my office and we'll answer: them: okay, So, we're going to there are two people that one at an earlier time and one I appreciate the fact that you're trying to get through this meeting, quickly, I just wanted to thank congressman Maloney first for her efforts in which I joined and attempting to really repeal the discriminatory and homophobic FDA gay men, blood, ban.\nI want to thank them for all their work, including distributing meals using you, know, leveraging different parts of our districts like the management company at Stuy, Town Peter Cooper, which is owned by Blackstone they've, been donated.\nIf you're sick, are you gonna pay the rent if you've lost your job If you've got two kids at home, who are being homeschooled and you have a loved one, who's on a respirator I mean I, can't imagine just how grim it is for so many of our neighbors, so I'm in strong support of the cancel rent movement, along with our sibling members, who are on the line, some member yulie, new and Harvey Epstein, among others, of course, Deborah Glick, and we not only are pushing that.\nI've been appointed to the revenue-raising committee for the state Senate We're, going to look at ideas to you know the governor's proposing 10 billion dollars worth of cuts in the absence of any aid from the feds.\nWe have to tax the wealthiest, but you know we got to think of creative solutions like who's making money during this kind.\nWe, now require a whole host of protections for women who want to act as servants, including their own medical, care, health, insurance, life, insurance, independent legal counsel, ensuring that they have counseling make sure that they have Every medical decision is made by themselves, including whether to carry a child through term or not so I believe we're raising the standard for surrogacy, because so many states in this country, and, frankly, the world, have no laws whatsoever.\nYou, know where individuals who can prove that a loved one has been killed due to some negligence on the part of a physician or Hospital, can sue for beyond just the actual monetary damages, but pain and suffering, which has limited their recovery for so many people, particularly women people of color and people who are low income, because the estimate of your worth is based on how much you are able to earn according to a formula and if you're, a baby or if you're somebody who works in construction, they will limit.\nIt was done without watchdog groups and there was really no reason for it to happen at this point in time during a pandemic, so that that's my objection just on the on the face of it Here, but I would say in terms of the nursing home issues that really what we need are stronger standards and public health and Health Planning Council.\nAnd I think that those disparities have not only been brought to light in terms of what we already know that food housing, health care and education, which are basic human rights specially in this city, are not accessible to everyone, but that we also see that in the fatality numbers, which have been absolutely heartbreaking.\nSo in terms of the budget and how we're going to recover, we've been served about seven billion dollars in cuts from the mayor's office.\nI could say that coming from a former small nonprofit and making sure that we're saving things like the Summer Youth Employment Program, when our pools are going to be closed, we don't know about what's gonna happen in their parks in our beaches and our young people need something to do.\nI know the mayor kind of did his big announcement and many people think that we might not go through with the bill, but until we see a real plan from the mayor, not just an allocation of how many miles are going to be determined by the NYPD.\nWe're gonna keep going forward because we do want it to be community driven to work with the Business Improvement Districts to work with civic and block associations.\nWe're kind of still figuring out the process to make sure that people do feel included, because you all know your communities best and that's what happens when you're kind of you know trying to operate in the midst of a pandemic.\nMy question is, who is going to talk to the workers, the workers, with just a variety of issues that, like I, said whenever I hear most officials talk and people from the hospital sector?\nWhat we're not hearing is the actual people that are out there working and what this situation is like and what their concerns are, especially because rules have basically changed.\nWe're, also working to make sure that will protect whistleblow, because that is how a lot of the information got out to the public into the world as to the conditions that were going on in some of our hospitals.\nYou know dozens of people die every night and, in addition to the teachers and the students and the families and everyone else who are in homes where there is domestic violence, there needs to be a mental health program.\nLet me know what you hear: I'm, always interested I'm, always checking with workers as well as people like a dr.\nKatz and I want to make sure that people feel safe when they're inside what we deem as one of the spaces in New York City, which is a hospital That's what I'm gonna do tell them that they can contact you, Because you'd, be surprised, I, think a lot of hospitals have policies that everybody has to sign off on about how they communicate outside of that hospital, and your hospital said that he does not have that.\nWe want to protect whistleblowers, they're, doing the right thing and letting people know of the conditions, and it is because of them that many of the terrible conditions that existed in some of our systems early on were eventually rectified.\nI'm on the iPhone, because my iPad and my computer is not working The morning you know straight through because we had a hearing today, as my colleague Karina was talking about housing and building meeting And I really want to focus on our senior population, because I know that my office has been getting a lot of calls from our seniors.\nYou know from the school it's helpful, but they still got to work out a lot of the kinks.\nOne of the things that we want to focus on is that we want to make sure that, coming out of this crisis, that our Senior Center are kept home because they are so crucial in our community because, right now.\nThey are calling out senior doing wellness check, but I also want to make sure that they have the capacity going forward to really look at what the Senior Center should look like after this crisis.\nNow they put in more money in this 3.5, and the good news is that from the discussion with council, congresswoman Maloney, there's 60 billion dollars, set aside for women and minority-owned business, and also to allow smaller bank and credit union and Community Development Fund to help small businesses.\nI just wanted to hear any thoughts you have about the devastation that has happened in New, York, City, nursing homes that you know as the governor and the and the industry blame each other.\nWe need to work with our state elected and the governor I mean they cannot abandon our frail seniors.\nYou wanted to leave time, hey, we'll just close by saying that we heard from the governor's folks that they might entertain yet an extension on the moratorium of evictions, we're going to push for that And we're going to push them to allow us to use security deposits for rent that's a way of actually getting money, not out of someone's pocket but into the hands of some of the smaller landlords that really they too are struggling.\nYou hear people having concerns about getting unemployment, benefit officers they're, having daily conversations with the governor's office- Tomorrow night around, you know, with the young Invincibles or on Keeney SUNY issues, I'm doing when they Creek around small businesses, I think we're all trying to catch as many people as we possibly can on these issues.\nI think we are lucky to have such great colleagues on the east side with the assembly and send in the council I'm lucky to be able to be able to work with them, and if we think we can get something done, we can figure it out together early today, we, you know Yes, a or two days, ago, the governor's office dropped, a lot of hand.\nYou know we don't have money in New. York State I have a bill to allow commercial tenants to basically create like a scree tree type program for their small commercial businesses to say the landlord gives some portion of the rent that can be as a real estate production of real estate, taxes.\nWe've got two hundred and fifty percent of what's called fair market rent which, in New, York City, would cover rents potentially up to around forty eight hundred dollars, depending on the number of bedrooms, and it would be available to people who have lost income or jobs probably have a range of criteria that would allow people to qualify and the goal would be since this is emergency, to create a relatively smooth process for people to get that assistance and again that I think that you know we.\nSo, as Harvey noted about 200 of us legislators and other government officials, as well as lots of advocates, have called for a hundred billion dollar national figure, with ten billion of it going for New York, and that was addressed to our compression on New York congressional delegation and our two senators, and some of them have responded favorably and have actually put in writing their desire to try to make sure that is funded in the next stimulus.\nOh just I, know that money has already been allocated through the cares act to the states, but I've heard that the governors are saying you know and a lot of senators also saying we can't actually use this money because of all those in place on it, including through the new Treasury guidelines.\nYou know the effort of providing relief through stimulus bills that are going to cost additional money, so I think one option is, to the extent that they are going back to the drawing board, it's probably easier for them to modify the terms of some of the things they've done already than it is to.\nYou know: ask the executive branch, through its discretion, to change the terms of some of these things, that we can also ask Congress to go back to the drawing board and modify these programs to the extent they're, not working as they seem to have been intended to be and again.\nThere, obviously also a lot of efforts to make sure unemployment and other programs are providing cash to people for various expenses, including housing.\nAnd I want to make sure that, where were actually addressing a lot of the community concerns that we have and the other thing I wanted to talk about really quickly.\nAnd I started to ask on the state level for help since then, since end of January, because I start coming, None of my small businesses have been able to apply and successfully get any of the resources that were promised and it's very hard to figure out what would be the best way for us to actually even access those things.\nIf a kind, bigger business is able to return their money, maybe it can come to us, but if that's not the way, I think it should work.\nI know the city council pressured the mayor, And I think there's another example of what does the community board in your case 4-3?\nI assume this projects going to go forward, but I want you to know that we've been working with them.\nAnd, that's going to be a very large project And I know that there's some state money to be used for economic development So we'd be working with the community board and different stakeholders to do that without getting into lots of specifics.\nIf you have some specific needs, please let Brian know because we will try to address them and get them delivered, and thank you very much hope you read our newsletter and congratulations to your amazing virtual community board.\nSecond, is the mayor: So that's another place to put focus as team who you know or just make sure that as a board or as a community, you tell them the same thing And then the third thing is Mayor said, open streets will be near parks.\nI know you don't have a lot of heart, but that would be another place to say: We need the park open and we need the street open and they should work.\nAnd I want the community, board, saheb, say I feel very strongly about the health, but I am sure that, as we sit here, today, the governor, who will decide what's essential and what's nine when it gets rolled out so on.\nWe've had I think four or five of them so far, all of them have had over 200 people, and we just want to get those word out to as many small businesses as we can to help as much as we can.\nYou can look to for additional help, whether your homeowner or tenant want resources for nonprofits, small businesses or freelancers are concerned about New, York's, seniors students or immigrant communities.\nOkay, also I want to thank our elected officials for being on the front lines, distributing meals, checking in on our community and doing the hard work as we are dealing with this epidemic and this pandemic.\nIf there are others and I haven't seen you, but I want to thank those three members for doing an exceptional job of going out to the development and making sure that there's food being distributed to our seniors and our very vulnerable community.\nJust saying that now so my question is they just started voting again at City Council for your lips and stuff, like that And I know that we were scheduled when of the crisis.\nThere is going to be a land use meeting, but the agenda would be on 70 Mulberry Street, as susan has mentioned before in terms of two bridges applications I think I'm, not sure if I want to put that on the May agenda."
    }
}