{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB8",
            "channelId": "https://www.youtube.com/channel/UCPsRKFds5RmAx05fqHLE66g",
            "title": "General Meeting October 8",
            "publishDate": "2020-10-09",
            "shortDescription": "",
            "lengthSeconds": "2:41:25"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB8",
            "normalizedName": "Brooklyn Community Board 8",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 8",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPsRKFds5RmAx05fqHLE66g",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "ZD_fDubHvu0",
            "fillerWordCount": {
                "uh": 234,
                "um": 267
            },
            "readTimeFullTranscript": "83 min read",
            "readTimeSummary": "9 min read",
            "wordCountFullTranscript": {
                "building": 51,
                "project": 49,
                "motion": 46,
                "chat": 42,
                "school": 36,
                "budget": 35,
                "statement": 35,
                "vote": 27,
                "land": 25,
                "votes": 24
            },
            "wordCountSummary": {
                "project": 11,
                "building": 9,
                "budget": 7,
                "chat": 6,
                "vote": 6,
                "land": 5,
                "motion": 5,
                "school": 5,
                "church": 5,
                "end": 4
            },
            "fullTranscript": "Because I did not hear you it's already hidden on you or was the problem on my end, but listen for the thank you. If you did not hear him say something in the chat or by mutant talk to me at the end, Mr Witherwax, if I may, before you get started, I'm getting a text message from a fellow colleague on the board who's saying that by calling in he's not allowed to engage with audio and he's not showing up other than through a phone number, I'm sorry Mr Ellis would not. He get audio on the phone he's hearing us, but he's able to engage with the audio meaning he can not communicate back. So his roll call or his attendance vote would not be able to be heard, not good. Thank you. I think that might be the case on a few other people trying to just dial in through the dial and direct the same problem. Can you guys hear me Boyd hi Julia? Yes, we can hear you okay, so we shall proceed with the agenda for this evening. Believe we have a presentation, miss George. Can you announce that? Well? Do we call first, I'm sorry yeah, let's go through the role, you have a bad connection. Messiahs, I will speak slowly. Is that better? Okay? Sorry about that, Mr Witherwax, as Mr Ellis reminded us. Please do the roll call. Yes, your money, allison present. Thank you. Linda Andrews, Lisa, Atkinson, Wayne, Bailey, Princess, Ben, James, Julia, Boyd Julia Boyd is here. Thank you. Thank you. Thank you for supporting me John Buckholz. Thank you also. Yes, and this is John Buckholz, I'm present. Thank you, Mr Buckholtz. Thank you. Mr Mohammed, Robert Callahan, I'm here thank you. Hanji Charles, Helen, Coley, Norah Daniel. Thank you, James Ellis here. Thank you. Kevin Farley here. Thank you. Andrea Ferris Fred Frazier drew Gabriel Tamika gibbs Johnny Grenville by Jeannie Harris Blendman Marva Henry Present. Thank you. Zerzima Jordan Regina Kinsey Mahoney, Calvis, Mickelsteins, Robert, Puka, Yaya Rajki. Thank you, Adam sax present. Thank you, Brian Saunders President. Thank you. Janola Soko, Meredith, Staton, Kamisha Superville, I'm here thank you. Greg Todd, Ethel, Texas President. Thank you, Gibson President! Thank you, yves Villas, Kimberly Watson. Here's a will spoon. Thank you. Sharon Wetterburn Robert Witherwax present Deborah young prep. We only have 20 of 47, we do not yet have a Quorum Mr weatherwax in the Chat Miss Sarah Lasser has announced that she's here. Thank you, President Miss Granville is also present. Thank you. Mr Weirdo, Acts, Miss, Gordon, Miss Jordan, said, and also she just texts me she's calling in but can't speak. Thank you. That brings us to 22.. We still need two more bodies. Okay, we can start we'll start a discussion with a presentation from who is our guest. This evening, okay, Speaker Miss, George Miss, Larae Brown she's on yes, this is larae Brown. Can you hear me? Yes, thank you very much community board. Eight, I'm sorry that all you can see is the top of my head, but in better times we will all be able to be innocent in the same room. Thank you for allowing me to speak with the Community Board tonight, I'm here to talk about the interfaith medical center and our plans of around our pediatric inpatient services. During the height of the first wave of the Covid-19 pandemic, we essentially transformed our pediatrics unit into intensive beds, intensive care bed capacity in order to essentially triple the number of ICU beds. That interfaith has. We went from 13 our ongoing number of intensive care beds to 43 beds and that included the use of six of our pediatrics in patient unit beds. Reason we were able to do. That is because the daily census on our pediatrics unit has been extremely low. Over the last three years, we've had anywhere between two and three patients on our ten bedded pediatrics unit and therefore, even as the wave of Covid-19 hospitalizations, significantly declined and the use of intensive care beds. When has gone down to our normal utilization, we stepped back to think about what would we do in terms of our pediatric inpatient capacity? I should have introduced as the CEO of both interfaith medical center and the one Brooklyn health system, and I apologize for not introducing myself in that way because, as we were considering what the future would be in regards to our pediatric inpatient services, we're also looking at the pediatric inpatient capacity and utilization at brookdale medical center. The one Brooklyn health center system includes kingsborough jewish medical, Center, Brookdale Hospital and medical center and Interfaith hospital, as well as three nursing homes and at least 10 family care, centers or ambulatory care centers. So, in going back and looking at the last three years of pediatric inpatient utilization at brookdale, we saw that the utilization of that 30 bed unit has also significantly declined. We have at any given time eight to nine youngsters in the pediatric inpatient unit at brookdale, and the reason for the decline is principally a good news item. Many children do not need to be hospitalized, particularly in the last 10 years, more of many of the hospitalizations related to asthma and the success in treating asthma and having asthma action plans and educating families as to what to do to prevent asthma attacks has been successful and when a child needs to be in a hospital that child is very sick and often needs to be in a specialty children's hospital. So the utilization declines have not been a surprise and therefore we stepped back to look at what might we do in terms of better using resources? So essentially, we are proposing to consolidate the two units at brookdale I mentioned an average of two to three children in Interfaith and eight to nine, at brookdale and in consolidating we would have a census of 12. Even though brookdale has a 30 dead unit. That consolidation to brookdale was an important consideration, because brookdale also has a pediatric intensive care unit, so, as the needs of a child might be more in significant or more serious than what interfaith could provide. Brookdale has that capacity, and then a step down could occur in terms of the level of intensity of services to the child in a regular pediatric unit at brookdale. Since we commandeered the pediatric beds in early March and through the end of September, we have essentially had 26 or so youngsters present in a interface emergency room or emergency department. Two of those youngsters were transferred to brookdale and would have been transferred. Had we not not had inpatient pediatric services or had we continued to have the inpatient pediatric services operation, because those two youngsters needed psychiatric inpatient care and brookdale has a child and adolescent in a psychiatric unit about five of those youngsters were transferred to specialty children's hospital. Two maimonides that has a specialty children's hospital and to the Cohen hospital and 19 of those youngsters who came to the Interfaith emergency Department and who needed to be hospitalized were transferred without event to brookdale. As the youngsters are discharged, they are discharged back to their treating pediatrician, be that a pediatrician from the community or a pediatrician who works at Interfaith, Bishop, Walker, Health Center. I should add that the consolidation of the inpatient services does not mean that interfaith is closing or reducing our level of services on an outpatient basis. We still and will continue to provide primary care or outpatient pediatric care, pediatric specialty care on an outpatient basis. We have an extensive array of dental Services, Pediatric dental services and again we will continue to ensure that if a youngster is hospitalized at our sister facility, that youngster will be able to return and get their ongoing treatment at Interface Bishop Walker. Moreover, we have significant investment and we will be making a significant financial investment and a capital improvement in our emergency department, because one of the things that we have learned, we actually convened focus groups of consumers and others who have used whose family members have used. Our emergency department is that, right now the design of our ed does not separate children from the adult population, and so we've undertaken a design or redesign of our new ed. The renovations will begin in the middle of 2021, and in that new design we will have a discrete space for youngsters and their families, and that will include two bays or rooms so that if a youngster needs to be observed over an extended period of time, we will have that opportunity. As I mentioned in terms of the numbers of transfers that have occurred since March March. First, it's about three and a half transfers a month of youngsters. So having those two observation beds and this discrete space for children should enable us to provide the requisite triaging and and emergency and urgent care for children and their families at Interfaith. Emergency Department. I would also say that we are over the next two years are going to be doing a significant renovation at Bishop Walker, and that would include the total revamping of our outpatient pediatric services and so we're very much looking forward to that, and in that context we are continuing to provide exp our extensive sickle cell services from pediatric from the age from youngsters to adults. But we are very proud of our pediatric sickle cell program that occurs at Bishop. Walker, when often when a hospital or any healthcare organization changes its services, either through consolidation or closing or reducing, the question is asked as to what does that mean for the staff in this instance, with the exception of four part- time, pediatrician pediatricians, all the staff have been able to be deployed into positions at interfaith and in terms of the doctors, there were a total of nine doctors impacted by our change, they're, not full- time. Doctors, part-, timers and five of those pediatricians are going to continue to work for the one Brooklyn health system. They will be providing services at Bishop Walker or at the Brookdale hospital center, and importantly, two of the physicians will be providing services at our rutland nursing home, which is on the kingsborough campus, where we have a special needs unit. A pediatric special needs unit that is comprised of 25 beds for children, who are very fragile and vulnerable and in fact, have we've been able to bring youngsters back who've been placed out of state because of their needs in our creating this special needs. Pediatrics unit on the campus of Kingsborough and at our rutland nursing home, so I'm going to pause there because I do not want to be talking at you. I would very much appreciate any questions that you have for me and I know you have a really busy agenda, so I do not want to take up too much of your time. Thank you very much. Miss Brown. Do you have any printed materials we can post on the Community Board website? I can send you some materials about what we're doing. I certainly would be willing to do that and importantly, send you materials about our services at at Bishop Walker and at interfaith and brookdale will be and Kate Brook in terms of our outpatient service. Thank you very much. We'll look to post that material on our resources section of our website and I do not know sharonie perry may be on the phone, but I'll make sure that Sharani follows up and getting you that information. I so much appreciate it. Thank you so much I'll ask Ms George for the next item on the agenda good evening. Everyone. The next item is the budget okay, so we shall proceed with our budget review, we'll go item by item and I have to ask Miss George to guide us through that process. Okay, the statement that I sent you need to read the statement first to explain the budget process. Thank you. All right in response to tonight's budget request, keep in mind that starting in May and ending through the end and extending through the end of July, the district office sends mailings emails and surveys to residents requesting assistance in discovering what is needed in the community. Once the information is gathered, we submit our items to the community for review during a public hearing in September. It is at this public hearing that additional requests can be taken from the floor by those in attendance. Additionally, this public hearing serves the purpose of assisting the board and prioritizing what is submitted. We also rely on our committees to discuss what types of programs are needed in their general coverage areas. Therefore, our budget items are a compilation of what was submitted to the district office and what the office staff recognized is needed in the community based on questions and complaints fielded during the course of the year. We understand that different demographics need different things. That is why we reach out to the community for input. Excuse me: please shut that off, I'm sorry. So with that, we will proceed with the comments received, so we're only taking comments tonight or editions. Only comments on budget items additions to the budget items. That's all we're doing tonight any comments we emailed it out to the community to the board members. So we would like comment to what we're submitting or any additional items to be submitted. We've received a few via email, Miss George. Do you want us to recap anything that was emailed or is that sufficient yeah we're not we're not going through all the items we're not reading it tonight? Okay, thank you questions any additions as someone who's monitoring the chat and the Q&A. If you do have any questions or comments about the budget that was circulated, please acknowledge yourself in the chat in the Q&A when we in. We can then hear your point hi. This is Robert Callahan. I wanted to know if this is the last. If this is the final stage, this comments and additions process, because this is this- is the first time seeing a document like this and would be interested to know if we're midway through the process at the beginning of the process. End of process we're at the very beginning very beginning of the process: okay, Mr Callahan: this is fiscal 22. This would start in next July first, so it's always a half a year ahead. Over the past week, Ms George and I Ms Neil, we've sat in on budget updates from these various service agencies of the city, and they are asking that if you see a need to send a letter to the mayor asking to increase their budget, so one of the things I was able to put in for sanitation is to ask that the trucks have brooms and shovels to sweep up any bags that burst spillage from bags that burst as they are doing their regular service. So it's small things, but at the end of the day it all adds up. We have some other serious issues in the district that I hope will come out as we step through this process. So I hope people speak up, because this is a chance to bring these things forward. Miss Tyus I'd like to acknowledge Sarah Leiser, who has a question or comment hello. I was wondering if this would be an appropriate place to insert a request for the city to provide land use training for us. I do not know if that fits into this the scope of what's being done here or not. No, that's not a budget request item. Oh okay, thank you! Well, we are in the process of scheduling land use, training for community body work, you'll be getting information over the next week for city planning to come in and do a webinar during our regular meeting. Maybe not we'll have to agree on some dates to discuss zoning the basics on zoning, especially regarding M, Crown and we'll go into that more over the next couple of days and then we'll also be asking the borough president's land use director, Richard Barack to come in and talk about euler, hopefully, that'll be December or January, so we'll be having those things excellent, and I think my next question was just what Kathy Hislin put. Would it be open to everyone in the community or or just board members, because I know that I just know lots of people who are very interested in learning more about this it'll be posted on the community boards calendar awesome. Thank you. Any other recommendations, suggestions, additions to various agency budgets speak up now. My daughter always says the closed mouth does not get Fed Miss Tyus. If I'm very, I would encourage those if you have a chance to review that to please if you have not been able to review this, to do so and support our efforts and identifying our most premium needs. Oh, I do see a comment coming in, so let me acknowledge Mr Buckholz Mr Buckholz. Would you like to mention your comment, or should I just read it from the chat I'm happy to? Have you read it? I think that mostly a self- explanatory, I'm not sure that I have an exact, concrete proposal, but the merge and the way that the traffic at the merge of rogers in Bedford, especially as cars, are trying to get through the signal in Atlantic. I would be surprised that there have not been significant, killed or serious injury accidents at that merge, slash intersection, and I would think, regardless of anyone's feelings, about Motorists Pedestrian cyclists, it's really something that is badly in need of some study and improvement for calming okay. We can reach out to DOT and require and request a study. That's not a budget, a budget item either, but we can request a study of that area, so this is Robert Callahan again I can you explain what the extent the scope of what are we talking about tangible budget proposals for the capital and expense budgets like what is the scope of something that could be proposed because it does. Some of these seem to be like about three times the budget. I've been explaining right. No, I I'm sorry. I just happened to work for a budget oversight agency, and so this is I'm going to have a lot of questions about this that I'm happy to. If this is going to be a long process, I'm happy to take Offline and offer my services, but it the nature of the proposals seem to be. Some of them are pretty broad, and some of them are very specific proposals and just wanted to get a clear understanding. I just think it would be wise to take Mr Callahan up on his generous offer to blend his expertise offline after this meeting, so we can get this improve this process. So I think that's a great absolutely raising your hand. Thank you. Mister. I want to remind our attendees and our participants that these materials are available on the Towns City Council website, by community district and by category expense, budget and capital budget items for fiscal 22., also for fiscal 21, where we are now, and so please take a look at that. Ms Neil did send out our items about four weeks ago, maybe five weeks ago it sounds like people did not get a chance to look at that, but we will improve as we go forward. Hi it's Lisa Atkinson here, there's something that's still on the budget that I think is incorrect. Under services and programming related to educational facility programs, you have renovate or upgrade middle intermediate school Ms 584 located at 130, rochester, Avenue, Ms 584 no longer exists. The new school is Ms 898, the Brooklyn green school, so Lisa. Thank you for that budget request that began in another year and until all projects are complete, it's going to be known under that rubric. Although the Department of Education is fully aware of the name change and the number change Okay Miss Wetterburn, do you mind identifying yourself for the benefit of the crowd that was miss waterburn she's, a co- chair of the education committee? Yeah? Are there any other comments before on the request for the budget for fiscal 22 by agency type with any particulars hi? I have a question great well, more and more of a comment. Upd. All of these proposals are pretty good and current. I'm just curious about the dollar amounts as it as it corresponds to each knee, and you know if those muscles sort of decrease or increase. You know as we enter this sort of post Covid-19 type of society. If you will, I just because I see more issues, sort of taking precedence over others, but that's just a curiosity. What the agencies are asking us to do is as boots on the ground, so to speak. We see what's lacking in our community district, and the agencies are asking us to identify for them what services are lacking. So we need to point out to them what where the holes are, and they will put the dollar amount on it going forward right now we are in a revenue decrease mode, so most agencies, all agencies are operating on what we call peg projects to eliminate the gap and, frankly speaking, most agencies are being asked to furlough their employees for periods of time during this fiscal year and during this calendar year a day a month a day a week through December and so on, so we are facing dire times financially. As far as revenue goes, all the revenues are down everywhere, so we will be looking at pegs going forward right now we have to put a pin in the budget a note in the budget for these service agencies, every city agency that has a capital or expense budget, we're addressing both of them this evening to tell them what we need on the community district level. So that's what we're asking you to identify. Thank you very good. Thank you for clarity. Can we? What is the comment period that you're keeping this portion open for Tuesday the 13th? Thank you. Hi! Can I just ask in regards to the budget for policing and crime, it says: increase resources for youth crime prevention programs. Are we taking any proposals or funding requests from any non- profit organizations that can provide those services, because I know just by Broward Park this week there were two shootings and you know the issue is: what are we going to do about this? Get the guns out of these kids hands and give them productive things to do so. The funding? What specific way are we going to get organizations the money to provide these services to the community? Thank you for that inquiry. Mrs Henry. We are working on the city's budget for its agencies who city employees, city agencies. We have a avenue, through our elected officials in the council to use discretionary funds that are allotted to those council representatives based on the population in their districts and those discretionary contracts are up to the individual council members to award to not- for- profit agencies to provide the services that they feel are necessary. Mr George is asking me to remind all of you that the information on the budget is available in the chat for the entire budget document as this evening, and it's also available on the web. But if you look in the chat, you will see the link to the entire budget document Madam Chair. Could I raise an issue? As you probably know, the city suspended all curbside pickup of organics citywide because of the budget crisis, but just last week they reinstated 2.8 million dollars for pickup of drop- off sites, of which ahmadi garden is about to become one. This is only because of extraordinary pressure from the communities and the incredible interest in organics, and in fact, antonio reynolds, the chair of the sanitation committee, has introduced what we call the core act, which would create two drop- off sites in every one of the 59 community boards. It was not implemented because of lack of funding, but we in the Brooklyn, solid waste advisory board feel that drop- off sites are much more efficient than curbside pickups in terms of the efficiency of collecting materials, and we would raw strongly advocate that the community board try to reinstate in the budget money for at least two pickup sites in each community board be far less money than curbside pickup and be much more efficient in collecting organics. So I would like thank you. Thank you, Mr Todd. We would ask you to help identify which of the two pickup sites you would recommend for this community district and for a written statement from you to that effect, so that we can forward it to the department of sanitation. Thank you, you're welcome, Madam Chair. Can I make a statement and propose a motion? Yes, sir. So in response to tonight's budgets, requests and those that can be accepted up until Tuesday, keep in mind that starting in May and extending through the end of July, the district office sends mailings emails and surveys, residents requesting assistance and discovering what is needed in the community. Once the information is gathered, we submit our items to the community for review during this public hearing in this time of the year. It is at this public hearing that we ask for additional requests to be taken from the floor as we tried to do this evening and solicited. Additionally, these public hearings serves as a purpose of assisting the board and prioritizing what final decisions are submitted. We also rely on our committees to discuss what types of programs are needed in the general coverage areas. Therefore, our budget items are a compilation of what is submitted to the district office and what the office staff recognizes is needed in the community based on questions and complaints fielded throughout the course of the year. We understand these different demographics need different things, and that is why we continue to reach out for your community input, but at this time, I'd like to make a motion that the full board vote on the final submission of the budget document and give the district office the authority to use this information gathered at tonight's hearing and by email submission to prioritize the top 40 capital expenses, our top 40 capital items in the top 25 expense items. Thank you second, thank you. Thank you, Miss Wetterburn, Mr Witherwax. Will you please call the roll on the motion, so they had planned. Three people say something and then do not have to get the motion to like your comments can be heard. If there's something you'd like to say, you can chat all right before you start Mr. Witherex I'd also remind those that are not enabled to engage on the audio to also not. You can potentially acknowledge in the chat as well yeah. Please do use the chat function. If you can not heard we need to see either hear you or see you, preferably both. So again, I'm going to go through this alphabetically. I will say thank you. If I hear your vote, if I do not we'll come back, I'm sorry Mr wither. Would you please repeat what they? What the vote is? Yes, no abstain. After you say the name. Can you do that? Please sure! Thank you all right here we go Mr Allison, Andrews, Desmond, Atkins, Lisa Atkinson. Yes, the vote is yes. Thank you, Wayne Bailey, Princess, Ben, James, Julia, Void, Miss, Muhammad votes; yes, John Buckholz, yes, John Buckholz votes; yes, Robert Townham, yes, Mr, Callum, Yes, Hanji, Charles, Helen, Kohli, Nora Daniel! No, I did not hear you miss Daniel. Thank you! Miss Daniel, but yes, Mr Ellis votes. Yes, Mr Chat, Mr Allison voted yes in the chat, Mr Farley! Yes, thank you. Mr Farley votes, yes, Ms, Farris, Mr, Frazier, Mr Gabriel gives Miss Granville a mutant. Yes, thank you miss. Yes, I Jeannie Harris Blendman Mark. Yes, I'm sorry is that that's more. She vote. Yes, texting me who votes? Yes, ms, is that you mentioned Marva Henry. Yes, thank you. Miss Henry votes. Yes, Zuzima Jordan! I apologize yes for her. By way of text Miss Jordan Correct, thank you. Mr Curtin, Mr, Otis, Miss, Kinsey Laser. Yes, thank you. Miss Lasser, yes, Miss Lemayne! Yes, this is the main vote. Yes, Tony Mr Mickelsteins, I believe, is on the chat, fight shot. He votes. Yes, thank you. Mr Mickelstein, Mr Raji, yes, Mr, Roger, Vote, yes, Mr Sachs; yes, sorry, Mr Sax! I did not. Yes, thank you. Mr Sax Votes, yes, Mr saunders, yes, Mr saunders votes; yes, Miss, Captain, Staton, Miss, Superville, Miss, Tate, Hall, Mr, Thurton yeah. Thank you! Mr votes! Yes, Mr Todd, yes, Mr, Todd, voties! Yes, Mr is Yes Mr Verconi one moment myself here, Mr Bocconi. Do you want to vlog your vote? Yes, thank you. Yes, all right! Mr, Patricia, Mr, Villas, Miss, Watson, Mr Weatherspoon! Yes, thank you. Miss witherspoon votes. Yes, Miss Wetterburn! Yes, Miss wilder burn votes; yes, Mr William, Ots, Miss Young. Yes, the motion passes mister, that's my way of Chat Mr Robert Votes; yes, Mr Pooka votes! Yes, that means Mr. Puka is also present, and that brings us to 27 in favor no opposed, no abstentions. Thank you unanimous. Thank you. Mr Weatherwax and we'll now move on to the next item on our agenda. Miss George. Can you bring that forward for me, please, I do not have a printed agenda in front of me we're up to action items right now. The first action item is slack. Thank you, who's, presenting for state Liquor Authority. Today I had myself muted. I was asking. If you wanted me to proceed, I presumed from no comments. That was a yes, so let me proceed so the slack my name is James Ellison, the co- chair, I'm the chair of the Slac Sidewalk Cafe Review Committee, and we met on Monday, October 5th 2020 via Webex. This committee discussed these following applications. The following renewals were presented for Cheryl's at 236, underhill Avenue, for a full license. The renewal was presented for Essex Lounge at 1662, 1666 Atlantic Avenue for a full license and final renewal was for bar 704 at 704, Nostrada, Avenue, inclusive of a yard in live music and dancing for a full license. The committee voted to support these three renewal applications and hopes that the full board supports its recommendation at this time. I will be monitoring the chat or any raised hands or Q&A for any comments or questions regarding these renewal applications presented, giving another couple seconds for people to potentially type or unmute James. Are there any of the owners on this webex? Thank you. That's a very good question. Can I ask if there's any representatives from Cheryl's or a representative from Essex Lounge? What's their name, I need names. I do. I do not know. I do not recall. I'm Cheryl is Cheryl Smith. Oh, we have Miss Vogel and miss waverick from Brooklyn clay, but I believe theirs was a motion that was made in the what was it the August meeting that then was made it's an executive decision, so thank you for becoming Miss Vogel Miss waverick, oh okay, September, okay, bar 704 is here as well great. Are there any other questions or comments hearing or seeing none in the chat, the Q&A or through audible transmission? I asked for a motion from a member of the Community Board motion to recommend renewal of all of those liquor licenses. A second are there? Is there any questions for this motion being presented to support the following renewal items? Those following mentioned in that item. I believe that was young was that Miss Miyam Miss Mohammed. I believe it was miss muhammad. Yes, okay thanks my apologies, miss muhammad hearing or saying none. I asked the chair. If we can call the vote, please call the vote. Thank you. Mr Secretary I'll monitor his response in the chat. Thank you best to wait till I'm done with the whole role and then I'll ask if there are any votes in the chat. All right. Thank you! Mr. Without Linda Anders and Atkins Lisa Atkinson Vincent Vautius, Mr, Bailey, Miss, Ben, James, Miss, Boyd, Miss Branch. Yes, thank you. Miss Branch Muhammad about Mr Buckholz. Did you hear Miss Boyd? I did not. I do now. Thank you. Miss Boyd! Yes, Mr Buckholz! Yes, thank you. Mr Callahan Votes, yes, Miss, Charles, Miss, Coley, Miss, Dan, yeah, Miss, Daniel votes. Yes, thank you miss Daniel, yes, Mr, Ellis, yeah Farley! Yes, thank you. Mr Otis Miss, Farris, Mr, Fraser, Mr, Gabriel, Miss, gibbs, Miss Granville see Mrs Granville, but I do not hear a vote. Miss Harris there. You are. Thank you. Thank you votes. Yes, Miss Henry! Yes, thank you. Miss Henry votes, yes, Jordan, Miss, Kinsey, Miss Kinsey is on the phone. She said you can't hear her she's talking to me. She's just voted. Yes, thank you. Miss Jordan! Thank you Sir and friend Harris. So thank you. Did you get Miss Kinsey? I did okay, it's lancer. Yes, thank you. Miss Rocies, Miss lemain. Yes, thank you. Mr main votes. Yes, miss mahoney, Mr, steens, Mr, Puka, Mr Raji. Yes, thank you. What's? Yes, Mr Sachs? Yes, thank you. Mr thanks, Ots Mr saunders. Yes, thank you. Mr Saunders, Yes, Ms, Soko, Statement, Ms, Superville, Miss, Tate, Hall, Mr Thurton. Yes, Mr, Curtin votes. Yes, thank you! Mr Todd! Yes, I vote. Yes, thank you miss Tyus! Yes, thank you. Mr Villas, Miss, Watson, Miss Weathers. Yes, weatherspoon votes! Yes, thank you. Miss Wetterburn! Yes, Mrs! Wetterburn votes. Yes, thank you. Mr Witherwax votes. Yes, miss young! Yes, thank you! Miss young votes. Yes, the motion passes unanimously. Let's check the cat anybody in the chat- yes, Sir, I'd like to record Mr Allison Voting, yes, Mr buckholz voting, yes, Mr Mickelstein's voting, yes, Mr Puka voting. Yes, let's back up and include Ms Ben, James she's texting me rather than putting her vote in the chat. So I'm asking everyone who is having problems being heard to put their information in the chat, so we can share it during the meeting with everyone chat. Everyone for clarification, those that are dialing in can't engage in the chat function. Oh okay, Ms, Ben James has text she's texting me, so I do not understand that. But at any rate, can you give us the head the account the total account to find account messed up with saying she can't be heard and she's voted she's that she's asking me to let everyone know that she can't be heard she I have. This is not the time to discuss this, but I have a bit of a problem with that, because if I can't hear you or see you vote, how do I know it's? Actually you voting right for tonight for non- controversial issues, we'll roll with it, but let's keep that in mind for the future. If you can not be seen and heard you can not participate in this meeting legally. So let's keep that in mind and try to fix it. Okay, what we want people to know and anyone on the call who's receiving text messages on their phone and the caller is asking them to relay to the meeting what's happening. Then they need to try to dial in to the meeting and do it that way, rather than calling someone else and it missed. I think that is that's the best way to do it right. But what happens here? Okay hold on Miss Kinsey people are saying: well, I have Miss Kinsey. She said that she was on the call and she was talking and no one heard her. So how do you? How do we do that? She said she called in, but nobody could hear that she was there. She might do not want it. I'm sorry she might need to check her settings and she might need to manually unmute herself, because I believe one of the settings is to put people on mute when they enter the room. Okay, she's saying that she was unmuted, I know she's. I think I believe you're on your phone, correct, yeah she's on her cell phone. She said it was not muted. Now we're not talking about sorry we're not talking about the cell phone muting, but we're talking about the settings of the Webex platform that you might be using. Okay, I'm going to try to repeat that to her she's, saying she's, not she they're talking about the Webex portion of it that you should unmute Mr Ellis, Ms, Young, Mr Ellis. We can hear Miss Kinsey through John's phone. Thank you that's what I was going to say. Thank you all right, okay, so that is that is a workaround for this meeting and we will discuss how to fix this going forward. Okay, Miss I'm going to I'm going to put myself on mute and repeat what you just said to her so said for the next vote. She you I'll. Let put her voice up to the my computer. Okay, thank you, miss Tyus. If I may move on to the next action item, please do. Thank you all right. We were also presented a new application for Bk lobster at 643, vanderbilt Avenue, seeking a wine beer and cider license the details of the application are as followed with four tables and eight seats, but a maximum capacity of 28 under non- coveted specs hours of operation are presented as being closed on Monday Sunday from noon until 8 pm Tuesday through Thursday noon, to 10, P.M, Friday and Saturday noon to 11 P.M. No outdoor space was presented as a part of the formal application, but during Covid-19 they will be looking to take advantage of the curbside seating and offering takeout and delivery options. This is the third location for Bk Lobster and the second of which will have an on- premise license. The committee voted to support this application, as presented by a final vote of 12 in favor, zero opposed and zero abstentions, and hopes that the full board support its recommendation great at this time. If anybody has any questions or comments, please acknowledge yourself in the chat or, if easier to unmute yourself I'll. Give just another couple moments. Is the proprietor of this establishment joining us on the call today not sure that they are here or not? They can acknowledge themselves in the chat or via other methods, seeing or hearing no other indications of a question or comment about this new application presented I'll ask for a motion from our board. I move sorry. This is Sarah Lazar. I move that we accept the application, as stated and is recommended by the committee. Thank you that was a motion by Miss Lazar in a second by Mr Rashi. Are there any questions on the motion being presented? Seeing no indications of the question I'll. I ask the chair to call the vote secretary to call to call the roll on the boat. So here we go Mr in the chat, yes, Mr Atkins. Yes, thank Ms, Atkinson, Mr, Bailey, Miss, Ben James from some telecommunication. I'm sorry Mr Witherbox. If you could slow your pace a minute because it seems like it takes two seconds for it to cross the ether and to get a response, James Miss Boyd. Thank you. Did you eat Miss branch, my husband? Yes, thank you. Miss Paul and Miss branch. Muhammad you've bounced voting; yes, Mr Buckholtz, yes, Mr Buckholz, Mr Count; yes, thank you! Ms Charles, Miss Coley. Thank you. Mr Ellis, Mr, Charlie, Yes, Barley, Miss, Ferris, Mr, Frazier, Mr, Gabriel, Miss Granville. Thank you, Mr Miss, Harris, Blendman, Miss Henry, yes, Miss, Jordan, Miss, Kinsey, Miss Kenzie. Your turn say it again. Thank you! Miss Lazar! Yes, thank you! Sir Miss Lemaine! Yes, thank you. Yes, thank you. Mr Sachs, Mr saunders. Thank you. Mr saunders, Soco, Mr, Staton, Miss, Superville, Miss, Tate, Hall, Mr Thurton! Yes, thank you. Mr is todd. Yes, thank you. Miss Tyus! Yes, thank you. Mr Villas, Miss Watson, Miss Webb. Yes, thank you. Miss Whitaber, Mr Witherwax, yes, Miss young. Yes, all right! Anybody in the chat, yes, Mr, Weatherwax, I'd like to record Mr Poop votes. Yes, Mr, Carmona Allison voted. Yes, he was able to get in, but I think he might have got overpass, but he votes yes and Mr. Mickelstein's votes, yes said. Yes, thank you miss Harry! Thank you! Elaine Mahoney, Miss mahoney. She said she's stuck on Mute, Johnny yep. I see her in the chat now she sent it to me directly. Okay, a recorder, yes, in which case we have p9 in favor. No opponents, no upstate great. Thank you very much for those of you are not aware. The SLA and sidewalk Review Committee meets on mondays the first mondays of the month's review applications. I'd like to just take this moment and share with our community that there are many restaurants and beverage serving establishments that are trying to adapt in these new Covid-19 working prescriptions, and one of the things is just as a being a community effort there. If they, if you come acrosss any issues and operations, we ask that you know contact the Community Board office are trying to reach out and speak directly with the pr, the proprietors and the principals as they're all going through a learning experience and trying to be compliant with these rules and regulations that are being updated on a regular basis. We also, at the same time encourage you to try to frequent as many of our community businesses as this you feel comfortable and can and try to help them and move you through this trying times. Thank you for the opportunity to share that message and I hope to see you in one of our community meetings. Mr Ellis. May I please make a statement. Can I refer to the chicken oh Miss Chayas Miss, Hyatt yeah, I'm unmuting myself, I'd like to hear from the president of the Crown Heights North Association, who's sponsoring a special event in two days or no stream? Okay right! Yes, I just want to mention remind for those of you who are not where aware of the Crown Heights North Association is sponsoring a destination no string between Atlantic and eastern Parkway. There will be an opening ceremony starting at 12. The event is from 12 to 6. there'll be live music at three venues: no string social from 12 to two blue finn, two to four sweet Brooklyn. Four to six, and as I mentioned, there will be an opening ceremony from 12:30 to 1.. We ask everyone to please come out and support the merchants along Notion, Avenue Corridor and they will be offering some of the participants are offering a 10 percent discount if you are frequently if you visit their establishment. So please join us as we support the merchants on Nostra Avenue. Thank you Gail. Would you like to add anything that I forgot to mention in relation to Saturday? No, I think you've covered it. Okay, thank you. Thank you. Ms Young. Is this information available online anywhere? Now? Yes, there is a we did send it. I think it was sent to the Community board. I think it was distributed. Yes, okay, it's on our website and it was emailed out. Okay, thank you. Thank you. Ms young, so would miss. What's next on our agenda, Ms George Land Use, land juice. We have a new secretary for the land, Use Committee North Daniel and I've just emailed her the the report for the October first meeting that was prepared in the office, and I will ask her to read that and then we can entertain questions on. What's recorded there and then hear the motion that was made at the October 1st meeting Ms Daniel. Would you read your report? You can shorten it as you go if you want to emailed a moment. Oh basically, here is that on Thursday October 1st we had a presentation from a representative of the Hope Street Capital 959 Sterling Partnership, Tiffany Raspberry and her team regarding a proposed new building on the campus of the Hebron school at 920 park place. The building would be on sterling place between New, York and Brooklyn avenues. Are you ready, Daniel, so the committee on Thursday there was a presentation on we heard an application for certificate of appropriateness for 920 park place. The application excavation curb cut the site is the current Hebron sda bilingual school, formerly the methodist home for the agent. The application was presented by the Hebron congregation of Northeastern conference corporation of the seventh- day, Adventist Hope Street capital in 959 sterling partners. The following details were provided during the presentation. The decision to sell the portion of the property came as a result of requests from the church as the Hebron school is currently unable to operate in the building because of dilapidation and floors. Three through five are under a vacate order by the city of New York. The proceeds of the sale will allow the church to repair the building and bring students back into the building. Its proposed building is six stories and the scale is considered as of right. As far as current zoning laws and regulations of r6 zoning codes, 182 apartments of 30 of what 30 would be affordable, it will be a lead building, and here were the issues raised by concerned residents and Hebron parishioners. The line of sight of the school building is obstructed by the mass and scale of the new building, with full obstruction of the entire wing of the historic building, light blocked for adjacent neighbors and for the entirety of the block. There's a loss of oak green, open space which could create a heat island and exacerbate health conditions for children. The building as presented is institutional, looking and not becoming of the area and small apartments are not designed for long- term stay and growth in the community, but are designed for transients or short- term stays parishioners state that hope, Street Capital's presentation was misleading and confusing, as many Congress did not speak English and the presentation was entirely in English. It was reported that when the church voted, the younger English- speaking congregates were kicked out of the presentation and not allowed to participate in the vote. The affordable housing being generated will not be affordable to those that live in the community and not congregants of Hebron. The negative impact of the project is too great to ignore, along with Hebron being contacted numerous times prior to Hope Street capital, to get grants for school renovations and restoration of the property. I hope Street capital made statements of commitment that, despite the current economic uncertainty in the budgets for the state city and in the country that they are committed to the project, attendees referenced other commitments that led to unfinished developments that blighted the community for decades. Emotion was made and seconded for the committee to withhold support of the project as presented a committee member offered an amendment to the motion for the committee not to support the application unless developers had a setback at the fourth floor and starting place on the sterling place side of the building to reduce the mass and scale and allow it to better match the shorter row houses and for the developer to commit to affordable, New York option. A the amendment was not accepted by the original motion maker nor seconded. The committee voted to withhold support for the applications presented with a vote, a final vote of 14 in favor to oppose the Dr abstentions and hopes the full board will support its recommendation to not support Hebron project as presented. Thank you, Ms Daniel. Are there any questions? Mr Ellis on this item? Do you see any questions? I have seen known indications of any questions or any comments in the chat at this time. If you feel there's a chat, Mrt is just sent. Someone has a comment. Let me ingrid. Let me let me find her sure I have a statement. I have a request to make a statement from Miss Lindy on Pardon me for pronunciation issues: Ms Tyus. Would you I accept the request to make a statement community board, 8 members. I think she's saying that she can't unmute. I do not know if you can manually do that, but she also then says she would like to pass. The statement to fiore is fiore available to make this statement. Yes, I'm available. Ingrid has the first portion of the statement Ingrid Saraguard Madam chair. Would you like to hear from us ingrid? First you're on Mute, I must ask the statement makers to keep their statements to two minutes or less Miss Glenman Miss, Ingrid, Harris Blindman. Please carry I muted. You sorry, please hold on one. Second, I think I can help troubleshoot. It looks like you're on the phone and on the computer. Can you do one of those? That's what's clearly the echo? Oh, maybe I'm Sorry Miss Blemen, that audio is not of quality at this time. That's Miss! Sarah! Every time I try to mute her, I get the echo I can. I suggest we move on to the next speaker. Two minutes. Can you hear me? Yes, please identify yourself. My name is Fiora Ortiz Joiner. Please carry on I'm reading this on behalf of friends of 920, and this is our statement. Hope Street capitals project does not have a single redeeming quality in terms of housing. The small unit sizes, as well as the building's lack of amenities, make it clear that this development is catering to young short- term. Tenants who will not be looking to settle down and integrate into the community do not be fooled. There is no affordable housing in this development. At best, Hope Street capital will participate in the affordable, New York Housing program and offer 30 percent of apartments under this program, but the program's name is misleading by design. Only the upper middle class can afford apartments offered through affordable New York this year. Individuals who make a hundred thousand dollars a year qualified for affordable, New York apartments. Here in our neighborhood, the median income is around forty thousand dollars and that figure is even lower for black households. Therefore, we repeat, there is no affordable housing in this development. Lastly, we are deeply disturbed by the congregant's testimonials of the corrupt deal that has occurred between Hope Street Capital and the northeastern conference leadership. It's clear that our neighbors in the Hebron congregation are being deceived and lied to that is an outrage equally troubling is the northeastern conference's claim in the media that the local community has never offered them any help to restore Hebron's historic building. In fact, the opposite is true. For over 15 years, local community members, including members of the Crown Heights North Association, have offered to meet with the church's leadership in order to share grant opportunities that would fund the restoration of this building. The northeastern conference has consistently ignored these opportunities, but we are still here and we are still willing to help. In conclusion, we urge Community board 8 to vote against this project. This greedy developer shows no regard for community concerns, is willing to desecrate a landmark building for his own profit, has no real intention of offering affordable housing and makes corrupt backdoor deals behind the backs of her bronze members for the sake of our community. Please vote no on this atrocious project. Thank you. Thank you. Miss fiore, Mr Ellis. I think we have representatives from the project proponents in the audience. Do you see any questions for them in the chat? I see that Miss Lin Yee is supposed to read the other half of the statement. I'm asking okay in response to Ms, Viewer or Cheese's statement. Is there any response from the project sponsor? Yes, I would just like to say that we sent a letter to the Community board. Excuse me, Miss Raspberry, do you mind just identifying yourself in your role with this project? Yes, I'm so sorry, my name is Tiffany Raspberry and I'm the community outreach consultant for this project. Dr Daniel Honore, the president of the Northeast conference of seven day, adventist churches sent a statement dated October 7 yesterday to Community Board 8, addressing many of the issues that were raised in the previous statement. So I would just like to request if it has not been sent out already that everyone receive a copy of this statement if you'd like. I do not know if there's enough time, but I can read it into the record now, but if I do not have enough time, I think it would be great if everyone could receive a copy, because it directly addresses many of the concerns that were raised in the previous statement. Thank you, miss Raspberry. I believe that statement was distributed amongst the members of the land use or the land Use Committee. I will, in fairness, offer the ability to make your statement publicly here if you can keep it within the chairperson's request of two minutes I'll read through as much of it as I can. This letter, as I said, is from Dr Daniel Honore Dear Miss George in 2012. I began service as president of the Northeast conference of seven- day adventists, which is the ecclesiastical and corporate parent of nearly 200 congregations and 60,000 parishioners in New, York and New England. As part of its mission, the Northeast conference operates 15 parochial, elementary and secondary schools and a 100 acre campground and 270 senior citizen subsidized housing units. The North East conference supports member churches in acquiring and developing real estate. A few years ago, we received a request from the Hebron seventh- day adventist church, to assist in redeveloping the Hebron bilingual school in a manner to allow restoration of its premises. We retained Council conducted a zoning analysis and issued a request for proposals to qualify developers. We received five viable proposals. After reviewing these proposals, the church board voted to recommend the Hope Street Capital proposal to the church body for consideration. This board meeting was chaired by pastor John Philippe, then pastor of the Hebron church, pastor, Philippe invited me to make a presentation to the church explaining the details of the proposal on Saturday October, 14, 2017., being a patient descent. I prepared a multilingual powerpoint presentation in English, French and Haitian Creole. I was able to engage the young people in English and the older members in French or Creole. I responded to questions according to the language in which it were it was asked. That is why I was shocked to hear at the land use subcommittee that the older people did not understand what they were voting for because they do not speak English. I am still in possession of the original unedited multilingual presentation that I used for this meeting. The Hope Street proposal was the most attractive because it offered the most benefits to the church. These include 21.5 million dollars in cash to the Hebron church, a regulation size gymnasium for the Hebron school in the new building at Hope, Street's expense. The school never had a gymnasium a two- bedroom unit in the new building deeded to the Hebron church and 25 underground parking spaces for the benefit of the Hebron church in school. Following a healthy debate and a question and answer period, we posed the question as to whether the Hebron church should proceed with the sale of the point acre parcel of its land in exchange for the above reference benefits, the question was asked in both English and french. Those in favor were asked to stand after they were counted. They were asked to sit while those opposed were asked to stand. We're then asked to stand. I'm so sorry, two individuals were assigned with counting the votes. One was first elder, Emmanuel Toussaint, the other was pastor Japan Saint Louis, coordinator of the franco- haitian ministries, for the northeastern conference. Pastor, Saint Louis served as pastor of the Hebron church for six years prior to Pastor John Philippe and is widely respected by the congregation. As the votes revealed a majority in favor of the sale. Some of the opponents of the projects cried foul, claiming an inaccurate count to display any doubt. I called for a second vote. The final tally was 101 in favor 69 opposed at that point all understood and accepted the result, based on the vote of the congregation, the Northeast Corporation Executive Committee voted to authorize the sale, December 10 2017., our Constitution expressly forbids the corporation from selling any property without consent of the local church. Please, okay, I'll just go on to say that the pastor, the Northeast conference would also like to raise attention to the fact that there's believed to be funding from the charter school grants. For this it says the Hebron school is not a charter school and has no interest in seeking such status becoming a charter school would mean surrendering our religious foundations in order to qualify for public funding, we would not be allowed to engage in prayer or Bible study with our students. We seek the same rights as the yeshivas and catholic schools to educate our children according to our faith, and if anybody needs a copy of this letter, if you put in the chat your email address, I can send it to you so that you can review it yourself. If you have not received a copy, thank you. Thank you. I have a couple comments and requests for statements in the Chat Miss Tyus. If I continue, I look I'd like to acknowledge Miss. Is it Chi Osei? Are you able to connect with audio and make your statement? Hello? Yes, I'm sorry Mr, Ellis and Mr child say I want to clear up a misunderstanding before we go forward as Mr Ellis is assisting with letting us all be aware of questions that are being posed in the chat in order to keep order during this well attended meeting Ms raspberry. Your letter was not distributed to the land Use committee upon receipt because it went into Spam. I do not think there was advanced notice to the board office or to myself that the letter was coming so it is being distributed as we speak. It adds a lot of clarity. Do I want to say Clara, it adds another dimension to statements that were made by your clients previously. So that's very interesting as well. I do not know if this will lead to a request for a layover on this vote, because some of the things that you read out do not coincide to other statements that were made during the previous, the presentation at the October first meeting. But at this point the gist of the letter is there Mr Ellis is indicating that we are having questions come into the chat, so I will ask Mr Ellis to put those questions to the attendees. Thank you, Mr Ellis, Mr Ellis, and thank you, ms rasberry, for reading the letter and bringing it to our attention that it was there. I'm sorry it went into chat, but it is being distributed to the land Use Committee as we speak. Thank you. Thank you, miss Tyus. So let me just back up. I know why we acknowledge che Chayo say, but there is a direct question about the asking from Mr believe it's Miss Naomi Jb has the developer clarified, which affordable housing option they are selecting, or is there still no commitment? Ms Raspberry? Can you respond to that? Yes, we are still in such an early stage of this process that we have not responded to. My client has not decided on an affordable company level. Again. Thank you. Let me just add I'm sorry Mr Ellis. We did get a letter from Mr Siegel on Friday, which I just forwarded to earlier today to the land Use committee. That indicated the three different options that would be available. Thank you I'll now ask I'll bring back cha, Chi Osa again for pronunciation, no worries. Thank you. Everyone for letting me speak. I just want to, I guess, address the Community board and especially members that may have not attended October. So if I can interrupt real quick before you get into your statement, are you a resident of Cbh? Yes, okay! Thank you. I am a resident of cba for 12 years to any community board members that were not attended in attendance at the October first meeting regarding this development, the energy regarding the concern of community members was heavily against this development and for right reason, friends of 920 have garnered support from New York State Senate candidate Jabari Brisboard in the 21st district. Our soon to be Assemblywoman, Farah forest in our current assembly district was also against this development as well. Not only is this threshold of affordable housing in murky waters, as we've seen, developments do in the past in central Brooklyn, but this will also be taking away from a large plot of green space within our community. It will raise the temperatures within our community. It will pollute the air as well as well as add noise pollution, the entire community, or at least the majority of this community, especially as someone that has lived here for over a decade and has grown up in the neighborhood, is ferociously against this development. So we heavily urge the community board to vote no or vote against this development. Thank you. Thank you for your statement. I have a question. I have a series of technical questions being posed by Mr Rob Mandelbaum Miss Raspberry. If you're able to respond to these, we appreciate it says: can someone explain from Hebron explain the breakdown of the 21.6 million dollars? How much is cast cash compensation and how much of his in- kind rehabilitation? If you would like to start with those questions, I have a couple there's another set of follow- up to that. I do not have to that question morris, or are you able to shed some light on that question? I have a number of people joining me on this call if you'd like to direct it to the most appropriate respondee. That would be great hello. This is Maurice hatchery, I'm the architect for the new building, I'm not the architect for the restoration work at the Hebron school. However, the payment is being made to the school and they are committed to restoring the school and the church. Building. A very extensive survey was made, drawings were shown and the scope of work was also identified at the committee meeting great you. Can you speak directly to the question about the breakdown of the 21.6 million for cash versus in- kind Rehab? Well, I think Jeff Gershon, who is one of the principals at Hope Street, might be able to answer that better. It is my understanding that the compensation is being made and they are directing the funds on their own. I do not think that the developer has control of how they spend their money- okay and follow- up to that. Nor do I think that is typical or appropriate. Thank you for your response that, following up to that from the same gentleman, Mr Rob Mendelbaum asks how does sda intend to use the cash proceeds and how much of the cash proceeds will use expressly for this congregation and this location in school? Is there someone miss Raspberry that can respond to that question from sda or from northwest school? Well, we have some team members that are muted, so, if you could unmute Shaw dinor from Hope Street he can chime in is that possible? I will defer to the Community board, I'm working on it. Okay, thank you. I'm starting to get miss ties just to acknowledge that we're starting to get kind of some backup of questions, so I'm going to do my best to move through these and and as quickly as I can or as efficiently as I can sorry not quickly, Mr Ellis. Thank you for bringing that forward. I did portion the project components that this is not a second land use committee meeting. So at this point, given the rest of our agenda, I have to ask the project proponents to ask you Mr Ellis, to select two more questions for which we can get two more responses, and at that point I have to call for a motion on the item. Well, as we're waiting for any the technical response to the previous question, I will mention that in a there has been a comment made in the chat from Mr wither, wax that you can review about this location being a crown jewel of Brown heights. I want to look through. I see a question from Miss. I believe it's murphy considering there's concerns for the environmental health concerns of taking away sorry. It keeps scrolling back on me, so I have to apologize, taking a one of only two open green spaces in this area, and was this discussed with Hebron since they'll be greatly impacted as well? I will just can't recall that the presenters did not speak about this building being a leed certified Specs, I'm in construction and management, but I will continue to pose these questions. Thank you, Mr Ellis, I'm asking for two more questions and each one of them would have a response, and at that point I'm going to ask for a motion. Okay, okay. Well, I mean we're leaving a lot of comments and questions on the on the table. Miss Diaz. This is not a redo of the landing speeding. I understand, but we're asking for the full board to make a decision and make a vote. So I and they're not presenting to all of our members, have the opportunity to attend the various committee meetings or each it's a public meeting. Anyone can attend on the committee level and we could take two three four five six hours on the committee level to do the work of the committee. This is a full board meeting and I am limiting the comments and questions on this item for this meeting at this time. Thank you. Let me just make it. Let me just highlight a couple comments that I think are worthy repeating in this statement, but read by the board the committee secretary. It was stated that hold on sorry. I keep losing it because it keeps moving that this project was presented stated that the project would be as of right when this was not correct. This was clarified in the October 1st meeting. I think the as of right would be by standard Zoning regulations. I think that what is not as of right is that this is in a landmark district, and so all things must be reviewed and we were still waiting for Miss, Lin Yiwan and I believe, Miss Linuan, to make her statement was the board office able to unmute. I thought we were waiting to hear from Shea de Noir. Oh is Shea ready to speak Mr Dinor. Can you repeat the question? I'm sorry, the question was the diff the down between the of the 21 points. I believe that was oh, how does the sda intend to use the cash proceeds? How much of these proceeds will be used expressly for this congregation and this location? Well again, I am a member of Hope Street capital, not the sda, so I can't give you that answer and accuracy what we do know. I'm sorry is that the reputations themselves, that the crucial repairs necessary for the existing structure are well in excess of 10 million dollars, and we actually have a letter that I can send over to right now from the church stating that they intend to spend as much money as necessary to make the repairs and they're sure that the repairs are in absence of 10 million dollars, but it could obviously exceed that. So I can send you that letter for your record. If you want yes, please send it to Brooklyncba.Gmail.Com, and I will forward it out to all interested parties immediately. Okay, Ms Neil, make sure I'm sorry, Ms, Raspberry, Miss, Neil Miss Raspberry make sure that this raspberry's contact information is in your contact. So it does not go to Spam. Okay, the previous letter did not come from this raspberry. It came from a dawn dawn, something or other, and that was the first time. I believed that we had our office had gotten an email from her and that's what I went to Spam when I searched for Mr Honore's name. I did find it okay. Thank you all right, while we like just in response to Ms Tyus's, request to wrap this up, I'd like to ask the board office to unmute when you want, and while I do that, I just want to do some clarifications- that the concern for the deletion of green space was not directly responded to by Leed certification. It's still concerning that, there's actually going to be deletion of green space and these related health and environmental issues with deletion of green space, okay and then, at the same time. Oh sorry, this is morris addressing the architect, I'm happy to respond to that. If you'd like, please do Mr edge me and then I'm going to have Miss Len Yuan wrap us up with our final statement. First of all, two things one. I made it very clear at the committee meeting that this was as of right from a zoning point of view, and I did state that it had to go through LPC. So that's number one number two half of the building is on an existing parking lot and we are adding green to the overall project, both behind the building between the Hebron school and the new building, as well as on the roof and around the building. Thank you, hi. My name is Lindy Ryan and I am a the owner and resident at 989 sterling place, which is three doors down from the proposed development. I wanted to follow up to what fiore had spoken about earlier when she was speaking about affordable housing and friends of 920 park, for the record is a diverse intergenerational coalition of neighbors united in our firm opposition to hope, Street capitals, project at 9:20 park place to date. We have garnered widesp widespread support over 6,500 individuals in counting have signed our petition against this project, and we have received statements of support from local community groups and organizations, including the Crown Heights North Association, the Crown Heights Tenant Union, the Sterling Place Civic Association, the History Council and Crown Heights mutual aid. The project is a travesty, no matter which way you look at it and it must be stopped. Number one: the project goes against landmarks law, the partial demolition of the historic structure, its inappropriate scale and style, the obscured sight lines, the significant adverse impact on the old homes, visual entity and the character altering changes to the open space are all in direct violation of the city's environmental quality review guidelines for historic buildings. This is cultural erasure and it begs the question whose monuments does the city protect, whose history matters the proposed project will be the first building of such magnitude, built in our historic district, since it was given landmark structure status by the LPC less than 10 years ago, and would set a dangerous precedent for preservation standards in this new historic district number. Two, the project removes half a block of essential green space in a district that is already played by higher temperatures and unhealthy environmental conditions due to racist redlining, we are in a climate crisis. We can. How can we possibly continue to ignore devastating impacts of selling away open green space for private profit? The environmental impact of this development is not a footnote. Lives are at stake. Just as a footnote. I am actually pregnant with my second child and I understand that in these types of construction situations, there's a increase in asthma, environment, environmentally racist kind of affiliated asthma, so removing the little green space available in the majority. Black neighborhood is environmental racism and it is outrageous that Hope Street capital is not proposing a single green initiative to mitigate the environmental devastation there. Thank you for your time, James. I think you're muted still thank you for that, and thank you for your statement to follow up on the question about revenue, distribution. There's miriande demero is here and has offered to clarify that Miss Mr Mrs Demero. Can you please respond good evening? Everyone? I am a Hebron member. Can you hear me? Yes, ma'am? Okay, I am a Hebron member, so I have all the several hebrew members on the line with me. Also at the same time, thank you for giving me this time for clarifying the money distribution. According to the question that was asked before the money, as per the church leaders and also the naughtiest and conference leaders, they stated that money will be more than sufficient to fix the school, but only because they do not even know how much it's going to cost to fix the school, because they did not bring anybody up. No architect, no contractor to come and estimated how much it's going to cost to fix the school and not the school. The whole building, since after we sell this portion of the land, we're not going to have anything else to sell to fix anything in the building. So this is this is the problem because none of them have actually taken part. They were saying that they want to fix only two floors where the school is exact, currently existing. They only want to fix the two floors and then invest the rest of the money, and when you do that right now, what happened to the rest of buildings instead of selling that lens over here? Why do not we sell the portion that had the senior leaving assistant building? They can take that and then do whatever they want them to correct instead of selling the land right. Now we can do that, but they do not want to listen to the youth Mr. As the letter said, Mr Honore, they do not know what that's not a true statement, because we were there. We were kicked out because they do not want to answer our question truthfully, since we had the knowledge of the land the knowledge of what's going on, they do not want to answer our questions. Thank you for your comments. I'm looking and the only final comments that I'm seeing that are speaking in response to the green space they wanted to community members wanted to acknowledge. This was not a parking lot. It is actually a grassy area where cars are parked and that sorry, I'm giving is and that the green space that will be initiated in this development is tucked away between new and old buildings and will not be the benefit for those living around the area. That is the last of the comments that I believe need to be mentioned. I think they're miss ties according to our process, we usually ask for additional comments or questions from our board members. Would you like to tell us I was about to do that. You and I are twins mentally on this issue. Thank you. I want I'm asking now for comments from the community board members on this project. Thank you. I see Mr Viconius being wishing to be acknowledged, go ahead, Mr, Coney hi. I have one question for the for the Sta folks and then, and maybe a couple of comments. The question is this is so you know, we've heard a lot about who's, designing the new building and who's building the new building, but have you identified? Have you identified a contractor to do the restoration of the existing building? According to the plans that have been presented to the community board, it says: is this basically a project? That's ready to go once you. Assuming you closed this deal with Hope Street, nothing like that was done. This is Milan demero answering the question. Nothing like that! Never been never been done and that's what I'm saying they do not even know how much it's going to cost to fix the existing building. I'm sorry Ma'am. I think that might not be true. I think I think we heard before that there has been an estimate in my and I want to make sure that we're hearing from the project team here, including the sda, have, is there? Is there a contractor identified and is this a project that's ready to move forward? If you are able to close Morris and Tom, can you please answer that question? The answer is, I'm not sure if we have a contractor, this is Tom Lewis. I'm sorry for Morrison has been architects. I do not know if a contractor on board or not what I do know is that we've identified a scope in the drawing that were presented and last week show what that full scope is of what the relation is going to be, and you can see that if you're a look at the presentation from last week, okay- but I mean I all right- I let me say this- I wanna I'm going to make a couple of comments here, there's a lot of discussion here about affordable housing and there's a lot of discussion about environmental review. This is not an affordable housing project, though, and it's not an affordable housing review. The LPC will not consider the affordable housing component of this project when passing on its application for a certificate of appropriateness. All of the all of the community members who are speaking about this should understand that. Second, because the project from the zoning point of view is as of right, there is no environmental analysis necessary. So there there's really there's really no opportunity to argue that in the scope of a certificate of appropriateness application, so the community board could potentially take a position against this project, but if it, if it takes it, for those reasons we will not, the LPC will not consider that. Will we unlikely to consider that opinion and that and that advice, if we want the landmarks commissioners to consider what we, what outcome we'd like to see in this project, we will need to say what that outcome should be, and if we want to have some influence with the applicants, we should tell them what kind of outcome we want not expect that we can make this project go away by arguing that the affordable housing is too expensive, which I believe it is or that it'll have adverse environmental impacts, which I do not know if it will occur. I am concerned, though, that the proceeds from the sale to sda could be used for something other than remodeling the existing building and not remodeling, but restoring the existing building. I care about. I think that building is a beautiful building and I would like to see it salvaged and I would even like to see it salvaged as a function of a project like this that could be made more acceptable to the community, but I do not see that there is. I do not see that there is a solid there's, an absolute commitment to do that and have this project go forward and not have the existing building. Remodeled, I think, would be a would be a mistake. Having said that, the LPC is not going to consider that guidance either and I and I think we need to consider what would make this project acceptable. I just if for and I'm speaking to the Community board members now, if for no other reason than we've, given some guidance to the commissioners when they review this project that they at least will discuss in the meeting. For instance, I believe that the facade of sterling place is the most objectionable element of this project from a design point of view. It overwhelms the brownstones next to it and it could be mitigated by reducing the setback down to four stories rather than six, and I would be interested in hearing a commitment from the project team if they'd be willing to do that. It probably might I might favor a motion to withhold support conditions on the updating their plans. Are you project team? Are you willing? Would you be willing to make such a concession hi? This is Morris hatcher, the architect for the project. I think I stated at the at the committee meeting that we would certainly entertain a discussion about the design. Unfortunately, that was not where we ended up focus or where all the energy was focused. So I would say yes, we would be open to entertaining that and just to follow up a little bit on the issue about whether it's ready to go the school retained, caples Jefferson, who specialized in restoration, work to do an extensive analysis and a scope of work and based on that they obtained preliminary pricing. I was not privy to that. However, what I would say is that if this is approved or once we go forward, they would then do detailed drawings and then proceed to have that fully priced, but they have committed to doing both the structural work and the restoration work as identified in the scope of those drawings. Thank you both. Are there any other questions from land Use committee members? I have a statement, I'd like to say something: Sorry Miss Young, Miss Young. I need to stop you real, quick, because I had Mr Todd was looking to be acknowledged before I got your notice. So if you do not know no problem, Mr Todd yeah, I just wanted to say that I think that last comment by the architect helped clarify my questions. There was mention of a scope, but a scope is very tenuous, especially with historic properties that the cost could easily go way beyond what preliminary estimates and those of us who live in the community know that the top two floors have never been used by the school, and we wonder if in fact, they're, sincere and actually wanting to renovate the entire property, seeing that they're only using half of it would be a great tragedy if they only renovated part of the building and left the rest of it to decay. I mean, if they're, not using it, what interest have they in renovating it? That's just kind of a practical consideration: Sir Mr Todd. I just want to state that the school has would love to utilize their entire building, but they were unable to because of structural problems and department of building regulations. Currently, they are leasing space at another location to educate their students because they are interested in operating their school and as soon as the building meets the required standards for operation, they will move their school back in and they will utilize the entire facility, as well as the gymnasium that they are being deeded in this proposal. So would the developers or the school be offering some kind of assurance as in a bond or a financial, Mr Todd, I'm sorry, you were not able to attend the open meeting for the land, Use Committee to ask these questions. The land use committee meetings are advertised on the board's calendar. So at this point I would ask if we need to bring this back to land use so that these questions can be explored. What day you committee members hold up. Well, it's we're at the board, but I miss Young was next in the queue for for a comment. I understand that Mr Ellis and what I'm seeing and hearing is of a raft, a multitude of really meaningful questions and really relevatory answers that tell me we did not do a good job at on October 1st and possibly we need to ask to lay this over and ask them to come back in November. I do not know well, as the chair, you certainly have that privilege. So at this point I do not want to ask for a motion to lay over. If the committee members think we should move forward, I would make that motion the as the applicant we'd actually like to move forward. We we've we just do not see. We would really like to move forward in the process tonight. Jay Siegel who's. Our attorney is on the line. If you can unmute his microphone, he can speak about that. I understand that, but it's not his decision. Okay- and at this point I need to hear from the full board as to whether or not they think this is something that's ripe for a full board vote or is to go back to committee, because we're getting all of these really deep questions and elevatory answers. Cables, Jefferson's handling the pricing whenever Ronaldo Jefferson is a commissioner on the LPC. That's absolutely interesting, so I do not know I'm just asking the full board members the appointed members to weigh in on that. I would make a motion to. Can we just have a little I mean we can make emotions to have a discussion. This is Sharon whatever, but I would have to support chair ties in saying that this this meeting is evidence that there was not a the vetting that we had in the land. Use Committee was insufficient to answer the needs of both the full board and the committee, and although I've heard Miss Rasberry expressed that she has no desire to do so, I would say that she could take the temperature in the room and if she were to receive a no vote on behalf of her. On behalf of her clients, it would yield to a result that would be not desirable to neither the community board or to the applicant. I would like to remind the board members that their calendar Ms Tyus. I would just like to remind the board that the lbc hearing scheduled for October 20th, so laying it over to December will not delay the LPC hearing on October, 20th and also LPC has been historically loath to postpone hearings that have been scheduled when the applicant has already met with the board. I we have a raft of unanswered questions at this point. We're dealing with agency practice the LPC, if I remember correctly, LPC, set that meeting back in the summer. I can not make this decision on my own, so I asked promotion from the floor on this item. While I would love to table it, I think we've lost that opportunity if it's already been calendared at LPC, so I think we're disposing tonight. I would like to weigh in I think that if we are moving forward with the LPC hearing on 10:20 and that can not be changed, then I think that a motion needs to be made on this item this evening. I would not want us to be in a position to it go forward without the board having and some input. I also wanted to say something earlier and I'd like to use this opportunity and it some of it addresses some statements that was made by Mr Bocconi, and I want to assure you that those who have spoken this evening are quite well aware of what comes under the preview purview, I'm sorry of LPC. However, they we wanted to make sure that all of our concerns were heard, including the lack of affordable housing for this community, in addition to the issues that directly impact this historic district. So please I do not want anyone to assume that we're not knowledgeable about what has to go forward before LPC. Thank you last thing. I am prepared to make a motion as well. Thank you, Ms Young, okay, I'm not seeing. I do not know if Mr Ellis is seeing things in the chat that tilt one way or the other of as far as attempting to dispose of this evening. No there's no there's been no other indications of other outstanding questions, but if let me add to Miss Young's statement that if we are to make a motion- and if that motion were not were to echo that of the committee- then I think that any motion made tonight should have a few items of substantive concerns with the actual structure, design, massing and volume of this building. Obviously, there are concerns for lack of green space concerns for affordability, concerns for the stylistic implementation of that building being smaller apartments for single people. But the point that Mr Verconi made before he had to leave was that LPC is looking at aesthetics, massing and volumes in conjunction with the character of the neighborhood. So if we are not, if there is a motion to be made, that's not going to support this, then we need to have some items to indicate within that vein and with along those lines of why it is that this motion is not being supported at this time. I completely agree with you Mr Ellis, and I just want to make sure that we understand that the tide is turning in the favor of community and, as a matter of fact, New York Law School was having a a webinar coming up on the marriage between government and community, and I'm seeing also legislation at the council level indicating that they are very interested in the marriage between urban design and community health. So those issues will be coming forward. They will be knitted into the considerations of LPC on the historic preservation level, so that we should be mindful that we can influence decisions by agencies like city planning and the Landmarks Preservation Commission in our favor as a community. So with that said, I am not so sure that if we decided to lay it over that we could not get LPC to change the date, but again I'm only one person in this community board and I'm asking now for a motion on this item. Whichever way it goes considering all the things that we know about it now and all the things that we think we know- and it seems the things that we do not know. So I I'm asking for a motion on the item. Okay, I know Miss Mohammed Mitsubi was about to make a motion, but just procedurally chair tires we can take a position tonight and then still kick it off another month or two for LPC and give the applicant an opportunity to come back and argue against or for whatever position we took. They can both happen, but I think we need to dispose of this tonight. Okay, could you repeat that please Mr weatherwax, I'm sorry. I missed with the essence of what you were proposing, but I was saying that I think you should make your motion and I think we should just take a mission on the project tonight. Whatever that may be, we can still work with the applicant and LPC to move the date off and do another deeper dive at the committee level, but I think we need to take a position tonight. Okay, all righty, with that. I want to make a motion, but I want to say that there are a number of elements as to that. Based on my motion, I do not want to take the opportunity the time to read all of those points, because it was it's somewhat lengthy. What I would like to know make note for the record. Is that sorry, I'm sorry Ms young? If you have a statement in support of your motion, I ask you to read it in its entirety. Oh, my goodness: gracious, okay, all righty! Well before I make my motion, I also want to share with the full committee that Crown Heights North Association submitted a lengthy letter about his position, as did not friends of 9:20, which outlays numerous reasons why this project should be posed opposed. However, my motion, I move that the committee withhold support for the new building proposed for the campus of Hebron school at 9:20 park place. A number of my motion is based on some of the following reasons. The proposed plan will negatively affect the architectural integrity of the Hebron site. The proposed plan completely competes with, rather than being deferential to the existing lebron building and scale bulk and its materials. Hebron is the gem of Crown Heights North. It is an intact Picturesque, romanesque, Revival, Gothic, institutional building and the only building of its kind remaining in central Brooklyn. The erasure of the open space surrounding the Hebron buildings will obscure the legibility of the landmarks historical identity. As an institutional structure, the project will be a substantial adverse impact on our architectural resource of the crown Heights North historic district that will result in the isolation of the property from or alteration of its settings or visual relationships with the streetscape. This includes changes to the resource visual prominence, so that is no longer conforms to the streetscape in terms of height footprint or setback. It no longer part will no longer be a part of an open setting or can no longer be seen as a part of a significant view. Corridor. The proposed plan is an urbanistic departure from established tenants of the neighborhood, including breaking the street wall, and its scale is incongruent with the streetscape of the three and four- story: row: houses on sterling place between New York and Brooklyn Avenue. Thank you, miss Young. Thank you. Miss Young. I believe I believe your motion is to the full board and I'm asking now, if there's a second for Miss Young promotion Second. Is that you, ms lasser? It is thank you very much so Miss Young, I would ask your motion is on the floor. I want to get any other comments on that and I have to ask you to please either put your statement in the chat and or send it by email to the board office with a copy to me and then now we will explore any take any questions and have a discussion on your motion to withhold support and then we'll ask for a vote from Mr Witherwax's role, any questions or comments or an emotion, nothing indicated at this time. Mr Witherwax. Can you please call the roll on this motion to withhold support who seconded that motion please miss Lazar. Thank you. Miss Lazar beat me to the punch by five milliseconds Mr Witherwax. I have to ask you to do what channel two does on their morning. News give a 20-second pause as you wait for responses on your roll call. 20-Second pause with 50 members I'll see what I can do. Thank you Mr Allison. Yes, thank you. Mr Allison, Miss, Andrews, Mr, Atkins, Miss, Atkinson, I'm sorry Mr with Wax. I want to make sure that people understand that the language is switched if you're voting, yes to withhold, support, you're voting. No. On the project, that's correct: the motion on the floor is to oppose the project for the reasons outlined in Miss Young's, excellent presentation, which was succinct and was to the heart of the aesthetic matter that LPC deals with and does not delve into the other side topic. If you vote. Yes, you support Miss Young's position consent. Yes, thank you. Miss Atkinson, Mr, Bailey, Miss, Ben, James, Miss Boyd. Yes, thank you, Mr buckholz! Yes, thank you. Miss Paul, no Miss Boyd is dead yet and Mr Buckhold says no. Thank you. Thank you. Mr Buckholz Mr Callahan. Yes, thank you. Mr Callahan, Mr, Charles, Miss, Coley, Miss Daniel. Thank you. Miss Daniel, Mr Ellis. Yes, thank you. Mr Alice, Mr Farley. Yes, thank you. Mr Farland, Miss, Ferris, Mr, Frazier, Mr, Gabriel, Miss, gibbs, Miss Granville; yes, thank you. Ms Granville, Miss, Harris, Blendman, Miss Henry. Yes, thank you. Miss Henry, Miss Jordan. All right, I was that Miss Blendman or Miss Harris that just voted. Yes, sorry. I believe that was anyway. Okay, thank you. Yes, miss Jordan response by way of Texas. Thank you, Mr Thurton, Miss Kinsey. Thank you. Thank you. Okay. He heard you miss mahoney, be voting by chat shortly. Mr mickelsteins, he voted. Yes, thank you, Mr Puka. He voted yes and chat. Thank you. Mr Rajeev Mr Sax. Yes, thank you. Mr sacks, Mr saunders! Yes, thank you. Mr Saunders, Miss, Soko, Mr, Stanton, Miss Superville is Tate Hall Mr Thurton. Yes, thank you. Mr Thurton, Mr Todd. Yes, thank you. Mr Todd, Ms Tyus. Yes, thank you. Miss Tyus, Mr, Oconee, Mr, Villas, Miss Watson, I'm not hearing, I'm not hearing the responses. I know the Connie's on the line. What did he do? Mr, you're, hearing everything? Okay, yes, thank you! Miss Weatherspoon, Miss, Wetterburn, Mr, Witherwax, Miss Young. Oh, yes, I'm sorry! Thank you mission. Did I hear Miss Wetterburn. I have a couple more to record Miss mahoney votes. Yes, Paris votes. Yes, thank you, Mr Ellis. Thank you right. The motion passes 27 in favor to opposed how many opposed two okay thanks any abstentions, nope. Thank you very much. Mr Witherwax. I have an update. Miss Muriel Lemain wants to vote. Yes, 28., okay, so at this at this point we have foreclosed our opportunity to have any further engagement with the project sponsors on this level and would look at working with them as we move towards the October 20th LPC hearing. I thank Ms Rasberry and her team for joining us at this meeting this evening. I do not know if we have representatives from our elected officials in the audience who wish to speak to this project, but if there are, I would ask you to put your name in the chat and your representation and come forward and speak to this issue or other issues concerning CB8 at this time. Miss George. Do we have seeing none any representatives from our elected officials in the audience, then I would ask Miss George if we have other agenda items we need to attend to before we close the meeting. We have committee reports, elected official, reps, hello, I'm here, okay and we have with us, you can choose the chat function to be managed. Is that it we're going to go into our committees. We have economic development. Thank you. So we have our committee reports and then we'll do the elected representatives- okay, yes, Ms, George, yes, who's! Next up for the committee reports, economic development, brian, you want to give just a brief update. Yes good evening, everyone. Thank you for your time, a little while and we're looking to get back started. Our first meeting will be November the 10th. I believe I'm looking for a few some members to get involved if you're interested in the Economic Development Committee, please contact Michelle George, and I look forward to working with anyone who wants to participate. Thank you, youth in education, Miss Waterburn good evening. I had difficulty unmuting myself, youth and Education Committee met last Tuesday and the most important quarterly decision we made is that we will not meet in the month of November in honor of the late great Quasi- Menza who, when he was vice chair of and opposed to us meeting on election day. So with that being said, we've had the request. The reopening of schools, remote and hybrid learning, there's some challenges with schools in our districts. One school ps9 in regards to incomplete construction was halted because of budget issues and that project will be completed according to a representative from majority leader, Combo's office, Arnold Lipkin, that's one item two: we have another outdoor learning site at ps705, which is located in the Ps22 building, which is classen Avenue in Bergen, as well as Ps 316 will be utilizing the park, their exclusive use of the park for outdoor learning activities in this time of Covid-19 and us being adjacent to several hot button issues or hot zones. I would just want to remind everyone to practice social justice wearing their masks and and making sure that you're doing everything that you can do so that we won't have the continued spread and expansion of a lockdown within our district be kind to children, be kind to parents who are becoming teachers in a role that they had never anticipated prior to March 2020 and be kind to crossing guards because they are on their posts and, as with many people in the community, they're the first to be aware of news aside from our school's public safety officers. So with that being said, the next meeting of the committee will be the in December. Do you have a date or if I can see a calendar, but it is the second Tuesday in December? Yes, thank you. December, 8th, December 8th, is the second Thursday. Thank you, miss George who's. The next committee to report thank you, Mrs T, environment, sanitation and transportation. Good evening, everybody very briefly. We will be meeting virtually on the 27th of October to sort of discuss a wrap up of the liverpool streets project going on in our district all summer, and we welcome those who want to discuss sanitation, environmental and transportation issues, some of which have been already percolated here tonight in the chat and elsewhere, and the budget discussions come out, join the committee and we'll try to get it on for for next year. Thanks very much. Thank you Mr Witherwax! We did have some back and forth on the 5 g hardware that do it is allowing vendors to install especially along. I think it's the corner of Easton Parkway and New York Avenue. I hope that will be on the agenda. Thank you, who's. The next committee to report housing- can you hear me now? We can okay good evening. I just want to let you all know that we will be having our first virtual meeting this coming, Wednesday October 14th and we will start at six o'clock. I look forward to working with everyone and I understand that we have a group that will be coming that is concerned about security in buildings within New York City. I do not remember the name of the organization, but I believe they will be coming to speak to us about their concerns about safety and security. I urge anyone who is concerned about anything that has to do with tenants and tenants rights to please come out to give us your voice and give us your feelings and give us your input, and we could definitely use some new fresh blood. So I look forward to seeing you this Wednesday. Thank you. Who's next parks is not that Parks Committee Public Safety, hey good day mark Thurton. We had our first public safety meeting on Monday September, the 28th. It was pretty good. We had about 10 members come in, and I want to thank the new memberships to that participated for what's going on for our NCOS, we're not going to have our NCOS meeting as of yet we're waiting for the 77th and 78th precinct to advertise when they're going to have the NCO meetings and once that's established, we'll be sending out the information and our next meeting will be on October Monday October, the 20th at six[, _, _], we'll send out information and everyone is, is involved to participate. Thank you Adam chair. If I may ask a direct comment or question to Mr Thurton, the chair of this public safety committee of Course Mr Thurton, I am in my portion of the ward 8 district. Our local buildings are having a really increased spec of package theft from our lobbies, from our doorsteps and from just General Mis management of these packages being delivered. I'm wondering if there's any engagement happening with the local precincts to address this increase in package thefts within the Community Board of eight districts. In fact that police officer vidal did speak on the on the packages and they did mention. If they could be delivered to a to one of the storage locations, but what I can do I mean they can participate on the call and he can give much more details on what steps can be done to prevent them and also, if there's, a specific building, that's of concern. What can be done is that they can visit the location and give recommendations that can that can improve on the safety of delivery of packages. So if anyone have a specific building or specific area that can be addressed, you can send it over to Community Board and we'll touch base with the 77th or this or the 78 priesthood, and see how they can address it, specifically with the residents of the building, if needed anything else, Miss Dallas. Thank you. Okay, it's george who's. Next, have my agenda in front of me. Next is seniors. Thank you all right. Good evening this is Gail Mohamed Chair of the senior Committee the senior committee met last night. We meet the first Wednesday of every month. We had. We have Daryl white from the attorney general's office. Did a presentation last night was very informative. I got feedback from seniors today that they did enjoy the presentations and that they did learn things. I've requested him to send out pamphlets because they wanted to have some of the material to be able to share with their neighbors. Last week, Diane Richardson sent food. I delivered boxes of fruit, Vet Fruit, fresh fruit and vegetables to the site, and I have committed to do that at least once a month. I've also received a call from Congress member Yvette, Clark's office and they're interested in providing supplies to the seniors. Also one of the issues that we found out last night that the seniors, although the calls are working the telephone conference working, it would be very nice if they had tablets. So they gave out air conditioners in the summer, we're not looking for heaters for the winter, but we would like to get some tablets for the seniors so that they do not feel so isolated and especially for the winter months, when they're not able to get out and around as much so. Thank you and we look forward to you coming out on November 4th we're hoping that we'll have some good trouble by the time November 4th comes around, so we look forward to you coming or calling in. Thank you thank you who's going to for the senior committee. I do not know how to help with this scale, but if there's any way that I could be of help with helping the seniors get their votes in I'd, be willing to help with that. I'm concerned about the handicapped and the elderly making sure their vote, their vote gets counted, gets registered, gets where it needs to go. So if anything comes up with any seniors that you know need some help, I'd be willing to help with that. We did go over that. Last night we went over the ballots, the mailing procedures, the early voting, however 230 Kingston Avenue is a polling site, so most of them vote in the building. So it was not an issue, but we did go over that and explain it to them good, but thank you, okay. Thank you all thank you. Both miss George who's, next of any elected officials, elected official reps or comment bylaws committed. I also have a message from the health committee sent on text go first James sure so from Miss mahoney of the health committee. She says she really liked to report. The health committee would like to begin meetings in the next two weeks, we'll be setting our priorities and plan for the 2021 year. We will be distributing a doodle poll soon to assess interest in optimal meeting times for everyone to join us. Thank you. Excellent bylaws is next. Thank you Mr Witherwax. Well, I will keep this to two minutes. So as we as we went over on the September meeting, we have made some adjustments to the bylaws there's about 12 small changes which can't be able to do 12 small changes. I want to thank Miss Irisa Weatherspoon, Michelle, Peterburn Mr, listen to Johnny Granville, along with myself, Mr, Michael Church and, of course, our esteemed Chair Miss Ethel Tyus worked over the summer to identify these problems and come up with good solutions for them. So our protocol is, we have to read them into the record in October and November and then vote on them in December, so you're going to have it memorized by the time we come around for December. But let me read the changes into the record briefly, and this was all circulated to you. If you did not get it. Please reach out to the board office file those updates membership. There are three changes default language defining leaves of absence from board service notice requirements for excuses from a given meeting. If you can't make it have the good grace to call in and say, I can't make it and shorten notice requirements for removal proceedings, we're taking it from a 30-day 21-day window elections. Two small changes we're putting what I'm calling an escape clause in the event we can not meet in person that will permit the Nominating committee and the district managers to set alternate rules for elections, because right now we're kind of locked into an in- person signed ballot and we're saying no need to elect officers to fill the vacancies. The chair can appoint and the offer the remaining officers of the board can approve third category officers. Three small changes, we're defining the chair as another, the board as a non- voting member of all committees, we're establishing an emeritus status for a retiring board chair who has served at least two terms will carry that title for the next board year and we're giving more specific definitions of duty to the vice chairs, the secretary and the sergeant- at- arms. Fourth, category: three small changes committees vice chairs will be chosen by the board chair in consultation with the committee chair. Currently, the board chair just says who the vice chairs are we're defining the way committees must meet at least four times in a given board year. Right now, it says quarterly and that language is wrong and we're shrinking. Our executive committee will be only comprised of officers and the chairs of the committees. Only currently, the vice chair sit on the executive committee now we're removing that function to make the executive committee smaller fifth category. Last category three small changes: miscellaneous we're defining the district managers and personnel authority. We're saying that any changes we make to these bylaws will be incorporated automatically into the bylaws of friends of community board, eight, our non- profit arm and we're defining we're clarifying the definition of a term and a year a term is the member's two or an officer's two- year term of office a board year runs from September one to the end of August, and we wanted to make sure that there was no cross- confusion between those two. Those are the changes, you've all gotten the documents, so you can actually read both how it currently reads how we propose it to read and the comparison between the two and I'll do this again in November and we'll vote in December. Thank you very much that was great Mrs Mister with Wax. Thank you very much, Miss George. What's next elected officials, elected official reps at this point, I've only identified Mr Orlando Ross from Congresswoman events. Clark's office was in attendance, Mr Ross. Please proceed hello. Everyone greetings from congresswoman of that Clark's office wanted to give you guys. Greetings wanted to remind everyone that the census is still going on according to the HTC map. If you look on the side, I was able to give you the heart to count map as pertaining to the census, and it seems that Crown Heights area, one in your zip code, you're doing a little bit better by six point. Seven percent, but you still have a lot to go. October 31st is the last day everyone I want to make sure that everyone knows that early voting is going to be taking place. I'm pretty sure everyone knows about that, but the key thing is that our office was sending out information about absentee ballots. I know that people were having issues with their absentee ballots being incorrect. We want to let you know that I believe October 9th is going to be the final day that you can apply for it. If you have any questions on trying to find a better way or trying to rectify that issue, with your absentee ballot feel free to email me or contact me and I'll, send you our information. The last thing I want to talk about also is about some legislation. That's coming through. Everyone knows about the Heroes Act and the Covid-19 relief act. As you know, the Heroes Act was recently updated for 2.2 trillion dollars. It will provide 436 billion in much needed support for state and local governments, as you know that we're having an issue with a deficit with the city, and we want to make sure that everyone is funded, but that would have to mean that the Senate would have to vote on it, but it has been passed by the house. We have a few things regarding the George Floyd Act, which is police, which is dealing with racial issues that are going on with the NYPD. All of the information. All the different bills have been posted in. Your chat group feel free to go through that, and I do not want to take too much of your time, because we've been on for a long period of time, just want to say that it's a pleasure to be back and if you need anything, feel free to reach out to me my name is Orlando Ross. I work with Congresswoman Evan Clark. Thank you Mr. Can you please put your email address in the chat so that people can get in touch with you, as you indicated. Thank you if I may I'll call and send to Speaker. Yes Mr Ellis good afternoon, everyone. My name is Kim Robinson and I represent council member Alika and Pr Samuel's office on behalf of the council member, I bring greetings. I Mr Ross basically said it all. You know really want to stress the sensors, the sensors, the sensors and also stress you know, with kovac that first to maintain safety, wear masks where Mass is very important. Our office is closed. However, we are there remotely. So if anyone has any questions, concern issue, you can either email I'll put my information in the chat. My email is Kay Robinson at Council.Nyc.Gov telephone number. Direct cell number is 646-, 574-, 7661 and I'll put that information in the chat and again the censors, get out and want to vote to encourage someone if you're someone mentioned that they'll be willing to take somebody to the point. We encourage that to everyone. If you know someone assist help, you know cars whatever you need to do. Definitely we want to make sure that everyone gets out the boat and again I want to stress the importance of being safe and wearing a mess on behalf of the council member everyone had it be Bc. Thank you. Thank you, Mr Robinson. Finally, I have identified Mr from the Senators Eleanor Myrie's office. Mr Baialama. Are you available he's not muted Godfrey? He was having problems with audio and video early hi. Can you hear me yes, Sir hi good evening? Everyone God forbid here on behalf of Senator Myrie, bring greetings on his behalf. Our office is actually open, but just for appointments. So if you have a pressing issue that needs to be addressed, please reach out to our office. Our phone number is 718- 284- 4700, and we can be able to help you if you set up an appointment, I'm not going to repeat what Orlando and Kim have just mentioned up regarding the census and regarding voting. The last state director to vote is tomorrow. So if you have not done so, please do so. That's it. For us, thank you so much and have a good night. Thank you, Mr Balalama, that is all I have been notified. As representatives from our elected officials, I now defer back to the board chair any old business. Oh any old business. Yes, we have old business that affects all of Us city planning has been asking and asking and asking for recommendations on rezoning the area that Mr Viconi was very instrumental in naming M Crown and we're going to try that again we have a plan for gathering that information and moving forward. We want to look at the population and demographics, the urban design and mapping how to do the massing and capital planning for the neighborhood result. We want to start that at our next land Use committee meeting, which is always the first Thursday, so we will be also asking city planning to do a presentation on zoning, about 20 minutes and they're prepared to answer questions from you as community board members. It does not have to be a land use committee meeting we can set another date now work with Ms George to identify a date they're willing to do that. So if you have questions about zoning as it relates to our district in particular, M crown, please submit them to me and the Community Board office. You have my email address, I'm sure, if not I'll put it in the chat and we will gradually approach this Mr barack. The land use director for the Brooklyn borough president is willing to do a follow- up webinar on euler, so that when we meet as a committee, we understand what those processes and constructs are, and we can ask the correct questions. Informative questions to applicants who come before us, because we will see development in improm. We will see a lot of development in Weeksville, in addition to crown Heights, North. Okay, so we'll discuss this more we'll be publishing opportunities for dates. Work with the I work with Mr, George and Ms Neil. Maybe we'll do a survey to identify dates when we can get DCP department of city planning to start the educational outreach and to do the seminar and if we want questions so submit questions in about what you want to know about zoning as it pertains to our community district in particular improm. So that's number one and we'll go along with this process as we move through the fall and into the winter. That's it for that. What else do we have on our agenda? Miss, George, Mr Ellis. You want to read the comment from we have a. We have an item from other business that wants to be read from Kathleen Island of the North Prospect Heights Association Island. Please proceed two minutes. Is she there wait away? She might have to be muted by the board offices. I'm muted. Well. Thank you for this opportunity to read this statement on behalf of the North Prospect Heights Association, and it's a very good segue from chairman tious, mentioning zoning issues and a presentation that might educate us all about zoning issues. This statement reads: the New York City Department, Housing preservation and development recently published the schedule for the community engagement process on plans to develop 516, Bergen, Street and 542 Dean street, which reform which are HPD properties. Hpd's announcement asks for community participation regarding the development of new, affordable housing and neighborhood amenities and prospect heights. Hpd development at one or both of these sites could involve rezoning or up zoning from existing r6b zoning. A change to the zoning of mid block sites will likely generate changes to zoning acrosss, a broader area, the Norfolk Heights Association advocates. Maintaining existing zoning at the sites in our neighborhood public infrastructure is already over taxed and open space is scarce. Any HPD development proposal should include plans for public infrastructure and public open space. Hpd should make a good faith, transparent effort to review and, where possible, make use of unused residential capacity in our neighborhood and all around the city. Before undertaking new development, successful development sites will require close and regular consultation organization and other community groups, and we would love to engage community board eight in the discussion of these really rapidly developing situations with the HPD sites, and I thank you very much for the time I have an update, so we heard from HPD today they are planning a community meeting on October 21st regarding the Bergen and Dean's sites. So once we get additional information, we will disseminate the information to the community. So that's a community meeting on October 21st. Do you have a time I do not have the time. I do not have further information once I get it from HPD I'll, be sure to be blasted out. Is there a way to get a commitment from HPD to have a regular attendance at our land use committee meetings? We are still working on that we've been back and forth. Okay, so any public comments, announcements. I have a. I have a an announcement. I received a second ballot today, even though my first ballot was right. I know people that received incorrect ballots. I hope they've received corrected ballots, but I have received a second correct ballot, interesting vote in person. If you can well I'm going to fill out my ballot and drop it off at the polling at the board of election that that'll take care of it. I do not have to deal with a crowd. Okay, so unless there's anything else, if anything else Miss George are we finished? No we're done we're done. We can do that I'll. Just make a final shout out that tomorrow's the last day to register to vote. I know one of our elected representatives had mentioned that already, but just reiterating that tomorrow is the last day to register to vote. Can I time it one more time guys I think, in light of, what's going on in the whole community right now, I think the best thing to do is just if you find that you're having a problem trying to get your votes in, go to the board of election and just drop off your stuff. Do not wait for anybody just go in drop off your ballots, and that way you avoid any kind of confusion or just do early voting. That will be. If you feel that you're you could do that, but if you feel that it'll be better to avoid any confusion, just drop it off. That's what I would say thank you Mr Ross and make sure you use your security social masks exactly your security envelope and your mailing envelope are different. So make sure that you look at that very closely. If you're going to mail, it put your ballot in your security envelope, and then you put it in the mailing envelope. Okay and post postage is required. One more thing guys. I also put if you have not done your census and I'm pretty sure everyone has done it. I have put in the chat line where you can do it online. So if you could just you could go through the notes. I have the link pass it to someone that has not done that census you're only at 66 percent. We want to try and get it to 70.. Thank you. If there's nothing else, Madam Chair I'd like to make a motion to adjourn a second full. Second yeah, okay, see you all next month. Thank you very much. Thank you. Miss George! Thank you! Miss Neil! Thank you good night, wonderful, so much take care. Thank you. Good night.",
            "summary": "If, you did not hear him say something in the chat or by mutant talk to me at the end, Mr Witherwax, if I may, before you get started, I'm, getting a text message from a fellow colleague on the board who's saying that by calling in he's not allowed to engage with audio So, his roll call or his attendance vote would not be able to be heard, not good.\nThank you for allowing me to speak with the Community Board tonight, I'm here to talk about the interfaith medical center and our plans of around our pediatric inpatient, services.\nAll right in response to tonight's budget, request, keep in mind that starting in May and ending through the end and extending through the end of July, the district office sends mailings emails and surveys to residents requesting assistance in discovering what is needed in the community.\nWe are in the process of scheduling land use, training for community body, work, you'll be getting information over the next week for city planning to come in and do a webinar during our regular meeting.\nI want to remind our attendees and our participants that these materials are available on the Towns City Council website, by community district and by category expense, budget and capital budget items for fiscal 22., also for fiscal 21, where we are now, and so please take a look at that.\nWe taking any proposals or funding requests from any non- profit organizations that can provide those services, because I know just by Broward Park This week there were two shootings You know the issue is: What are we going to do about this?\nKeep in mind that starting in May and extending through the end of July, the district office sends mailings emails and surveys, residents requesting assistance and discovering what is needed in the community.\nWe submit our items to the community for review during this public hearing in this time of the year.\nTherefore, our budget items are a compilation of what is submitted to the district office and what the office staff recognizes is needed in the community based on questions and complaints fielded throughout the course of the year.\nTherefore, our budget items are a compilation of what is submitted to the district office and what the office staff recognizes is needed in the community based on questions and complaints fielded throughout the course of the year.\nWe understand these different demographics need different things, and that is why we continue to reach out for your community input, but at this time, I'd like to make a motion that the full board vote on the final submission of the budget document and give the district office the authority to use this information gathered at tonight's hearing and by email submission to prioritize the top 40 capital expenses, our top 40 capital items in the top 25 expense.\nThe committee voted to support this application, as presented by a final vote of 12 in favor, zero opposed and zero abstentions, and hopes that the full board support its recommendation.\nThey, can acknowledge themselves in the chat or via other methods, seeing or hearing no other indications of a question or comment about this new application presented.\nIf you come acrosss any issues and operations, we ask that you know contact the Community Board office are trying to reach out and speak directly with the pr, the proprietors and the principals as they're all going through a learning experience and trying to be compliant with these rules and regulations that are being updated on a regular basis.\nWe have a new secretary for the land, Use Committee The the report for the October first meeting that was prepared in the office, and I will ask her to read that What's recorded there and then hear the motion that was made at the October 1st meeting Ms Daniel.\nOh basically, here is that on Thursday October 1st We had a presentation from a representative of the Hope Street Capital 959 Sterling Partnership, Tiffany Raspberry and her team regarding a proposed new building on the campus of the Hebron school at 920 park.\nThe building as presented, is institutional, looking and not becoming of the area and small apartments are not designed for long- term stay and growth in the community, but are designed for transients or Short- term Stays parishioners state that hope, Street Capital's presentation was misleading and confusing, as many Congress did not speak English and the presentation was entirely in English.\nAs presented a committee member offered an amendment to the motion for the committee not to support the application unless developers had a setback at the fourth floor and starting place on the sterling place side of the building to reduce the mass and scale and allow it to better match the shorter row houses and for the developer to commit to affordable, New York option.\nThe committee voted to withhold support for the applications presented with a vote, a final vote of 14 in favor to oppose the Dr abstentions and hopes the full board will support its recommendation to not support Hebron project as presented.\nFor over 15 years, local community members, including members of the Crown Heights North Association, have offered to meet with the church's leadership in order to share grant opportunities that would fund the restoration of this building.\nWe urge Community board 8 to vote against this project.\nThis greedy developer shows no regard for community concerns, is willing to desecrate a landmark building for his own profit, has no real intention of offering affordable housing and makes corrupt backdoor deals behind the backs of her bronze members.\nDr Daniel Honore, the president of the Northeast conference of seven day, adventist churches sent a statement dated October 7 yesterday to Community Board 8, addressing many of the issues that were raised in the previous statement.\nThis board meeting was chaired by pastor John Philippe, then pastor of the Hebron church, pastor, Philippe invited me to make a presentation to the church explaining the details of the proposal on Saturday October, 14, 2017.\nThese include 21.5 million dollars in cash to the Hebron church, a regulation size gymnasium for the Hebron school in the new building at Hope, Street's expense.\nWe seek the same rights as the yeshivas and catholic schools to educate our children according to our faith, and if anybody needs a copy of this letter, if you put in the chat your email, address, I can send it to you so that you can review it.\nI just want to, I guess, address the Community board and especially members that may have not attended October.\nAm a member of Hope Street capital, not the sda , so Is that the reputations themselves, that the crucial repairs necessary for the existing structure are well in excess of 10 million dollars, and we actually have a letter that I can send over to right now from the church stating that they intend to spend as much money as necessary to make the repairs And they're sure that the repairs are in absence of 10 million dollars, but it could obviously exceed that.\nYou all right, while we like, just in response to Ms Tyus's, request to wrap this up, I'd like to ask the board office to unmute when you want, and while I do that, I just want to do some clarifications- that the concern for the deletion of green space was not directly responded to by Leed certification.\nI wanted to follow up to what fiore had spoken about earlier when she was speaking about affordable housing and friends of 920 park, for the record is a diverse intergenerational coalition of neighbors united in our firm opposition to hope, Street capitals, project at 9:20 park place to date.\nNumber one: The project goes against landmarks, law, the partial demolition of the historic structure, its inappropriate scale and style, the obscured sight, lines, the significant adverse impact on the old homes, visual entity and the character altering changes to the open space are all in direct violation of the city's environmental quality review.\nThis is cultural erasure and it begs the question: Whose monuments does the city protect, whose history matters the proposed project will be the first building of such magnitude, built in our historic district, since it was given landmark structure status by the LPC less than 10 years ago, and would set a dangerous precedent for preservation standards in this new historic district number.\nI'm looking and the only final comments that I'm seeing that are speaking in response to the green space they wanted to community members wanted to acknowledge.\nI want I'm asking now for comments from the community board members on this project.\nThere's really no opportunity to argue that in the scope of a certificate of appropriateness application, so the community board could potentially take a position against this project.\nAnd, I'm speaking to the Community board, members now, if for no other reason than we've, given some guidance to the commissioners when they review this project that they at least will discuss in the meeting.\nThere was mention of a scope, but a scope is very tenuous, especially with historic properties that the cost could easily go way beyond What preliminary estimates and those of us who live in the community know that the top two floors have never been used by the school, and we wonder if in fact, they're, sincere and actually wanting to renovate the entire property, seeing that they're only using half of it would be a great tragedy if they only renovated part of the building and left the rest of it to decay.\nUse Committee was insufficient to answer the needs of both the full board and the committee, and although I've heard Miss Rasberry expressed that she has no desire to do, so, I would say that she could take the temperature in the room and if she were to receive a no vote on behalf of her.\nThey we wanted to make sure that all of our concerns were heard, including the lack of affordable housing for this community.\nWell before I make my motion, I also want to share with the full committee that Crown Heights North Association submitted a lengthy letter about his position, as did not friends of 9:20, which outlays numerous reasons why this project should be posed.\nHowever, my motion, I, move that the committee withhold support for the new building proposed for the campus of Hebron school at 9:20 park.\nAnd I have to ask you to please either put your statement in the chat and or send it by email to the board office with a copy to me.\nSo at this at this point we have foreclosed our opportunity to have any further engagement with the project sponsors on this level and would look at working with them as we move towards the October 20th LPC hearing.\nAs with many people in the community, they're, the first to be aware of news aside from our school's public safety, officers.\nWe will be meeting virtually on the 27th of October to sort of discuss a wrap up of the liverpool streets project going on in our district all summer, and we welcome those who want to discuss sanitation, environmental and transportation issues, some of which have been already percolated here tonight in the chat and elsewhere, and the budget discussions come out, join the committee I hope that will be on the agenda.\nThe next committee to report housing- Let you all know that we will be having our first virtual meeting this coming, Wednesday October 14th, and we will start at six o'clock.\nI, look forward to working with everyone and I understand that we have a group that will be coming that is concerned about security in buildings within New York City.\nEveryone I want to make sure that everyone knows that early voting is going to be taking place.\nIt will provide 436 billion in much needed support for state and local governments, as you know that we're having an issue with a deficit with the city, and we want to make sure that everyone is funded, but that would have to mean that the Senate would have to vote on it, but it has been passed by the house.\nIf anyone has any questions, concern issue, you can either email And I'll, put that information in the chat and again the censors, get out and want to vote to encourage someone.\nWe want to start that at our next land Use committee meeting, which is always the first Thursday.\nSo we will be also asking city planning to do a presentation on zoning, about 20 minutes and they're prepared to answer questions from you as community board.\nIt does not have to be a land use committee meeting we can set another date now work with Ms George to identify a date they're willing to do that.\nIf you have questions about zoning as it relates to our district in particular, M crown, please submit them to me and the Community Board office.\nThe land use director for the Brooklyn borough president is willing to do a follow- up webinar on euler, so that when we meet as a committee, we understand what those processes and constructs are, and we can ask the correct questions.\nHpd's announcement asks for community participation regarding the development of new, affordable housing and neighborhood amenities and prospect."
        }
    }
}