{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UCRjoWtWg9BPyZK8YxMrH2Zw",
            "title": "CB 3 Manhattan - Executive Committee Meeting - Oct 22 2020",
            "publishDate": "2020-10-23",
            "shortDescription": "",
            "lengthSeconds": "2:22:28"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "ZG4Wwc-hDXU",
            "fillerWordCount": {
                "uh": 163,
                "um": 411
            },
            "readTimeFullTranscript": "79 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "vote": 40,
                "parks": 37,
                "funding": 31,
                "item": 29,
                "list": 28,
                "order": 26,
                "budget": 21,
                "school": 20,
                "month": 19,
                "trevor": 19
            },
            "wordCountSummary": {
                "vote": 11,
                "room": 5,
                "services": 5,
                "program": 5,
                "list": 4,
                "maintenance": 4,
                "transportation": 3,
                "beginning": 3,
                "chat": 3,
                "policy": 3
            },
            "fullTranscript": "One is in the room: may is here Jackie's here, okay, we have 11 people, so we have Quorum so we're going to go ahead and get started good evening and welcome to the executive committee meeting for the month of October for CB3 we are going to get started with a roll call vote for approval of minutes, Michelle. Okay, I'm sorry Alicia Lewis Coleman, yes, Michael Moreno, yes, Lisa Kaplan, yes, Eric, Diaz, Eric, okay, not here Michelle, Cooper Smith, yes, Herman Hewitt, yes, Jackie Wong, yes, Linda, Jones, yeah, Alex, Militano, Trevor Holland, yes, Paul Rangel! Yes, thank you! Thank you! Michelle! Okay. You have screen sharing for the agenda. I have it on my phone, but I just want to make sure everyone sees the agenda. Thank you, Michael, okay, so the chairs report. I have really nothing to report because we have a very hearty agenda tonight and I wanted to just take the opportunity to thank everyone. That's been working very hard on your committees. I have been able to attend a few of the committee meetings this past week and last week as well, very interesting meetings going on and I'm glad to say that many of you are working very hard on committees and tons of information that is out there. The district. The budget priorities is one of the main things that's going to take up the bulk of our time tonight. So let's go ahead and get started. First, Vice chairs report, Michael, you went to Burro Board. Anything interesting, really interesting. Borough board this month had the board of election come to present about election stuff, and you know what not the only interesting takeaway from that was the drop- off ballot boxes that people can drop off their ballots in. They wanted to make sure that people understood that those are only inside of act of polling places. So if you see a drop- off ballot box on the sidewalk somewhere, it is not a legitimate ballot box and the only other big update, which I'm not sure if this affects our working relationship with them at all. As far as the East Coast resiliency projects and other partnerships, but community Board, six has a new chair. She was term limited out. Okay, thank you, Michael Second, Vice chair. The only report I have is my work on the attendance, but that's a separate item on the agenda. Correct. Yes, it is okay. Thank you. Second, okay, treasures report. Herman is not here and, I believe Susan. If you have anything to report about Treasury, can you include it in your report? Yeah. Okay, thank you. District manager's report. Okay, I'll start, since you brought up shares, we're basically not spending any money other than our usual our contracts and salary, because we're not in the office doing anything so we're not using papers, pencils or whatever. It's mostly like a contract for a photocopy, and that kind of thing we actually a few of us are in the office either every week or every other week for at least part of the day. The city has said: they're striving to have 25 of the workforce in offices at the end of the year. So I think at that time, I'll reevaluate with the staff. You know how and what they want to do that. One thing I would like to ask the exec committee is people are emailing for direction about how to speak at committees because they go on our website and they see instructions for a public speaking at full board, but nothing for committees, and I do not think the committees are even all consistent. So I would like to put something on the website for them and would like to know how the exec would like this handled so, like a speaker form Susan for the for the committees. Well, if they want, I mean that's kind of extra work. I would suggest you know to do something closer to how they're doing it, but I do not know what all the committees want. Do you want people to to join and raise their hand? Do you want them to to write in the chat box that they want to speak, or should I say the chair at the beginning of each meeting, the chair will explain how to speak. You know just whatever it is that you want me to put. I think those are the three best options: either chat box raise your hand or the chair will give instructions for public. Speaking at the beginning of the meeting, I'd like to ask right now, the chairs is there something that's working for you that you could suggest to other committees. That is a possibility for them, so we can have some uniformity. I think that's important to just have uniformity across the board. We all are doing the same, go thing Paul. So what we do at transportation is we usually put up the list of rules at the beginning at 6:30 and people if they want to speak on a specific agenda item, they have to sign into the chat room before seven o'clock and I'll acknowledge them. Once I move away from the committee for any questions from the public, that's what I've done. I do not know what other committees have done. Okay, that sounds like a good one. Anyone else have something else they want to how it works for you and your committees. Well, yes, I think it might be a little dependent on the size of the committee like landmarks. We do not need to have any you know anything fancy. There will be one or two people that want to speak and they can just raise their hands. That's probably true of arts, and I do not know you know about others. Land use. On the other hand, I'm sure Jackie can speak. We have always had more. People want to speak than we have time for yeah, okay, Jackie, what's been working for you, I mean you have a really a really large committee. You and Trevor have a very large committee. Yes, so normally, if this is a Europe, we have to let everybody speak. So I do not have a choice. It is limited. Each speaker is limited to two minutes and that's just a Europe process, but if it's non- euler, then I still try to let people speak as many as many people speak as possible. However, I feel like many times. We do need to have certain control, because a lot of their points are actually repeating, and but we do it like, we call the name by the order they raise their hands. So when I see their hand raised- and I call them and give them two minutes, however, I do not use that power a lot. I actually can limit the number of speakers, but because he's a community boss setting, so I still try to let people as many people speak as possible, so we have both chatroom and Ray's hands being used, so this is so yeah. I have a like. My committee has like 11 or 12 people, so we, our policy, is that you, our policy, is that you use the the raised hands feature or if you know you can also go like this. If you know you somehow can't raise your hand and if you are having difficulties with all of it, like the video and doing this then put something in the Chat box and then Larissa watches it. It is also explained at every meeting, so we usually so just like in when we're in the room. You know the committee goes first and then the public members of the public, the community, does not have anything. The public goes next door, you know, and then there can be some. You know back and forth yeah, so that's about it parks runs very. Similarly. I think I think the best option here might be just to say that the third, the third option that you gave Susan of you know Login. You know instructions will be given by the chair at the beginning of the meeting, but make sure it says at the beginning of the meeting, because sometimes people come at 7 or 7:30 and they're like I want to talk. How do I talk yeah? That is true. I think that's been working for us at full board too. Just to make sure people understand what the rules are ahead of time. So this is something that can be put up on the website in advance. So people will know if they're not on by say what what did Paul just say by seven, if they're, not at the meeting by seven o'clock, they're not going to know, and so they they'll know in advance, hey on the website, it did say I had to be there by seven o'clock. If I wanted to, are we saying we're going to have and it's okay different rules for each committee? The problem is with like parks. We have very long meetings and some folks look at the agenda and say I'm not signing on at 6:30, and the topic won't go to 9 o'clock. We sort of merged the speaker session into a question session so that people want to speak on a topic. They sort of get cue to the line first, if they, by putting their name or by raising their hand. But if we're are we looking to have it a uniform for each committee, or are we saying check with the committee for the way we're going to operate whatever you guys decide? Yeah, I think that's a good question. I think that we, you know. Maybe we should take a vote, a pole, vote and see what people are thinking I mean like Linda did say it's according to the size of the committee. If the committee is small, like her committee is relatively small, that might not need to be done for her, but for the larger committees. I think there should be some type of uniformity, because if not and we've seen it in different committees, they do different things and it's another example as to why, when we did the trainings, that was the most important thing. Is that there's an instruction in the very beginning? So, let's take a vote on it. I mean like, because I think Susan just wants to have some type of policy for the website. Right Susan is that the goal- and I want to put something on the website, so people are not emailing and asking me- and I do not even know from committee to committee what to say right. It's fine. You know that it will be discussed at the committee all right so trevor. Sometimes we find that we have to. You know remind the committee attendees more than once. So it's for those late comers, especially mm- Hmm Lisa, has her hand up Alicia. Okay, I'm sorry Lisa go ahead. That's all right! I just wanted to say. I think there should be flexibility committed by committee, but I do not think we should impose a seven o'clock deadline to go on to be present for exactly the reason that trevor said. Okay, I feel bad because Alex is not here and her committee has a lot of issues around this topic. I can. I can speak to that at least a little bit, so it seems that there is not like a. We just asked people to sign into the chat room without a time constraint around that another. You know long often long meeting for SLA as well so and clint watches the chat room yeah he puts also puts like similar to transportation, puts a set of rules on the screen at the beginning of the meeting, but does not keep him up the whole time once we start talking, he takes them down, but I think people are allowed to sign into the chat room at any given time yeah. So, okay and they're not limited of timing. So maybe so maybe we just need to say on the website that each committee runs the speaker differently. You should sign in and if you have a question put it in the chat room like every zoom has someone watching the chat room. So what do you guys? What do you think about that? I mean I do not. I do not. I want to hear from everyone. What do you think is working? What's strong and what's wrong, I mean let's find out. I have something to say in land use, which is a big meeting a lot. A lot of people want to speak all the time. I do not like the idea of using the chat room for people to sign in. I think raising the hand is better because we're trying to discourage use of the chat room for any purpose except to sign in discouraging Chit Chat- and I often you know, turn it to turn it to private at a certain point in order to keep people from doing it, because they can't seem to stop themselves. Yeah people do have a tendency to get distracted with the chat room. Yeah it's bad. I physically see your hand Susan yeah, I'm I you know, I do not know need to like put all the details for each committee. If I it sounds, it sounds to me like different people do different things and that I should be saying that each committee handles the public speakers with different procedures. The chair will explain the procedure, explain the procedures at the beginning of the meeting. I think that it should also say there's no need to sign up in a bit prior to the meeting right, oh and then so. Therefore, I think it's incumbent upon us or our zoom master as they are called on the website. Oh you changed or not zoom masters anymore. I would I got criticized for that. It is now the student coordinator, okay, zoom coordinator a resume coordinator. It's incumbent upon the coordinator to just you know, keep track of people, you know, or you know, or Jab, or give them a little poke if they're doing the wrong thing. Yeah, our you know, Larissa does that she pokes at him a lot. I think. As long as everyone has someone to be the co- coordinator, as they say it could work Linda, I saw your hand yeah. I was just going to say and I've gotten kind of loose about this. It might be worthwhile to at least everybody have a one pager that describes the rules of their committee that they can put in the beginning, and that could be up as people as people join in they'll see it yeah. I think that was something that came at the beginning. I think you know some committees use it regularly. Some I'll speak to parks. I do not use it anymore at parks. What we do at parks is trevor has me, go through the rundown verbally, so people hear it and we're not relying on them just reading it yeah that's what we do in land use too, but I think maybe the piece of paper, particularly with the rules about how you how you speak. That is not really in that standard thing. I do not think, because that would be different for each committee. Would it be too much? Would it be too much if to have a link to each committee's procedure in the agenda yeah? I think we're that's asking way too much. I think we're overthinking this at this point. I think I'm good. I think I'm good okay, I have a good short answer. It's okay, I see Jackie has his hand up go ahead, Jackie, I agree with Linda because we do not want people to use the chat a lot. The reason is because other than signing in because it's kind of it's just like when I sharing land use, it's just a lot of things going on. So I really try not to handle a lot of things at the same time. So if you I have to watch what people are talking about at the same time dealing with the chat it's just like, I feel like I'm a little bit like too much, but I what we do at the land use is that before the meeting we always lay down the ground rules. However, if the people come in, like Trevor said before, maybe the people come in for the second topic, not really the first topic, so they may have missed that one. So I guess what I could do in the future is that I could have a little a text or a sentence and copy and paste to the chat box every time before a new topic, that's probably just to re- announce that guidelines. That would probably be helpful. Okay, thank you, Jackie, okay, so Susan, you said that you got enough information about this, I'm good, I'm good! It will be on the website before the next batch of meetings. I will put that you know I'll use wording to say that it's flexible per committee, the instructions will be given in that beginning and no need to sign up in advance. The one last thing I'll mention as part of my report is there, are more complaints now coming to the office than ever before by a great deal, the biggest issues not ranking in order are various street conditions such as drug use, such as vendors, particularly on 14th street homeless situations, and the other big issue is noise and music, because everything that used to be inside is now outside. There is great difficulty with the city being clear to businesses or residents and what the regulations are. They change them constantly and certainly never notify the Community Board, and you know particularly music, I'm going to say loud music that is constant, like maybe have people said six hours at a time. The city is trying to promote their mediation method for SLA procedures, which, to be honest, does not fit at all and does not serve residents at all. At a meeting, the program is administered by oath, the Administrative Tribunal and at a meeting with district managers. We brought this up, so they are going to have another meeting just on this, because we made a point of saying: there's never been any import input from the community. I just want. I had one resident say to me last week: it was just sincere and sad and I said, like nobody cares about us anymore. Nobody is listening to us and I have to say and trying to deal with their problems and trying to work with many of the city agencies either because they can't or won't it's really true. I am wondering if it might be a good idea. If say, council members held a town hall just to hear from residents and had city agencies there to get input from the community and understand you know what's working. What's not, the city is not making an attempt to bring people together, they're just not listening and that's my report. Thank you, Susan. Okay, the next agenda item. If no one has any questions for Susan any questions, I do not see any hands: no hands. Okay, we're going to go on to the Nominating committee Linda, okay, so the nominating committee has identified most of the candidates. We have, I think, three people who somehow have not yet confirmed that they're willing to serve but other than that we have our list and I guess I'll, just get after those people one more time tomorrow we have a tentative. I think a good plan for how to vote and Paul is going to demonstrate to you how that will work it uses Google forms. Do I have the ability to share, or can you let him share Michael all right Paul? Is there a green thing at the bottom of your screen that says, share screen yeah, but it says host disabled participant screen sharing hold one. Second, please! Thank you all right. You should have it now all right. Thank you, you're welcome there we go right, so this is a sample one that I've been working on. I've been messing around with it, so this is a we'll just play around with this one, but this is what it would look like and now you've been board three. We can always change the title, but this is what it will look like. This is what it will look like once I send it to everyone's emails during the meeting or right before the meeting. I'm not exactly sure when we'll do it, but every category is listed. Chairperson, First, Vice, Chair, second Vice Chair, Secretary Assistant, Secretary Treasurer. Am I missing anything. I think I got everything but you'll be allowed to vote for one person, and I will get your responses and I will get them onto a Google sheet and it will track your email, so I'll know who exactly voted for who and it will track your responses and if we needed it for a public record, I can always print it up, but I will always send it to some I'll, send it to somebody's email and we can send it back and we'll get all the percentages brought back in real time. So Paul I have a question. I've used Google forms before what so. What is the? How are you going to be able to validate sort of the voting if somebody does not use the email address that they use? For community board activities, I can make them put their name in as well. I'm like I'm still messing around with this is just the this is just the email address that I'm only sending it to the email address that is listed. That's given to me that you've used for the Community board, I'm sure we can probably say something. You can only vote with the email that you use for community board purposes and that's the only way we'll accept it. I do not know if that's something we have to change or not, but but I will be able to validate it, that I can track it, but I'll try to put the name in as well. I can mess around with this yeah just from it from like the zoom experience of you know. When we started using doom and people's email addresses, it became problematic at the beginning, because people were logging in under different emails, then we had put them in the system under so okay, well and zoom. I know that you may log in probably under a different email. If you have your work, zoom or something like that, but I am emailing you this link. I am to your email address, I'm not put posting it in the zoom chat or anything like that. I'm not going to post that link, I'm going to email it to the address that is listed in the big directory that we have all the Community board. Members. Okay, I see Susan's hand yeah. We need each person's name. We need a name on each ballot because it's you know, people are going to FOIL it and they have to see the person's name. What I will do is after the election, if you email just email me these, you do not have to print them out. What I'll do is I'll have to black out the email address, because we certainly are not going to want to give out people's email addresses. So if we have additionally the name on each one and then after the meeting, you'll email them to me I'll print them out I'll black out the email address, and then people FOIL them, but I'll just do treat them the way I did paper ballots, scan them and email them. Okay, not a problem like I said, I'm still messing around with this is just very basic from what I'm looking at right now. I think it's going to be the easiest way for everybody to vote and for us to get everything back in real time. I do not know when we, when you would want me to send out this link if you want to send it out prior to the meeting, because I know there's some people who call in on the zoom as opposed to using the video chat. So I do not know when people want me to send this specifically out. I will take recommendations on that. If you want me to send it out like at 5:30 or 4 o'clock, 3:30 3 2:30, to whichever one you'd like feel free, I I'm open to sending it out at any time. Once it's officially ready, I think Lisa had her hand up. Okay, Lisa, I'm sorry go ahead, Lisa and then Eric go ahead. Lisa! Oh sorry, I was muted. I just going to ask why we need the email address. Then, if we're putting the name on the on the sheet, because I have to email, I have to email the the ballot the ballot out right, but maybe I just do not understand how yeah how come. Why do you need it printed on here? You need it printed on here to send it. I do need to print it on here on Sunday, but I can always delete the emails once I get okay, once I get the responses I can, I can I can clean up. I can clean up. I can clean up the form on the responses. Okay, Eric. This is being emailed during the during the full board. Meeting right or earlier depends on what everybody wants. I know there are people who call in, I think so it could be difficult. I do not think there's so much towards the nominating, I think is for the Community Board Bylaw question. I think I know we got to do the oh, you guys already did it earlier anyway. The Bylaws committee met already, but this has to happen during the committee meeting right like all election voting right. I do not think it actually says that yeah. I do not think that was. I think we kind of looked at it and it did not say something specifically has to happen during. If it was an in- person meeting, we would have a presentation by each candidate. You know one minute presentation and then we would hand out, while they were doing that we would hand out the ballots and then we would collect the ballots and then we'd go off and count them. So I do not know if we have to follow that exact procedure or whether, if we sent them sent the link for the ballot out in the late afternoon told people that they could either you know they could vote early or they could wait until they've heard the presentations during the meeting and probably we'll also need to figure out a time limit for them to vote. So that's the other thing. We do not want them to you know we want to get those votes in right, yeah Susan. I would suspect they need to vote at the meeting, because otherwise they would not even have to be at the meeting, but I think whatever you decide and something like that, we should pass it by either the Bro president's lawyer or open meeting just to make sure that it's okay, do you recall what they when they did, the vote in Community Board one they sent it, they sent it out early, but they actually did the voting at the meeting. Okay, so people would save that email and at the Mo right moment they would click on the link, and you know you definitely need a deadline, so you know when to count them right, and I do not know if we needed it. We thought if there was somebody who was not using a computer at all. I do not know if we have anybody like that, that's only on the phone! Well, it can be done on the phone. That's. Why that's why? I think it I think it's. I think it would be prudent that we come up with whatever the plan is before next week's full board so that you can tell people what the plan is, so that they're prepared yeah. No, that's no problem. I just wonder whether we need to say if you're, if you're, if you're on a phone, if you do not have access to a computer, here's how you vote. You call this number and you tell people what your vote is. Well, you can't do it on the on a smartphone. No, I do not mean I mean my phone, I mean a dialing, oh okay, yeah! Okay! I see, I see Eric's hand yeah. I do see the because how I mentioned it was possibly during the zoom call. We all take. You know a five minute pause to then go and access our email fill out the form and then come back to the zoom meeting. Yep you know make sense, and then that could be how it's done. That would be good and then Paul can you can you can turn off the you know make it stop accepting responses. After a certain time, yeah we get it gets time stamped. So some, let's say we stopped accepting responses at eight o'clock and somebody decided to use the link at 8:20. It would show it up and we do not have to count it. I think one thing you need to add here by the way that we talked about was an abstention. If somebody does not want to vote at all, they should be able to click abstain. Yes, okay, like I said, I'm still messing around with this. It's literally the first draft. I think it's terrific and if you wanted to for the for the actual voting period at the meeting, you know if we want to take Eric's suggestion- and you know say we're going to take five minutes, go vote. We can put the timer up right. That's true! I like that yeah I like that and I'll hit, send right away and then everybody will have it in their email. Okay, that sounds good. Any other kind of another question for Susan go ahead. Lyndon. When we do this in person voting do not we require that everybody hand in a ballot, whether they're, actually voting or not. That is correct. That is correct, so in this case they're going to just need to use the ballot and abstain rather than not vote at all. So that's another important rule. You have to vote well, they can submit an empty ballot on this right just but just make them put in their name. I know we've been doing it wrong. All these years, we've been doing it wrong. All these years. Have we yeah? You have to count an extension. We've never been counting. Abstentions. I see yes this year, we're going to yeah we'll do it I'll, put extension as the final option and it's required anyway yeah for each one, okay, all righty, that's it for the Nominating committee. I think if anyone else has either a question or a suggestion. This is all we're plowing new ground here. Okay, so now we are going to move on to the biggest part of our meeting tonight budget priorities. Here we go already huh Alicia, I'm sorry. Eric has his hand up again. Oh, I did not see Eric's hand up Eric did you have something else to say it's muted his hand went down too yeah. I did not see his hand, he might have changed his mind. He put it up and then put it back down. Sorry all right, all right cool all right. So here we go budget priorities. Susan! Yes, please thank you so Michael you're going to should we start with this on the agenda. Screenshots hi, guys, I'm sorry, I lost the reception. Oh okay, did you have something else you needed to say Eric, I apolo just a related, quick question: when is the nominees? How was the process for the nominees to address the full board as it's kind of normal for a nomination, just like normal, just like normal during the during the full board meeting, you would do that before the vote. Okay, thank you and you know. You'll also be asked to write a one paragraph thing for him for me to send out to all of everybody beforehand. So probably be rough. You say the same thing in both places. Usually, okay, thank you, Linda sure, okay, starting with expense priorities, which I think is going to be difficult. This year we can only have 25, so we have many more than 25 once you finish, ranking them the ones after 25 will fall off the list. There is one mistake on page four: we have under the second transportation item. We have completion of pedestrian ramp. That should not have been under expense that should have been under capital. So that's a good thing, because that way, we it will fill under capital and it'll, give us one more one more space for an expense item. So what we did was for the first 22 we kind of ranked put things in the order. This is just a draft for you to look at. We put the items in the order of committees the committee order from last year. So if the first seven items last time were the first seven human services, that's how they were ordered, then, at the page three at the very bottom and actually starting on the next page for page four and half of page five. These are all leftover new items that and there's only space for four of these, so you have to decide tonight just working on expense. First, do you want to keep this draft order? Do you want to change things and from the leftover items? What four of those do you want to include and where not easy? May I have one question for you, considering that we just had a DOE meeting and they're saying that they now have a full- time nurse in every building. I'm wondering if you think that number 10 is less important, but that was just something I wanted to bring up well, we said well, there's every building and there is every school right, but that's a that's different. Yes, I just want so I think we said I think we had said every school, but they said every building and then they would check to see whether it was really every building or literally every school. It's probably every building. Okay, I just wanted to note it since it just came up yesterday, so I'm going to leave it, I mean. How do you want to handle what's doing food for the new sections? Okay, I see Lisa's hand hold on. I see want to make sure I have everyone's hands lisa. Yes, I'm muted yeah. I went through this and I thought there with all due respect to health and Human services. I kind of felt like this was a little heavy on those and did not include some of the other really important items from other committees and in to me. There should be something about NYCHA in the first ten. There should be something about parks in the first ten. There should be something about a well something about. I think that the item with regard to funding of DOB for inspectors should be in the first ten, and I made an effort. I I lower ranked a couple of the health and human services ones to make room for those in the first ten, but generally that sort of oh- and the second major comment I have is that I think there's a couple of priorities that did not make it last time that I think should be in the top 25, such as the increased funding for commercial peace assistance program. I think that should be a high priority. Given the Covid-19 situation, I think organics collection should be a much higher priority. It was not ranked at all. I think, funding for tenant advocacy for the office of tenant advocacy should be ranked, and I could suggest where to put those in, but I do think those deserve consideration. Can I just make a few technical issues I did not mention, but if you look at it after each number, I have the ranking for the committees. So one thing we have always respected the ranking of the committee. So when we change things, we do not change it within the ranking of those committees. Another thing I would say is you know some of this. Some of the rankings from the committees was based on research for that specific item. For instance, like the commercial lease that you mentioned, that's a very vulnerable item, because the city did stop the program and then restart it because of advocacy, whereas the DOB tenant advocacy is not in danger, we would like more funding, but it's not in danger. So those were some of the things that I think the committee chairs and I can speak to if you want to deal with individual items, but the ranking within the committee is like the priority to keep okay. Let me see if I see any hands. Okay, I do not see any hands wait. Let me go down okay, no hands raised. I could just also mention the chairs know this. We had meetings that were over an hour which, with each agency with very detailed agendas in the minutes, the agendas and the minutes, the results are all on the website, but I just want to say there was a lot of a lot of research behind each one of these trevor I'll mute yourself. Trevor situations, like I said, like the commercial lease you know it does show which ones are more vulnerable. Okay trevor, I think what I'd like to ask and find out is how we want to do this. I think we had a method last year or that we moved up or down a particular item and I'm not exactly sure how it worked, but I'd like to talk about how we want to do this first, because we I agree with Lisa on some of the items from parks, because I remember last year's discussion and you know we moved around a lot of things, but what's the procedure or what do we want to follow to sort of get this done? Okay, I think you're right I mean you know we could do it. However, the exec wants to do it, but I think you're right that we went through each item and say you know, should they did down or should it move up? We did and we put them in the order and within the committee order, but we moved them around on the first percentage. Okay me and then so I think the way we should do it is do not look at it as moving it up or down, but just inserting something so like, for example, if you want to insert you feel, is there some priority and land use or whatever that belongs between two and three? Then you know someone has to advocate for that and then everything else gets pushed down. Okay, so are we going to go one by one hold on a second? I'm sorry, Jackie go ahead. So this way we preserve that order. That Alicia was talking about. I have the same question as trevor, but I thought last year when we wrote the item one by one, did we do that, take the exec or did we do that the full board? I thought we did that yeah right exactly okay and then we presented to the full board okay, and then we did that again right at the full body. We I every train had to like pull out the item like one by one, if I remember not at the full board, no only here at exactly okay, and also I wanted to say that, like I'm more familiar with my own committee items and I'm not entirely like very familiar with other committees, so I do not know. If I mean there are like two or three items like from my committee that I feel like I want them to be on the top 25 I mean, if not 10, but I mean, should we just say that, like which two or three items from each committee that we want to, would that be more effective? Well, it's only going to be your first one or two or three I mean you that you've right, you basically would be moving them up right. So let's look at the order that we currently have. Okay, everyone. I mean I'm looking I'm looking at it on my phone. I do not want you guys to think I'm looking at text messages, I'm looking at it on my phone, so the first one being funding for community boards and operational budgets right increased funding. This was picked up from last year. The what it should say is that eight thousand dollars was removed from our budget this year and we want the 8,000 back with funding. Are you going to change the wording of that? Yes, okay, I did not realize that this happened it should it was not the wording that was supposed to be there okay. So there has to be an amendment to the wording of the first item, correct who stored the 8,000 that was removed from the current budget. Okay, so does that need to be our top priority to you? It was last year. It allows us to do work, but it's up to you. I think it makes sense. Yeah I mean because without the Community Board right we would not be here. Okay, that does make sense. Okay. The next item is human services, increased funding for senior meals and kitchen staff, salaries and senior centers and home delivered meals. What do we all say about that? I believe that during especially now during Covid-19, we really do need those meals being delivered to our senior residents. See you know Alicia. I think the way it should be done is not. People should not look at each one like that because, like Jackie says they do not know, or they might think. Oh this human, you know, then we get we're trying to preserve the order. So we have to make decisions and make choices. You know. Maybe somebody decides that okay, those are seniors, but you know, but those NYCHA tenants. You know they need to be prioritized over those seniors or maybe right before that, so they insert it and then everything bumps down, and so this way we okay so preserve the order of the that the committee decides this way. We preserve the order that the committee decided, so everyone got an opportunity to look at the listing and the way it's listed right. Everyone got an opportunity to do that. If not, you can do so while you're sitting here now and see. Is there anything that should be moved up or bumped down, or what have you right is that it may is there anything that should be inserted in there insert it into because there's four more that can be inserted right because we're preserving the order? Yes, so it's either inserted or moved up, but then everything else moves out. Okay, so right so in order to okay. So look down further in the list. Okay, so maybe we can look at what the top 25 should be. Maybe that'll be easier, and then we can do this. You know bumping up or you know whatever. Okay, because there's four more to insert right. Yeah, there's one two yeah you have space for more, but there's a lot left over. You know that you'll see on the sheet. Yeah there's 20, there's 25., but if you look at page four page, four yeah they're, all the ones that make it so there's at least four to insert but people, maybe they feel like they want to insert more and then more things get bumped off. Okay, so Lisa suggested a couple right: alicia you got hands up by trevor and I see I see: okay go ahead, Trevor and then Lisa. This is obviously considering the environment that we're in. I would like to see parks maintenance staff, which has had serious cuts, moved up pretty high along with the recreation program the playground associates, which I think is non- existent anymore, but if we could move those up and to the point I thought Jackie made about knowing other committee's priorities. It's kind of hard to say put this in front of like city Ffs hra, because I really do not know the importance of that, but I do know that we really need to get some parks maintenance because they suffered some serious cuts. But I do not know where to push that up to okay. Wait because I know Lisa was next okay, what I have two Lisa Kaplans, what's going on there, I'm going to have to change my views, so I can see who the second lucid. Captain is, okay, so that might one of them might be anisha as a matter of fact yeah. One of them is me: I do not know why that happens, I'll change it. Okay, thanks! Okay! So since I spoke already okay, so Anisha go ahead. Sorry, I missed a little bit of this, but I would say: there's no economic development priorities that made the 25 or whatever the top, and it seems like in this particular environment. At least one thing from economic development should be in there and that would be our first priority: the commercial lease assistance program, which has been threatened multiple times and actually was defunded by the city and then brought back because of advocacy, including ours. So just putting up that out there yeah in the workforce, I'm sorry I'm cheering Lisa yeah. Well, I was kind of reiterating what I said before that I think that the item with regard to NYCHA should be moved up. The first NYCHA maintenance should be moved up and I think the DOB liaisons should be moved up and I what was the other and I think, curbside recycling should be moved up. It should be on there. It's not on at all. I would prioritize those Melee trevor had asked what the feps program is. So it is a housing voucher program for those they're in temporary housing or you know, shelter, and they you know it would help them like it's like a router to help them move into rig into rental housing. So more money need is needed for those vouchers. Okay, Jackie, I'm reading the priorities from other committee committees and I feel like I want to see ellen pike stream being constructed, and I do not know if we are already having too many past items on that list or not like that's capital. Oh that's capital! I'm, sorry! Okay, all right! I'm sorry! I know Susan had a comment. Oh okay, I was just technical again. I just want to make sure that people are looking at the ranking like so, for instance, if you're moving something from DOB up, it's going to be the first one that that deal that what do be ranked as number one that will be moving up, and I also want to just say you know when we talk about items both the chair of the committee and I can give information about how vulnerable that is from the meetings to take that into consideration, because some you're certainly getting a bigger bang for your buck or some are more vulnerable than others. Okay, Michelle your hand is up yeah. I just want to say this is really hard to follow. If we can maybe identify the like five or six new items, we want to add- and maybe the ones that we want to move around and then debate those because I can't I can't keep straight on what's coming from the random feedback. So I think that would be really helpful for me, both as a notetaker and as trying to evaluate the different options so like. Maybe we should go around to each chair and ask them what they'd like to see on their list, and then we can debate each one. Something like that. I think that's a good idea, michelle we'll just go committee. I guess we'll go Committee by committee. Then okay, can I just can. I just add something. Sorry, I can't raise my hand, so I just want to confirm. I think what I understood Susan to say is that if we, if so something that's that's in this leftover list, you know like for transportation. If we want to move something from transportation, it can't be like number four. It has to be the next thing. That's ranked number two, exactly that's one! That's how we've been doing it for a number of years and that's why it's so important for each community to rank theirs because their ranking count. Okay, it's under the actual committee. Everyone has to be clear about that. It's under your actual committee, okay, all right so Anisha's already made her wants known, and that was under economic development. Yeah, okay, Michelle: did you catch? What Anisha said yep? Does she want to add number one if possible, yep? Okay? Now, let's go back to human services? Okay, me all right! Well, all of our priorities. I think there are 12 of them, made it into this top 20:22 or 25 or whatever it is, but I just want to maybe explain the process by which we did it. So, yes, we did go to all of those OMB budget meetings. It was like hours of meetings to understand. You know the different priorities that you know they had. We also in the committee. We voted like 12 times on the on the order of each one. We discussed the you know it's like the seniors versus the youth versus the homeless. It was that kind of a thing, but we had a discussion of what is the impact of each one and that went into yeah and different people had different ideas, but that went into their vote. So we voted on each priority and its order, and we also understood that the ones that came out for us on the bottom might be dropped off so that went into. I do not know if that went into it that much, but we understood it. That's all I'd like to say: okay, thank you mate any hands Paul, I'm advocating for t2. I want to see that out then top 25 at least the rap mitigation zone from us. I know we have one in the top 25. I'd like to see t2 get in there just to save some face. T2 the rap mitigation zone. Yeah, I see it. Department of sanitation just took a major hit in their cuts. You know we put pretty much a lot of the sanitation priorities up towards the top at committee. So, okay, let's see up there, t2 yeah all right. Thank you! Michelle! Okay, let's go to the next one land use so right, so I was looking at the list. The only thing I wanted to say is that if we could move number nine, restoring funding for starving program, maintenance and building maintenance from nature move it above seven, because I understand social services, a lot of important issues- and I do not want to you- know- push them down, but I feel like NYCHA is really lacking staff right now so and they have such a big population in our community. So if we could move that item to seven, that would be great. Anyone have anything against that. Okay, what about the other Niger one Jackie? Okay! I do not see any hands, so I guess okay, Paul and then Trevor. I'm sorry, just a quick question! Why are we right if we're trying to fill out these last three? Why are we pushing that one up so high unless I'm completely missing the boat on this one? And it's just this was a draft list, so the executive committee votes on it. I do not prepare it, but in order to make it easier, you know to give the exec committee a draft collated list to have something to work from. I prepared this or the office did based on last year's list, so it was just a draft for you to have something to work. Okay, I mean the ranking within committees is fixed, but otherwise the coalition is not fixed copy. Thank you trevor, two things for clarification and I'm not sure if I understood Susan's answer, I thought right now. We were just looking to fill stuff in the 23:24 25 spots. Now we're looking to do both re- rank and because I think Michelle was saying she was getting a little confused, but so just clarification of what we're doing right now. You can tweak the order, so we can do as long as you're, not changing the ranking. Can we figure out what the last one is? First, before we start tweaking the ranking, we have one more yeah. We have one more empty one empty. That's what I thought we were doing. Okay, I thought we were doing that too. There's one more empty spot and Lisa gave a suggestion for that empty spot right. I do not have any suggestions for the empty spot only for ranking items. Okay, Lisa. What was your suggestion, where's lisa? The problem is that her suggestion is not number one on the list. It's not the next one. Oh okay, her suggestion was the composting. Is that even here is the parks. Is that it's transportation? Seven, oh transportation, but if I could mention that one, it's not the top ranking, but also the funding for that is coming back in January. So it will the funding plan. It still needs more funding, but it's not going to be unfunded. Past January! Okay, I got it. I can't re- rank it anyway. I do not want to take over for Paul, but I think that transportation is the least represented on the list and we've had a lot of local constituents asking about accessibility. So if we can move up t3 to the list as the final one I would I would. That would be good. That's going to go in capital, that's something! Oh, okay! Right! That's what you were saying so the next one would be t4. I mean I guess, that's the same thing. It's really hand- in- hand with the other with p2, so because my understanding was different. The curbside recycling is coming back in January or funding to the to the rece. I'm sorry, I'm this. What what's this about the organics right and now I was talking about curbside, the curbside, the curbside picking up of council right, that's what you're talking about for buildings and that's not, but that's not projected to return it is. It is I'm sorry, the composting is January you're correct. No, I'm sorry, I'm correcting myself. The curbside is coming back, but not in January, but they are definitely bringing it back. They have said that. I think that's why it was not number one on the list. Depaul do you remember, or you went that you went at the San Andreas talking with Susan we're talking about the brown garbage can yeah yes and yeah they're. They are they're lisa, they are coming back. I mean I work for the DOE in the kitchen and we were told that they are coming back relatively soon. They just could not give us a projected date. Absolutely yes, yeah, because we, you know, I dispose of a lot of organics every day, so they have to bring it back. I mean the schools have a lot of organics that we have to dispose of. They are definitely bringing it back. Yeah! Okay, that's! I did not know that! That's why we had dropped it that low, because we got that we found that out during the meeting you told us, it dropped that low got it. So that's what I'm saying there's a lot of research. I think behind all these rankings and everything. Okay, I'm sorry, I see Trevor's hand just a couple of things to make it clear. Can we refer to each item either by t2 or e2 or p whatever just to make it easier to follow, because we were talking about you know organics, if I knew which one t number it'd make it easier and also we have a ranking system that committees have done so if we could kind of respect that ranking system. As we talk about this because we're talking about moving stuff up, that's in front of other committee items, correct, okay, I think we're good now right now, if there are any committee chairs who want to advocate to insert one of theirs higher, that's what we could do now right, that's where we are right now: okay, everyone look through the list. I can't see the list from here, so we're going to have to look at it here. Oh my god, my eyes, would you like me to read just the headings? Please: okay, yeah my eyes: I'm getting computer glare craziness! That's right! Number: one: funding for Community board operating budgets, number two Hs1 increased funding for senior meals and kitchen staff, salaries in senior centers and home, delivered meals. Number three is Hs2 increased funding to expand access to after- school programs for elementary and high schools. Number four is Hs3: increased funding for safe haven and stabilization beds. Number five is hs4 increased funding for Syep Summer Youth employment. Thank you. Number. Six is Hs number five, which is funding for the norcs. Naturally, retirement communities. Number seven is land use number one, restore the funding for staffing for grounds maintenance and building maintenance in NYCHA number. Eight is human services, six increased staff, funding for social workers and guidance counselors in schools with high homeless populations. Number nine is Hs7 City fh Eps Sorry number 10 is hs8. Increased funding for school nurses, number 11s, hs9, increased funding for beacon programs. Number 12 is hs10 pay parity for anti- eviction. Lawyers number 13 is parks, number one parks, maintenance, staff, number 14 is parks, number two recreation programs, number 15 is parks, number three tree pruning and stump removal number 16 is parks. Number four additional parks enforcement police number 17 is Hs, 11 increased funding for cornerstone programs. Number 18 is land use. Two increased funding for waste management staff and operations at NYCHA buildings. Number 19 is land use; three: restore funding for staff for staffing for liaisons. That seems to be a typo inspectors and auditors h. Number 20 is Hs12 increased funding for summer camp programs for middle school students, Sony program number 21 is parks, number five, neighborhood branch libraries open six days a week. Number 22 is transportation. Number one litter basket: service number 23 is economic development number one increased funding for commercial lease assistance programs, SBS number 24 is transportation. 2, rat mitigation zone collection and number 25 is transportation. 3 inspectors, neighborhood interventions, okay, everybody! Where do we go from here now everyone looking at the list, I guess the question is: does anybody want to do any of the chairs want to create removing something or inserting something? Whatever terminology you want to use so there's hands from Trevor and Anisha and Jackie? Okay? Let's go Anisha Jackie Trevor. Let's do that so economic development has won. We only have one and I'm happy that it even made it to the top 25. So I'll sort of just take that. But I do think in this time of crisis for small businesses, it should be ranked higher than where it is because we just stuck it on the bottom. I think it should be under all of the human services the slate of human services budget priorities, because I think that program, in particular, is quite heavily used by a number of the small businesses and economic development is certainly. I think you know something that the city is going to be prioritizing going forward. Amnesia, do you mean, under the last human services, which is number 20 or under sorry, I meant like closer to the top when it was that first block? Okay. Does that make sense age? Two you mean Anisha so up here at number, 12 yeah before the park stuff starts Sorry Trevor do not be sorry, I'm next. Should I move that before we go to parks or should we do everyone? First, let's put it there. Let's go ahead and put it there, Michael put it there now, okay and then, and then we can always shift sorry. My computer's acting really slow, though so feel free to go to the next one. While I move stuff, okay, Jackie, I think Trevor is before trevor is next. That's I'm sorry Trevor go ahead. Actually, I do not know if it was, but I can I'll be brief because we could be here all night with this particular thing. If the as everyone knows park, staff has been cut and if anyone does not know they've been cut in this serious drastic people's jobs have been lost. So I would like to see p1 or number 13 moved into the top 10., I'm not exactly sure, but I'd like to see in the top 10. and for the rest of the items as long as they do not shift where they are. I hear echo as long as they do not shift where they are meaning. I know we want to insert stuff above that, but the more we insert stuff above that moves it down a list, but if we could just keep it in that particular space, I won't push the other items which are important because they include recreation programs for kids and tree pruning, but I'd just like to see p1 or 13 moved into the top 10. Susan has her hand up. I know she's going to say something. Sorry, I'm going because of the echo Susan you're. Muted Susan, what I said is I'll wait till after the next person is who's supposed to speak. Okay, oh, I did not give a number and I'm being as flexible as I can so I would say after nine, that's as low as we can go so number 10 yeah sounds better if you say after nine, instead of in front of 10. Jackie. Yes, thank you. If you go to number 18 number eighteen, that's now you mean number! Nineteen! Now sorry, I'm sorry number. Nineteen, I think, there's a typo len used to increase funding, not increased. That's fine, okay and also I do not want to create trouble. But when I was reading this I feel like I actually support Anisha I feel like. I want to see one more of her economic items to be on the list. I mean we can talk about it and I do not want to make trevor feel bad, but I feel like the pruning and storm removal is not. I mean because I do not know your community, so I could be wrong, but I feel like it is to me seems like a workforce. Development is more important, but I could be wrong again. I could be wrong. I would concur with that yeah. I kind of agree right now, because we're in Covid-19 and a lot of people have lost jobs. Workforce is very demanding, go ahead. Susan I see the hand okay. So I want to comment on these. As far as you know, there's in the community every day in the community, the parks, maintenance staff is at a critical. I mean we now have all over the community. We have citizens doing cleanup days for blocks and parks. I think it's a really critical. It's been cut, probably over 60, it's critical for every person, almost in the community, that's using it every day. So I just you know. I would like to say that I think what you know Trevor's discussing there is something we hear about and we try to deal with every day. As far as the workforce development, the top workforce development is actually it's for the one we use with lesson which is actually for Nycha's residents, and we do want more money for that, but it's not threatened and to Susan's point. There are a lot of things that are threatened here, including park staff, which is the reason why I was pushing for that and to keep the order of the other ones. In other words, if you move something up or you want to go in the top 10 as long as park stays as number 10, which is pretty low, considering that they're only at 40 workforce, I'm raising my hand, but I can't I can't click the thing I want to support trevor and I want to keep tree pruning somewhere in there, because it's a safety issue. We have so many trees in Seward park and the branches are always falling off and they're not pruned, even in the best of time, they're not pruned, often enough, and if we go without any tree pruning for a year, it's going to be very dangerous. Sorry, I just want to also point out that we can't, if we take the proposal, was to replace land use two with or take out tree pruning and put land use two there, but then we're also breaking our rule of not honoring the ranking of the committee, because the P4 and P5 and p6 would be left and we'd be taking I'm sorry, P4 and P5 would be left, which is parks, enforcement, police and neighborhood branch is staying open six days a week. If we take out p3 yeah, I do not advocate taking it out or I'm removing it just do not remove it completely. I did not think that was enough to remove it completely. Okay. No, I I'm sure you did not. I thought Jackie had suggested swapping taking out tree pruning and stump removal and putting in land used to, but maybe I miss, I think he just wanted to move land use two up. No, that's not what I meant. I my suggestion is that we keep the pop maintenance nothing to do with the park maintenance, it's the pruning and stem removal and replace it with not land use. But with economic number, two, the workforce development- it's not economic number, one, I'm sorry, workforce number one is for nature, but workforce number two is general, so I suggest we move workforce to replace pruning and stem. However, I also understand what Linda is saying that it could be an issue, so I'm just bringing that as an idea. We can decide whether we want to do it or not. However, like hearing what you guys just discussed, I also feel like I still want to see that replaced, but it's up to the Exact Susan go ahead, just giving you the background on tree pruning before Covid-19. For some reason, tree pruning has been cut every year and there's tremendous complaints about it because of the safety issue. So it's been cut every year, pre- covered and now it's been drastically. Alicia you've got hands up with from anisha and Trevor. Okay go ahead, Anisha and then Trevor. So I obviously would like to see more economic developments in the 25, but I will also agree with Susan in the sense that you know, workforce development is really spread out amongst a lot of different agencies. There's not really a really good comprehensive, like one or two programs that serve the city we in our district needs. We actually said that was a need that we do not have sort of a comprehensive plan. The commercial lease assistance program, which was our number one which is on here that was chosen because it is threatened that they threatened to defend it constantly, and it's not a permanent program, but it should be. I if anything would now say it should be even higher on the list and in the top ten. But again I'm happy that one even made it onto this list. So thanks driver ever yeah, I was just waiting to be called. It did just for the parks items that all of them and I'm assuming pep is also threatened. All the items are threatened right now, because there are drastic cuts made to parks. So, even though this is last year's ranking to a certain extent, it has a little more validity this year, just because of the budget cuts and to this to Susan's point and also to the way we're doing this. Is that we're not really looking to replace an item and take off one item, because that would mess up the committee's ranking we're only looking to move up or move down and, as I've said, I was trying to be. You know somewhat generous just to 752 to get parks maintenance up there because of the drastic cuts that are made and that whatever ranking is done after parks is preserved at number 10 and the other items are preserved in their order at 13:14 and 16 respectively. That's going to be difficult to do, but that way, I'm not asking them which they should be moved up and I'm not asking them to be moved up just to preserve their location. Okay, any comments, any thoughts, anyone else, okay, one hand up whose hand is that all wrangle? Oh go ahead. Yeah, I'm going to fight for my guy, my t1. I want to see it move up, but you know I think it just got dropped down a whole spot from where it was at the beginning, I'd like to see in the top 20 at least or 15. But you know if it's going to stay, where it's at it's going to stay where it's at you know, I'm happy to get three on there now, but I'd like to you know: there's human services: 12 is ahead of us and now it's our first priority and sanitation just got just demolished they're at 30 capacity yeah. So I that T1 is important to me. I'd like to see at least move up four spots, maybe ahead of 20., maybe ahead of 20. If that's possible, I do not know if anybody wants to argue that, but at least that go up, I would agree considering your sanitation issue in my area, I would agree yeah, then rats are big, so they're huge. I agree with that and moving up economic development yeah, but where we say what not, what e number sorry, okay, can we put T1 at number 20.? I think it should be further up, I'm being generous right now. If people Wanna, why do not we go up with it? That's fine with me. Could we put those two before number 11 of human services, so the human services just gets 10 and the others can get one well I'd like to see parks maintenance, because that's the same item that we're talking about maintenance of parks at number 10. right. So she means human service is 11.. So what are you suggesting when we move there t1 to number 11. go up? Okay and what e number it would become? 18 from it goes from 20 to 18. and what is what is E1 now one there's only one economic development, one. I think it's a number is not it further up number 14., oh okay! Then that's okay. I thought it was further down yeah Anisha you're. Okay, with that I mean thank you, people to eat or do about them to work, so they have money to eat. It's sad! We I mean, you know kind of have to laugh at this, but it's just really sad. I mean it's just oh! I mean the other thing we could do anisha. If you wanted to get another active and we could, we would have to get rid of the last one of one of the committees right. One of the priorities so like Hs12 or p5, seem like the logical ones. Is there really a? Is there really a? I mean also New York public library is not only fully funded by the city, so especially right now I mean that seems a heart like a hard one number 23 p5. I know the chief of staff, the New York public library. I do not think they're opening six days a week anytime soon, no not in my lifetime. If I could suggest that you know they lost the six day program, but they think it's a hard still to get it back. So I would agree with you to not make that as high. You know a priority or we could drop it off and add another active yeah, because the library is even saying you know it's. We want it back, but it's not very likely, so I can be dropped off, but then, as long as we keep the now the lower locations of parks, because I really do not want to see the other items dropped off the branch libraries come under parks if we could put the next economic development one and then with it being low and that in that spot, where just p5 just came off of that's fine, okay, guys they're killing your libraries, oh no, we love the live streams. Oh you're, breaking my heart: okay, how's that how's that anisha better a little better, okay, you're above the rats, perfect place to be okay. Let's move on Let's! I do not know why, but I want to watch that stupid ass debate tonight. Susan yeah! I just want to confirm so we now have our first 25 expense. Those will go out to the committee to the board. The ones 26th beyond will be dropped off correct. I mean I just want to make sure we're all on the same page yeah, that's what it's looking like everyone said is in agreeance. So for the capital priorities, capital is really a lot easier, because almost all of them are I'm sorry getting feedback. Almost all of them are parks and parks has already ordered them. So the first 24 are already in the order of parks and then 25 through 31. We have to add the pedestrian ramps 25 through 31. You need to insert where they should go, because they were not ranked at all they're, just those are from from the schools and they need to be inserted with head ramps. So you just need to figure out where that is listen when you say Ped, Ramps, okay. So what those are the street corner? Pedestrian ramps where they do not exist? People people with disabilities are actually stuck like they get off the bus and they can't get off the block because there's no, it's not accessible city has been sued multiple times they're about. They have been directed by the court through all this they're about 10 years past their court date. So it's a question of accessibility for people with disabilities. I'm sorry! I guess I was asking. Why is this just new now? Because I mistakenly put it on the expense list and capital so we're just removing it from expense and putting it in capital. It's not new, it's just being put in the correct position, so the two committees that have items on this that need to move are health and human services and transportation. Correct right, so transportation only has one. So why do not we start with that? One Paul? Where would you like your pedestrian ramps to be on this list all the way to the top? Now we had it high up when we had it as a original list. It was number three on your expense right. I need to yeah, you keep scrolling up. I like it in the top 10 at least top 10 at least you're funding, P2 P3, P4 P5 first 25 are all parks. 10 is fine if he thinks it's that important. We had it at three before. I would not mind it at a time. If that's possible, I do not have a problem with Ped ramps being attended. You yeah, I like it. Okay, I just want to remind everyone. Everything will be on the list because we get 40 capital, so everything will be on the list in some form. Okay, thank you. It seems to me like things like pedestrian ramps and school improvements are really as important as parks and I'm not. I do not see why we might not just do something as arbitrary as like, adding each one of those in their order, maybe putting the pedestrians before the individual schools like every third one. You know like first school, it would be number six and then second school would be number nine. You know what I'm saying they're just like interested, so it's Parks, Park, School, Park School. Something like that. Oh just, oh, my next question is sorry. Is it these school things? I do not remember seeing them in previous years. They're just did I imagine the schools have always had need. Why is it new now? Oh, I can't explain why? Is there all this feedback? Oh hi, can I explain everyone? That's not talking yeah, I'm going to mute everyone, but who's talking go ahead, man, oh okay, so the the schools well where what okay? So this these capital priorities were given to us by the cecs by the Cec one, which is most of the lower East side and also by the ec2, but just for the Chinatown schools. So they went and we just asked them for their top five priorities. They went through their own process of deciding what I mean each school, you know made a request and if you ever go to those cec meetings, you know they go through a very laborious process to decide what the what the you know ask will be and what the priority will be. They have already submitted these ask to the school construction authority and none of it has been funded yet so we're just it. You know we're basically like uplifting their asks and I do not believe they were. They have been on before. I'm sorry, yeah, no, that we have not done that before so we're. I mean working with the schools more, so that's why we, you know reach out to them about their priorities. To put on to you know, to sort of continue pushing for on our priorities. Does that answer the question? Yes, I'm just thinking about what Lisa said in regards to these priorities that we already have primarily because if something says you know supplement a cooling system, you know, whereas an error may not have a playground at all. I mean I understand the ranking that you've done, I'm just talking about in ranking over all of our of our entire community of really looking at what they're asking for like. If someone needs a new roof for a Rec center as opposed to a supplemental cooling system or upgraded wiring, it's kind of hard to just put them in between specific things. Some of the parks are extremely critical, involve entire reconstructions of playgrounds or entire reconstructions of bathrooms, as opposed to a particular item supplement and cooling system. I know it. I understand the school's need and in a Covid-19 environment that cooling systems are going to be critical if they're not already funded, but I just want to make sure that we understand what we're looking at from the human services or this ranking from for the schools trevor. If I may, I just I just want to I as a employee in the school systems, I'm telling you cooling systems are a necessity and the funding for them is horrendously low. We do not have the cooling systems necessary for even the kitchens and the children do not have them in their auditoriums, and so because the buildings are more than 100 years old. It does not. I it just. I can't even begin to tell you the deplorable conditions that many people are working under and the children are having to be exposed to, so it often gets the low on the totem Pole. The Board of Education normally has to just wait years and years because of electrical work, and things of that sort- and I tell you I can put in paperwork now and it'll- take five to ten years for it to go through. So it is a priority. No, I agree with you, but these are specific requests from specific schools like Ps42 supplement code, not the overall cooling systems in the district. No specific schools they've probably been waiting for many years for those things to come through yeah. So that's how they submit their request. They do not. They do not. You know it's like project by project so we're you know. Just I mean that's what we have right project by project school by school and if it's two different projects in a single school, it's two requests. Two separate requests that you know we should not try to combine. I mean that's just the way it is with the system. Can I make a suggestion? Maybe trevor since we've already moved transportation to number 10? How would you feel if the school things do not start any higher than 10? I'd? Be? Okay with that, and I think that the one exception was and my brain is getting too much was Ped ramps here, ped Ramp is here: that's where we move the pedestrian is number 10. Now right, that's transportation, right and then intersperse, the others after 10, as Lisa, had suggested based on the ranking that they have. Yes, is that copacetic, that's fine yeah and you can go one after another meeting parks, yeah, D.O.E parks. Do you park theory and there's some there's some extra spots too. So if anybody has any not too late, but just some extra spots may is that acceptable to you? Yes, that would be fine. Thank you was that clear, Michelle who's taking notes. I can't see your yeah. I was going to start after so after p12 insert Hs1 correct a question on p12 well number 12.. Are we still looking for a new school at Essex? Crossing, that's number 13. yeah. Is that going to happen? It's still in the district needs? Well, it does not have oh what? Where is? Where is it? We always still where's the school at Essex crossing? It's number three! It's! It was originally number 12.. It's now number 13., oh okay, so it's still so of all the the human services is I mean it should like. I said you should preserve. The order should be preserved. Okay, I'm just asking because it, but you know if it gets bumped down it gets bumped down, but it should not get bumped down below not getting bumped down below number below him below number two, because that's number one for us. Okay, so now, basically number 14 is p12. Number 15 is hs1, number 16 is p13, number 17 is Hs2 and so on and so forth. Phsp I do not see a p13. Did I delete it by accident Columbus park Sp13? Oh yeah, it got combined. Sorry all right! Thank you. So are we voting on all of this yeah? Do we want to do a separate vote, or do you all want to vote at one time vote at the end any hands for voting at the end? Or would you like to vote now? Okay, we're good at voting at the end. Okay, all right! Okay! Thank you all right. So I'm going to stop sharing this. Thank you. Okay. Go back to the agenda screen two seconds! Sorry! Ah, okay, yes, attendance, Lisa yeah, so I did the accounting of attendance and I guess the bottom line is that there were three people that did not meet the 33 maximum missed meetings mark they were Miss Crookshank, Troy bellez with oh Krupp, Sank was 59 percent, missed Troy bellas was 35 percent missed and permaneut because he is on like two different committees missed 45, so I have drafted letters for Alicia's signature. The standard letter saying they were their attendance would be reviewed over the subsequent three months. Then they must bring their attendance up to the 33 maximum missed meeting rate during that interval. So yeah Lisa. I have a question so I know that myself and also Paul have reached out to Ms Khrushchev and she's not been responsive to myself or Paul. Would you like to share as her committee chairperson and she showed up this month, so she responded that way. She showed up this month to my last email, so she was there, but it was the first time she had been in our committee since we were face to face, I believe in March, but still I think, we'd have to go through this process. Nonetheless, right now, no absolutely I would. I really was not expecting her two weeks ago to be honest: okay, so there's one little tweak that has to be made to the attendance sheets right Susan. You were going to do that and I thought you'd send them back to me. So I can incorporate that information, and so we have the right percentages for everybody. One person who was added to a committee was not on the attendance list that I reviewed so that little tweak has to happen, but it would not affect the bottom line. So will the board do that and also send out the letters? Will the board staff do that and send out the letters susan? We can't hear you I'm sorry Lisa. Yes, I will send you the revised a sheet either tonight or tomorrow morning. No tomorrow morning, not tonight doing stuff as we speak, you know I just said. Okay and yes, Deidre always sends out the letters over Alicia's name. Great, that's my report. Thank you. Lisa Okay Agenda Item description Susan. What do you mean by that? I'm sorry. Do you want me to speak to this? I brought it up last month and we agreed it would be discussed this month and I do not know if any of us have the bandwidth to do it, but it will get clarification about under what circumstances we can or should or would be permitted to take a vote. Does there have to be a specific wording on the agenda item in order to allow for a vote to be taken, because there seems to be some inconsistency in determining that? Can you give an example I do not. I do not wanna criticize anybody. I really hate to be. You know I'm not. I do not want this to be to be punitive, but there was at least one instance that I'm aware of and that we discussed last month where the committee was told it was inappropriate to take a vote on a certain item because it had not been expressly written in the agenda that a vote was going to be taken on that item. I think the confusion comes when something is listed on the on an agenda as a discussion of a topic versus a presentation of a topic. You know if something's listed as a discussion or- and you know, informational- obviously I think informational means we're not voting, but I guess there's just some confusion as to if something is listed, a certain way does that mean it can't be voted on if somebody asks for a resolution and Mei's got her hand up, oh and she just put it down- okay, so yeah, so this discussion has been had before. I think it started, but did not go far enough, so we decided, I think it was back when Jg was chair for certain policies to put them in writing and vote on them, which is really helpful on this issue. We have decided that if it says informational that there will not be a vote, nothing else had ever been specifically decided. In writing. I think it would be very helpful to know sometimes it's very difficult to figure out wording. I think it's very helpful to know when there's going to be a vote, or at least a vote is expected. I do know on CB2. They put an asterisk by each item. That's going to be voted on and that's just my context, so yeah, okay, I see physical hands, so I saw Linda's hand go up just now. Yes, Linda yeah. I think the there's some middle ground there that you know Lisa and I have talked about a little bit. So you have a discussion of some issue. It was not originally intended to have a vote and it does not have an asterisk by it, which is a good idea and spontaneously as you as the discussion goes on. It becomes apparent that you'd like to make a resolution about it. Is that kind of what you're thinking Lisa yeah. Precisely and so then the question is, you know, is that okay, oh you've got a hands up from May and Trevor yeah, okay, so may and Trevor go ahead. Me okay. I mean I like the I like the way what Susan had said that you know if you're definitely not planning to take a vote. You know you should say for say so for informational purposes only, but as Lisa well, not lisa, as Linda said you know, sometimes discussion happens and it could be a very non-, controversial issue. Maybe it's like a little nice project in the park, or you know, and in the course of discussion you know the committee wants to take an action or and therefore it requires a vote. So I think it should be allowed on a case that there's always no. It's there's always a possibility. It's not case- by- case, it's always a possibility. Unless I mean the instance where you would say for informational purposes, only is because maybe there you're, you know you there's a decision to be made, for example, but you're only going to get half the information at this meeting. Maybe there's more information to come later and you do not want to. You know, make the decision at that meeting. So that's a good, a good reason for saying you know informational purposes only so that people do not expect you to make a decision at the meeting. But again you have to take it on item by item. As it comes up, it's like it's not something that you can generally say yeah, you can't generally say we will or will not vote right. You know unless there's like it's a big long term. You know like those eulops or last year it was you know: Mount Sinai, Beth Israel. You know we got. We did not get everything at one meeting right. It took many meetings, so we you know, held off on voting until another meeting right. So in that case you can't because you're planning ahead for when you're going to vote on this big issue. But otherwise you know you do not. I mean if it's to be a democratically run meeting, then you know you can't. You know say that. Okay, you know people can't vote or come or you know, come to a decision to take an action. Okay trevor. I think we need to be very careful about our wording in our agenda and that primarily has to do with the public, because a lot of the stuff we do is informational and they may not attend because and then they find that there was a vote and they go. Why did you vote to put the you know parking stripes on my street? I thought you were only going to discuss it. So you mean there is some chair discretion, but with regards to park items and we get a lot of stuff, a lot of you know just informational designs that we need to be extremely careful. If we're going to vote on something and perhaps and I've seen it in other community boards, they say possible vote or an asterisk, but if it's for informational purposes, I would never take that to mean a vote unless it's a timely thing, because there are instances where they've come and they've, given us a presentation and they do not need a resolution, but there might be something controversial about it. So we'll say: okay, we'll look at this next month or bring it back when we need a vote yeah. That sounds like a good okay Susan. I see your hand yeah. So I following river the issue. The reason for that this came up previously was about transparency, and it was about the public knowing when there would be a vote and when you have something like an update, it sounds like there will not be a vote and generally not always generally there's an opportunity to put it on the agenda for the following month, so that you can vote and be very clear and the other issue that sometimes comes up is that there's often when something is done spontaneously not enough or information that you're not aware of or an opportunity for an opposing viewpoint. So I think if it could be clarified and certainly you're, not saying not to vote, but often it could be put on the next month, but I certainly would like clarity. So when I'm working with the chairs that we know what to put Jackie yes, I kind of agree with trevor on that as well, because if we are taking a vote on something, I just wanted to be extremely careful about that. I feel like I a lot of times. I wanted to have some background information about a specific world. I want to do some background research before I do that I mean that's just myself and I agree that if we see something that is very controversial or some people wanted to have a vote, we can put it on next month's agenda and I also wanted to say that I think last month the issue arise because is the description of the agenda item in the past. I always thought that when you say information presentation, we are not taking a vote and I think, update. I get the same idea same feeling that for updates, we are not picking a vote, but I guess, if we like want to be clear, we could like make sure that we, you either use information, presentation or update, like just consistent with the wording for the description of the agenda items to make sure that we know what to expect for the public to know what to expect in these meetings. Okay, so Lisa, do you want us to maybe write up something like create like some type of resolution, or something or like not a resolution, but like a policy or something? I think it would be helpful. I am concerned that you know like May was saying sometimes when you there's a presentation. New information comes up that is very timely and that there is need for a quick action, and that saying just next month, there'll be a vote. Sometimes does not do the trick, so I really think we need to be. We need to avoid having this discussion and we need to have clarity so that there's some way that people will know in advance that if there can't be a vote on a certain item that it is clearly evident to all and that generally there should be openness to a vote. If a vote is necessary turns out to be necessary because of the information that's provided at that meeting at the discretion of the chair. So yes, I think I think we need it clearly delineated in writing. What so, would you like to suggest some wording? Not now? No okay, so you want to come back to the table with this next month with some work with the wording. Okay, I think the team with you lisa. Okay, so did you say you'd help me Linda? I did Linda said that she would team up with you excellent okay. I love it all right. Thank you very much to two of you. Thank you. Okay. Now we're going on to. Let me see where is that? Thank you, committee reports, SLA is not present, but Michelle would is there anything in particular, I will say- and I apologize if this is too much, but I thought that there were some potentially racist comments made by a community member in reaction to the application by one of another community member, and I said something about it, and I just hope that we think about how our power can impact people and especially people of color when we make decisions. I know that the that the that the borough president was inviting us to trainings on bias, and I think that we should really. I think we might need it for our board. Specifically, we have most applicants of or one of the most applicants for liquor licenses in the entire city or in Manhattan, and I worry that we are exerting power in a way. That is not equal, so I just wanted to flag that for all of you. Besides that the media went until I think 2 am but will be fixed next month. Yeah, I heard you guys went very long, very long, okay, thank you. Michelle Parks, I had my hand raised just for Michelle when you say community member you mean Community, Board, member or just a regular. No, it can a member- and I just I just meant also that, if we're taking into like making sure that we can skillfully evaluate what the types of comments that people are making, what they really mean, as we have a lot of power on liquor licenses so and that can mean, as we heard from other applicants, make or break for their businesses. So I want to make sure that we are not explicitly or implicitly being biased in the way that we evaluate applications. Okay, thank you, but I'm sorry, I'm still massively confused. So did a community board member say no, a constituent like a member, a general member of the public, but I just know that we take community input into consideration when evaluating our applications. Whether it be for liquor licenses or for anything, and I want to make sure that you know we can control how we as a board, evaluate the suggestions or the comments that come to us so that they do not implicitly or explicitly bias us against people who are applying for liquor licenses and other things all right. I understand that. Thank you. Okay, sorry about that. Yeah thanks! Thank you. Michelle Okay Trevor parks, since I'm now number two, I'm going to be brief, and just I if anyone has any questions, but we did do past two resolutions. One of them would support the return of the ecology, since Comp assured to the New East River Park and the other one was to support the preservation of the East River, Park, House and Tennis comfort station. The meeting did go along. I do not really know why, but we had support for both those items. That's it questions. Thank you. Thank you. Trevor transportation Paul. We really just had Revel the electronic moped company come and present talk about their safety stuff and now that they're back. That's really it no there's no resolutions past. That's it. Thank you. Thank you, economic development Anisha. We did not have any resolutions. I think the thing that we are going to be working on in the future is figuring out what will happen with the special district and how that will move forward. Yeah. Thank you. Maylie Health human services hi. So well, besides budget priorities, and what is it like that? So, besides budget priorities and district needs, we also had a you know: we had a presentation from the alliance for positive change: the lower East side harm reduction center. You know they've moved to 35 east broadway into Chinatown, and you know the reason, as you just remind you, the reason why we invited them to have a presentation at the meeting, because we received a letter of complaint from one of the China major Chinatown organization, the ccba. So they came to the meeting. It was us, it was them, it was Jackie and that was it yeah I mean you know Justin and all did not come. There was a chinese language reporter who said she would come and she did not come to the meeting, and you know it was an opportunity for people to talk together and have their concerns addressed. You know we did work really hard to make sure that I mean it took some doing. You know to get the lower East side, harm reduction, centers to realize that you know they're in a different community. Now, even though they're just a few blocks away, and they need to address it so anyway, so we had the meeting anyway, we had the presentation. I know there was a lot of questions I asked you know, Jackie asked a lot of questions and they were answered and after that there was a the week after which was last week. There was a of a site visit a walk- through scheduled for the ccba. I think Justin went to it, it was just for the ccba was scheduled, you know with the help of Margaret's office and to be for him to visit. You know the lower East side, harm reduction center at their new place. So, just last week I think we received a letter from Ccba they're, still not happy with everything, they're, not happy with this location and this organization and the services they're, providing you know the children in the library and then be afraid of them, and you know I mean you know it's a one and a half page letter. So we want to. We just got the letter. You know they somebody we left released a letter to the media. We got a call from a chinese or an email from a chinese language reporter. We have to respond to that, but we really do want to you know sort of maybe sit down with ccba or respond to them, and you know their questions more. I'm sorry. They did not come to the meeting, but they did not. I do not know why and that's all I have to say I mean there's a lot going on there and that I'm not sure about, and maybe a lot of things to unpack and discuss, but that's where it is. I do not know if anybody here has some insight into this. If you do please, let me know: yeah I see, hands trevor has a hand up and Susan has a hand up yeah. Just for clarification. You said they moved into Chinatown. Where were they? What neighborhood were they in before Allen Street yeah, so they're more like right outside of Chinatown, basically yeah? That might be Chinatown to be honest, but I did not know. I did not even know they're in Allen canal to be honest, but that might be Chinatown for a lot of folks. It is Chinatown trevor. It's just like. I think it's the outskirts of the most popular part of Chinatown yeah. So it's so that East Broadway section at one time used to be more like lower east side, and it was not very. But now, if you look at it, you know it's like east broad, it's like between market and it's close to library. It's too, you know. So it's anyway. I was trying to remember their. I do not know their previous location. I know where it is now yeah. I just did not remember where their previous location was it was. It was literally hidden. You could not really see it, you would not even know it was there unless you were a participant, but I think now because they're over more on the East Broadway side, it's like it's more visible because there are other harm reduction programs in that same area. There's a drug, the lower side, service center, yeah service them through there. So okay yeah all right. Thank you. Okay! Thank you me Lamb used Jackie. Oh I'm sorry Susan had a hand up. I'm sorry! Thank you. I just want to say Jackie we may- and I have talked about this and Jackie- sent you an email for help and how to respond to the reporters. So you know, maybe tomorrow we could talk about that or you can help us. Okay, sure we can talk about that tomorrow and I to follow up on Trevor's point. I think the original location is still Chinatown. However, the original location is a not a low- key because it is in an area that you do not have a lot of food traffic. You do not have a lot of retail is the location was situated between two wholesalers and food distributors, so it's not really a location that a lot of people pay attention to, but now they move to a location that is right next to a library- and I guess in the library has a lot of children users. So I guess that's bigger the concern and also that blog we already have like three or four two other centers, so they are worrying if each broadway will become a hub for treatment centers. I guess that is the concern. Okay, thank you, jackie. You have anything for land use, yes, so for land use we we did have a we d pass a resolution, so we approve a minor modification application for Grand Street view to build two buildings at 151 to 165 bloom street with 480 units, and they are all affordable units. The developer and the Ga have reached some agreements, so we made a condition that these agreements need to be legally enforceable for the project to be approved and also we did budget priorities, and this month the two, the two british co- applicants. They need to revise their rezoning plan in response to the recent rulings of the lawsuit, the two bridges, lawsuit and and because now we need to assume those towers can be built. But this is just a technical change, so it does not change our boss position from our from our August wrestled. So we just agree with the co- applicants and the co-. Applicants need to hire the consultant and George James again to make the changes and they are willing to cover the course of it, because Cp3 does not have extra money for that, and also on 70 Marbury street. They just finished their first round of engagement and they are doing a second round, and I want to thank Michael Alicia Susan for helping to put those information on the social media and they are doing a second round of engagement in the second week of November. That would include a town hall meeting and and some paper surveys- and I also he also did not just a committee meeting, but I think I should do it later or maybe because you have a natural social media items after landmark, and that's all I have thank you, jackie, okay, last landmarks, Linda, you're, muted, so professional. So we had two certificates of appropriate applications unusual that we would have two in one meeting, but it was they were both interesting. They were both we approved both one of them is, you may familiar be familiar with the building. It's on East, 11Th street. It says public baths of the city of New York, it's quite a quite an elegant little building, considering it was a public facility like that and it has new owners and they're doing a lot of changes internally and some minor changes to the exterior, which is what we considered and they plan to totally restore the facade. So that's really good and the other was extremely. You know completely insignificant, so we approve them both. Okay, thank you. Linda. Okay. We had a couple of subcommittee meetings this cup this month. Okay, so we had NYCHA met Jackie want to report on NYCHA. The subcommittee now mute yourself. Okay, there you go so we had the first nitrous committee meeting since since when was the last time we had a meeting, I think it was before the pandemic right. So the turnout was pretty nice, I have to say we had 20 something people. I think 20 people yeah, and I wanted to thank Linda for for volunteering and help us with the zoom platform. That's really nice of you. Thank you Linda again, it was very interesting. I enjoyed it yep and because, before the pandemic, I went to a natural subcommittee once and I do not think there were a lot of people attend. That's a committee meeting and this time I saw around like 20 people, I feel like it's a good number and we discussed it. The nature staff gave us an update on the recovery and receive resilience, construction and I think Smith and Laguardia they are substantially completed. The concern is, is Baruch house and also victories. I feel like their delay is going to be substantial, looks like their construction delay is going to be another year and when you're dealing with these type of governmental jobs, the delay may be longer than what they tell you and and the committee members, and also the public. They complained about lack of outreach and garbage issue. Rats rodent these kind of things and and the NYCHA staff agreed to meet with them privately and also John Blasco that the district leader also suggested. Maybe CB3 can have a tongue type of a meeting for nature residents to express their concern and also for Nato staff to address that and Alicia did. I miss anything, no, that's it, and I think that was a really good suggestion that the district leader gave, because I do not think how the subcommittee has ever done. Anything like that in the past to have like a platform for the NYCHA residents to actually you know. I know we've had meetings in the past or information sessions in the past, but like a full-, fledged town hall, where people can express you know their concerns for the developments in the area. It's it would be amazing and I think it would be powerful yeah. So that was a good suggestion. I maybe perhaps we can talk to the committee and look at what that would look plan something around that: yeah. Okay, all right, so arts and Cultural also met Anisha any sure, so I actually did not attend, but I know that they did write and approve two resolutions, one for for city agencies, to increase funding for cultural orgs and then a second to support, City Council legislation for outdoor permitting for arts events and performances, so sort of like the outdoor streets or outdoor dining, but for cultural venues. Those are going to go to economic development next month. So you'll see the sort of final resolutions next month on those two and then yeah. That's all sorry! Thank you! Anisha. Okay, can I ask a question because I've read the vote sheet that Susan has sent, so it just seems to me. The first resolution looks like it would have should have been something that should have been included in the budget priorities. No, okay. We there was these. Should you want me to address it? You can go ahead, I'll, say something after there's a lot of discussion about that. The things well, one we've never had a budget line with cultural affairs and it was not requested. We can request it, but we never. It was never requested and a lot of the funny some of the funding that they wanted. Some of it is City Council discretionary funds, but I'll I won't go into it more. However, they should go in. It's been a big subject: yeah. There was a lot of confusion about how this whole thing happened and I think specifically, if you do read the results you're frozen, I think. Oh, can you see me or hear me? I can still hear you yeah. Okay. I think the resolution is for current budget and the district, like the budget priorities are for next year, so they decided to do separate ones. One of the things that I was not sure about is that I do not know that there was a quorum at the meeting. If you look through the minutes, I actually did not attend, but I think only three people were there. So I'll have to go back and check about that, maybe because I'm not sure if that changes anything about how it goes to economic development Susan, we just know they should note on their minutes supposed to note that there was not a quorum and so because you did not have a quorum voting. The resolutions have never been moved. So when they go to economic development, they have to be moved at that committee. Okay, I'll double check there were people came in and out so, but I was going to ask you about the fact that they're asking for modifications to the current budget is that really they wanted to change the budget? That's already adopted and not next year, it's how it's written so that there should be opportunities from not just DCLA but DOT a couple of other organizations again they I did not see it before it went into their subcommittee. So all I've seen is what has come out of it as the approved we'll have to maybe clarify and yeah to answer Michael's question the reason those specifically did not go on the budget priorities is because this was researched and none of those agencies have budget lines for arts like within transportation. What they explained that they did is they have private public partnerships to create those programs, so the resolution can be. I did not read it. I only read the heading. The resolution can be to provide those opportunities. Thank you. Okay, any old business susan. You have old business. I just want to ask Michelle if you will send me the two priorities tonight, because we're going to post them in post them on the website tomorrow, and I want to actually take half a day off. Is that possible? Did you hear Susan Michelle yeah? Sorry, I can't speak without my headphones and they had died. Yes, I will send them to you tonight. Thank you very much and I'm sure I really appreciate all the work you did on that for us. I'm trying to take three quarters every day. My family is coming in this weekend. I got to go: buy food, jewish mother, Good Glad to hear that Susan any new business. Okay, I just want everyone to know. We should definitely all congratulate gigi. Our past chair. She gave birth. She had a little girl. When did she give birth was a Tuesday if I'm not mistaken, yeah so yeah, so shout out to Gigi and her husband on the new addition to their family. Do we have a name for this child yummy? She was born October, 14 last two last Tuesday last Wednesday last Wednesday, Sorry last Wednesday, so yeah, so she's, officially one week old already, but yeah and she's doing good and Gigi's doing good. Okay, let's see, I think, that's it in motion to adjourn and roll call vote. Let's go vote for vote Alicia and we have to vote on the yes. Everything is going to be all in one, that's what we agreed to. Am I correct. So yes, this adjournment will be a vote on the budget priorities as well adjournment along with the budget priorities and agreement. Okay, all right! Thank you! Alicia, yes, Michael you're, muted, Michael Sorry, my computer's freaking out. So yes lisa! Yes, thank you Eric! Yes, thank you. Michelle Cooper Smith, yes, Herman, Hewitt, okay, Melee, yes, Jackie Wong, yes, Linda Jones, yes, Alex, Moltano, Absent trevor Holland; yes, Paul Rangel! Yes, thank you! Okay, everybody I'll see you Tuesday night on Zoom have a great weekend. Ciao nice.",
            "summary": "One is in the room: may is here Welcome to the executive committee meeting for the month of October for CB3 We are going to get started with a roll call vote for approval of minutes, Michelle.\nOkay, I'll start, since you brought up shares, we're basically not spending any money other than our usual our contracts and salary, because we're not in the office doing anything It's, mostly like a contract for a photocopy, and that kind of thing we actually a few of us are in the office either every week or every other week for at least part of the day.\nWhat we do at transportation is we usually put up the list of rules at the beginning at 6:30 and people if they want to speak on a specific agenda item, they have to sign into the chat room before seven o'clock.\nMy committee has like 11 or 12 people, so we, our policy, is that you, our policy, is that you use the the raised hands feature or if you know you can also go like this.\nWe should take a vote, a pole, vote and see what people are thinking I mean like Linda did say it's according to the size of the committee.\nI mean like, because I think Susan just wants to have some type of policy for the website.\nHe puts also puts like similar to transportation, puts a set of rules on the screen at the beginning of the meeting, but does not keep him up the whole time once we start talking, he takes them down, but I think people are allowed to sign into the chat room at any given time Maybe so maybe we just need to say on the website that each committee runs the speaker, differently.\nI. Think raising the hand is better because we're trying to discourage use of the chat room for any purpose, except to sign in discouraging Chit Chat -And I often you know, turn it to turn it to private at a certain point, in order to keep people from doing it, because they can't seem to stop themselves.\nIt sounds to me like different people, do different things and that I should be saying that each committee handles the public speakers with different procedures.\nThe reason is because other than signing in because it's kind of it's just like when I sharing land use, it's just a lot of things going on.\nYou know I'll use wording to say that it's flexible per committee, the instructions will be given in that beginning and no need to sign up in advance.\nThey change them constantly and certainly never notify the Community Board, and you know particularly music, I'm, going to say loud music that is constant, like maybe have people said six hours at a time.\nI. Think a good plan for how to vote and Paul is going to demonstrate to you how that will work.\nThe link for the ballot out in the late afternoon told people that they could either you know they could vote early or they could wait until they've heard the presentations during the meeting.\nI would suspect they need to vote at the meeting, because otherwise they would not even have to be at the meeting, but I think whatever you decide and something like that, we should pass it by either the Bro president's lawyer or open meeting just to make sure that it's okay , do you recall what they when they did, the vote in Community Board one they sent it, they sent it out early, but they actually did the voting at the meeting.\nIf you wanted to for the for the actual voting period at the meeting, you know.\nIf we want to take Eric's suggestion-And, you know say we're going to take five minutes, go vote.\nMay I have one question for you, considering that we just had a DOE meeting I'm wondering if you think that number 10 is less important, Well, we said well, there's every building and there is every school right.\nI kind of felt like this was a little heavy on those and did not include some of the other really important items from other committees and in to me.\nI I lower ranked a couple of the health and human services ones to make room for those in the first ten, but generally that sort of The second major comment I have is that I think there's a couple of priorities that did not make it last time that I think should be in the top 25, such as the increased funding for commercial peace assistance, program.\nThose were some of the things that I think the committee chairs And I can speak to if you want to deal with individual items, but the ranking within the committee is like the priority to keep okay.\nBut I'd like to talk about how we want to do this first, because we I agree with Lisa on some of the items from parks, because I remember last year's discussion and you know we moved around a lot of things, but what's the procedure or what do we want to follow to sort of get this done?\nAnd also I wanted to say that, like I'm more familiar with my own committee items.\nYou know they need to be prioritized over those seniors or maybe right before that So preserve the order of the that the committee decides.\nI would like to see parks maintenance, staff, which has had serious cuts, moved up pretty high along with the recreation program, the playground associates, which I think is If we could move those up and to the point, I thought Jackie made about knowing other committee's priorities.\nIt's kind of hard to say, put this in front of like city, Ffs hra, because I really do not know the importance of that, but I do know that we really need to get some parks maintenance because they suffered some serious cuts.\nAt least one thing from economic development should be in there, and that would be our first priority, the commercial lease assistance program, which has been threatened multiple times and actually was defunded by the city and then brought back because of advocacy, including ours.\nReading the priorities from other committee committees and I feel like I, want to see ellen pike stream being constructed, and I do not know if we are already having too many past items on that list or not like that's capital.\nIf you're moving something from DOB up, it's going to be the first one that that deal that what do be ranked as number one that will be moving up, and I also want to just say: you know: When, we talk about items both the chair of the committee and I can give information about how vulnerable that is from the meetings to take that into consideration, because some you're, certainly getting a bigger bang for your buck, or some are more vulnerable than others.\nOnly thing I wanted to say is that if we could move number nine, restoring funding for starving, program, maintenance and building maintenance from nature move it above seven, because I understand social services.\nA lot of important issues, But I feel like NYCHA, is really lacking staff right now, And they have such a big population in our community.\nI do not prepare it, but in order to make it easier, you know to give the exec committee a draft collated list to have something to work.\nThe slate of human services budget priorities, because I think that program, in particular, is quite heavily used by a number of the small businesses and economic development is certainly.\nI know we want to insert stuff above that, but the more we insert stuff above that moves it down a list, but if we could just keep it in that particular space, I won't push the other items which are important because they include recreation programs for kids and tree pruning, but, I think.\nI thought Jackie had suggested, swapping taking out tree pruning and stump removal and putting in land used to, but maybe I miss, I think he just wanted to move land use.\nSo the two committees that have items on this that need to move are health and human services and transportation.\nYou know made a request and if you ever go to those cec meetings, They have already submitted these ask to the school construction authority and none of it has been funded Yet I mean working with the schools more.\nI understand the school's need and in a Covid-19 environment that cooling systems are going to be critical if they're not already funded, but I just want to make sure that we understand what we're looking at from the human services or this ranking from for the schools.\nThe I like the way what Susan had said that you know, if you're definitely not planning to take a vote.\nIn the park, or you know, and in the course of discussion you know the committee wants to take an action Or and therefore it requires a vote.\nI think we need to be very careful about our wording in our agenda and that primarily has to do with the public, because a lot of the stuff we do is informational and they may not attend because and then they find that there was a vote.\nIf, we're going to vote on something and perhaps They say possible vote or an asterisk, but if it's for informational, purposes, I would never take that to mean a vote unless it's a timely thing, because there are instances where they've come And they've, given us a presentation and they do not need a resolution, but there might be something controversial about it.\nSo when I'm working with the chairs that we know what to put Jackie Yes, I kind of agree with trevor on that as well, because if we are taking a vote on something, I just wanted to be extremely careful about.\nNew information comes up that is very timely and that there is need for a quick action, and that saying just next month, there'll be a vote.\nThere was a chinese language reporter who said she would come You know we did work really hard to make sure that I mean it took some doing."
        }
    }
}