{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB2",
            "channelId": "https://www.youtube.com/channel/UCxPAYgO8OpFev3PUTKbsxNw",
            "title": "2020.10.28 - CB2 Youth",
            "publishDate": "2020-10-30",
            "shortDescription": "Brooklyn Community Board 2 (CB2)\\nYouth, Education \\u0026 Cultural Affairs (YECA) Committee\\nWednesday, October 28, 2020 // 6:00pm\\nremote via Webex\\n\\n00:00:00 - Welcome \\u0026 Process\\n00:01:00 - Roll Call \\u0026 Introductions\\n00:03:11 - Approval: Agenda\\n\\n00:03:20 - Presentation \\u0026 Discussion: Brooklyn Public Library District updates\\n\\n00:54:07 - Chair's Report\\n\\n00:58:45 - Discussion: Columbus Park statue\\n\\n01:10:27 - Community Forum\\n01:12:05 - Approval: September 2020 Committee Minutes\\n01:12:40 - Other Business\\n01:12:49 - Motion to Adjourn",
            "lengthSeconds": "1:13:41"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB2",
            "normalizedName": "Brooklyn Community Board 2",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "twitterHandle": null,
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "zJ9sGAHImkk",
            "fillerWordCount": {
                "uh": 195,
                "um": 525
            },
            "readTimeFullTranscript": "35 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "library": 49,
                "space": 40,
                "project": 22,
                "center": 16,
                "heights": 15,
                "branch": 14,
                "work": 14,
                "building": 12,
                "schools": 12,
                "history": 11
            },
            "wordCountSummary": {
                "library": 13,
                "space": 10,
                "center": 5,
                "project": 5,
                "heights": 5,
                "work": 5,
                "branch": 4,
                "conference": 4,
                "room": 4,
                "neighborhood": 4
            },
            "fullTranscript": "So this is a meeting of the youth education, cultural affairs of Brooklyn CB2 and it's being recorded for public access and it'll, be on the CB2 YouTube archive and according to the open meetings, we conduct remote meetings with the members cameras on and we encourage public attendees to leave their cameras on, especially if you will be speaking and if you can keep your microphones muted when you're, not speaking. That would be great and we'll make it known when topics are open for comments by community members by committee members and so on, you're encouraged to use the chat and we're committed to access for everyone. Okay, so my note says the committee secretary will conduct a roll call, but I'm just going to suggest that the chair, the coach here the secretary introduced himself and then everybody else, hypothetically so figure out where your name is alphabetically by your first name. Okay, so I wish I'm the chair of this committee and my co- chair. I knew it yourself: Dorothea Thompson manning coach here committee, great welcome and meredith good evening. Everyone I'm Meredith phillips, Almeida, Community, Board, member and Committee member secretary now alphabetical order, I'm guessing I'm next, I think good evening everybody nicholas Ferreira, Comedian, Hey, Nick, welcome and only one after M. That's why hey Oscar? Are you there hi, I'm here, Oscar, Luckett, Committee and Board member, oh, and I see Mr Sproul has joined us, so I'm here and I'm here and I'm a board member and committee member in Glenda been able to get on yeah and we're very happy to see you. We have not seen you for a while. So we're glad you're here and well. So that's great and we have another committee, member santia, thank you and I say you're wearing the voting bed. You voted. Yes, all right. Okay, so now we introduced the members. You saw the agenda in your email. Is there an approval of gender by consensus? Great okay, so the next? The main part of our meeting tonight is the presentation by the Brooklyn public library. We've been looking forward to hearing about the new implementation of the new projects and then, after the presentation. First, the members will have a chance to ask questions and then members of the public, so we're excited that you're here, please present great well thanks thanks for having us and good to see a number of you again and I'm good to meet the ones we have not before my name is David Wallach, I'm the executive vice president for external affairs for Brooklyn public library. I have a number of my colleagues here as well, including a number of the branch librarians kat, savage from our John Street Annex and Janet cotton from Walt Whitman and Tracy Mantrone from the Clinton hill branch, and there are a few other folks as well, including Sonia Covington, who runs our capital planning and maybe weighing in later on, when we get into describing some of the capital projects going on in the district good evening. Everybody, but first I just want to take a step back before talking about those projects and just talk a little bit about where we are as a system right now given what's been happening over the past nine months. So we closed our doors on on March 16th and stayed closed through mid- July, and at that point we began to gradually open some of our branches for grab and go service. We've also referred been referring to that as lobby's lobby service patrons are able to return books and pick up books that they put on hold, checking out the materials using our self- check machines or using their using our app on their phones, and that's pretty much- that's been it so we've been able to offer arguably our core service, but there's so much that goes that goes on in our branches that we have not been able to to do yet. So this is this has been and will continue to be, a very gradual process to bring our branches branches back to life. Right now we have 24 of our 60 locations that are open for for grab and go. We expect that number to go up over time and also gradually to begin to offer more services in in our in our libraries. But it's it's going to take some time to get there of those 24. We have two branches that are in community board, two that are providing lobby service, the Annex and the Walt Whitman Branch in in Fort Greene, both of which opened in Mid- September. So I think part of the challenge for us over the past nine months, given the limitations on what we can do in our buildings has been to pivot and provide new ways of offering services and expand on the the tools that we have. So we really turned our attention to virtual programming and here's an array of some of the things that we've been. We we've been doing. We've been doing a lot of story times on Facebook live Kat. Savage in particular has been one of our stars, but we have a lot of stars throughout the system and we're doing about 10 a week, librarians for branches all over the borough and we've actually been attracting more folks through the virtual story times than we were able to to bring into our in- person story times pre- pandemic, and similarly, we've been doing. We've been able to do a lot of other things, ranging from tutoring services through a service called brain fuse, resume and job search, assistance and cultural programs, including through our new center for Brooklyn history, which I'll talk a little bit more about in a bit and some new exciting projects, one of which is on the screen, is the David 28 yeah. I think there might be a problem with you sharing. I think it you have. You have a maturity. If you need help, I can I can share oh huh, okay, let's see if it go ahead and choose share in the upper left hand, corner and then choose share content. Let's see just give me a minute great, oh, no! We're actually looking at your desktop right now, not at the side content there. It is all right that should do it. So, let's go back a bit because I just want to show you what we missed. So first of all, I want to show off our branch, our branch, librarians cat, Janet and tracy and turn to the map. So again, here are the two locations where we've started Grab and go service, John Street at the Annex and the Walt Whitman branch, and so here's the slide I was just referring to, which shows some of our virtual programs. So now, like my comment about cat, probably makes a little more sense. You can see here in the middle of the screen and we basically, wherever we can, we've been trying to make as many of our services available online using zoom for cultural programs again using facetime live for story times, providing things like resume help and job search assistants over over over email, and I think where I was before the point where we could see the slides was mentioning the 28th amendment project, which is a project we've been conducting largely via community zoom meetings about three dozen of them over the course of the past nine months, where we've been getting feedback from folks all over the borough and what they'd like to see in a 28th amendment to the constitution which we've compiled and have made it available to folks for to consid, to continue to wait and weigh in on another project that we've been able to do not virtual, but just one I wanted to mention, because it relates to Community Board 2.. We for the first time started a poet in residence program and Cyrile. Gerald Johnson, who was our first poet in residence, is a professor at is a professor at pratt. So we're glad to glad to have him on board the challenge with the with the virtual programming as successful as it's been. Is it's really unmasked, this ongoing challenge of the digital divide? So it's you know. The availability of all these services has worked well for people who who have computers, who have broadband access and it does not. It does not work for those who who do not. We've been trying to do our part to help bridge that divide. We've left the Wi- fi on in our libraries and we're beginning to try to expand the reach of that Wi- fi, so more people in the neighborhood can have can have easy access to it. So that's sort of an overview of where we're at as a system right now- and you know, as I said before, we're going to keep building on that. But as long as the pandemic is here, we're going to be constrained for making full use of our buildings, at least in the in the short term. So I'm going to turn now to the capital projects that we have going on in the district, and before doing that, I just wanted to take a step back. We probably have more going on in community board 2 now from a capital perspective than we've ever had at any point in any community board in the borough. That said it all. Those projects are part of a very robust capital program that has grown tremendously over the past five years. Part of that is due to the Brooklyn heights project, which we'll talk about in the revenue that it's brought in part of it, I think, reflects an increase in funding from other Gov government sources. But the upshot is we're doing a lot of work around around the borough, but there is nowhere that we have as much going on as community board two and it's one of the reasons why we're really glad to be here tonight to give you an update on all these all these projects. So we're going to talk about, go back, we're going to talk about the Brooklyn heights project and then two projects that relate to the Brooklyn heights project. You know and I'll explain those connections, the Adam Street Library and the the Wall Whitman Branch and we'll also give you an update on the sorry. The screen keeps jumping on the our piece of the south side project at 10, lafayette and the last one. That's not on the screen that I'll touch on is our newly created center for Brooklyn history. I believe Heather Mallon, who is running the center, who came to us from the Brooklyn historical society, is also joining us this evening, but let's start with Brooklyn heights, so just to sort of refresh everybody's memory. Th. This project involved the city selling the site of our old Brooklyn heights library on cabin Plaza West, which netted us 52 million dollars and the core and shell of a new library at the base of the Condo tower. That's gone up in that location. That's now called one Clinton street, so we are getting a a brand new library, we'll walk you through the latest design. It is the library is now in construction, and we will be opening the new branch in summer 2021 next summer. The project also brought in revenue that we're able to apply and we've begun to apply to other library construction projects around the borough. It also the building also includes a stem lab for DOE and created 114 units of affordable housing in Clinton hill, which I'll come back to come back to in a bit so on. The screen is the layout of the first floor of the library and so just to orient you, you see cabin Plaza west at the top of the screen Clinton street on the other side of the building, the the residential tower. The entrance is here on Clinton street, and so this gray part is the the as part of the part of the residential portion of the tower and this yellow and then into the green over. Here is the first floor of our library and I'll. Show you renderings in a bit, so you can see what these look like. Let me go back jump the head too quickly, but the green is the main hall of the library which cut cuts through from cabinet Plaza west, all the way to Clinton street here's the entrance and then over here on the north side of the building in the pr the prowl is a is a a reading room. My laptop keeps wanting to. I guess it's reminding me to try to go quicker I'll, try to I'll try to do that, so that went too quick. So here is a view of the main reading room from Cadman, Plaza, West and there's this circular welcome desk at the front, and you can see the middle of the reading. Room has bookshelves and places to sit and work and, on the other end, a budding Clinton street is a reading circle. Where we'll be able to have smaller programs. Author talks, but when it's not being used for programs, people will be able to use the space more informally, as you can. As you can see here, and then this is the prowl of the of the of the building which we're setting up as a as a quiet. Reading space, obviously it has light coming in from from both sides and then jumping up in the mezzanine space of the building is a teen area. So you can see here, there's a small conference room in the middle, some casual seating right in front of it and then there's the sort of mezzadine itself, with books on books on one side and would just go back what you can't see. What would be a little would be on. The left. Side is a another room for for four teens and then I'm going to jump to the lower level where you can see the stairs coming in from the first floor, leading down here to the entrance of the children's area, and this is what you'll see when you come further in this- is the latest rendering we have at the children's area. This design has changed. There is going to be less of this sort of platform space for children to sit on and more tables and chairs, and the in the revised revised design. I do not have a rendering of it here, but on the other side of the lower level is a large 200 person, plus multi multi, multi- purpose room and that's the the slides I wanted to show today, knowing that we have some other locations to talk about, but for those that are interested on our website are some of some of the other renderings we have which show some of the other spaces and give you some other views, but before moving on from the Brooklyn heights design one other piece I wanted to touch on and Betty. I know you were interested in this one connection between the old Brooklyn heights library and the new are the Bob Reliefs that adorn the old entrance of the of the of the of the previous branch. We made a commitment to to keep those and find a good use for them. They're. If everybody recalls there were, there were six groups of these panels. Two of those groups are going to be placed in I'm going to jump back for a second are going to be placed in two small conference rooms, one that is off of the main hall over here with a view of Clinton street and then right above. That is a second conference room on the mezzanine, and so each of those conference rooms are going to have one set of the bar reliefs that are going to be visible from the street and the other mile reliefs are going to be placed at Walt Whitman, and I will come to that in in a few minutes. So the last piece of broken heights that I wanted to talk about is the affordable housing. This is not our portion of the project, but we've always been excited about this. It's one of the nice benefits for the borough and the community board coming from the project. These buildings are up, the the apartments are done, they look, they look. Terrific- and I know Hudson is in the in the process of allowing some of the fortunate people among the thousands that have asked for those spots to to get apartments, so those are to be occupied are going to be occupied soon. So I'm now going to jump to another project that relates to Brooklyn heights, the Adam Street library. So we until now have never had a branch in the Dumbo vinegar hill area when we went through the euler process and were in discussions with councilman levin about the approval for the Brooklyn heights project, and there was a lot of talk about the size of the library we committed to making the Brooklyn heights library twenty six thousand square feet, far away the largest branch library in our system and then beyond that made a commitment that we would build a a small library in Dumbo, vinegar hill. We found a great location at on Adams Street. The address is also 3535 plymouth. So it's on adams between Plymouth and John, a multi- use, building. Here's the Exterior plan for the exterior signage that was just approved by the Landmarks Commission and one of the neat things about this project was you know we had a much shorter time period to really begin to not only build the library space from the from the from the ground up within that building, but really start to build a library community that used not to exist. So we had a great engagement process over the course of 2019 and the other sort of nice opportunity that arose was when the Brooklyn children's museum moved out of their space and Dumbo Brooklyn bridge park made it available to us essentially for free, so we're in temporary space on John Street. It's not was not quite a full library but allowed us to get our feet wet and has given cat and her team a chance to start to build up relationships with stakeholders in the neighborhood and to begin to provide some library, some library services, just a quick overview of what that space is going to look like the core of it. After you walk in here, there's some teen space here and then a raised platform with the children's area, which includes stroller parking underneath there's the adult reading room on sort of the waterfront side of the space and then also our great architects here, work ac, managed to squeeze in a multi- purpose, room and another small conference room so like the Brooklyn heights design. We're really excited about this one and looking forward to opening both spaces in in summer 21., okay. So what women I mentioned, how the other bar reliefs are going to come to Walt Whitman right now. Walt Whitman does not have sort of functional outdoor space as part of this rehabilitation project we're going to be building a new outdoor garden and that's where the bar reliefs will be placed and we're also going to be upgrading the infrastructure and make making improvements to the interior space janet and her team at Walt. Whitman have done a great job in this. It's a it's a Carnegie library that, in some ways you know, looks really nice on the outside. But I think the inside leaves a lot leaves a lot to be desired. The downstairs space in particular there's a lot of underutilized space so as part of this project, we're going to be able to take some old mechanical space and turn it into programmatic space, so we'll effectively be able to make the pub the space that's serving the public larger as part of this project, as well as an overall interior rehab and an upgrade to the infrastructure. The lion's share this funding is coming from the Brooklyn heights revenue, there's also a portion that we were able to get to apply to the interior work with, with the help of a lot of the community stakeholders who weighed in on the downtown revitalization funding funding process. So we got one 1.2 million from the state through that program that we were able to to apply to this project on the other side of Fort Greene. We also were given yet another opportunity, essentially leaving aside the build out of the project free space that we're getting as part of the L-10 cultural condo, which has been essentially a partnership between two trees and and the city. I can't speak to the overall project, but I can tell you about: are our piece of it, so the all the cultural space in the building there's about 50,000 square feet, we're getting 2,700 square feet which is small for a library, but I think we're going to make particularly good use out of it here. So it's going to be a branch. It's going to be a bpl library. In some ways it's going to be open to the public, there's going to be space for people to come in and use there'll be Wi-, fi, there's a small collection, but it's really going to be a special space geared towards its location, with a focus on the arts and the cultural happenings in the neighborhood and around the borough. It's going to have a small collection focused on focused on the arts. That will we expect to revolve and, to some extent, tie into what's going on in in the cultural, in the cultural district it it's itself, so we're excited to bring a new library to the neighborhood and also I'm excited to provide a space. That's particularly tied into the cultural community, our work, our construction work has started. It will get done in 2021, but the space itself is expected to open in 2022 here's sort of a wider shot of what the bpl Vpl space is is going to look like and before opening it up to questions. I just want to touch on the newest addition to be btl, which is the center for Brooklyn history. We recently merged with the Brooklyn historical society and pulled together the historical society with our own Brooklyn collection, that combined entity at the center for Brooklyn history is going to continue to be housed at 128 pierpont, and it's a it's a beautiful building. It's a little ironic that we've taken in this new entity that has a library, that's arguably more beautiful than any- of the libraries, the other libraries in our system, but we're really we're happy to to have this. This have created this new entity. I guess two primary goals. One is to continue the great work that this historical society had been doing, both in terms of Ex exhibitions and the education work that they do in the programming work that they do and the great work that our Brooklyn collection has been has been doing, and also to begin to have the center leverage, the library system so to create a better connection between the neighborhoods around the borough, bring the work that's happening at the center to the branch libraries in terms of those programs in term terms of those exhibitions. So we're really we're really excited about this new part of who we are one last note on the center for Brooklyn history, and it's here upon Pierpont Street building we are, we have we have closed the the temporary branch on Ramson Street, which was not suited towards grab grab- and- go grab-, and- go lobby service, but before the end of the year, we'll be opening grab- and- go service for Brooklyn heights at the center for Brooklyn history, low location and wanted to. Let you wonder when you know that, so I know that probably took way too long and I went past my ten minutes, but we had a lot of ground to cover. You know I said this before, but it sort of bears repeating. This is really an exciting array of projects for us and I think part of what we've done over the past few years is leverage some opportunities that came our way tried to think creatively about them. We still have a ways to go. We still have some new libraries to open next year and we have some other ones that are going to follow in the years after that, but we hope we're well on our way towards a really special set of libraries for this for this or this part of the borough. Thank you so much. That was an excellent presentation. I myself grew up in the padaga library, not in this neighborhood, but somewhere out in Brooklyn and Central. So first I would like to open the conversation of the questions to the members of my committee. Is there anyone on our committee who would like to offer a question raise your hand or good evening? Yes, I just quickly. I was wondering if there was any specifics available on the stem program, any updates on that. I think last time there was not much to share so just curious if there were any specifics, there's an arrow on his screen, so maybe there's some technical difficulties. Okay, yeah, I see a circle on his screen. It does appear that Mr Wallace is having some technical separation. Oh nope he's back he's just muted David, you're, muted, okay. So I'm back, I do not know what happened to the to the presentation. It looks like it disappeared, but I'm glad to be back yeah happy to happy to take happy to take any questions. Yeah, so Nick asked about for any updates on the stem program. That was a collaboration with the department of education that was going to be coming to the Clinton street building yeah. So I we've heard from the Department of Education- and I know that the district is is you know they obviously have they have their hands full on many fronts, but they're they're. I guess refocused on that space. The school construction Authority, really early in the process about four years ago, had come up with a design, so I'm not sure of the latest schedule from them and if the stem space is going to be ready before the library is or after, but I will say that we we've raised with DOE the the the issue that when they do open up, there's an enormous opportunity for us to collaborate with them. And you know we have begun a a terrific program around robotics around the borough that we love to be able to work with them on so we've. I guess initiated that dialogue with the oe. I think it will have to be a question for them in terms of what their what their schedule is, but I think when they, when they do open, it's going to be an exciting opportunity for collaboration. Thank you and Santia has a question just really a statement. I'm a little disappointed that the stone all of the stone walls could not be incorporated in this okay site location, but I I'm excited about the branch opening up because on the outside, it looks beautiful. Thank you. Thank you anyone else from our committee. Let me scroll and see Oscar hear me, okay. My question is similar to Nyx, I'm wondering about what specific new programming will come out of the center for Brooklyn history in conjunction with the Brooklyn public library that did not exist before so, if Heather is here and I'm not sure if she is or not, okay, I'm assuming the silence means heather's, other others, not here. So, as I alluded to alluded to earlier, and this oscar, this may not answer your question in terms of specifics, I'm happy to come back to you with some of the I some of the ideas that are that are brewing, but I think the a fundamental goal is to develop programs that are going to be geared towards neighborhoods all over the borough, and you know I'll gi I'll. Give you give you one example, which is something we're starting to think about in East, New York, where we're going to be building a new library. We've received funding from the council member there to include in that new space, a heritage center that will focus on the african burial ground. That's under that location, so here's an opportunity for us to tap into the expertise of both the staff at the Brooklyn collection and the new staff coming from the center for Brooklyn history to work with us and work with the the East New York neighborhood around the new lots library, as we figure out how to how to incorporate that space in the new library there. So just one example that comes to mind of us sort of integrating the expertise of the center for Brooklyn history, with the what's going on in the library around the borough. As for some of the specific programs, we can probably best if we re report back to you with some of what we're starting to plan this year. This planning has just sort of gotten underway and I think, over the next couple months, we'll be pulling some of those new ideas together. Thank you any other questions from committee members. Well, this is eric. I have my hand up: okay, Mr Sproul, yeah you're on okay, I'd like to say that I'm a little disappointed at what I am going to refer to as the library by the Brooklyn academy of music, which you're calling the south side or whatever I thought it was going to be more comprehensive, like the arts library at Lincoln Center. That being said, I'm a musician and when I've needed sheet music, what I've done is I've gone to the central Library Grand Army Plaza, going to the top floor and availed myself of the of the sheet music election that you have up there and made copies, and it's is it's eliminated, a tremendous expense in terms of buying that kind of music. Is that sheep? Is that the feature still going to be at the central library? Or will it be at the library at Bam yeah? It's a good! It's a it's a it's, a good question that that's going to remain at the at the at the center central library. Our space at Bam, as I mentioned, is 2700 square feet, not not a whole lot of space to work with. So I think it would be. It would be tough to bring the whole sheet music collection over but Eric. It's an interesting certain raises an interesting question. If there is some way to incorporate a portion of that in a work in a way, that's going to be useful for people at at the south side space. So it's I do not think it's necessarily out of the out of the question, but I do not think we could accommodate the whole sheet music collection, and so then I think that the challenge is there something smaller, that we could do that's going to be of use used to people. If that's you know, sort of in a separate place from what remains at at central. So I'm not sure that can happen, but we still are a ways away from filling out figuring out what exactly is going to be be on the shelf? So it's something we could we can take under consideration. Okay, thank you. Anyone else from our committee, Miss, Darth Vader. Do you have any questions or comments? Dorothea, she's new! I do not know if she has any questions. Can I just ask a quick follow- up so who's speaking just again ask a follow- up question about the stem center program. I'm curious. If any conversations have happened and or you will happen- around equity access and you know and you're seeing it with who can already access programming. So I'm just wondering if you know if schools that are not right around that library area could would or could be prioritized as likely. You know, schools right around. There probably do not have a stem access and programming issue, whereas other schools within this area certainly do so just curious if any equity conversations have happened so just to be clear, so the stem space is not is not out our space. So it's it's great. It's great that it's that it's that it's going to be there, we're happy that it's going to be there and, as I said, I think there are going to be some interesting opportunities for collaboration. I think the decision on how that space gets used is going to be up to the up to the DOE. I you know my we have been put in touch with with that school district, so I think our expectation is that it's going to be largely used by schools in the school district, but it's really more of a question for for for d.o.e, but just sort of piggybacking. On your question, I do think that there's a there's a, maybe a related question for us when you know, as I said, this is going to be the largest. This will be the largest branch library in the system. You know outside of the central library and we're excited we're excited to serve the neighborhood. We are going to have this great, this great, really unprecedented teen space on the mezzanine, and we do want to be welcoming to any teenagers who want to come to use it and I think, there's some proactive work. We can do with schools and particularly schools. You know most in need- and I do think this gets to the question of when we open these great new libraries and we're going to have a bunch of them we're going to be opening Adam street, we're going to be opening Brooklyn heights and then later on a revitalized Walt whitman we're going to have the new south side space and it you know it does get at when we open a new space casting a wide net to let people know about it, and you know particularly folks who need us. Nina's need us most, and you know with it's been particularly interesting with Adam Street, where again we're sort of creating the library community, starting at the beginning and cat, and her team have been talking to lots of stakeholders in the neighborhood. We've been very focused on Farragut houses in particular, so I think that's sort of a real, a really important part for us when we open new spaces, it's not just building them but making sure that we're doing what we can to communicate with people who can really use them and need them. Thank you. I think, based on Nick's question this conversation and a previous meeting, it might be very helpful for our committee to follow up with the district to find out what their plan is in the stem space and to find out their opportunities for partnership or collaboration with us, Ms Thompson Manny. Did you have any question or comment for the library, but no I I did not have. I do not have any questions. Okay, just so everyone knows my for some reason. Even though I've been charging my device, mine is a little wonky and if I fade out, I'm going to try to get back on another device. My apologies, so thank you very much for that presentation. Very briefly, are there comments or very brief comments or questions from the audience, the public for the library? Do we see anyone with a raised hand or starting to speak? Welcome to our committee hi? Absolutely. I have a quick question for David. Are the contents, the current contents of the Brooklyn collection of the main library and grant Army Plaza? Are they remaining intact? There are any of them being moved to the new Brooklyn center to the historical society, so every everything that we have in the in the Brooklyn collection is ultimately going to get moved to the to the to the to the center for for Brooklyn history. Good- and you know, as some of you may know, we're also embarked on a a large renovation project at the central library and that space, that's out that had been occupied by the Brooklyn collection is now space that we can factor in factor into into that project. Okay, thank you. Thank you. Okay, I'd like to move the agenda on to the chairs report. I have a few brief announcements and then I'll turn this over to Dorothea Thompson manning, who will lead us in a discussion about a future meeting that might be planned. So there was a borough budget consultation with the Department of Ed and School that Mr Perez sent me some notes on and, as we know, from reading the media, there's a decrease in tax revenue, they're waiting for state and federal funding, there's a hiring freeze in schools and central office and central office budget cuts they've had to spend more money on not only the technology but the cleaning material, the PPE and so on. So there's a significant budget problem. Let's see what else and the suggestion was the community boards can advocate for budget restoration and partner with schools. So if we know of specific schools to get rezo a funding, so that's a specific grant, let's say for a library or a playground that type of thing and funding from the city council. So we can encourage schools to follow up in that way, and we did include an artistic statement, the need for not only for the technology that the students are using at home, but for the Wi- fi, the broadband access and so on. That's very important for the equity of education. Okay, I attended the district 15, participatory action, relay participatory action or par report at the cec meeting. We heard from Maddie Fox about her program a few months ago and they've been doing a lot of outreach and speaking to parents about what they want visually rezoning or having more of an open application. Lottery and they'll be reporting out in the middle of November. It's important that the parents who will be applying for kindergarten for next September that they know if they have a zoned school or if they're, going to be applying in a lottery. The superintendent of district 15 was very pleased that the district won a two- year grant to support efforts in integration. It's over two million dollars to be spent over two years. It's not for specific teachers in specific schools, but rather to support staff, education, parent workshops, libraries that will promote culturally responsive education and equity and we'll be hearing more about that, and we expect to be hearing soon from district 13 because they also applied for this grant at the district 15 meeting. There was another point that was raised, which was about this scanning of students. In some of the schools, that's where the students go through similar to airports and other public buildings and there's a concern because of equity issues that they're in some neighborhoods and not in others, and it adversely affects students of color but also because of Covid-19, and the students have to line up pretty closely to go through scanning that there's a lot of concern, so they anticipate having a town hall meeting and some media advocacy for the removal of scanning. So that's something of interest. It occurs throughout the city of course, but that's something they are taking up. So there any questions to me about that, and then I'll turn this over to Dorothea. No okay. If there are no questions, Dorothy Thompson manning will an issue and hold a conversation. Thank you. Dorothea hi, everyone, I'm hoping that my battery does not go dead. That's why I was off for a while trying to plug up my ipad. I want to talk to you about something that has been brought to the Cultural Affairs Committee's attention that was first reported on at transportation and public service public service, and they decided that maybe it would be good for our community. Also when I explained to you what it's about we're going to make a decision as to whether or not this is something that we as a committee would like to undertake, and if so, we would be having a joint meeting with parks. I believe the date is December 7th. So now I'll tell you what it's about there is an organization called take down, Columbus NYC and their concern with the statue of Christopher Columbus, that's in serious locations in the city. One of the things they talked about was that the stats statute is located on park property and they would like to see about having these statues removed. The people involved would take down to Columbus. They are community members with backgrounds in Social work, Mental, health and education and most of the members of high school students high school teachers in Brooklyn, and they conduct weekly teach- ins at local statues of Christopher Columbus to educate people about the full history of his legacy. So, while conducting those things they found out, every Columbus statue has 247 police department, sometimes the base salary for New York, City police officers between forty two thousand and eighty five thousand. So their estimate is that the cost is between fourteen thousand to twenty eight thousand a month to protect the statutes and they're saying that the statues also pull officers away from doing other work in the neighborhood. So what they're saying is they we're talking about this committee? Is that they would like to see the statues are removed because they feel that they're offensive and also because of how costly they are. So what they will they want to do is address our committee, along with the Parks Committee, and that would be December the 7th. What I'd like to know from the the members of our committee is whether or not you think this is something that we should undertake and if so, then we would have a vote on whether or not we would be meeting with the Parks committee in December I'll try to answer as many questions as I can. You see I'm reading from my notes, because I'm not that familiar with the group but I'll try to answer whatever I can. If anyone has any questions, I'm sorry I moved in my call. This is Eric. I have a question. I work at the kings, County clerk's office, which is in the building, that is, that houses Brooklyn Supreme Court the park surrounding the court. It's called Columbus park and in front of the Supreme Court building is a large statue of Christopher Columbus on a pedestal. I'd say it's about two and a half stories. Maybe three stories high. So my question is this one of the statues that they want to remove? This is that's the first question. The second question is: would they want to change the name of the park? That's the second question, and the third thing is an observation. The observation is, I have not seen that many that that much police activity in terms of protecting the statue, in particular in Columbus park, there's a puts for some reason. There's a lot of teenagers who like to go behind borough hall and skateboard. The the the borough president has put up signs saying no skateboarding, yet the teenage skateboard at will- and I do not see any police coming around to stop stops, stop them from doing so. If they're, not policing that activity, I do not see how they could be policing or protecting this statue, so I do not know of any other places around the world that has a statue of of Christopher Columbus, but I do not see any police presence there. So again. My question is this one of the statues that they would want to remove, and would they want to change the name of the park? I'm going to answer what I have in front of me. They would like to address CB2 about the Columbus statue created by Ms devins, located in Columbus park in front of the NY New York City Supreme Court, building in downtown Brooklyn. So I'm sorry Dorothea you got you broke off. I did not hear you because the call came in and I declined it. So could you repeat that I'm sorry, one of the answers to one of your questions, one of the statues they would like to address CB2 about- is the Columbus statue created by emma Stevens, located in Columbus park in front of the New York State Supreme Court, building in downtown Brooklyn. So one of your questions is jess, that's one of the ones they would like to address. I can not tell you about whether or not there is any police presence, I'm just reporting on what this committee says is going on. I have no knowledge of that. There is nothing else. Also that says whether or not they want to change names. Their main focus seems to be to remove the statues where they, if they remove them. I do not know what would happen to them. That is their focus. Thank you any other questions. Nothing. You see nothing Betty. I do not see anything okay, so right now, I'd like to know, I'm not sure how we would go about doing this. Maybe we can do a show of hands or whatever is this something that the Youth committee would like to undertake? Is this something that we would like to address about the removal of the Christopher Columbus statues and it would come to us only because of the cultural aspects. So is there a way we can pull our committee members Betty to find out yeah, I believe Nick has left, I'm not sure if Meredith is still here, so I think we can just call each person's name and ask so the question is not whether we want to remove this whether we want to engage in this conversation with the Parks Department, I mean the Pitfalls Committee, I'm sorry, the Parks Committee and the group who's advocating in terms of that work. Youth, Education, Cultural affairs, statues are cultural affairs. Do we want to engage with this, so Mr Sproul, yes, window, sure, let's engage in it. Okay, myself I'll, say sure. Let's engage in it unless Manny Thompson manning, I'm going to say no okay, I think Nick has left Meredith. Are you there? Yes, I say yes, you say yes, I say ask: what do you say? I vote yes to engage in this conversation. Yes, okay and santiago. Yes, okay! So that's one, two, three, four, five, six, seven! So six, no nick was so six of us. Nick was not there. So it's five, two five and two one two zero. So it says is anyone else on our committee that I did not get your vote? No okay. So it sounds like we want to engage in this conversation right. So thank you, Betty Betty. I think the next thing is whether or not we're going to take a motion that we're going to be meeting with the pause committee. December 7th. Do we have to do that or we're just going to be included in their meeting? We were asked by the board office to discuss it and what do we have and I think we want to discuss it. So if we're discussing it, it's at that. That's the meeting. Okay, that was my understanding taya. Is that your understanding? That's exactly correct? Okay, so that means based on the number of replies that we get, that we will be attending that meeting with the parks department, December 7th, the president's committee yeah, absolutely yes, yeah good! Thank you just to be clear that would replace your late December meeting right. Well, maybe our late November, because we have a meeting before Thanksgiving and a Christmas time meeting, so it will replace one of our meetings, one of our meetings, because we had talked it also in the past about teen food justice and if that's something that the health committee wants to meet about, we met with them last year and if we can get the teens to speak about the food justice and the growing food in the classroom that could be with the health department, I'm in the health committee, I'm sorry another time so yeah. So thank you for getting in this conversation. So I think the next thing is the community forum and I think sonya from the ccrb wants to speak richie. Yes, I am- and I just muted myself. Thank you. So much I just love a quick announcement, so the Youth Advisory Council is now accepting applications and they're due November 30th, so the youth can feel free to apply. If there's anyone with questions, they can either call or text me or feel free to shoot me an email, but I can repost that information once again in the chat so that everyone has it since our young person, our youth Representative Oscar, is here Oscar. Do you have any questions about that so because you would be maybe telling some in your school about this opportunity. So do you have any questions about this opportunity? I do not know at the moment, but you know I'll probably do a little bit more research on my own and pass it along. Even if I'm not joining. No, I we we're just asking you know, since you know, probably a lot more young people than some of us do yeah. Thank you, okay! Is there anyone else for a community forum? I know our librarians are here. We heard a lot from the library and I'm sure your branches are doing as well as you can under the conditions. Okay, are there any anybody else for community forum, okay? So the next thing is the approval of the minutes from our September meeting. They were sent digitally. Were there any comments or concerns about those minutes? Okay, so hearing none. Can we say that the minutes are approved by consensus? Okay, thank you. Thank you. Okay. Is there any other business to come before the boy? No, we have do. We have a motion to return moves to Adjourn and a second. I second santiago. Thank you. So much and we'll see you all soon and be well read books if you can from the library and stay well, everyone yeah, I'm excited that Eric's Bro came back because we have not seen you for a while Mr Sproul. Yes, I am too I'm glad that the technical difficulties that I have been saddled with have been somewhat taken care of good and I'm glad everyone seeing everyone's faces so nice to see you Mr school, okay,.",
            "summary": "I have a number of my colleagues here as well, including a number of the branch librarians kat, savage from our John Street Annex and Janet cotton from Walt Whitman and Tracy Mantrone from the Clinton hill branch, and there are a few other folks as well, including Sonia Covington, who runs our capital planning and maybe weighing in later on, when we get into describing some of the capital projects going on in the district.\nWe've been able to do a lot of other things, ranging from tutoring services through a service called brain fuse, resume and job search, assistance and cultural programs, including through our new center for Brooklyn history, which I'll talk a little bit more about in a bit and some new, exciting projects, one of which is on the screen, is the David 28 So first of all, I want to show off our branch, our branch, librarians, cat, Janet and tracy, and turn to the map.\nThink where I was before the point where we could see the slides was mentioning the 28th amendment project, which is a project we've been conducting largely via community zoom meetings About three dozen of them over the course of the past nine months, where we've been getting feedback from folks all over the borough and what they'd like to see in a 28th amendment to the constitution which we've compiled and have made it available to folks for to consid, to continue to wait and weigh in on another project that we've been able to do not virtual, but just one I wanted to mention, because it relates to Community Board 2.\nThis project involved the city selling the site of our old Brooklyn heights library on cabin Plaza West, which netted us 52 million dollars and the core and shell of a new library at the base of the Condo tower.\nYou were interested in this one connection between the old Brooklyn heights library and the new I'm, going to jump back for a second Are going to be placed in two small conference, rooms, one that is off of the main hall over here with a view of Clinton street and That is a second conference room on the mezzanine, and so each of those conference rooms are going to have one set of the bar reliefs that are going to be visible from the street and the other mile reliefs are going to be placed at Walt, Whitman, and I will come to that in in a few minutes.\nSo I'm, now going to jump to another project that relates to Brooklyn heights, the Adam Street library.\nIt's not was not quite a full library but allowed us to get our feet wet and has given cat and her team a chance to start to build up relationships with stakeholders in the neighborhood and to begin to provide some library, some library services, just a quick overview of what that space is going to look like the core of it.\nThere's some teen space here And, then a raised platform with the children's area, which includes stroller parking, Underneath, there's the adult reading room on sort of the waterfront side of the space and then also our great architects, here, work, ac, managed to squeeze in a multi- purpose, room and another small conference room So like the Brooklyn heights.\nIt's going to be open to the public, there's going to be space for people to come in and use there'll be Wi, fi,, there's a small collection, but it's really going to be a special space geared towards its location, with a focus on the arts and the cultural happenings in the neighborhood and around the borough.\nWill we expect to revolve and, to some extent, tie into what's going on in in the cultural, in the cultural district So we're excited to bring a new library to the neighborhood and also I'm excited to provide a space.\nWe, recently merged with the Brooklyn historical society and pulled together the historical society with our own Brooklyn collection, that combined entity at the center for Brooklyn history is going to continue to be housed at 128 pierpont, and It's a One is to continue the great work that this historical society had been doing, both in terms of Ex exhibitions and the education work that they do in the programming work that they do and the great work that our Brooklyn collection has been has been doing, and also to begin to have the center leverage, the library system, so to create a better connection between the neighborhoods around the borough.\nThe school construction, Authority, really early in the process about four years ago, had come up with a design, so I'm not sure of the latest schedule from them, and if the stem space is going to be ready before the library is or after, but I will say that we we've raised with DOE the the the issue that when they do open, up, there's an enormous opportunity for us to collaborate with them.\nYou know we have begun a a terrific program around robotics around the borough that we love to be able to work with them on I think it will have to be a question for them in terms of what their, what their schedule is, but I, think when they, when they do open, it's going to be an exciting opportunity for collaboration.\nThink the a fundamental goal is to develop programs that are going to be geared towards neighborhoods all over the borough, and We've received funding from the council member there to include in that new space, a heritage center that will focus on the african burial ground.\nSo just one example that comes to mind of us sort of integrating the expertise of the center for Brooklyn history, with the what's going on in the library around the borough.\nOkay, I'd like to say that I'm a little disappointed at what I am going to refer to as the library by the Brooklyn academy of music, which you're calling the south side or whatever I thought.\nAnd I do think this gets to the question of when we open these great new libraries And we're going to have a bunch of them we're going to be opening Adam street , we're going to be opening Brooklyn heights and then later on a revitalized Walt whitman we're going to have the new south side space You know it does get at when we open a new space casting a wide net to let people know about it, and you know particularly folks who need us.\nNina's need us most, and you know with it's been particularly interesting with Adam Street, where again, we're sort of creating the library community, starting at the beginning and cat, and her team have been talking to lots of stakeholders in the neighborhood.\nWe've been very focused on Farragut houses in particular, so I think that's sort of a real, a really important part for us when we open new spaces, it's not just building them, but making sure that we're doing what we can to communicate with people who can really use them and need them.\nWhat I'd like to know from the the members of our committee is whether or not you think this is something that we should undertake If so, then we would have a vote on whether or not we would be meeting with the Parks committee in December I work at the kings, County clerk's office, which is in the building, that is, that houses Brooklyn Supreme Court the park surrounding the court.\nThey would like to address CB2 about the Columbus statue created by Ms devins, located in Columbus park in front of the NY New York City Supreme Court, building in downtown Brooklyn."
        }
    }
}