{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB1",
            "channelId": "https://www.youtube.com/channel/UC3zGl21r2KKJFwGJqudIuig",
            "title": "Combined Public Hearing and Board Meeting 2020 09 08 18 03 44",
            "publishDate": "2020-09-14",
            "shortDescription": "",
            "lengthSeconds": "3:01:44"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB1",
            "normalizedName": "Brooklyn Community Board 1",
            "twitterName": null,
            "youtubeChannelName": "Community Board",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCG5fH7ZKjO3bS7BB33MjAXA",
            "twitterHandle": null,
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "zjcNdLw-riM",
            "fillerWordCount": {
                "uh": 209,
                "um": 302
            },
            "readTimeFullTranscript": "81 min read",
            "readTimeSummary": "11 min read",
            "wordCountFullTranscript": {
                "bylaws": 44,
                "votes": 35,
                "date": 29,
                "elections": 25,
                "grass": 24,
                "census": 22,
                "chat": 21,
                "nominations": 20,
                "budget": 19,
                "food": 16
            },
            "wordCountSummary": {
                "bylaws": 10,
                "elections": 9,
                "grass": 6,
                "state": 5,
                "developer": 5,
                "census": 5,
                "date": 5,
                "agencies": 4,
                "plantings": 4,
                "hearing": 4
            },
            "fullTranscript": "I, don't think David, it's Elliot. Can you hear me? Yes, we can hear you, okay, just our hit start video. All right. Can you still hear me and we can see you. That is your risk, but we I'm doing this on my iphone, because somehow we couldn't get the my laptop to accept the code anyway. I'm here I will only speak when spoken to because I don't know how many others are being subjected to this right now. So, if you want me to chime in or anyway, I will now keep my microphone on, so I can speak, but I will otherwise be quiet. No, it says here the experience, ladies and gentlemen, very sorry, but we're having technical difficulties bringing the chair of the community board into the meeting. So please stand by and bear with us. Thank you. Oh the numbers we're having trouble getting the chair in I. Don't hear anything. Is there a number I, don't hear anything! You didn't hear what okay Gary came on and he told everyone that they're having trouble getting the chair in I'm. Not even hearing I didn't see him coming. I see myself. I see some of the people, but I don't see that I, don't see anybody yeah, okay, rabbi, we can see and hear you I can see it too. Okay, so we can hear you as well just want you to be mindful that you're not on mute. You better, not tell people all those secrets that you've been carrying around hi Tom. Are you here, oh yeah, I'm here, okay, good evening, everybody hi nice to see you good evening. Well, you look as cute as ever. Can I have my committee meet on the side to discuss the 80 billion liquor licenses perfect? Can we go out in the hallway? Can we see your books up there? Everybody read all those liquor licenses. Okay, so then, can you hear me Tom, there's a hundred and twelve licenses on that list. I move that we deny them all here. Are you Maria? Can you hear me I'm on? Can you hear me? Yes Marie, we can hear you, oh Tom. How are you doing love it's? Today's one day, 180 says work at home, stay at home, all right, computer screens facing at me from many different directions. How are you Marie, I'm good? Thank you. I've been working on you have you been thrilled with the one block closure of Graham Avenue for no purpose whatsoever? Are they curious up on Manhattan Avenue? I'm just trusted with everything, even the tables out in the street. We have no parking at all now. Well, I, don't know the street clothing serves no purpose. The restaurants have their little corrals. It's like. Why does the whole street have to be closed, so people who walk in the street they all stand around the bar and also, if you go to other community boards, you know that does not exist. I've not seen no places in Brownsville one block of Graham Avenue between Consolidate and skillmate ties up the entire Graham Avenue here in Greenpoint. Imagine that they even close West Street, which has one bar on West Street and at least West Street, was useful to slim the traffic on Franklin right. So now, why do we close West Street? It's completely deserted, because the grass at the buildings on the waterfront got killed by the dogs. I did a tom yeah I did a press conference today with somebody, the woman who she's a transgendered woman that worked on Ray Kelly's commission to incorporate Lgbtq it's like well I, quit I gave up on the police department, so I don't go to that anymore too. Many white people, so I said I can't go anymore. I need a little diversity. I said so. I'll volunteer to leave, but I don't know any Mary. She spoke a lot about Ray Kelly, so she might have left yeah, but I was on his I was on his Bratton's, all of them lovely lady. Don't know you saw the great publicity on the renaming of P Johnson Park yep. What are they trying to do with the Alice Right? Of course? What's going on? Can you tell me why she can't use a telephone? Where is she are they trying to? Where is the Alice? How come they can't get her in put her on Marie's phone put her on community board, the Brady Bunch is waiting for her into the access area has now resulted in our application, which has taken well over a year. So with that I think I would allow David to run through some of the technical requirements and then we're available and Elliot's available to answer any specific question so David. If you want to continue. Thank you Richard just running through some of the technical aspects on page slide. Four, you can see the site in the area that it is site. Five shows the certification. That's a piece of this action to show that the site plan as complies with the visual corridor requirements, and you can see how the south visual card are extends through. This is just recertifying, based on the new site plan, with a previous certification having been done in 2015. Moving to slide six, you can see we'll come. This is a map of the different public areas in the waterfront public access area. With all of these areas, what you find is that you're either going to be in short, public walkway. What the what's in blue hatch is called supplemental public access area, which is the additional public access or in the upcoming connection, and then DEC requires us to shift things around for either to cap the bulkhead in the area, at the top of the page that you see in gray or to recarve out protections for the wetlands, which is the part just to the right, where you see it kind of cuts in everything moved around, and so the blue areas that you see at the top, the 872, the 319 and the 86. Those were previously part of the short public walkway. But now, for definition, for technical reasons are now supplemental public access areas and then all the blue areas that you see running up and down on the sides. Those are areas that were previously designated as private property and now through these actions would be designated as permanently public access. So they would have to stay in the condition that they're in now and wouldn't be able to be cordoned off for any kind of private use or change to the design. And so you can see the slides. Please can you move the slides you're still at slide? Three, I'm sorry, the way that Webex and I know there were a lot of complaints about this before I can't share the screen and move the slides, but everyone can move the slides along with me either using the keep me using the arrow buttons on their keyboards. Each of the slides has a number on it. It's one of the unfortunate things of Webex and so with beauty. So these newer, these blue areas, hatch, have to stay open to the public and in the condition that they're in for the site plan slide seven. What you're going to see in some of these slides is just a side by side comparison of the plans that were originally approved versus the as built condition that we're looking to show here. There are some slight differences in the way the plans were drawn that make them look a little bit different, particularly with the cheating and the legend. But these plans are showing the same areas to scale, and you can see here the way that the cove was modified, the protections around it and so the 40-foot requirement. The blue line that you see on the left was the 40-foot line which complied with the zoning and then when it was changed now in one point, the shortest distance between the edge of the building and the waterfront is 38 feet and 10 inches, which is 14 inches short, and that requires an authorization of both the minimum width of the short public walkway and the required waterfront yard, which end up being the same thing here. Moving on to slide eight, you can see the transition area, it's another waiver that we need. The requirement for planting, for this is 40 of the planting, which amounts to required 768 square feet of planting in 2016. The fire department had asked for particular modifications to make sure that they had vehicular access, which brought the number of planting down. What you see on the left, which amounts to 643 square feet of planting as proposed on the right. It does not amount to the full 768, but the planting is proposed is increased to 671 square feet of planted area, and you can see that it's buffered around it by new additional permanently public space, including areas that are permanently planted. Moving on to slide nine, you can see the upland connection. If you look at the red line going along the top, you can see how the change in the cove changed the shape of the shore public walkway and ended up moving a lot and reduce the size by a couple hundred square feet. Also between that move and the proposed changes to the lawn area and replacing it with gravel. The total planting in this upcoming connection type one was reduced from 2500 square feet, roughly 221 to 2138 square feet, which is just shy of the required 200 and 2,334 square feet, or a difference of about 3.3 percent on slide 10. You can see the proposed comparison of the lawn area on the left in the 2016 approval. You see the area that is just flat grass and on the right you can see the proposal to add additional outdoor seating and changing the surface of that area. To for a permeable, paved gravel and just for those who aren't familiar, you can see on slide 11 pictures of what this lawn has started. To look like during the land use committee meeting. There was a lot of discussion about making sure that we've done everything we can to protect this grass, and we have we've gone spoken with the landscape, architects and the maintenance team, every measure that we could was deployed, but the options become limited because what they pointed out to me that I didn't have in front of me at the land use committee meeting was that this area of the grass also falls within an easement held by the city and the state, as well as part of the necessary vehicular access path for the fire Department. So whatever goes in, this strip needs to be drivable, and so any kind of structures that you put to coordinate off or program the space that would interfere with the ability of any kind of vehicle to go over. It would just not be acceptable and so parks had asked us to look at replacing this with synthetic turf. The Department of City planning had some other concerns about what might happen with synthetic turf and how dirty and hot and smelly that can get when it meets some light and dogs, and so everyone started talking about this when we arrived at the paved gravel would be the best solution here. Moving on to slide 12. there's a requirement for a screen buffer in 2016. You can see the original approval. There was a plan here to have two different commercial entrances into the building when we were here in front of this board in 2018 with the phasing authorization. There was a lot of discussion about allowing some kind of out that retail inside the building might not make a lot of sense here and that people wanted to see outdoor dining here that put more eyes on it, use the space a little better, and so what that resulted in was removing one of the commercial entrances, and for that the zoning requires a densely planted screening buffer between the building and the public areas which would be required on the right. Where you see right about where you see the 10 foot a, and we felt then- and we feel especially now with Covid-19- that having that kind of outdoor use that is meshed with the shore, public walkway actually enhances the experience and livens up the area a little bit and prevents this corner of the shore public walkway from becoming a kind of back alley that no one ever gets to, because it's dark and wooded on all sides. And then that covers all the waivers. The rest of the slides show different pictures of the area, I'd point to slide 15, which shows a rendering from seawolf that of the effect that this particular that not having the screening buffer has on kind of opening this area up to the public. A little bit more and I would also point to on slide. 21 I think is the best way that shows this. It's you can see the corner of the building right there measured to the corner of the fence. On the other side, that's the 38 feet, 10 inches. That requires the waiver of the minimum width of the short public walkway, and this is the only point where it's less than the required 40 feet and so I think. With that we're happy to take any questions from members of the board or the public. We asked that we asked people to put questions in the chat if they had anybody Joanna. Is there any questions in the chat pertaining to this presentation? Yes, hello? Yes, there's a question from Katie Naplantarsky and William Elkins. Can you read the questions from Katie Nadulaski's I went to this part of this property today, and so that there is really. There is a really nice resettle low area with fencing around it and a sign saying please allow grass to regrow- and it looks great I- think it's a mistake to give up on the grass that precedent needs to be grass or planting of some sort, no grape, no gravel, William Elkins. Why was the synthetic tariff not pursued simply because of dog owners, and thank you for the questions? I think that- and this speaks to really the developers and their approach to projects like this as difficult as it is, and as we found it to maintain the grass and why we're here going through this process to be able to repave the area pursuant to the previous authorization and the certification of these plans, we remain required to maintain these plantings, and so, despite the fact that it keeps getting run over, we still have to do this again and it's just impossible to maintain long term. Every avenue to do this and I know that Elliott Spitzer here can talk more about the efforts that they've put in to just doing this, and the dog traffic makes that impossible David. This is Elliot and I. Everybody I appreciate your time and attention to this, and let me just begin by saying that we're proud of what we've built hope you appreciate it and find it aesthetically satisfying a good contribution both to Williamsburg and all of Brooklyn, and we are especially happy about 187, affordable units, all of which are filled and I. Think anybody who has gone through this knows that it is difficult to do that, but we have gotten all 187 leased and that's something, including over 30 homeless families. So we're very proud of that in terms of the specific grass I can promise you that, both as a matter of protecting natural environments as a dog owner I, would have preferred that the grass there be possible it simply wasn't you have a very small space that is actually covered with grass and the number of dogs in that neighborhood. Many of them who reside in the building simply overran that space, no matter what we did, we had signs, we encouraged, we persuaded, we cajoled, we begged, we pleaded we watered the grass and, as a consequence, I think we, as David and Richard have said, have gone through a very complete process, with both parks and the other city agencies. In an effort to find the best answer and I wish grass or some synthetic the city rejected synthetic said it simply wouldn't work for the reasons David alluded to and I wish. We could come up with something that would work, but the city was quite adamant that the combination that the David described with the synthetic gravel and the other stuff is what they expect us to put in. There can well I see a couple of questions up on the chat, I'm not sure if I'm supposed to react to them or respond to them we're in terms of this area. Yes, there's going to be a little berm there, which is I, guess the the architectural term for a bump. The that area will continue to be planted in some way, shape or form. It is am I right, David, but I guess the seats will be there. It's the flat area that will be the gravel yeah I think that if we go back to I'm just going to pull up the slide number so on slide, 10 you can see on the right and left you can see on. The left is the previous approval that, where, on the left, you have that rounded area where you see the trees, that's where the berm is the little bit of hill heavily planted and on the right they're the covered seating that you see now and that are in the pictures. Those areas will stay exactly the same. The only proposed change is the change that you're that you can see the difference between the two drawings, which is that on the left, there's the area in green, that is just grass and the then the area on the right, which is a darker shade of some color that I can't quite tell from this distance. Without my glasses on that will become cave gravel instead of a glass. The other point I'd make David is that and I hope everybody on the in the community board has been down to the esplanade, which I really think is again, I'm obviously partial, but I think it's quite a wonderful contribution to the waterfront. There is loads of planting along the entire esplanade, and you know, as I say we all believe we need more trees and more grass in the city. It simply didn't work in this one location but elsewhere along the esplanade. I think the plantings are beautiful and the trees are thriving and I can tell you we're putting a lot of effort and funding into maintaining them and making sure that's the case. Are you still asking questions because I have questions in the chat? I think that so with respect to the other questions that I'm seeing in the chat, I think they're all along the lines of what we've been talking about with the grass. The questions about the affordable about domino I can't speak to the site conditions at domino. I, just don't know them, but I know here we're dealing with a very unique set of factors, particularly in making sure that this area remains navigable because it is within city, owned, easement and then the other issues I think are here about the Affordability Asp about the affordable housing. But I, don't know if there's if people asking those questions can specify what their question is or if it's just a general statement about the need for David I, don't have in front of me and I apologize, I'm just assuming. If the question was what is the breakdown across the various income levels? I do not have that right in front of me, but I'll tell you, expand the entire spectrum as most inclusionary housing does, but at the request of the city and I, don't think this was mandated. Initially, we have over 30 apartments that are filled with homeless, individuals and families, and so I think that has made obviously been an important effort on the part of the city to confront what is an issue that we all have to care about. How long are they going to have access to staying in that apartment? The inclusionary units yeah in perpetuity? Well, I! Guess that's a long time for people. The units will always be inclusionary units, so I wish them perpetuity, but that's not sure any of us gets that. Well, you said it on the record right: okay, yes, so I just see that Katie had asked specifically different kinds of plantings in this area again compared to fern, which has next to it on the hill, which has ornamental grass the fact that this needs to remain a flat surface that can be driven on changes a bit of the topography and what we can plant out. Some of the ornamental grass when you use some actual passive space that people can use and clearly the central location of this is such that you want people to be able to walk through it. That's the idea, whereas was for people to be able to use it, and it's regrettable that it got overrun by dogs the way it did any of that kind of ornamental grass, aside from the fact that it may or may not actually be able to grow there, because the depth would be impossible would not be navigable by either by people or by vehicles, and we just take that space away from the public. Tom I noticed that you mentioned that it was an intentional taking of grass I just hope that you're not importing that on the developer, because I think we've been clear that this is not something we wanted, and it's Richard Lobel, just to kind of reiterate. Some of what was stated. You know I think that Elliot's really tried to go a long way to make this a really functional and enjoyable esplanade for the community. You know we are at about 6,000 square feet greater than what was originally required, and that was by design, and you know it's unfortunate that we had to go through this additional process. You know to for the for these changes, which were really in large part required because of compliance with state regulation. But you know I'm encouraged by the fact that some in the chat I see that people who live nearby I enjoy it. They feel that it's you know it's a really pleasant area, and you know we're hopeful that the community board can allow us to move forward. I could not see the entirety of the question that was in the chat, but let me just reiterate what Richard said: we went through a dynamic process with a whole slew of city agencies about what this covering should be, and we, as you tried very hard to keep it grass or some equivalent, including astroturf and everything else. City parks and DCP city planning are the ones who gave us this as not quite take it or leave it. But essentially they said this is what you're doing and Steve just to address your point. If I think I'm getting your question right, the area of the gravel amounts to 986 square feet, the Cir. The surplus of open space here is over six and a half thousand feet square feet. Who's moderating right now like what's there's a lot of space and time what's happening chair are you able to speak Jerry? Can we keep going? Can somebody share and facilitate is what Diane's asking so is the vice chair on in the meeting good? Is the vice chair in the meeting I? Don't think so? Jerry Simon's, not here the next one in line, is Miss Teague I do not have an agenda so we're just asking for a chair right now. How about the chair of the committee make a motion and everybody vote and move this on. So let me just then, why don't I just say that we did have a public hearing and a land use committee meeting and the presenters have made my job very easy right now, because sorry, just seeing just the point of order, do we have to close the hearing before we move into the to the meeting she's cheering right now, Steve she's terrible. We need to close the hair. Well, I! Don't know that I don't know that I can close. The hearing, on the other hand, I don't want to just we don't stick here now we shouldn't be voting yet all right. We have other items on the agenda. So if there are no further questions, then we'll move on fine. All right here are no further questions and Dell. The next item on the agenda is a presentation update on the census 2020 by Barb Williams Field Associate is Barbara Williams in the house. Yes, okay! So let's proceed then thank you, miss Williams. She needs to be unmuted, she's she's an attendee, so she has to be turned on Jerry. Can you unmute her turn her on I have to run up front and do that I'll tell him to do that. Thank you. Thanks I know I'm trying to get her I'm trying to get her to turn on Miss Williams. Yes, thank you. Excuse me one. Second, I'm going to okay and my screen. Okay! Yes, we see you all right, Miss Williams. Would you proceed? Please I'm trying to shoot my screen right now. Okay, we can see you yeah, but my screen is for my slides I see it's not letting me. It's that's okay, I'll just can you see that? Can you see that I only I don't see it I just Marie? The host has to turn on the share files button for you, so Jerry needs to walk back up front and tell her I have already done that. Sorry, Martin! You know what it's okay I'll, just do it without the slides. If that's okay, is it fine? No, yes, please proceed. Thank you so I want to say thank you. First of all, because as a proud resident of Community board one, it's an honor that I'm able to speak for the board and I'm here to basically update you, because we have about 22 days left to the census to the end of the census and I know. You've had several speakers so far discuss the census. So I'm not going to waste your time and telling you why it's important that we do the census, as we all know, is about justice and rights and representation and redistricting. But if you can imagine this all the hard work that you put into making sure our streets are clean and we have garbage cans on the corner and that you know we make sure our kids have opportunities for education. We want to make sure that this line is run properly. We want to make sure that we have enough subway lines in our community, but imagine that we days left originally we closed it go to October 31st executive order from the White House has was sent down to us and now will be enforced in distances, as I said before, on September 30th. So it's not just about the representation that makes it so important. It's about making sure we have our congressional seats where possible. Okay, so every 10 years the data is used to determine how many seats we need in each states to get out congressional seats right, and so this being said because we only have, but so many people filling out the census we are going to lose. Probably two congressional seats is, at the rate we're going. Half of Brooklyn is going to be seen as invisible. So half of Brooklyn will not be counted at all, okay, so the resources that's needed, the representation. That's needed, we're not going to get it and that's going to what we get will have to last for 10 years. I had a a graph there, where I wanted to show you how we did it in 2010 10 was at 55.6 very low when we finish the sentence, but as of now, when you look at Brooklyn is at 55.3 percent, so we're not even where we were in 2010, okay and in the neighborhoods, such as green point. Green point was 54 55 and now it's at 54, no 54 and I was at 53 in Williamsburg, we're still below where we need to be self-response but we're at 55. So we still have a long way to go with only 22 days to go. So I'm coming to the board to tell you what community one can do to help the situation. Okay. The first thing I need to make sure that everyone who is on the call and their family members and their friends have done the census. Okay, if they did it later in the summer, they have to make sure that they do it again, because what happened with the post office being, you know, slowed down, a lot of mail was not received. This is so that means if anyone milled any fences later can't be counted the good thing about this. Now we have so many languages that we can help out with you know it's not just english and Spanish. We have tagalog, we have portuguese, and so we are very open to helping more people. Unfortunately, we don't have the time. So what we're asking you to do is to join us in some of our events that we have coming up. We have outdoor events coming up where we're hitting the streets, we're hitting the parks, we're going to vendors, we're going into the stores, we're hanging, flyers and posters and we're also doing phone banking, we're doing the subway stations as well, and so in order to get involved with any of those activities. I would love for you to contact me personally, Mr Ellis. She has my phone number in my email, I'll say it at the end. Barbara, can you also put it in the chat so that we could contact you separate from her yeah? That's a good idea! Thank you. Yes, so what we have coming up? We do because we do phone banks for Brooklyn, every Tuesday and every Thursday on Tuesday. We do phone bankings from one to three and on Thursdays is from six to eight, and the 24th will be our last opportunity to do any phone banking for the census. Okay, so we're having what we call last dance bombing party on September 24th on we're having a mutually in organizational challenge. So, if you're a part of a community board- and you want to see how many people you can recruit to be part of the phone banking or if you're part of an organization that is in Brooklyn, you can join us on September, 10th and I'll. Put the information for where you go to sign up for the calls I'll put my email address and I will put my phone number as well in the chat box. Thank you, but most of all we just need help in getting this done, because, like I said, we are way behind all the other boroughs right now. We're in last place. Yeah I have questions too. I have a question: okay, one at a time Dana, so Barbara, two questions, one I know you can only phone bank up until the 24th, but people could fill it out online until the 30th correct, yes, okay and then. Secondly, I hear what you're saying about the challenge. You know a lot of people are doing, occupy the block setups right now and then outside from you know, 8 p.m, till 2 a.m. In the morning, are you guys taking an innovative approach, because those are the people most likely not running into you guys, most likely not signing up for the not doing the census on their own? Are you going to be doing activations on impacted blocks overnight, both in our district and outside of our district, where people are most likely not engaged with the census? It's funny that you say that, because I came across a rally recently and when, when I went, they asked if anyone like a brown wanted to speak, and so I spoke about the senses and the need for the senses to be done, and I asked him to do the sensors on the spot, and so when I walked away. Someone came up to me who I knew he said. Do you remember a group of people who were not going to do the census? But when you just spoke to them what you said to them? It comes to the fact where they wanted to know more about the census, and some of them actually did their census, and then I spoke at Mccarran Park as well, so I will go wherever is needed in order for us to get the numbers in, and you have iPads that you could do it on site with people. Yes, as a matter of fact, I have right in my apartment, I have and what we could always do is if the person doesn't want to do it on your iPad, you can ask them to pull up the website on their phone. Okay, so I'm going to contact you separately and I have some events. You can come out too. Okay, awesome, that'd, be awesome. I really appreciate that, but why are there so few hours waiting? Please let her finish. Okay, sorry, I can't know this fine, I'm sorry, okay, Jan. Why are there so few hours a week that you're doing phone calling two hours and two hours seems, did I hear it right? Maybe I heard it wrong. Well, that's because we're doing other things during the week as well, so we're hitting the phone panty, the food pantries and we're doing all kinds of events we're doing a bicycling event we're hitting the subways we're hitting the arena. The Barclays, where we're all over the place and the sad part, is there's only five people who work for Brooklyn like a steady work, job for Brooklyn in the census, and we depend a lot on the volunteers and so I myself, I cover 11 different parts of Brooklyn and we're talking about over 2 million people. No, I'm shocked to hear this. I'm just saying is that we have a borough president running for mayor, and this is the state of this campaign. This really is unbelievable, I mean yeah, but what I do with my volunteers that I meet with every week? I look at the numbers and and I give them the option to make calls on their own using a manual dollar instead of a predictive dollar. When we do it on Tuesdays and Thursdays, we use an automatic dollar that Dallas number for you, but my volunteers and I we've been focusing heavily on the Williamsburg section, not just because I live here, but because we see the numbers are really low and out of all my 11 areas, all my neighborhoods are starting to come out of where they were in 2010. But my Williamsburg sections are the only two sections where my numbers are low. If you talk to the public housing leaders we're working with public housing, we have someone who does public housing. We have someone who does clergy, we have someone who works with the chinese community. Yes, so we cover faith, we cover Pacific and orthodox, and all that, yes, we cover that. We cover the unions as well. We cover city workers, and so we are still trying to figure out why it is that people don't want to do a census, a lot of people when they speak about the census. They speak about it on a macro level and when I speak to people I try to find out why it's important to them. You know people don't realize that when you leave your house and you walk down the street, everything you see smell and touch is impacted by the census right and so with the Covid-19 being so here and we in need of vaccines. What's going to happen when we have an undercount and they need to produce, they don't know how many to produce, and so we're going to be short, wow yeah. We've done, we do caravans, we've done that we're playing on March as well. You name it we're doing all kinds of stuff. We've done virtual events during the Covid-19, every Tuesday, you partnered with community-based organizations in the area that have a large constituency and a very intimate relationship with their constituents. There was an opportunity for community-based organizations to receive funding from the state and there were probably about 250 organizations throughout this, the five boroughs that received funding and we're not just talking about five thousand dollars. Some of them received a quarter of a million dollars and maybe a little more, and this was to be used to design programs to educate. My focus is those people who are coming out of prison. My people are that I'm really looking out for is domestic violence situations, those people who are living in fear of doing senses, because you know, like I, said you have to reach out to the person to where they are not. Where you think they should be in life right, and so I've been focusing on the people who are hard to reach, such as those people well, I think we're now waiting to reach out to the people that are easy to reach to any numbers. But the question I would have, is you said some of the community-based organizations here have been funded to do this? You have that I have access to it. I don't have it on me. Could you sit down to us all? So we know who's been funded to do this work and because it's obviously there's a real problem here. This is a crisis. This is not little, yourself is very sweet, but it is big yeah. It is a large problem and this is for 10 years yeah. You know with Corona now we're going to have funding cuts. Can you to do this yeah? It breaks my heart that a lot of people don't see that this is a big problem. You know that's the list right, yes, uh-huh! It was actually published in a newspaper where they listed everyone who received the grant. Well, let's find out how well they've done yeah, so I'm going to say that one of the things that really hindered the process he needed the count to move forward was Covid-19. Yes, I think that the funding was allocated somewhere in the first in the beginning of the second quarter of this year and started right when the funding was allocated and that's the funding that Barbara were mentioning and everything paused and the counters the outreach workers were not the census. Average workers were not able to go out and knock on doors know that you guys engaged heavily in some phone banking campaign and even texting, but I'm gonna be very honest with you. I think that during those first four or five months of Colby, nobody was really focusing on census. When everything was covered and now there's a big rush and the fact that the timing has been shortened to September is it's what's making it worse? I'm not gonna say that the organizations are to blame for lack of production because there's a lot I mean the census workers themselves. They could have expressed the challenges that were so. This is what I'm saying have been partnered with those organizations, because it's everyone's best interest to have people counted and I know that there's an organization in Williamsburg that refuse so there's you know it's probably an organization you should partner with yeah and, like you said, hope it was a big problem and you know what I say: it's freaky funny, but you know during a Covid-19 we're lucky. We got that far we're looking to get before, because a lot of people when I did call a lot of people who we did reach to. They didn't want to talk about it, but when I sat down and had a conversation with them on the phone about, why it's important to a loved one who does have coded you know and will need services when it's time to recover, they were like. Oh, my goodness, I didn't realize it. I was so cool just as absolutely on the chat wait one at a time. Please there are people on the chat that are giving a lot of suggestions of events that are being organized events by elected officials that are being organized in glensburg and all that stuff I, don't know Denise of Barbara. I'm sorry if you're able to see it, but it wouldn't. If you would partner with them, I'm sorry Dana I'll, just we are yeah, I'm gonna get off the soapbox in a second, but maybe those are good. You know, suggestions to partner with those folks and Dana even had some ideas as well. So there's a lot of connections here that you could probably benefit from yeah. So so we've been, I'm sorry can I just say something can I just say something, I'm sorry. So we have partnered because I want to before I forget what she was talking about. I'm sorry because we are, we have partnered with rain. Oh so we have partnered with we have partnered with a lot of the elected officials like we have a separate department that deals with just the elected officials, and we have meetings with anticipating is just you know- is difficult when you're trying to get people to shift from the whole notion of trying to be safe and trying to be well to please take five minutes to do a census. I think we are working with. We have worked with them even up to Eric Adams in the May's office. We've worked with all the elected officials, Sorry Dana, no I. Just think that, like we could have this conversation all night long I'll tell you. If somebody does a lot of organizing it, doesn't you don't need an event? You need to go into laundromats where people are waiting for the laundry to be done on the food bank lines in the barber shops all meet people where they're at as they're sitting waiting for things, that's where they're gonna be, and people that have minimal access to the internet and whatnot I think you know, I'll send you some occupy the block information, so we can mobilize people outside. But again it's really not centered around events. It's you meet people where they're at and we've. We did 10,000 surveys in Brownsville in like three months on the ground and it was 10 minutes each for each survey and we're in barber shops at laundry mats on the corner. The food bank line is around the corner at all the different food banks. People are sitting on that line. Doing nothing so yeah. We've done that we have people who will go out in the streets and they're going into. Like you said we could we stand outside the check cash in place. We stand outside when the lines along outside the food Banks, Diana Richardson. She does something. So we joined forces with her to do the food bank lines. We put, you know so we're doing actual underground work. We have a squad of people who help me as well, so we are going to where the people are, but it's still hi. It's Julia I raised my hand twice. I'm sorry church has finally opened back up and only a suggestion. Somebody put it in the chat box, maybe Sundays I know it's short time. You only have three sundays. They can hit the churches on Sunday, because people are coming back to church, not too not three you've getting, maybe 40, 50 people and I do know they haven't a lot of them, have not done their senses. I have spoken to them and not only like she said the food bank there's a food truck that comes to Cooper on wednesdays, I, believe and the folks are lined up to get the food Thursdays they're in Williamsburg houses in front of St John's church. So if you can do, I gave you my phone number in the chat box. You can give me a call. There are some other events that I know about that's coming up this weekend or my friends in the chat box. You can give me a call. Okay, not a problem. I would definitely give you a call, but, like I said, I'm going to put my information down in the box and we need to see my phone banks sessions and I appreciate you having me to speak tonight and I. Thank you for your suggestions in your time. Thank you. Obviously, it's a very important issue. Mm-Hmm. Thank you. Jerry I think we can move on to the next item. Well, you have the the listing of liquor licenses. That's attached to your gender and I guess. We need a motion to open the board, meaning okay, do we have a motion? Do we need a second I need I? Second, okay, Jerry, so it's a roll call for the full board meeting. Okay, please answer when I call your name on mute, your microphone to do so. Thank you. Gina Argento here Ogden Buckarowski President Lisa, Bermanti, Gina, Barros beer, Teon, Brooks, Theon, Brooks, Eric Bursitis, here Tom Burroughs, here, Iris Cabrera, Phil, Cappanegro, yeah, Frank, Carbone, Stephen Chesler, here Michael, Chirichello, Giovanni, D'amato, here Erin, Drinkwater, Arthur, Divinowski, Erin Drinkwater here. Thank you, Arthur Debanowski, here T Willis Elkins, here Julia man, the foster present chairperson Fuller Joel, Goldstein Joel, Gross, Sonya, Iglesia, Kaminsky Present. Thank you! Evan Katz, Avram, Katz, William, Klagsbold, Coonan, Ryan Conan, don't have her I, don't have visual it's here. She was there before Joel Landau, Marie Leanzo, really Abraham Leibovitz, Yolo, Trina Mckeever, here Sante, Michelle, Obi Moskovitz here. Thank you. Martin Needleman, Marty, Needleman, Rabbi, Nederman, Rabbi, Niederman, Karen Nieves here. Thank you. Mary O'domerick, Janice Peterson, here Dana Rocklin here. Thank you. Isaac selfer, Isaac, Sofer, Rob, Solano, Present, Vega I can see you William, but I can't hear you I mark your present from the visual Rio Vieira Maria Vieira President Stephen Weiberman here Stephen. Wiser Gary. Did you hear Marty? Did you hear me? Marty Needleman I hear you now: okay, I'm sorry Tommy Torres Jerry I got you Tommy and Jerry. This is Dell. Do you have rabbi niederman I, think I heard his voice by Needleman yeah Rabbi, Niedermann, I, thought I heard his voice, he's there twice approval of the agenda and then approve of a minute? Did you get the company agenda that was sent to the phone? So do we have a motion to approve the agenda? Did I hit chair, fuller, yeah, I'm back on? Oh okay, good cheerful! We just did the roll call for the board meeting? Okay, did you approve the agenda? I make a motion to approve the agenda about Zina Kaminsky. Second out the door. We have to do a roll call vote. Another one. Yes can I have a roll call vote the approved agenda. Please they can't hear me again. I hear you Jerry. We can hear you. We hear you okay, here Jerry Dialysis asking for a roll call vote. Can you hear me? Yes, okay, Gino Argento approved Bogdan Bakarowski, yes, Lisa, Bemanti, Gina Barros, yes, Teon, Brooks, Eric Burzidis, yes, Tom, Burrows, Iris, Cabrera, Phil Capenegro, yes, Frank, Carbone, Stephen, Chessler, yes, Mike, Chirichella, Teresa, Cinciata, Giovanni, D'amato, Aaron, Drinkwater, Present, Arthur Dominowski; yes, T, Willis, Elkins, yes, Joy, Amanda, Foster, yes, Chairperson, fuller, yes, Paul, Goldstein, Joe, Gross, Sonia, Iglesia, Boyce, Yes, Sanjay, Mitchelly, Martin Needleman, yes, Aaron, Rabbi, Nederman, Sorry, Karen, the evidence; yes Mario, Domeric, yes, Jan Peterson! Here it's not a here vote. It's a yes, no or abstention. Yes, Sir Dana, Rocklin, Isaac, sulfur, Rob Solano, yes, James, Stewart, T, yes, I see a thumbs up; William! Thank yes! It's Toby! Maskovitz so noted. Thank you Jerry. Thank you. Thank everybody. So much for your patience. Thirty, the affirmative. Thirty in the affirmative. Thank you! So we have a quorum. Thank you. Jeremy can I have approval of the minutes. Please roll call vote. This is for approval of the minutes. Gina Argento, yes, Bogdan Bakarowski, yes, Lisa, Bermonte, Gina Barros, yes, Theon, Brooks, Eric Grossitis; yes, Tom Burroughs; yes, Iris, Cabrera, Phil, Capenegro; yes, Frank, Carbone, Stephen, Chesler; yes, Michael Chirichella, yes, Amanda, Foster, Yes, Chairperson, Fuller, Joel, Goldstein, yeah, Joe, Gross, Sonia, Iglesia, Indig, Bosina, Kaminsky, William, Klagsbold, Ryan Conan; yes, your Landau Marie Leanza, yes, Abraham, Leibovitz, Yolo! What's going on? Yes, Toby Moskowitz! Yes, thank you! Martin Needleman, thanks Team Rabbi, Nederman, Karen Evans, yes, Janice Peterson, yes, Dana, Rocklin, Isaac, sulfur, Rob, Solano, Stewart, Deltig, yes, Tommy, Torres, yes, William, Vega! I can't see what these classes. Yes, I, see a thumbs up: William Vega, Maria Vieira, yes, Steven, Weidberg, yes, Simon! Wiser! All right motion passes Madam chair. The minutes are approved. Thank you! So much Jerry Committee reports, Julie Foster, Bylaws, Committee, Julie, Foster, here hi, everybody later I, I'm keep going in and out. I'm sorry. I hate this program, hello, I'm back; okay, hi! Everybody! I hope! I'm doing this correctly. Okay, the bylaws committee. We met on August 12th. Can you hear me? Yes? Okay, we met on August 12th at 6:30 in attendance. Was myself co-chair in glacier? Just love Nemo Man, Peterson Vega Absent was Rabbi Goldstein, but we had a quorum also attending our meeting was Mikiva Miss, Vieira and Misqui Cabrera I hope. I'm saying that correctly. As chair of the bylaws committee I officially rescinded the report. Both proposals that were made to the committee were withdrawn. The bylaws committee members had an open discussion prior to the meeting beginning called to order. Miss Ingley says, held the discussion because I have technical problems. After resolving the computer issue, I soon joined the meeting roll call. We had a roll call was conducted in order to open the meeting. There were five members present and we met as a coroner report referred back to Bylaws Committee at the CB1 board held on June 24th. The committee's report was tabled and sorry chairperson, Fuller sent it back to the committee I Judy Foster as chair to the committee officially rescinded the report. Both proposals that were permit that were made to the committee were withdrawn. Mr Chesler made a motion to withdraw the committee to rejoice the report. The motion was seconded by Miss Peterson. The members voted to withdraw the report. The committees voted as follows: Iglesia, yes, Tesla, yes, Needleman, yes, Peterson Vega, yes, no no's and one abstention me no recruiters discussion of the vote. Although proposals submitted by Miss, Peterson and Miss Mckeever were each individually withdrawn. There was still one item that came to the committee regarding both regarding voting by voice instead of paper ballot. That's going to be interesting. Retention of this one item addresses how members would be able to vote in a virtual setting in this time of Covid-19, where in-person voting can not be held. Such a proposal is seen as an essential change is necessary for the community board to move forward and also for it to be in compliance with legal guidance. This point to modify the Brooklyn CB1 bylaws use of voice in place of paper balance is highly recommended proposal to go forward. The committee members agreed that such a proposal should be re-introduced for the board members consideration. It is important that a vote on the proposal is carried out at the board meeting scheduled today, September 8 2020. The bylaws should further be amended to follow use of new electronic technology in the annual elections. The use of paper ballot is indicated. This should be deleted and replaced to allow elections to be held elections to be conducted during video Tell conference of meetings. I have my own opinions, but hey. This is what we're in right now number 10 voting, see all actions taken by the board shall be made by open vote. A record of the position taken by each member shall be made by open vote. A record of the position taken by each member shall be recorded and maintained in the board's official files and shall be available for public inspection. The Bylaws committee shall recommend the appropriate mechanisms through which this provision shall be implemented on voice or voice votes via voice or a vote by a show of hands. The secretary shall know all negative votes and abstentions votes in the meeting minutes under the election section proposals delete the use of paper ballots and implement the use of voice votes electronically, delete the section crossed out and add the text that is underlined. Everybody following okay. Thank you, I see one head. Thank you section, 5 election of offices. Next page elections shall be conducted. Electronic voting and held during a scheduled meeting of the board designated for elections each present member shall cast a vote for a declared candidate by the use of a voice. Dear Voice Mr Chesler made a motion to submit the above proposal for the bylaws change for the board members to consider the motion was second by Iglesia. The motion was anonymously carried. The vote of the committee was as follows: six, yes, myself, Iglesia Tesla, Needleman, Peterson, Vega, no no's! No abstention, no recruits we on the fifth item. We had an open discussion. It was further discussion amongst the committee members on possible proposals for future bylaw chains. Changes. Mr Chester spoke about a possible change for the bylaws. Regarding elections, it was noted that any proposal would need to be formally introduced to the board's chairperson. The chairperson would then properly refer it to the bylaws Committee for its review and Recommendations Mr Chesler made a motion that this proposal for the bylaws change is to be submitted to the chairperson, miss fuller. The motion was seconded by Iglesia. The motion was unanimously carried out. The vote was yes myself and Glacier. Cheslin Needleman Peterson Vegan, no extensions, no no's and no recruiters Jessica related that he would make the proposal and send it to the chairperson to chairperson, fuller and then we had an adjournment. Tesla made the emotion to close the meeting. The motion was second by Vega and we were in favor. The meeting was adjourned. Sequential oh snow bylaws, Mr Chester sent to Madam Chair dear chair person, fuller, enlightened distribution be caught caused by the coronavirus and somebody hello. Somebody saying something: confrontative is pandemic to the board's election schedule stipulated in the bylaws and the board's bylaws. I'm submitting a proposal to amend the bylaws, the board bylaws related to the terms of officers and attendance committee members. Please see the proposal text below for your review. This amendment will allow the extension of those terms which will allow the extension of those terms in the event that an elections are unable to be held in the herring's tutor timeline stipulated in the board bylaws until elections are held. It should be noted that both Jan and Trina, which Dan Peterson I'm sorry y' all and Trina Mckyver I, hope, I'm saying it correctly. We drew their original amendment proposals that included modifications to texts related to officer's turn at last night's meeting on the 12th of August of the bylaws committee. Additionally, the committee voted to withdraw its committee report from the June 4 2020 meeting, except for one provision related to the election. The proposal amendment is as follows: elections of officers part five and c elections. The terms of the officers elected at the board election meeting shall commence on July 1st of that year and expire on June 30th of the following year. However, remember that word, however, in the event that elections can not be held according to scheduled outline in the bylaws and in order to provide continually board offices and attendance committee terms shall be extended until elections can be held. So this was forwarded to the bylaws Committee for consideration so currently to your review. Thank you. Stephen Chelsea hi, everybody was keeping up. Thank you vegan. Thank you, Joe Julie. What's the committee recommendation? Is there any questions? I, don't see any in the chat. Joanna, you see any questions in the chat. No I don't see any other questions. Is there a recommendation? You need a boat motion. Make a motion. Somebody make a motion. Some moves, accept the recommendations of the committee I. Second, the emotion, yeah okay, emotion has been made in second Jericho. We have a roll call vote. Please! Oh I'm still here turn off the mic all right. So the motion is to approve the recommendations of the committee. The response should be yes, no or abstain, gene Argento, yes, Ogden, Bakarowski, Bogdan Bakarowski, yes, Lisa, Bermonte, Gina, Barros, yes, Tian, Brooks, Teon, Brooks, no vote, Eric Bursitis; yes, Eric versus votes; yes, Tom Burrows; yes, Mr, Burroughs votes; yes, Iris, Cabrera, no vote, Phil Capanegro, yes, Mr, Cappanegro, Votes, yes, Frank, Carbone, Frank, I, know you're. Having trouble text me and I will record your vote accordingly. I will announce it and record your vote accordingly. Stephen Chessler, yes, Stephen Chesson votes; yes, Michael, Chirichella, Yay, Michael votes; yes, Theresa, Cinciata, no vote Mr. Let the record show that Mr Carbone, just texted me with a yes Giovanni D'amato, no Mr, D'amato votes, no Aaron drink water, Erin Drink water votes; yes, Arthur, Dimanowski, yes, votes; yes, Mr Dominowski, Vocias, Mr, Elkins, abstain, Mr Elkins, abstains, Ms, Foster Julia! Yes, can you hear me? Is that your vote? Yes, thank you. Miss Foster votes. Yes, Joel, Goldstein, no vote; Joel Gross, no vote; Sonja Iglesia; yes, Sonia votes; yes, Moisha, Indig, no vote; Posey, Zina Kaminsky, yes, Josina, Kaminsky, Vocias, Mr, Evan Katz have them cats, no vote; William, Clags Bald. Excuse me: Mr Williams, Clag Ball, no vote; Ryan Coonan, no Ryan, Conan votes! No! You all Landow yo Landau, no vote; Marie Leanza; yes, Marielianza Votes; yes, Abraham Leibovitz, no vote; Yolo; no vote; Karina Mckeever; yes, Mr, Kieva, Votes, yes, Sante! Miceli abstain, abstains! Yes, Martin, Needleman votes; yes, Rabbi needhammen, no vote; Karen Nieves; yes, Karen, Nieves, Votes; yes, Mary O'domerick, yes, votes; yes, Janice Peterson votes; yes, Dana Rocklin! Yes, in Iraq long votes, yes, Isaac, sulfur, Rob, Solano, no vote, James, Stewart, Dell Teague; yes, Deltig Votes, yes, Tommy Torres, yes, Great, Job, Amanda, Tommy, Torres votes; yes, I think William Vega! Yes, oh I heard you thank you William Vancouver, yes, Maria Vietta, yes, Riviera Votes, yes, Steven Weidberg, yes, Stephen, Weinberg votes, yes, Simon! Wiser, no vote. Oh motion passes 26, yes to no and two abstentions. I'm sure. Thank you so much Terry. Thank you. Committee next item on the agenda. Is land use, dalty, okay, so so everyone, the land use committee, met on September 3rd. We had a public hearing and a committee meeting, and it was with regard to the presentation that you all heard earlier, 416 to 420 Kent Avenue, so I'm not going to waste anybody's time. By going over it again. I will just mention that the committee members did express concern that we were not that the community board was not kept apprised of what was going on and the the applicants actually joined us and said that it was actually uncomfortable for them to have to come to us after the fact when everything was done, and they were very supportive of our sending a letter to the city and state officials, saying that look saying demanding that if any of the agencies either request or require a change in plans that we have approved, that we be kept apprised and be given the opportunity to be participate. As things go along. Be that as it may, we heard only positive things from the community with respect to the this development. Our concern, of course, was for the the grass. However, it just the committee just voted in favor of approving the application. It just seemed that the they had made real, very good faith efforts to try to keep the grass in place, but that it just is in a situation that doesn't really lend itself to passive use and so the, although we had 10 people at the committee, it was when it came time to vote. We couldn't access everybody, so the vote was was six to one six people in favor, one person against so I need a vote on that and then I will also need a vote on sending out the letter which we unanimously approved. So we need to vote on whether or not to approve the application and or to in favor of what the committee suggested. Just a quick clarification Dell. If I may they would. You did not have a quorum of the committee, so this is just my recommendation of those present exactly that's right. It's just a recommendation. Yes, thank you. Dale! Can we have a roll call vote? I, know everybody's tired and I'm sorry I had technical difficulty. So when we do the vote, can we vote? You just tell Jerry that yes, you're voting for both items or whatever, if you're voting for one item, tell them what item you're voting for if you're voting for yes I'd, yes for both items, tell Jerry yes, both items if you're voting for one item tell Jerry. Yes on the item that you're voting on and vote for, the other. Well, Dialys and I, don't know what you mean by two items: we just approved that application, but we also need I also needed a vote on I needed to vote also on sending a letter. So that's the vote. Okay, great! That's the two votes, we're voting on your land use item and we are voting on your letter. Okay, that's why I said you know we do both at the same time. Okay, voting! No for the latter, they can say no for the letter, yes for the land use item of vice versa, so we don't have to do it twice. Thank you is that good everybody yeah, but I'd like to make a motion to admit, to amend the the recommendation that that the developer trying to include plantings in the gravel area. You know, based on the conversation that took place during the hearing, I'm fine with amending it to ask the developer to try to add some more plantings, so I see that as a friendly. You know amendment I'm sorry I second I didn't hear it I. Second, the amendment okay, so Steve would like to Steve. Chesley would like to add to the recommendation that the developer try to add plantings to the area that is going to replace the grass. They will be having more seeding in that area and I. Think it's a very good I think it's a friendly. You know amendment to ask them to try to add some more plantings to that area. Okay, so now we got three votes. No just two votes, just he's asking for an amendment. You got to vote for the amendment and you got to revoke it. It's just a friendly amendment. It's just a friendly amendment. I would recommend you know, as the chair of the committee, that Steve's amendment be incorporated, there's nothing about what Steve just suggested that changes anything I, no one would at the committee would have been against they're trying to put in some plantings if they could. Okay, so we still got two votes still two votes, you wanna say something: I mean you really it's going to be very difficult to tally, a vote where you're saying yes on one and no on the other. You should really try to take this as a package since it's that's the recommendation. Okay well- and this includes the letter also okay, so we're voting for three items: the amendment, the land use item and the letter of recommendations. So these three items that we are voting on, what point of order, but the letter is going to agencies, isn't it you know? Yes, it's intended to go to agencies, basically calling them to revise their process that they should have notified the community board prior to this modification going through not after the fact and that in the future they should keep us as a part of the keep us in the picture so that they so that- and it's also better for the applicants they. It was very uncomfortable for them to have to come hat in hand to say. Well, please approve it, even though we know we've already done it, but our feeling was that they made these for the most part made all of the modifications, because they were really told that they had to you know because of the requirements of the fire department and the Ndec okay. So is it clear to all the board members that you're voting for three items? Yes, I, don't see where there are three items: I think adding plantings to the lawn area is just a friendly amendment to what I recommended mom. Just two you're saying it's just two items: it's just the application and then also the letter. Can we have a roll call vote Jerry? So the recommendation is to approve the consensus of the committee with the additions, as stated by the committee chair right though. Yes, okay, so the your vote should be yes, no or abstain or abstention on the consensus recommendation. Gina Argento, yes, Ogden Bakarowski, yes, Lisa Bemanti, no vote; Gina Barros; yes, Gina, Barros votes; yes, Theon, Brooks, Teon, Brooks, no vote; Eric Burzidis; yes, Eric, Berzidis votes; yes, Tom, Burrows, no, Verls votes; no Iris; Cabrera; no vote; Phil Cappanegro; yes, Joe, Capanegro, Votes; yes, Frank, Carbone, Votes; yes, Stephen Chesler; yes, Steven, Chesler, Votes; yes, Michael, Chirichalla, Yay, Michael, Chirichella, Votes; yes, Teresa and seatta no vote; Giovanni, D'amato, no Giovanni; the model votes, no Aaron drink water; no Aaron, Drinkwater votes; no Arthur Dominowski; yes, T, Willis, Elkins, no T, Wells, Elkins votes; no Julie, Amanda, Foster, Abstention abstain, Julia Amanda, Foster, abstains, Joel, Goldstein, no vote; Joe, Gross, Novo, Sonia Iglesia. Yes, can you vote Iglesia votes? Yes, moist Indig, Moisha, Indig, Bosina Kaminsky; yes, Josina, Kaminsky votes; yes, Avram, Katz, no vote, William, Bald, Lillian's, flag, ball, no vote; Ryan Coonan; no one who votes no you're Landow your land down; no vote. Marielle Marie Leanza; yes, really as a vote. Yes, Abraham. Leibovitz, no vote, no low, hello, no vote; Karina, Mckeever! Sorry to hear Trina; yes, Sante Michelle, no Michelle! He votes; no, we'll be Moscowitz; I'm sorry, Toby Moskowitz, Vote, Martin Needleman; yes, Martin, Needleman votes; yes, Rabbi, Niederman, no vote; Karen Nieves; yes, Karen, Diaz, Votes; yes, Mario Domeric; yes, Ariel Dominic! She said yes votes; yes, Janice Peterson votes; yes, Dana Rocklin; yes, Dana votes; yes, Isaac, sulfur, Rob, Solano, Absolano, no vote; James Stewart; no vote; deltig; yes, Deltig Votes; yes, Tommy, Torres, Votes; yes, William Vega; yes, oh yes, Maria Vieira! Yes, Rio, Vieira votes; yes, Steven Weidberg! Yes, Stephen Weinberg votes! Yes, Simon Weiser Motion passes 23; yes, six! No one abstention; okay! That's it for my report. Thank you. Next item on the agenda is Stephen Chesler, Environmental, Protection Committee. Thank you. Madam chair on August 11th, the Environmental Protection Committee met and in attendance for myself, Willis, Elkins and Laura Hoffman is an on-board member. Absent Trina Mckeever Eric Russitis Wim Flags ball Dildo, Janice, Peterson and Non-board member Kevin. Costa Trina was intending to attend, but she had not won. But two flat tires in transit where she was going to connect. There are two items that we addressed. Also, we did not have a quorum, but we didn't have any. We did not have voting fighting voting items. An additional board members president, were Dion Brooks and Marty Newman. The first item was a brownfield cleanup program related to 34 Barry Street, which is on the corner of north 12th. You know a lot, I'm not going to read the entire. You know written report, it's quite detailed, so I encourage you to go back and read it and the attached present presentation. We, you know, get these reports coming through the board to our committee on a regular basis for volunteer cleanup programs, Brownfield Location, Super fund I, don't know if people are aware of this property, but it you know it it's an already developed building with with a lot of apartments and residents already. You know we've been living there for 10 years, and so that's we requested that department of environmental conservation come in and so Jane H O'connell who's, a regional media, remediation engineer or DEC came in and presented the essentially the site. You know its biggest use historically was a quinine factory and there were other chemicals that were stored on site and then there were other less nefarious uses, not nefarious, but toxic uses. You know more recently, and then it was the building. The previous structures were demolished and it was developed in in 2009 and at the time you know petroleum was discovered and the combination of the sub you know sub slab and remediation procedures. They proceeded with developing the building and and getting you know, a certificate of occupancy, but in 2017 through except more you know additional testing. We discovered that there is a acclimated solvent. You know a massive plume under the property, which is called one two di Chlor, one, two DCA, which is a volatile organic compound and the so. The developer has gone through numerous steps in the process of doing an investigation with DEC and putting an interim radiation measure in place, which is essentially you know extracting products, including the petroleum plume, which is more extensive than they originally found. There are probably over there. Not probably, there are two over two dozen monitoring wells on site and adjacent to the site. The plume essentially covers about half of the property. You know the main, the chlorinated solvent plume and extends about halfway into Berry Street, and they at this stage they're devising a remedial access working plan, essentially the means by which they're going to mediate its examination and that decision will be made in this month. Supposedly at this time, and so there you know, is a rigorous discussion ensued after the presentation, and essentially we asked them. You know how the heck did. How was this massive, the traditional plume not discovered earlier and DC says, essentially they only test for petroleum. They don't test these other chemicals, it's just if they happen to you know, you know, kill themselves during that testing. Then they deal with it, which, if we found alarming and the remediation and the air monitoring, is taking place in the basement parking garage. You know question is what to them. Why isn't there air monitoring throughout you know for the residential portions of the building. They said they were required to do it in the parking garage area and partly what prompted our bringing the DC into talk about. This is. The notice was posted to a neighborhood Facebook page and one person who posted with a former tenant of the building who lived there for six years and said the year after they moved out her son contracted cancer, and you know and just developed that the woman direct message of me at one point and said he's in remission, but but you know Laura Hoffman Acid, and so it's just you know, the health studies should absolutely be done and DC did not really respond to that demand, and so this, of course, was just kind of left in the current state that it is that they're just going to remediate the product in the report, which you can see online I, don't know. I should also note in the Jane O'connell's presentation, which also be attached. There are links to the webpage and Dc's website with you know. Detailed coverage of you know various all the aspects of the of the program, but she also what she reiterated is that basically, the building's safe, there's little or no threat of vapor intrusion into the building and and unfortunately there was a reporter from the Brooklyn paper, Kevin Dugan, who covered it and printed a article about it two days later and created awareness about it. So so that's- and you know also noted that you know the developer basically can get credit for this cleanup. Your mark I mean with the rents that people are paying to live there. I was just just really incredible that they're receiving tax credits for building on top of this this toxic land. So that's, basically, where that was left. They were, you know, considering, maybe bringing in other they bring a doa having you know additional conversation about this matter. The the second item was an update on the national grid, North Brooklyn pipeline expansion and ray case by surrendered by Kim Freycheck and Lee Zitchie from St Energy. They, you know they were in the board. You know earlier in the year regarding this matter, and essentially they national grid is finishing up. There are five phases of this 30 inch pipeline that they're laying from Brownsville to green point right now: they're in east Williamsburg, Bushwick, finishing up phase four and they're beginning phase five, and they you know additionally they're looking for a rate craze case, which is essentially a rate increase that they want from the Public Service Commission at the state level to help fund these last two phases to the amount 100,585 million dollars in energy and what's called the north, no north Brooklyn pipeline coalition has basically generated thousands of voice comments and written testimony. All calling against you know killing this pipeline defeating the rape case and right now, they're. Basically it's you know it's there's negotiations going on right now about how it's going to play out. One other factor is that you know the this. The city basically passed a law that essentially bans you know: expansion of fossil fuel infrastructure in New, York City. So the focus of the resistance is on him right now, because one of the end goals of this pipeline is to reach a liquid natural gas terminal on Newtown Creek, which they want to expand and would essentially enable trucks to move the product to other areas like long island and out of state and those types of trucks are just incredibly volatile. If they were to explode, it would just be just horrific and devastating, and so they need a special permit from the city to do that. So so the cult origins coalition is really putting on the mayor and the city to not issue that permit, and so one thing they also asked of us was for the board to write a letter to the mayor, urging him not to you know, to not issue a permit and to stick to the law, and so we're in a process of drafting that and that'll come up the next committee meeting and then the next full board meeting consideration, and that is that is it. Oh I also just want to add that the the presentation for stain energy is also attached to the report and ways that you and networks can join the coalition. If you choose to resist. Thank you next item. Tom Brown. Have you asked questions? Excuse me: are we asking questions or just commenting in chat, hello, I'm happy to to field questions well, I didn't know, I understand that I mean it's quite an unbelievable report. You just gave I mean I'm frankly, I'm stunned am I the only one in the room stunned by these and I guess. I won't know what you wanted us to do just to agree to support this last thing. Well, one thing I yeah I failed to mention is that the developers required to notify all the tenants that what is going on with this, the state of the property and the remediation and DC said that they distributed the brownfield cleanup notice to the tenants as well. The reporter interviewed tenants going in and out some of them knew nothing about the situation and indicated that the landlords or the property owners noticed seemed deceptive. Not really, you know, spilling out, what's really going on. Unfortunately, so it did get pressed. You know, yeah. We were especially what further we could do. Okay. Thank you. Chester next item on the agenda is Tom Burrows update, oh sorry, Tom. Okay, sorry, everybody on the board. Please print out your agenda, which has the liquor license list under the public hearing agenda. As I said earlier, there's 45, new and 67 renewal I do know that some of those licenses have been suspended because of Covid-19 violations. I do know some of them have noise and police problems, but I can't know every bar in the entire community board one area, so please go through the list and make note of any ones that you have particular problems with or ones. You really like a lot or anything like that, so that the committee can make responsible decisions at our meeting and our next meeting is on the 22nd I. Don't know how we're going to do it with that many applications. I'm trying to work out with my committee how to wheel. You know wean certain things out so, but please go through the list, because I don't want to hear about it after the fact that some bar that's been the horror of all times got approved by us. Okay, that's all I want to emphasize. Thank you Tom. That concludes our committee reports. Oh dialysis, yeah find me Mr, Fuller I just have I had emailed you about one vote that we needed to do for transportation. I did not get an email on you, I. We sent out twon'tices, actually chairpersons. If they want to give a report. An update to let us know, I do not have anything down that you want to speak okay and then we also talked about it as well. Find me. We also spoke about it as well. I thought it I thought. I had seen it forwarded to the board. I, don't have you down as you want to speak well, I can be quick. It's one item. Okay, you can be quick, but let's just emphasize this to all chairpersons, we send out a notice asking chairpersons to. Let us know what they want to speak. I would appreciate it if everybody would follow this, so we can make these meetings as seamless as possible, so we'll know who's speaking okay. So yes, I'm sorry about that. I did send it last week, but whatever anyway, so we did not have a. We did not have a meeting thanks. Well, we did not have a meeting this summer, but we did take up the item of 200 Kent back in February. The board had voted to approve it with three conditions. One was that the trader Joe's that's moving into the retail space and the developer Mr Rosen come to some agreement that they would not allow trucks larger than 53 feet to access the load stone, and this is just to refresh your memory. This is to change the direction of River Street to allow for trucks to enter and enter any regress, the the area around 200 Ken, which is metropolitan to north third, so the first condition was to not allow 53-foot trucks. Second condition was to introduce a dedicated split light at Metropolitan and Kent to allow safer crossings for pedestrians and cyclists and another stock control at north. Third, and and Kent those conditions we did receive a letter that was forwarded, I believe yesterday from the firm Stuart Schwartz. That's representing the client in this matter that they would commit to keeping the size of the trailer to smaller size, the 58 foot and not allowing which is actually 51 without with all the the cab and everything else. But we did receive that letter with that commitment from them. D.O.T needs to go through its regular bureaucratic process to establish warrants for the turn signals. So, although the committee did almost insist that we have that stop the turn control at Metropolitan in Kent, it does need to go through the regular DOT review. I said, based on our letter to DOT, we submitted the board submitted two requests to study those two intersections and because this is a major change. If the. If the the study doesn't warrant a signal change now we can reapply within the 36 month window, because there is a major change in the traffic pattern. So DOT will have a better idea of before and after so we can better assess the safety there. So the DOT does need to move ahead with the direction change from River Street, so based on the goodwill of the developer and trader Joe's, as well as the process going forward with Dft I'd just like to recommend somebody make a motion to approve the the direction challenge for River street I make a motion Dell Teague, so Captain, Agros Second have a roll call vote. Please you want to just repeat the motion. Yes, the motion is to approve the committee's recommendation from February to approve the direction change based on a good faith effort to meet our conditions. The board's conditions does that work. It's basically a follow-up vote to the February vote. Can we do a roll call vote? Jerry? Yes, you hear me. Yes, the motion is to approve the recommendation from the committee. Your vote response should be yes, no or abstain, gene Argento, yes, Lisa, Bermonte, Gina Barros, yes, Dion, Brooks, Eric, Brzeitis, yes, Tom Burrows, I'm voting yes and Lisa. Vermont said she couldn't get on by, but she would vote yes he's having trouble with her computer yeah I was Cabrera. Philippe connect, Cabinetro, yes, Phil votes, yes, Frank! Carbone Votes, yes, Stephen Chesler, yes, Stephen Cheslav, Ocs, Michael, Chirichella, Michael, Churchill votes; yes, Theresa, Seattle, Giovanni D'amato; yes, Giovanni votes; yes, Aaron drink. What up? Yes, bought the votes; yes, T, Willis, Elkins, yeah, Timothy votes; yes, Julia, Amanda Foster! Yes, do your votes! Yes, Joel! Goldstein, Joe, Ghosty, no vote; Joe, Gross, Joel, Gross, no vote; Sonia, Iglesia, Sonia, Glacier, no vote; Moissa, Indig, Boisha, Indig, Posina Kaminsky; yes, Rosina votes! Yes, Ivan cats are from no vote. William, Klagsbald, William Clagsball, no vote; Ryan Coonan; yes, Ryan votes; yes, you all landau y', all Landau Elvo Luilianza really answer. Yes: three votes! Yes, Abraham! Leibovitz Abraham, no vote; Yolo; no vote; Trina Mckeever! Yes, I'm sorry abstain, something abstains, Toby, Moscowitz, Obi, Moscowitz, no vote; Martin Needleman; yes, Martin Needham votes; yes, Sonia Ignacio, just texted me. Her Wi-Fi went down I vote. Yes, I'm back on. Yes, oh wait back on huh, yes, you're all around all right! Thank you! Rabbi Needleman, Rabbi Needham and no vote. Karen Dieves! Yes, Karen votes; yes, Mary O'domerick! Yes, Mary votes; yes, Janice Peterson, yes, Janice Votes, yes, Dana Racklin; yes, Aina votes, yes, Isaac, sopher, Isaac, sulfur, no vote, Robert Solano; yes, Robert, Solano votes; yes, James, Stewart, James, no vote; deltig; yes, no votes! Yes, Tommy, Torres, Tommy, Votes, yes, William Vega, yes, William votes! Yes, Maria Vieira, give me a thumbs up or a thumbs down. I can't hear you, but I can't see you. Okay! Thank you! Steven Weidberg! Yes, Stephen, Weinberg votes! Yes, Simon Weiser, no vote, 30, yes, zero! No one abstention. Motion passes. Okay, thanks everyone, transportation, Committee is going to have a vote meeting Thursday next Thursday, the 14th I think the agenda will be amended right now. It's broadway stages, looking for an open streets application, but there may be additional items and that's it thanks. It's important because on Monday, because it was the thank you it's a good thing. You were going to be quick Eric. Thank you, hey sorry, yeah! So much for quick, hey! We still here! Thank you! Eric Jan! Did you speak after the moment of silence? No okay! You can do it now. Okay, I, just wanted to the women's issues. Committee has been talking about how to give recognition and honor the people that, since the end of February in our neighborhood, who have been doing work to help mitigate the impact of the quota virus and I just want to list some of the names that people have put forward in more I was going to have it in the quiet time, but just to list. But there are others, and we would like you to send in to me and to other people on the committee. The names of people that and organizations that have really helped do the opposite, I think of the census, but who really have gone out of their way to make a difference, and some of the names that have come up is first of all, swinging 60s, with top with John Pell and his whole team. In the beginning days, staying in and cooking and delivering food to people like Tish and her husband and people throughout the neighborhood Deborah Bender's at Cooper Park, who has provided created a way to provide hundreds of people in Cooper, Park, Food and distribute food because people don't go in to distribute and she's. Also pro they've also cooker has also provided food to other organizations in the neighborhood that didn't have food. There is I, don't know: Sonia Velasquez you Ncca St, Lucie's, old Roman, Catholic Church was nominated, Neil, Sheehan and Felice Kirby North Brooklyn angels, who I think have gone everywhere because they certainly went to Cooper and they went all over Tina Shipman from Bushwick houses, owners of the Jimmy Diner La service. We certainly know that Salerno Garage was all over TV for waving people's rent for all those buildings near the garage and other things that Salerno did. Saint Nick's alliance has been and I know. Marie Leonza is part of that following every trooper, that's living in the senior housing to make sure they're, okay, but delivering food taking care of needs that have arisen, the Bushwick generator, which I don't know what that is, but has provided food and support and I will stop at that and just say we I think on behalf of the community board one it's very important to recognize the incredible things that people do. I know I've seen so many board members here that have gone out of their way. This was not a definitive list, but it would be very nice if people here would just quietly nominate people, we can send out a form, but I, don't think it's necessary people in organizations that you think and that rabbi, niederman and others I know that there is an ambulance. The ambulance from ambulance has not only been caring people in your community, but trying to keep them out of the hospital and providing oxygen tanks. So I think it would be very good for us to. We want to compile a report and make a formal recognition and so, on behalf of the board I want to thank you. We want to thank you all for the work you've done and obviously, if we've left somebody out you're going to send it in we've done the best we can with the communication systems before us now, hey Jan can I add to this Saint John's church. Please do I appreciate it greatly. They give food to the pantry three days out of the week and they've been doing it since March wow, Jason tabar, the pastor just left, and he should be recognized for his hard work that I will put down and I think, and these are complete people that don't have much money and churches that don't have much like way out of their way. Eight days after week, yep thank you, Jan I think we should add Jerry Esposito to that list for making just keeping our office open every day. Since we've been in the all pandemics community calls. We thank you Jerry for doing that, and Marie I think yeah, Maria and Joanna Jerry's been there every day, though wow unless I had the office. Let's say: oh, that's I! Definitely got it right there. Thank you so much, okay I had Jessica Roacho community relations from Wood Hall Hospital. Okay, thank you Jan. If anybody else have anything that they want to add, please send us an email to the office and we'll get it to Jan, because we want to recognize anybody and everybody that what they did to help us get through this pandemic and still doing so. We don't want to leave anybody out. So anybody that know of anybody please send an email to the office, so we can get it to join. Thank you, Jerry. Do we have any elected officials that to speak that sign not to speak? Yes, we had Mr Levin Steve Levin hi, everybody! Oh sorry, can you hear me? Okay, yes, okay, I'm sorry, I'm echoing so much I'll turn mine down. Can you all hear me? Okay, yeah. We all have a technical difficulty tonight: okay, thumbs up: okay, hi everybody, so I wanted to say a few words about the budget. The fiscal 21 budget and first off I Trina wrote. If I had an update on the national grid pipeline at the Psc I. Just looked through the Psc's agenda from June through August and I, didn't see anything that doesn't mean it didn't happen. I, just I didn't see anything in the ps, I'm not like I, don't know the Psv agenda that well to know what to look for exactly, but I don't see it as having been voted on by the Psc. But I will look more into that Gina and get back to you. So this year's budget was, you know by far the worst budget we've had in a few generations. We had a budget deficit of about nine billion dollars that opened up from you know, early March until we passed the budget in late June and that's you know, that's close to ten percent of our budget. It's just a massive amount to come up so quickly. I mean we didn't. Even you know it was we had. We hadn't even contemplated that in the preliminary budget presented by the mayor in in January. So and then we were faced with this kind of unfortunate set of circumstances as well, because the mayor wanted to get borrowing power but needed that borrowing, power from Albany and I. Think Albany was disinclined to allow the mayor to borrow because they didn't see him, as you know, being a you know, really thoughtful steward of the public dollar, the public purse, so they didn't give him borrowing authority and and then we did not get any help from Washington, because Mitch Mcconnell continues to hold up any any Covid-19 related stimulus. And so you know we had hoped that we were gonna, get a federal stimulus by May and we didn't get anything so so there we were in June trying to deal with. You know nine billion dollars and we were able to get some matter of reserves attrition things like that. But when the rubber met the road we saw cuts, we tried to avoid layoffs. There were seasonal workers that were not rehired, so we saw most noticeably I think parks. Seasonal workers were not rehired the pops program, the parks opportunity program. So that means that there were a lot of summer workers that were not there for the parks Department, but we didn't have layoffs per se in the parks department. But, as you all know, the city is still fixing layoffs and the mayor's threatening 22,000 layoffs, and we still don't have borrowing authority and we still don't have any word from Washington whatsoever, anything close to an agreement between the house and the Senate, so so we're on our own. As a city, we have we're just we're spending for ourselves, and so we at the council made a lot of cuts, a lot of cuts into discretionary programs, things that we have built up over years, mostly programmatic dollars, but you'll, see it in sanitation, cuts so basket service and things like that. You'll see it in your parks. You'll see it. You know with just it's attrition, there's a hiring freeze. We obviously you know that the most kind of controversial aspect of this all was the the NYPD budget. We did cut 420 million dollars of the NYPD budget out of a budget of about close to 6 billion, and that's that was real cuts, those that most of it was overtime and over time it's complicated because over time you know it accrues over the course of the year, but they have they agreed to give us a kind of you know: I, don't know if it's monthly or bi-weekly accounting of overtime spending and so far it has not gone over what they had committed to. So far, it's a long, the trajectory that we had agreed on and is not and they're, not over overspending on overtime. We will continue to keep a close eye on that, because that's not the kind of thing that will just explode overnight. It'll be that's. If it was to go over, it would be going over monthly. So, but we- but you know, we anticipate a 420 million dollar cut to NYPD. In addition to the overtime, there are no layoffs, but there were two classes that got canceled two NYPD classes so out of four for the year. So so that will mean less cops hired this year, so I mean this was brutal. I felt an obligation to vote for the budget Antonio. My colleague voted against the budget, but we were both on the budget negotiating team. You know in on zoom in the zoom room, for you know, hours and hours on end. You know going into every line of this budget. I felt an obligation to vote for in a sense because it was so awful that you know I felt like somebody had to do it, because it's not just one agency that gets funded in this budget. It's not just the NYPD budget. It's not just you know. This is it's everything every budget every agency budget was in was it was there and you know hard decisions had to get made, and so I felt some obligation to do that. Knowing that it was, you know a kind of no win politically, but you know, among other things, the City Council discretionary funding to community boards that got cut. So I'm sorry about that, but that got xed out and hopefully that can get restored. You know if we're able to get the revenue back, but as it were, that's gone for fy21 and happy to answer any questions about it. I don't have it like all at the tip of my fingers, but if I don't have the answer, I'll get back to ever asked question. Thank you. Steve. We asked people to put questions in the chat Joanne. Is there any questions in the chat? No, there's no questions all right thanks everybody and I'm around so if you know, feel free to reach out to me or anyone on my staff and I'm here for at least the next 18 months or so. Thank you so much for 15 months. Thank you! So much Steve. We appreciate the update. Thank you, chair you're, welcome, bye! Thank you, Steve. Okay, next item on the agenda. Okay, I'm sorry speaker during public session we had one person who's written testimony, but I see that he's here as an attendee. Do you just want to acknowledge you have his testimony? Did we have a call, senator Cavanaugh and because we jumped over with the elected official that was present Kevin all recalled in the beginning? There was no show and same thing with Salazar's office. There was no show that was in the beginning and I don't see them. Okay, I know that the mayor's office wanted to speak. Well. The Parks department next item on agenda is parks department when it has read so we have no other public speakers. This is Edward from the mayor's office. If I can get wait. Edward you're coming under the electives, we're in the public section there. So Marie there's no other. There's no there's just this one gentleman I don't know if he wants to speak, but he did send written testimony. I'll see. If he's he wants to say something. Is he on the phone or yeah he just texted in the chat that he wants to speak? Is it barley, Cohen, Marie, I, see it I see something. Is that me Bartley Cohen, Mr Cohn? Are you there he's on as a panelist, but I don't know why he starts speaking. Okay, he's not able to speak, but we have his written testimony. Okay, so we can distribute that to the board. Okay, no other speakers, public officials, Jared, do you have a list? I know we have ed with Mr Cenero from the mayor's office and I know he's been waiting a long time: okay, Edward Good night, everyone! You know today good evening right, it's pretty late, so I'll be brief. First I want to echo the comments made by the chair about you know the board staff they've been really impressed throughout this pandemic, and so you know my I took my hat off to Jerry Marie Joanna, because when we were at the height of this, they were really responsive to my inquiry. So just want to you know, give that up for them as well and so far as my update I just want to echo some of the things that the mayor spoke about during his media availability this morning, namely that you know. Hopefully, everyone had a good Labor day weekend, but if you traveled outside of New York City, there are 33 states and territories that, if you travel to them, it is, you know the safe thing and the mindful thing for you to isolate for at least 14 days upon your return. Some of these states include Alabama, Alaska, North, Dakota, Oklahoma, Mississippi Texas, and some of the territories are like Guam Virgin, Islands, Puerto Rico. So if you've traveled again, we want to keep up the good work that the city is doing and all of you, New Yorkers, have been doing it and driving down this pandemic. And so the only thing I would add to that point is: if you want to get tested, you can go to New York, City, Health and hospitals. They have some of the best turnaround times right now. The near sight to board one or at least in the area, is Jonathan Williams houses or Gotham health, which is 333 Vogtland street. They have Covid-19 testing and anti-body testing they're open Monday through Friday 9 A.M to 3:30, P.M and Saturday, and Sunday from 9 am to 2 pm. Lastly, again I'll be brief: when we've been long is on the school opening. Today was the first day that teachers reported to duty to 2016 teachers will start instructing kids remotely as they continue to prepare for in-person classes and then on Monday to September 21st. It's one we'll have the first day of like blended learning, where some students will report part of the week and then will be remote on the second PA, the second half or you know whatever. The breakup is as part of that. The mayor also announced the Learning Bridges program, which is going to provide free child care supervision to children's from pre-K and K-8, because some folks go to work and they need child care in order for them to. You know attend remotely. So if folks are interested in that they can go to New York schools, DOT NYC, DOT, Gov Learning Bridges, and they can learn more on that so I think I'll keep it there again. Thank you, everyone for your dedication for staying so long, and if you have any questions you can feel free to reach out. Thank you. Edward, okay I see that we have a Miss Sharon Pope Marshall that wants to speak. Let me just make this announcement: the public elected officials. We have a spot for them. We send out emails. We ask everybody to send an email in advance to the office so that we'll know you want to speak anybody that want to speak in the public section. We also would like for you to send an email to the office. So we'll know that you want to speak. That's the only way we can make this as seamless as possible is that we know who's going to speak and then we could. We call that name. Miss Pope. Are you ready to speak Marcia, Miss, Pope, Marshall, apparently she's? Are you having to she's having technical difficulties? Okay, apparently she's not able to speak. Is there any new business is in the old business? Yes, Madam chair, yes! Well, it's first I'll just I could request that the can anybody hear me, wouldn't let me go at home tonight. My name is Sharon Pope. Can you hear me? Yes, we can, in the future Miss pope if you'd like to speak, send us an email to the office. Please I would am I being allowed to. Thank you very much, madam chair I. Do I have the opportunity to speak now or should I send an email to the office? It's it's up to the board she's on. Let her go! I'm sorry, madam chair she's, waited this long. Okay! First of all, thank you. So much I really appreciate the opportunity to speak Medicare and also community board members. Thank you. I represent bike, New York, and this is a tough situation with the pandemic. Since 1977 we have been biking the streets of New, York City. We know that this city and state is New. York, tough and bike. New York is New. York tough I want you to know that we have created our very first virtual event, which I will put in the chat. It's called a spoke Tober and it's it was created to be family friendly, very low. Can anybody hear her no she's cut out now go ahead? I just requested the revision of the revised bylaws. If could be posted to the website, just for you know, and the now that the bylaws have been revised, allow for electronic elections can the election process proceed with nominations and the elections in the near future. I think we're gonna need a month and a year and a date to start this I didn't see no starting period, no starting time how about a month? How about the bylaws committee tell us what they want to start? Well, it seems like it's at the discretion of the board the bylaws Julia Foster. We didn't come up with a date and sitting as a chair and watching this program and watching this web page I think there's still some kinks that need to be worked out before we make a final decision to move forward as to picking a date I go in and out chair people go in and out. People that are here can't speak. There's some kinks that still need to be worked out before we come up with a definitive date. Would it be possible to have nominations next month once again, there's still some kinks that need to be worked out. We need to work some things out before we could just say we're going to nominate and have an election. We didn't even give a date as a board as a committee mikiva as a committee, this committee has not picked a date for when this will go through and I'm not sure I could be wrong. Does it still have to go to the law department for approval from the president I need clarification. The bylaws changes that you've made tonight. You know, can you hear me? Yes, the bylaws changes that were made tonight allow for an electronic process. However, these bylaws would have to reflect the date and the period the month and the period when you're gonna want to have the election. If you're going to have an electronic vote, and the bylaws must reflect that. Accordingly, we were not told that either it's into bylaws. Well, that should have been brought up. Then, if you knew that in the Bible amendments indicate something about the next available meeting, there was some in the proposed bill or amendments nope. The amendment that's in the pipeline at the end of the report, so that you know officers terms will be extended until elections are held like that implies that just have elections, maybe a rotary table or a chamber. It says until they're held, but we have not picked a date to hold them or pick the nominations. It should be really good. It has to be clarified. Things have to be clarified too Julia, I'm a little confused, because the whole point of what we did was to not be in this situation right now, but we are I, hear you, but that's we have a committee and I would say that we, then this committee needs to meet again and pick a date and put it in the by-laws. Why didn't you pick a date and put it in the by-laws? Why are you wasting time pick a date? You did a whole day well, three months to pick a date. This is absurd. We don't get people next month because you have to go to a meeting and have another discussion Ryan you should have been there. Thank you for muting, her Mike. We have not picked a date, let's make sure we are doing things under the correct laws. Let's do it right. Yes, we had a couple of months. We've had a lot of technical problems. I couldn't even make it to the last meeting, because I had a blowout here. I couldn't even get my commute computer on, as you see I'm going in and out now and I. Don't know why, please not trying to delay it I, don't think anybody else is trying to delay it, but if we must, as a committee, meet to pick a date, that is something we need to do. I, don't like going back and forth with people. If that's what we need to do, we need to do it just pick a date now, I have a child in the room that I need to get to yeah hello, no hello! Oh my god. What happened? Can we just pick a day? Julia Marty, the bylaw amendment says at the next available date, so it was nice today and at this time I really want to get off this computer. I'm not trying to block anybody today. My September calendar is busy. The board can choose a thing you're too busy to vote next month. You can't nominate people come on Noodle Mike. You said none of our meetings, you don't know. What's going on, Julia I wasn't what's going on you're trying to not let us nominate people in 30 days, because thank you. This is what happens. Everybody constantly, my god. This sounds like the president of the United States. Yes, it does okay, but it's all still about democracy and moving it so Julia you, we have a quorum right here. Can't we just. Why can't we just? Why can't the sixth question right now at the next meeting? Why can't we do it at the next meeting next month? Why can't the names be? You know the nominations take place next month, next month's meeting and then the following meeting we'll do it okay? This is the committee meeting I'd like for my committee to actually be able to sit down and argue it out simply because I know I haven't done this I have agendas. I have a lot of meetings in September. I am not only on Cv one. Okay, Julian, it's totally our whole company. Let me speak. Our whole group has already may I please what I'm suggesting is that the nominations be brought forth at the next month. We meet are we meeting next month? Are we having another meeting next month? Can we do it next month? Sure and I'm very concerned about today we had a problem signing in and everybody was having a difficulties, and how can you in a in right, mind, have the election this way when we all have a problem signing in just wait until the next meeting have everything go smoothly and then proceed with the election for God's sake, I mean I, don't think there is a big issue of people being elected to the position. I mean we all know each other. We all know supporting each other for God's sake. I'd like to read section c elections in the bylaws item: 10 special elections in the event of an interim vacancy, a special election would be called the nominations and then a special election to be held at the next available meeting of the full board following nominations, I feel like we, our bylaws allow for us to hold special nominations and special elections. So what are you proposing about next month for nominations and the following month? We have the elections, okay and we're in which is what's being proposed. Right I can't hear y' all I'm going in and out so Julia. We can have he's saying that we have the nominations at the next board meeting Jerry. When is that October? What October 13th, okay, October 13th and our and right now it is September, 9th or 8th, so our bylaws, maybe we could meet in the next two. You can meet days next two days, I'm like okay! Well, I won't be there. Where are you leaving town? No there's nothing with that. Like I, said: I have a schedule too. I mean we all on this. Having the nominations at the next meeting, which is October 13th and the elections in November right, yes, because we have a quorum of our bylaws committee right here right now on this phone yeah, wouldn't the bylaws have to reflect. That was the whole purpose of having the bylaws state the term of officers. It's. It says the next possible date until the next possible until the next possibilities. Yeah. No, but that's not the regular term offices right. No, it extends until the election officers are until the next available date to have the elections. That's the public officer's law. Yes, as I said just keep it simple. If we can have a community really, the committee should really reconvene to come up with a date of a vote and then in the term of officers and put it in the by-laws and make it exactly yes, but he said that in our last meeting we all sat there for two hours. That's why we're annoyed well, Jan. Nobody brought up the fact that we should be putting a date specifically. Why not? It's now being called out and I think I. Don't think our adults need to adjust it and do it correctly. The Alice got cut off again. So it's back to you to chair the meeting. Did that mean that the election would take place? The nominations would the bylaws would get voted on at this meeting? The nominations would be the in the vote, which is the October thing, and the voting would take place in November. I sat true, I sat down, I lost him, that's not what we said. That would not think that it would be held in November. No one put that it's not in our minutes. No one made a statement as that is our intent. That's what it might have been can I ask the question: it might have been the intent, but it's not in the minutes. If we need it to be in the minutes and we need to have a specification date, then we need to do so come on stop trying to cut corners. Are we doing? Let's do it? Let me ask a question here: I, I'm cheering now so I have to ask a question: are we fighting over essentially one, in other words, I? Think is Julia saying that let the bylaws committee Meet and then real, simple and then the Bylaws committee will present this to the board in October and then nominations would be in November and then voting in December versus the nominations. One month earlier in the voting one month earlier down now and saying that probably about one it was never presented, it was never in the bylaws you're not doing anything by the book. Just real, simple I, don't understand it. Why it's got to be now when you didn't put it in there. Nobody wanted to do it. Janet, I'm speaking now. I have a lot of stuff in my head about these rules and this bylaws and, of course, folks met on their own and discussed it and I wasn't included, but that has nothing to do with it. The fact is, we did not pick a date. We as I'm not doing this right now. I want to get off this meeting. We as a committee needs to get together, decide on a date and look at your calendars and make sure you're available right now. Julia excuse me: do we have a coin with the board members that we can all decide today and get this out of the way yeah I would propose that we have the nominations on Tuesday October 13th at the next meeting right we're trying to pick a date to have a nomination committee. Let's make sure it's in the bylaws, please stop cutting corners people nominations Julia that you're available the next day, elections in November, meeting, yeah, again right nominations, October 13th would be no we're not having nominations, October 13th right now, I'm sure this is in the bylaws and that it's in there and I'd like to follow the bylaws. You know it says the current population mistaking that was the original bylaws that we are mending now. The most recent amendment says at the next available date and we didn't put in a month. I think I think Jerry made that clear. That was for another section, no I think that's for I! Think that's for a special election I. Don't think this is special election, but certainly I just is it seems to me it seems to me this argument is basically over one more one month, difference and a day for a meeting I personally. Very much want this to be over with I. Want the right to be happy and I want it to be correct, I mean, is it worth for everyone to have such hostility and anger over a one-month difference? I, don't know I'm just saying: well, it will be one month or six months. It shouldn't be six months, but my understanding is the Bylaws committee can meet and then can present the date to the at the next October at the October meeting, and then I would hope. That means that the nominations are the next meeting and then the elections are the next meeting. I think everybody agrees with your thing. If you give us a date, Julia will give us a date that she can do, because we have been trying to get these decent meetings, and this is getting pairing. Okay, so Jan, are you saying you need a date for the next one right now that we had my calendar in front of me, I was not available in the next two days. That's why you said you want to have your two days. I just want to deal with anything. I'll take I have I, don't know if anybody else's calendar is good. I have the 22nd of September 28th, yes, is that a holiday Marty I, don't think so. I checked, but I have cb1b the calendar. I don't see it. Saint Martin's is the 21st that Monday. Let me check where's my phone 20 seconds. September 22nd is not a holiday. It's not a jewish holiday. Okay, September, 22nd, okay and I know I'll, be in New York. We could even meet in the office yeah. That's the late community thing that they also. We have SLA that night. So we have Webex, you can't have it yeah. We can meet in the office meal. How about the 24th? Anybody Maurice got the calendar with all the meetings on it. Why don't we just do it? What time is your meeting over? What time is? That's the layover there's 125 licenses: that's not a good idea that that's a long meeting how about the 24th Maria? Are we good for that? I have conflicts myself. Why don't you put? Why don't you get some dates and then we'll have to check with the committee members to see if they are available? Now is the 24th available? Yes, I'm not available, but that's I'm not the only one in the world who's not available and who else there's a little story of this board meeting that night, I'm clear on the twitter. Can we meet at five o'clock on the 22nd 24th yeah. I'm good time is your meeting which meeting the poorest meeting, which one SLA? Yes SLA? What time is the SLA meeting 6:30 Tom? It's the same time, every month, 6:30. 15 at five o'clock? No, it's not a good deal! 24Th, I'm good! What about five o'clock on the 24th? Okay, good I can do that five o'clock works for me on the 24th. For me. Yes, it's almost 10 o'clock, guys yeah, my and my kid hasn't eaten dinner, but Marina Home, Marie, you're, home already, I, don't know about your kid all right, so it's settled that you're going to have the meeting is getting settled. The violence committee meeting will be held and then you can vote on the states and make sure that in the bylaws that we don't have anybody saying we're just picking random dates to have elections, it will be concrete in the bylaws June. It says June or July in the bylaws. Well, we went past that we already I'm not even going to go back there again. I got a headache. Julia see how bad my dog is. I just want you to see, don't bite, nobody she's mad yeah. So is my grandson he's hungry? Can somebody make a motion? I mean I'm not the chairperson of this meeting, but I need to make him out of this motion. What's the next sport meeting the third person October 13th? Yes, okay, yes, all right! Do we have a motion to adjourn? Yes, can you just say who made the motion and who said emotion before you yeah the motion to adjourn I wouldn't invade a second emotion, William and I. Your name should be down on the help list. Please say we need to do a a. What do you need to do? Nothing, there's a motion to it. There's a motion to adjourn. Yes, please don't say we need to do a roll call, please good night, everybody good night, hi good night. Thank you good night. Thanks guys, stop here, I want to leave. What's going.",
            "summary": "There was a lot of discussion about making sure that we've done everything we can to protect this grass, and we have we've gone spoken with the landscape, architects and the maintenance team, every measure that we could was deployed, but the options become limited because what they pointed out to me that I didn't have in front of me at the land use committee meeting was that this area of the grass also falls within an easement held by the city and the state, as well as part of the necessary vehicular access path for the fire.\nThere was a lot of discussion about allowing some kind of out that retail inside the building might not make a lot of sense here and that people wanted to see outdoor dining here that put more eyes on it, use the space a little better, and so what that resulted in was removing one of the commercial entrances, and for that the zoning requires a densely planted screening buffer between the building and the public areas which would be required on the right.\nThis speaks to really the developers and their approach to projects like this as difficult as it is, and as we found it to maintain the grass and why we're here, going through this process to be able to repave the area pursuant to the previous authorization and the certification of these plans.\nThink we, as David and Richard have said, have gone through a very complete process, with both parks and the other city agencies.\nOkay, yes, so I just see that Katie had asked specifically different kinds of plantings in this area again compared to fern, which has next to it on the hill, which has ornamental grass the fact that this needs to remain a flat surface that can be driven on changes a bit of the topography and what we can plant out.\nI just hope that you're not importing that on the developer, because I think we've been clear that this is not something we wanted, and it's Richard Lobel, just to kind of reiterate.\nYou, know I think that Elliot's really tried to go a long way to make this a really functional and enjoyable esplanade for the community.\nI could not see the entirety of the question that was in the chat, But let me just reiterate what Richard said: we went through a dynamic process with a whole slew of city agencies about what this covering should be, and we, as you tried very hard to keep it grass or some equivalent, including astroturf, and everything else.\nLet me just then, why don't I just say that we did have a public hearing and a land use committee meeting and the presenters have made my job very easy right, now, because sorry, just seeing just the point of order, do we have to close the hearing before we move into the to the meeting she's cheering right, now, Steve, she's, terrible.\nOkay, So every 10 years the data is used to determine how many seats we need in each states to get out congressional seats right, And so this being said, because we only have, but.\nOkay, If they did it later in the summer, they have to make sure that they do it again, because what happened with the post office being, you know, slowed down, A lot of mail was not received.\nThank you, but most of all, we just need help in getting this done, because, like I said, We are way behind all the other boroughs right.\nDana, so Barbara, two questions, one I know you can only phone bank up until the 24th, but people could fill it out online until the 30th correct, yes.\nA lot of people are doing, occupy the block setups right now and then outside from you, know, 8 p.m, till.\nIt comes to the fact where they wanted to know more about the census, and some of them actually did their census, and then I spoke at Mccarran Park, as well.\nYes, As a matter of fact, I have right in my apartment, I have and what we could always do is if the person doesn't want to do it on your iPad, you can ask them to pull up the website on their phone.\nWe cover city workers, and so we are still trying to figure out why it is that people don't want to do a census, a lot of people when they speak about the census.\nYou know people don't realize that when you leave your house and you walk down the street, everything you see smell and touch is impacted by the census right and so, with the Covid-19 being so here.\nMy people are that I'm really looking out for is domestic violence situations, those people who are living in fear of doing senses, because you know, like I, said you have to reach out to the person to where they are not.\nWas, Covid-19, Yes, I think that the funding was allocated somewhere in the first in the beginning of the second quarter of this year and started right when the funding was allocated and that's the funding that Barbara were mentioning and everything paused and the counters.\nWhy, it's important to a loved one who does have coded you know and will need services when it's time to recover, they were like.\nI would definitely give you a call, but, like I said, I'm, going to put my information down in the box, and we need to see my phone banks sessions.\nWe need a motion to open the board, meaning okay.\nWe, hear you okay, here, Jerry Dialysis asking for a roll call, vote.\nThe bylaws committee members had an open discussion prior to the meeting beginning called to order.\nThere were five members present and we met as a coroner report referred back to Bylaws Committee at the CB1 board held on June 24th.\nIt is important that a vote on the proposal is carried out at the board meeting scheduled today, September 8 2020.\nThe secretary shall know all negative votes and abstentions votes in the meeting minutes under the election section proposals delete the use of paper ballots and implement the use of voice votes.\nElectronic voting and held during a scheduled meeting of the board designated for elections.\nThe vote of the committee was as follows: six, yes, myself, Iglesia Tesla, Needleman, Peterson, Vega.\nI'm submitting a proposal to amend the bylaws, The board bylaws related to the terms of officers and attendance committee, members.\nAdditionally, the committee voted to withdraw its committee report from the June 4 2020 meeting, except for one provision related to the election.\nHowever, Remember that word, however, in the event that elections can not be held according to scheduled outline in the bylaws and in order to provide continually board offices and attendance committee terms shall be extended until elections can be held.\nWe had a public hearing and a committee meeting, and it was with regard to the presentation that you all heard: earlier, 416 to 420 Kent, Avenue, so.\nI will just mention that the committee members did express concern that we were not that the community board was not kept apprised of what was going on and the the applicants actually joined us and said that it was actually uncomfortable for them to have to come to us after the fact when everything was done, and they were very supportive of our sending a letter to the city and state officials, saying that look saying demanding that if any of the agencies either request or require a change in plans that we have approved, that we be kept apprised and be given the opportunity to be participate.\nWe had 10 people at the committee, It was when it came time to vote.\nWe couldn't access everybody, so the vote was was six to one six people in favor, one person against so I need a vote on that.\nThen I will also need a vote on sending out the letter which we unanimously approved.\nWe need to vote on whether or not to approve the application and or to in favor of what the committee suggested.\nYes on the item that you're voting on and vote for, the other, Well, Dialys and I, don't know what you mean by two items: We just approved that application, but we also need I also needed a vote on I needed to vote also on sending a letter.\nOkay, That's why I said you know we do both at the same time.\nBut I'd like to make a motion to admit, to amend the the recommendation that that the developer, trying to include plantings in the gravel area.\nYou know, based on the conversation that took place during the hearing, I'm fine, with amending it to ask the developer to try to add some more plantings, so.\nChesley would like to add to the recommendation that the developer, try to add plantings to the area that is going to replace the grass.\nI mean you really it's going to be very difficult to tally, a vote where you're saying yes on one and no on the other.\nOkay, so we're voting for three items, the amendment, the land use item and the letter of recommendations.\nYes, it's intended to go to agencies, basically calling them to revise their process that they should have notified the community board prior to this modification going through not after the fact and that in the future they should keep us as a part of the keep us in the picture so that they so that.\nThe recommendation is to approve the consensus of the committee with the additions, as stated by the committee chair right, though, Yes. Okay, So the your vote should be yes, no or abstain or abstention on the consensus.\nYou, know a lot, I'm not going to read the entire.\nWe, You know, get these reports coming through the board to our committee on a regular basis for volunteer cleanup, programs, Brownfield, Location, Super fund I, don't know if people are aware of this property, but it you know, it.\nYou know the main, the chlorinated solvent plume and extends about halfway into Berry Street, and they at this stage they're devising a remedial access, working, plan, Essentially, the means by which they're going to mediate its examination and that decision will be made in this month.\nIt's just you know, The health studies should absolutely be done and DC did not really respond to that demand, and so this, of course, was just kind of left in the current state that it is that they're just going to remediate the product in the report, which you can see online I.\nYou know additionally they're looking for a rate craze case, which is essentially a rate increase that they want from the Public Service Commission at the state level to help fund these last two phases to the amount 100,585 million dollars in energy and, what's called the north, No north Brooklyn pipeline coalition has basically generated thousands of voice comments and written testimony.\nThe focus of the resistance is on him right now, because one of the end goals of this pipeline is to reach a liquid natural gas terminal on Newtown Creek, which they want to expand and would essentially enable trucks to move the product to other areas like long island and out of state and those types of trucks are just incredibly volatile.\nSo the cult origins coalition is really putting on the mayor and the city to not issue that permit, and so one thing they also asked of us was for the board to write a letter to the mayor, urging him not to you know, to not issue a permit and to stick to the law, and so we're in a process of drafting that.\nYou know wean certain things out so, but please go through the list, because I don't want to hear about it after the fact that some bar that's been the horror of all times got approved by us.\nAn update to let us know, I, do not have anything down that you want to speak.\nThe DOT does need to move ahead with the direction change from River Street, so based on the goodwill of the developer and trader Joe's, as well as the process going forward with Dft. I'd, just like to recommend somebody make a motion to approve the the direction challenge for River.\nYes, The motion is to approve the committee's recommendation from February to approve the direction change based on a good faith effort to meet our conditions.\nYes, The motion is to approve the recommendation from the committee.\nOkay, thanks everyone, transportation, Committee is going to have a vote meeting Thursday next Thursday, the 14th.\nI think the agenda will be amended right: now, It's, broadway stages, looking for an open streets application, but there may be additional items and that's it thanks.\nThere are others, and we would like you to send in to me and to other people on the committee.\nMarie Leonza is part of that following every trooper, that's living in the senior housing to make sure they're, okay, but delivering food taking care of needs that have arisen, the Bushwick generator, which I don't know what that is, but has provided food and support.\nI, know I've seen so many board members here that have gone out of their way.\nYou know going into every line of this budget.\nI felt an obligation to vote for in a sense because it was so awful that you know I felt like somebody had to do it, because it's not just one agency that gets funded in this budget.\nOkay, I know that the mayor's office wanted to speak.\nI, don't know if he wants to speak, but he did send written testimony.\nWe, ask everybody to send an email in advance to the office, so that we'll know you want to speak.\nI want you to know that we have created our very first virtual event, which I will put in the chat.\nI think there's still some kinks that need to be worked out before we make a final decision to move forward as to picking a date I go in and out chair people go in, and out.\nNope, The amendment, that's in the pipeline at the end of the report, so that you know officers terms will be extended until elections are held.\nJulia Marty, the bylaw amendment says at the next available date, So it was nice today and at this time I really want to get off this computer.\nIs the committee meeting I'd like for my committee to actually be able to sit down and argue it out simply because I know I haven't done, this.\nI'd like to read section c elections in the bylaws item: 10 special elections in the event of an interim vacancy, A special election would be called the nominations and then a special election to be held at the next available meeting of the full board following nominations.\nHaving the nominations at the next meeting, which is October 13th and the elections in November right, yes, because we have a quorum of our bylaws committee right here.\nWe can have a community really, The committee should really reconvene to come up with a date of a vote and then in the term of officers and put it in the by-laws and make it exactly yes, but he said that in our last meeting we all sat there for two hours.\nThink is Julia, saying that let the bylaws committee Meet and then real, simple and then the Bylaws committee will present this to the board in October.\nWe, as a committee needs to get together, decide on a date and look at your calendars and make sure you're available right.\nLet's make sure it's in the bylaws, Please stop cutting corners people nominations Julia that you're available the next day, elections in November, meeting, yeah.\nIt shouldn't be six months, but my understanding is the Bylaws committee can meet and then can present the date to the at the next October.\nAnd I know I'll, be in New. We could even meet in the office.\nRight, so, The violence committee meeting will be held, and then you can vote on the states and make sure that in the bylaws that we don't have anybody saying we're just picking random dates to have elections, It will be concrete in the bylaws, June."
        }
    }
}