{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCAzhpt9DmG6PnHXjmJTvRGQ",
            "title": "July 2020 CB8M Street Life Committee Meeting",
            "publishDate": "2020-07-07",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 2,
            "um": 6
        },
        "wordCountFullTranscript": {
            "hand": 33,
            "application": 28,
            "hands": 28,
            "people": 24,
            "members": 20,
            "board": 19,
            "a.m.": 17,
            "applicant": 15,
            "hours": 15,
            "alcohol": 14
        },
        "wordCountSummary": {
            "people": 9,
            "community": 5,
            "board": 5,
            "applicant": 5,
            "lot": 4,
            "application": 4,
            "alcohol": 4,
            "hands": 4,
            "food": 4,
            "percent": 4
        },
        "fullTranscript": "Abraham, whenever you're ready because it started okay, do we have everybody here? Are the applicants we'll see I'm, not sure, so we have a lot of puffs okay. Well, the reason I was asking is I was wondering if my fellow board members learn objectives. They've all looked at the materials. If we have all the applicants here, if we could take them all in turn, I will let the fellow board members raise their hand to object, seeing none I think thank you. Have the floor. Yeah, because I was thinking that, where a lot of these applications, where always be supportive of the community zone, that there's a strong objection, I would make a motion seconded to take them all together, as approvals I see a hand up, maybe and one for my board member and one from a guest too from board members. Would you like me to unmute Russell and Marco and Aleta when a dime, oh I lost you Abraham? Yes, let's take. Let's ask what their position is: okay, yeah I was just gonna ask if we just have a few more minutes, just to go over everything, one more time and just make sure before we vote on everything. Sure, okay, so just give me, you know five or ten minutes, sir okay, then well, we want to go to mark. Oh okay, mark up, you take it. You hear me now, yes, okay, thank you. I think we can do that. First of all, the main issue is Robert. Follow me procedure be cool. The members they can do that and somebody has to second, that's one to I think is wrong to do that, because we need not to avoid application by application. What we like to hear is what are the problems they are facing, so we can learn from them from each applicant. What is the problem and that's what who in this case, we are not going to scream if that they have been doing something wrong? No. On the contrary, we would like to hear one by one and hear exactly what are they greatly concerned and promise they come, so the community will come, learn more about the situations under which they are living, and this is why I believe the first thing is: we have to walk location by application and learn each of them. What are the problems? What are the challenges that they are facing? Maybe we can help them, because our role is exactly is to help them, especially in this time. Thank you. Well and let's go leader. Thank you. I'm just wondering the Upper East Side has been notorious during the latter part of this crisis for having restaurants and bars that are serving liquor to people on the street and I'd like you to ask them. If there have been any complaints, please about serving drinks who are not seated at tables or where there are issues of people just milling around and congregating. It's just a serious issue with respect to the health crisis and one that, unfortunately, its way around the Upper East Side. Thank you so just to follow up on that, you would like us to ask the applicants whether they have received complaints about the congregating. Yes, I, don't know you do it because we I mean places like the green kitchen. We've all heard about other places. I don't know so yeah I mean I, know that they're not under oath I, don't know what else to do if you have another solution to find out, because there's not enough enforcement and the health risks, as we've seen in other states or really sniff again. Thank you. Okay, so I think I think based on the feedback, we will let's go one by one will on the applications. If you can pull up the I can't hear anything, are you I just want in case you can hear me. This has nothing to do with voting on about them on mass or not. It just has to do with asking them about how they're serving people and if they are doing that right now. Thank you. I have been muted, sorry, Abraham's, also muted, okay, so I think I think based on the feedback. Well, he will go one by one for the applications and we'll take it from there. So with that, for those listening, do I have the representative for application. 1A, the new applications, the liquor wine, beer and cider for Ivy Lane I did Hey Judy. We can hear you are muted before we start a bruh ham. I, don't know if you were part of the transportation committee meeting Wednesday night, but a lot. There was a huge discussion about people walking around the street that was served alcohol. They were seated or they picked up, orders to go and they took their alcohol and instead of staying seated taking it home with them, they were drinking on the street, and that was a real issue and I think that's something that we have to ask the people who are coming before us. How are they handling the alcohol and if they are, if it is part of in order arts, they seem to it that the people take it home and drink it if they're, not seated or the training. So if I understand you correctly so yeah, the establishments can serve to go so you're asking whether what type of prevention mechanisms they are taking to prevent individuals drinking on the street right because that's what's happening, I understand in the 80s and 90s and 70s people are walking around with open containers of alcohol. You can carry closed containers, it's not against the law. Yes, of course yeah. That was what that was what I wanted to say and those her point too. So, okay, we can ask them I, guess no I, guess a question and that I think the conundrum were in is that even if a establishment is serving and sealed containers that doesn't prevent an individual from posting as they're walking down the street and therefore an establishment should not then be penalized for the actions of the individual. I did see that what I thought was the applicant for Ivy Lane, raised their hand was. Are we ready to move to this application? Okay, great and a lower all the hands again, if there's something new that they that needs to be said, please keep your hand up otherwise Alexander hi yep. Here we yes, hi weekender, hi Abraham nice to meet you or amici I should say: I am in House Counsel for merchants. Hospitality, representative for Ivy, Lane or 116 East, 60th, LLC I've emailed before our meeting and to get to the alcohol point I can I can speak to that quickly. Actually, we have I've written the policy to make sure that we don't ask people to stick around if they've gotten something to go and they don't congregate in groups that would exceed any of the regulations, and we were also very attentive to the governor's executive order regarding a hundred feet within your premises, you're responsible for the individual opening that container or violating a liquor laws. So we had hired security guards actually and not a lot. I would say one probably per location or one location in the Upper East Side, that is active, Treadwell Park. We had one security guard there to keep an eye out and make sure people weren't within 100 feet and, as many of you brought up it's difficult for us outside of that hundred feet to kind of expand our responsibilities on the premises. So it has been a give-and-take working with the community on that so I think I'm, comfortable and saying as in-house counsel, that we've addressed the alcohol issue, given the current standards that were there and we're always vigilant and look for any input, the community might have thank you yeah and to the application. I sent an email prior I, don't know if everybody received the materials I think it was a bit of a bureaucratic misunderstanding. We had initially filed in July of last year for our liquor license and we appeared before the community board in the street life committee and got our approval and resolution from the community board to the SLA, and we recently got our permanent on-premises liquor license and curing the deficiencies for our permanent illicit liquor license. We needed to send an amended 30-day notice, which is what I think prompted our appearance today. So I have given all the materials and the differences in them and did notices that I submitted between the initial and the one for the SLA and I. Think. That's all I have for you today. Unless there's any further questions, I can help you with I do what were the deficiencies and in the materials I'm not seeing the hours of operation who were able to provide that the hours of operation we had originally asked for 11:00 to 2:00 a.m. Monday through Thursday is 11:00 to 4:00 a.m. Friday through Saturday 11:00 to 2:00 a.m. on Sunday. I can tell you that we did not operate at those hours and we weren't open on Mondays, so I think our last tables were at 11:30 and we closed by midnight. If I'm not mistaken. Okay, with that I will are there any hands up or members of the public Judy Schneider they've been a good neighbor since they've moved in I recommend their food highly would hope that the board members would support this application. Thank you. Well. Are there any other non board members right, I do not see any hands that are raised, I, say Russell Squire and Marco tamiya, okay. Well then, let's go to our fellow board members. So let's go with Russell DiMarco thanks. So I had a question for the applicant, but before I get to that I. Just wanted to address the point that the Judy had made that Abraham also spoke to I mean I, think that's a question of you know: people with open containers and taking the drinks away from the bars I reluctant to really press people too much on this I think you know there are some places that have been operating, that haven't even been allowing people to congregate or haven't even really made spaces for people to congregate and I. Think that's a perfectly. You know safe thing to do and in fact you know that they may even be safer than allowing people to congregate, which is not to say that you know if people are gonna congregate outside and a sort of socially distance manner. That's now approved that you know that wouldn't be okay, but it just seems to me that if we're gonna allow, you know we're in this sort of weird situation now, where we're a lot of the old rules, obviously have been sort of temporarily put aside and we're allowing people to basically purchase alcohol without actually setting foot inside of an establishment which is a new thing and we're allowing people to sit outside and eat and drink without the full. You know licenses that typically would go along with that and so I just think. Just to me, it seems like, as part of the sort of overall adaptation that we've got to what's been going on, that I think we need to be a little flexible and I think it's just. You know inherent that if somebody's going to be getting a drink from a bar, that's got basically like a counter set up and their door to gainers outside, and you know certainly the I just you know that I just think that that's sort of built in and so I think going beyond that in terms of what we want the establishments to do. I think there's just not really a lot that we can ask of them in that respect. I just think it's sort of built into this whole situation that we have so that's my view on that. Just more broadly, for the whole meeting for this applicant I didn't see like an estimated percentage of or I guess it wouldn't be estimated in this case, but what your food percentages and your drink percentages in terms of your you know your sales yeah, the rough percentages I have on-hand a debt rejected accounting to be specific at this point, but is a 75 to 25 percent, seventy five being through twenty five percent during. Thank you right, okay! Well, you wanna go to Marco yeah. Can you hear me? Yes, oh thank you. One thing that I would like to see is in the future, it's better to hear from the owner or the manager, because the counselor kick he's coming and he expressed himself the rules and basically we cannot learn more much from the restaurant. Yes, I was over there this weekend. Yes, I would like to subscribe. This application definitely without allowed, and the only concern that I have is that is the problem. Judy raised very well. The issue of open containers outside I would like to see something, and they are in the approval that the applicant are needed to avoid this kind of trouble, because the whole mess that we cover here is the virus, and we have to have the eight feet wide. A situation interested and that I think, is the only issue that I'd like to raise important that the articles all of them the reception, do not chopped the a part of the pedestrians which is eighty twice. This is the only concern that I cast and thank you and I will support this application. Thank you, okay. Three, so it sounds like support, so I will start it. I will move to approve this application if we have hand raised the second bit, that would be great I see. Russell gives a thumbs up so that counts, as a second I see a Barry thumbs up. It is second, we will assume right now. There are two hands up: Michelle: okay, oh it just Michelle right now, I'm Michelle, nodded, so I think she has something to say: okay, so that's better Michelle. If she's going to opine differently, yes, I am I, am muted. Now, yes, okay. Thank you. I wanted to follow up on Judy's comments, because I think one of the things she was referring to the Transportation Committee was my comment and I just wanted to share my comment with you tonight, because it's relevant to every applicant and just for everything going forward, and it's just a personal experience that was relayed to me by my daughter that happened a week ago, this past Friday night, when she made an attempt to go down second Avenue and have something at one of the outdoor cafes. She said there were hundreds of people in the street. She said, while the formation of the chairs and tables at each individual cafe was, they were in complement with what the guidelines are and that the tables was six feet apart and people were wearing masks until they were served, so those who were seated were compliant. However, she said so many people horns and horns. Hundreds were on the street close to the establishment standing around those tables, no masks, no distancing drinking. It was so dangerous that she actually got in a taxi and got out of the neighborhood. Now that I imagine is probably a common occurrence at all of the weekend nights, at least during the week as well is how are we going to address this I know the secret? Is enforcement I? Don't think it's realistic to think that we can call the police and that they're going to come down, and you know, move around all the 20-somethings and have them scatter and have confrontations I, don't think the climate is calling for that. I think it's very difficult for the owners of the establishment to have a confrontation. Also, however, I think this committee, as we can, should maybe make some suggestions as how we can encourage the crowd to and to police themselves, in other words with putting maybe rope up that says no standing beyond this zone so that they can stand in between the tables requiring them that if they get a drink that they have to completely leave the area and rather than telling them this have signs up all around requiring it and that they are distancing and wearing their masks when they're not drinking something that can help the proprietors some guideline or something to point to that can help them safely and non-confrontational e dispersed the crowd. I, don't think this is going to get better or on its own I. Think it's going to get worse and I think that each of the establishments has to have a method by which they can do crowd control in a safe way. So I don't know if a new business, maybe you want to come up with some guidelines to offer them some signage to offer them. There was signage actually offered in the Transportation Committee, but it would not have to just be posted in one place, but it would be have to have to be posted in many places, so people who can see them and just some way to help disperse this crowd. These crowds, I should say in plural. So if you want to have a further rather than hold up each applicant tonight with this discussion, although I think they should be a part of it, because they're going to be the enforces as well as the sellers, I think, maybe a new business. Maybe we can come up with something as a suggestion. Thank you. I think this could be a good thing that we're working on we'll may be behind the scenes and kind of come up with some documentation to be able to share out to the establishment. I know if I saw the email trail, that there was clarification and going to the establishment to remind them of guidelines in terms of the outdoor seating requirement, so this could be another additional hosting offering that we could provide to establish Abraham. You do have one board. Member and a member of the public has their hand raised I guess about this application just sent that Capello Center. You may have special button. I know it's only about my application. It's like! We want to move from location. We are right now and okay Justin. Is this a different application because we'll get to it on the agenda, so please lower your hand and we'll get to it after we get to the other applications. Sorry about that Brian, France, hey, just hey guys, serious to the applicant I, didn't see anything checked off inbox, fifteen and I'm curious if there's any type of outdoor, dining or sidewalk. Cafe. Now, considering that phase three of restaurant reopening has been pushed back by the governor hi Brian, we currently don't have any outdoor seating right now we haven't actually been operating out of the ideal and location since the shutdown has occurred. So right now we're not doing it may happen in the future. It's kind of a business decision at this point what they want to do moving forward but yeah. As of now no I'm, sorry go ahead, Brian, no, my fault good. What I was just gonna say and if, in the future they do want to have a outdoor cafe and I, don't know if they have the license or a that is a separate application and they would come to us before they do so. This is just for the liquor license aspect, correct, okay and then I'm. Sorry, can you repeat the hours of operation again, because I am familiar with this restaurant I? Actually, I didn't I didn't realize that they were open that late or looking to build. Well, it's gonna say this: was this initial application was submitted back in July of 2019, so we, the concept, was still a little bit open as to what it would be in the end, but the original application hours were 11:00 a.m. to 2:00 a.m. Monday through Thursday 11 a.m. through 4:00 a.m. Friday Saturday at 11:00 a.m. 2:00 a.m. on Sunday I. Believe we closed at midnight during the hours of operation, Creek Ovid and we were closed on Mondays. Okay, all right thank I'm, good thanks, okay, great any more handle only Marco who is I think it already spoken on this issue that I could be hurt right. Let's go to Marco I'm gonna. Maybe assuming he's going to move their firm? Can you hear me? Yes, okay, just motion to call the question. I'm sorry, yeah motion approved I. Second, that motion. So, let's see, if there's any, can an objection to the approval or IV line board members, please raise your hand to participants menu our star nine. If you would like to vote against abstain or not over cause, mrs. Brown, mrs. Brown, you may have to push a button but tell us how you'd like to vote. Oh, you lowered your hand, approve the application. Okay, only raise your hand if you're gonna vote against it or stain yes, I accidentally hit the raise your hand. My apologies no worries. Thank you, okay, so that was the unanimous yes and I'll. Just read the names of the board members that I see so is into the record of Abraham. Of course, Elita berry Brian cause Marco Michele, mrs. Brown Paul Russell Squire. That is all the board members. That is what I have is well so good, okay. So, let's move on to the application or apq that LuPone coated beyond by the sailboat on? Do we have the representative Ryan? Is that you yes mm-hmm? Can you hear me? Yes, I'm the director of operations with Lapointe opinion hi. There tell us about your application briefly and sure. Thank you for hearing us tonight. Our application. Our company has gone through a change of ownership with the current economic situation that we found ourselves in due to the shutdown and the pandemic. So we have a new owner that has purchased the u.s. franchise through bankruptcy and we are reapplying for our liquor license at this time still to operate at the sailboat on location same as before, I'm just under new ownership in the u.s. great. Thank you well. Do we have any public members over I do not see any member agency member any members of the public. Now I see Judy Schneider unmute, her okay, I have a question: that's maybe a little off target, but Ryan. Can you tell me, is your corporation planning on reopening any of the other had on the pod? Would you know absolutely Judy? We yeah. We are we're actively engaged in getting amount of Licensing that we need to be able to open up the locations and I can say from what I do know with there are so some negotiations in post bankruptcy. However, a large number of our locations on the Upper East Side will continue to exist and operate beyond the bankruptcy and those will be what will be rolling those out in waves. It nobody another I'm, sorry, a number of locations that we continue operate on the Upper East Side. We've done. It's been a pleasure to serve the community there for a number of years, and you know, hopefully they walk those back with open arms. Thank you. So you have two board members who have their hands raised in order Michelle and then mrs. Brown Baberaham. You were muted, sorry, yeah, -, Michelle and then Michelle. Yes, I just wanted to say that the printed page that I have from the website telling all of the applicants for this evening. Most of them, ratio of food to liquor or the numbers of tables and chairs, or anything like that, my computer is dead as a doornail so and it's a new one, but so I'm on my telephone. So it's not all the easy, very easy to manipulate, but I wonder if each applicant can just give us that information when they start so that we don't have to stop and ask those questions so, for example, for and cotillion how many tables do you have and chairs? What are your hours and the feature applicant can give us. That would be very helpful. Thank you, 84 percent food and 16 percent alcohol. As filed for 132 outdoor okay, given the current situation, we will not be opening with 132 outdoor seats, but adhering to their codes and regulations provided by local estate CDC guidelines for outdoor dining, so that would be amended depending on the regulations, but it was initially drawn and filed it for 132 patio seats, so that's obviously weather hindering. We don't have any indoor seating at this location and some that's nicely patio yon by the by the pond and then I apologize, but I forget the last question were 7:00 a.m. to 9:00 p.m. that's also dependent on the weather heavily and season, but for the current season we're in summer and spring and fall pretty much in here to that 7:00 a.m. to 9:00 p.m. Monday through Sunday. The other thing was the food to alcohol ratio, sure that's 84 percent food to 16 percent alcohol, and so, if each applicant can tell us that would be helpful thanks, Michelle Abraham, you're, muted right now, but I heard a lot of noise coming from your background, so I'm just gonna go to the next board member. Unless you want to jump in and speak up, mrs. Brown, oh you had your hand up. Yes, thank you. What I wanted to do is to amend Michelle's request in addition to that, I would like each applicant to state if there is outdoor space in addition to the food beverage ratio. Thank you. Thank you and the hours are the proud outdoors, Thanks correct, yeah sure like hand washing no that's our space assuming, oh sorry, yeah all of our seating space was actually outdoor in this location. So we have a counter for service and all of the seating that I mentioned all 132 seats under normal conditions. They all occur on a slate patio that our space is adjacent to in the corner. It we have one public restroom around the corner from us and the other ones. On the other side of the pond. In Chester hours, two hours of operation are Monday through Sunday 7 a.m. to 9 p.m. obviously, depending on the weather. We do if we have bad weather coming in, we do amend the hours of operation based on the foot traffic in Central Park. Thank you, yeah, no problem. Okay, do we have any hands up to make a motion? If not I will do so. You have to hands up Marco and then Russell. Okay, thank you an order. Marco. Can you hear me? Yes, thank you. Thank you Oh. Second, that lets go to Russell. Oh, he lowered his hand. I think you okay for the same thing: okay great. So that is a motion to approve. So unless there's any hands up to abstain or say no, that should go down as an approval, but you know to see any in three two one: no hands! Okay, great! So let's continue on to the next stage, which is item 2a. Do we have the representatives or zucchetto at home, Authority I will say they had not been responsive to our emails, so it's likely that they are not here, but if they are here raise your hand please, through the participants, menu. Okay, let's not seem they're here, let's hold that's till the end, then we'll decide whether to roll it over or take okay. So then, moving on to item three a we have the representative for rob, op virgin grill, please just raise your hand through the participants menu. If you can't find that it's at the bottom of your screen looks like two people house, the number 31 next to it or if you're on the phone, it's star, nine I, see it I, see and great. You may have to confirm hi members of the board. How are you very well? Thank you. Thank you and I know. You had asked us to provide the number of table than a number of seating, so we have a total of 17 tables in the restaurant with 55 chairs. We do currently have outdoor seating, no seating in the street so and that six table with a teams. There's our alcohol sales range from about three and a half to four percent and our food sales are about 96 percent. So we do very small amount of alcohol right and I. Think hours of operation for the hours of operation are Sunday, Thursday, 11 a.m. to 10:00 p.m. Friday and Saturday 11 a.m. to 10:30 p.m. great. Thank you you're welcome, thank you and well. Do we have any members of the public do not see any members of the public? You have two board members, Russell and Marco. Actually, Judy has her hand up unmute her. She son, you did I just wanted to support them. They've been in the neighborhood for a number of years. Good merchants and we've had no problems with the family. At all, thank you very much better Russell Hertz, alright Russell motion to approve. Thank you, Oh, second, that, let's see it Marco one thing I had to mention to all the restaurants are in bars all of them they had to apply in do T or the outside, because the inspector from the OT running around the neighborhood checking if the ceiling is, according with the new regulations of do T and I. Think in this case, I had to information. I found it one restaurant that receive a violation of fourteen hundred dollars from the OT. Because of the sitting. My obligation is to learn, know all the applicants, so she so everybody should be aware that DoD inspectors the going around the neighborhood. Yes, this weekend, I put application. The information of VOT, almost all say, comforts York part of the thigh revenue and Lexington and I has been an opportunity to talk with everybody all at least me know, and they all of them. They are concerned beauty, deities, look around for in violations. Please be aware of that. My recommendation is apply for the they do give service, which is free, and it takes five minutes. Thank you unless there's any other hands seconding the approval by Russell and let's take the whole hands up for a negative works and just raise your hand if you are voting against abstaining because I don't see any hands up Abraham, so I think you can confirm it. Let's go to item three, be a boy have the representative for luck! Your Waldo Alistair, hey, how's it going! Let's see if I can get this yeah you're. We can hear you. Oh thanks, everyone for inviting me and so just to go through the estimated percentage of sales food to drink. We will we're operating at a seventy percent to thirty percent food drink which already a lot of coffee and things like that and alcohol outside. We have a total number of eight tables, sixteen chairs, which are not in operation right now. We maximize the sidewalk between here and from Monday through to Thursday 6:00 a.m. to 10:00 p.m. Friday to Sunday 6 a.m. to 12 a.m. at the moment. We have reduced hours, obviously also due to current regulations that are in place, but also just for scarf safety to just to try and maintain one shift for everyone who's working there. At the moment, Abraham you have to hands up right now over you have one hand up just cause. Okay, so let's go to college because many months ago they came, they had an illegal sidewalk cafe. We asked them many times to correct it. They promised the night. They came to us that they would do it that night they never did they've had that illegal place out front for many months before they applied for the correct sidewalk. Cafe I mean you know, whatever they're telling us I'm, not believing them, because we've had experience with them. I mean we'd like to be nice to cafes in these hard times, but when people come directly and not tell us the truth, I have a hard time on it all right. If I can walk in there go ahead, and so in clinseq the outdoor seating there was wasn't and you make sure that you came in and we would thank you eating area -. In which case you go about leaving the whole area as there was nothing deliberately holding off any motion, it was purely just to make sure that everything that we put in ice was up to the standards well, I will I will actually follow up with what cause that I do recall this meaning vividly, and there was that big barrier that we asked to be removed and that was not removed. That was a blatant statement made and it was nothing for removing was sorry what not removed and all over there. No there was. There was the big barrier, the wide barrier, and it was stated that it would be removed because it was too bulky and too big from the committee's perspective and it was agreed to, but it was never done so I will agree with cause on that point. That was a just something. I did not happen. It has been removed that correct now, but we're talking about when we were visited this application back. Then it was not removed in any way time late that the if I can the community board asked us to send through a proposal for what we would have changed, the seating area to and from timing it was maybe after the meeting to which the outdoor seating area was routed and we continue to operate without anything there at all. To make Marco has his hand up Marco, yes, yeah. Thank you. Yes, then he removed that. Yes, he removed. The only thing I had to advise you to the owner is be careful. Now there is a very strict regulations for outside and deity is around and you don't want to see you to have a violation. Let me repeat again one of the restaurants, which was mass Muskaan. She received $1400 violation and I. Don't want to see you or any of the restaurant to receive this kinda violation. Please follow the regulation and I think and understand you have the sit-in outside yeah I. Think you apply if you evening, I'm, not saying a menu, and you can do your seating for the outside included the use of the road or street. That's the only thing, I had to say later. Thank you thanks father. Well, any other hands, no other hands right now. Okay, does anyone wants to make a motion? Mirko has a stand up. Michael great! Are there any virtual hands two seconds and just put a reaction? Button I see very I, see Michelle, okay, great. So anyone that wants to vote no or abstain raise your hand. Well, from my perspective, I'm going to abstain. Okay, anyone else want to see cause, explain your vote. I'm gonna, but not on this one. Sorry, okay, express any other hands anyone else. Last call: okay, Michelle, explain your vote. Oh yes, I'm going to abstain. Okay, thank you myself. One last call anyone else. Mrs. Brown explain your vote. It was a little unclear. I couldn't understand the applicant. He did state that the barrier has been removed when was it removed. It was removed in days after in which we were asked to submit a proposal for what we wanted to do. There was no deliberate delays or anything like that. We just you know, wanted to make sure that what we did was right and as soon as that it was voiced at the community board, wanted us to remove the barrier. We took the motion to make sure that we got rid of it as soon as possible, anything under 13 days to get that you know, would have done it as quickly as we could and at which time we also had the proposal for what we wanted to do after which was open, seating floor plan, which was approved by thankfully by a community board and by the city as well. Thank you. Thank you, mrs. Brown did you want to vote any way other than yes? Thank you, then. The last hand that was up is Alito's. Aleta, explain your vote. Okay, great, so I think that's all the hands. Let's go to section 4. Do we have the representative item 4a, which is sushi of gari Bob Robby Ryan hello. Can you hear me? Yes, I Robert Romano I have not worn a suit since March 11 2020, so forgive me and I, just my big question is: will I fit in my suits the next time? I tried them. This is an application for an alteration application or a relatively small. Very your most members, I would imagine, are very familiar with they're, very respectable and incredibly high and quality sushi Terron. What they are doing is currently they have a fact basement area which is not connected internally and they cannot use that for alcohol storage because it is, there is an unlicensed premise that would have to intersect it, so they do not use that. It's not a licensed premise. What they're doing now with this alteration application is connecting that area internally expanding the kitchen area, the rest, the patron area will remain relatively pretty similar to as it is now, they will be moving the front door to from roughly I think it's only about 20 feet, they'll be moving, it west, I believe they're. Moving a twist could be incorrect on that no I think they will be moving it. Yes, they'll be moving it with the restaurant will remain the same to the public. It will use most of the public, won't notice any difference except there'll be an internal staircase in the premise that does not exist currently, and that's it right. Thank you very much. Thank you. Do we have any needs? We have any public pens I once I do not see any hands from the public I'm confused on this one. If nothing is changing, no I will explain. This is considered a substantial alteration as far as the State Liquor Authority is concerned, anytime, you are adding to the license premise to the square footage or changing the configuration of a footprint of a existing license. Premise you do have to file. You do have to give notice to the community board, which is what we did and there's a protocol which might be, in this case a little overkill but the world, and we are technically expanding the license premise, because now, after everything is done, you'll be able to store bottles in that back area which they know could not do now, because it's not connected okay. Thank you. Thank you. Okay, I would second that motion through a probe is there any other hands? Will you have markers hand up? Let's do the roll, no abstaining or not voted for goddess. Please raise your hand going once great okay. So do we have the applicant for b-but spotted dog, whoever the applicant representative for the spotted dog, Rosa? Okay, great waves? Are you off just push a button on your screen to unmute there you go perfect, sorry about that. I've still been trying to learn how to like figure out how to be a mom and still trying to excuse me because I'm still trying to make dinner and everything. So this is Fargo and Road. This is a corporate change application, they're changing ownership, the one partner is leaving. One partner is staying with the business. There is no change to the existing method of operation. Great. Thank you very much well, in a public game, I have a Judy Schneider hand from the public and then Marko cause and Barry. Okay. Yes, now I lost my question: Oh No, what's the name of the new owner, Rosa five dog, it's gonna be John, Cavanaugh John Cavanaugh is the new owner or the old dog. Now they were so. It was John Hayes and John Kavanagh right breaking partnership, so John Kavanagh is staying with the spot. Dog. Oh and John. Hayes is staying with the other one with Baker Street Baker Street. Sadly, because it does break my heart is being closed, yeah! Okay, so when you said the other one, what was the other one is $14.99 on the agenda night. Oh, it is okay. Well, this particular establishment I. Just as a comment of the member of the neighborhood is a very good establishment. Food is good. You ever had any problems with them as a neighborhood. Thank you. It's basically a divorce and one okay. Well mark! Oh! Yes, thank you. Mark up. I will second, that we had Barry no more hands. Okay, one more hands; okay, great so lotion is on the porn seconded to approve, if there's any hand, may or abstain, speak now or forever hold your peace looks good great. So then, let's go down to the next one: doc Waltons, that's 40, I'm bad with trade names, but that's 49, a restaurant correct! Yes, it the same exact thing: John Hayes the same with 1419 gotcha ain't, no change in the method of operation still the same owner: okay, perfect it'sit's! This is the other. The other side of the coins, so gotcha, okay, will any publicans or any hands at all. Barry. There is the only one we'll have to approve marco raised his hand as well know if he's won in a second or Marco -. Okay, great! Thank you. Okay, let's do the roll as always big hand, seeing none wonderful, okay. So last but not least, we have the John and Sony people for 1097 birch. Avenue, raise your hand please. If you are representing John and Tony's pizza court, Oh Jacinta, they suggest changing the address right now we are in this, which is 1097 Avenue and we are moving couple of stores which is 1109 and the reason why we're moving is because the rent is so expensive and place is free right now we're getting a small place and the rent is like a half percent we're trying to keep the business. That's the only understood. Thank you very much appreciate that well any hands my head of a cheetah Schneider kitty, okay, they're moving from much larger to a much smaller place. We had a lovely, Eden, dining room, but we're glad they're staying in the neighborhood, because their food is delicious. We order from there frequently and they've, been in the community for as many years because I've been living here, I think and I've been here over 50 some-odd years. This place a thumbs up great support them any other hand, well I've, Marco and Russell. Okay. Yes, thank you, emotion to a pool. The only thing I'm going to mention is I think this crisis I live doing something else, because they rent very and I- think that's probably the good news in this day in this period of time, I'm very happy just for the document. Thinking yeah I just had questions so I didn't see on the application what the hours were and what the food and drink you know revenue percentages, whereas you have this in the application. We have a food like a seventy percent on drinks. We have ten percent, but we consider eight the drinks, which is soda coca-cola beer, which is water. That's why we put thirty percent and the arms are open. Issue is Monday to Tuesday 11:00, to 2:00, Friday and Saturday 11:00 to 4:00 and Sunday as good business. Thank you so much. Thank you. Do we have a second on Marcos? What can you do if not I will second I? Second, okay, all right! Well! Take the roll on this item one last time and anybody who wants to vote against it abstain or not go for cars. Please raise your hand and not seeing any okay. So, let's we have appending to a I'm assuming there's still no representative, Richard, Harrow and Pomodori. If you are the representative for Zep LLC, please raise your hand either on your screen or through the participant, menu or star nine on the phone. Seeing none, then I guess I will inspire my board members whether we want laid over well. Obviously, you have better extent of what the responsiveness, if you want to lay this over, invite them again for whether we take an action now I believe that they had submitted all of their documentation. You guys could see that they had been planning to come in the gym, I think they had confirmed for June and then, when we postponed June's meeting so I think it's theoretically possible that you could the first one in this one month and hopefully next month, I would I would move to lay over for one month and one month only we don't get a response. Then we would take an action, but if there's any other hands objecting for that approach, please I see Russell and Michele. Second, did that, but also I have hands up from Marco and cause okay, Marco yeah I think that okay, great this thing I see we were supposed to respond by March. It's now, July I've got the renew. So let's find out why they didn't come and do they have their in you, so I don't believe the new be allowed to have their renewal without but weren't we supposed to notify in March. That was whenever they suspended Council hearings and everything right, so it could have been brighter over time. So why don't we find out? Do they have their renewal I? Don't think we need any action on that right. So we're gonna well we'll look into that, we'll invite them again and find out, and then we can revisit and I guess in August now yeah, okay, great so well, is there any other hands up or any other business Judy Schneider has her hand up. Yes, I'd like to know what the vote was on that one that was disputed. Well, it wasn't all unanimous. So on that one, there was three abstentions: one no, which means there was one two, three, four five, six, yes, one, two three four that will go down as know what effectively Arno's abstained and oh great, well any other hands. I, see none! Okay, and with that then I will move to adjourn. Do I have a second I, see Barry's hand up I assumed to second that Aryan Anza said yes, great well, thank you! Everyone and we will adjourn. Thank you. Everyone thanks, bye,.",
        "summary": "Yeah, because I was thinking that, where a lot of these applications, where always be supportive of the community zone, that there's a strong objection, I, would make a motion seconded to take them all together, as approvals I, see a hand up, maybe, and one for my board member and one from a guest too from board members.\nSo the community will come, learn more about the situations under which they are living, and this is why I believe the first thing : is: we have to walk location by application and learn each of them.\nI'm, just wondering the Upper East Side has been notorious during the latter part of this crisis for having restaurants and bars that are serving liquor to people on the street There have been any complaints, please about serving drinks who are not seated at tables or where there are issues of people just milling around and congregating.\nSo you're asking whether what type of prevention mechanisms they are taking to prevent individuals drinking on the street right, And 70s people are walking around with open containers of alcohol.\nWe have I've written the policy to make sure that we don't ask people to stick around if they've gotten something to go They don't congregate in groups that would exceed any of the regulations, and we were also very attentive to the governor's executive order regarding a hundred feet within your premises, you're responsible for the individual opening that container or violating a liquor, laws.\nAs many of you brought up So, it has been a give-and-take working with the community on that So I, think I'm, comfortable and saying as in-house counsel, that we've addressed the alcohol issue, given the current standards that were there The community might have thank you And to the application.\nWith that I will are there any hands up or members of the public Judy Schneider they've been a good neighbor since they've moved in I recommend their food Highly would hope that the board members would support this application.\nKnow: people with open containers and taking the drinks away from the bars I reluctant to really press people too much on this I think you know there are some places that have been operating, that haven't even been allowing people to congregate or haven't even really made spaces for people to congregate and I.\nNow, where we're a lot of the old rules, obviously have been sort of temporarily put aside and we're allowing people to basically purchase alcohol without actually setting foot inside of an establishment, which is a new thing.\nIt's sort of built into this whole situation that we have Or I , guess it wouldn't be estimated in this case, but what your food percentages and your drink percentages in terms of your you know your sales Yeah, the rough percentages I have on-hand a debt, rejected accounting to be specific at this point, but is a 75 to 25 percent, seventy five being through twenty five percent.\nThe issue of open containers outside I would like to see something, and they are in the approval that the applicant are needed to avoid this kind of trouble, because the whole mess that we cover here is the virus, and we have to have the eight feet: A situation interested and that I think, is the only issue that I'd like to raise important that the articles all of them, the reception, do not chopped the a part of the pedestrians which is eighty twice.\nAnd I just wanted to share my comment with you tonight, because it's relevant to every applicant and just for everything going forward, and it's just a personal experience that was relayed to me by my daughter that happened a week ago, this past Friday night, when she made an attempt to go down second Avenue and have something at one of the outdoor cafes.\nIf you want to have a further rather than hold up each applicant tonight with this discussion, although I think they should be a part of it, because they're going to be the enforces, as well as the sellers, I think, maybe a new business.\nIf each applicant can tell us that would be helpful, thanks, Michelle, Abraham, you're, muted, right now, but I heard a lot of noise coming from your background, so I'm just gonna, go to the next board.\nWhat I wanted to do is to amend Michelle's request in addition to that, I would like each applicant to state if there is outdoor space.\nThank you unless there's any other hands seconding the approval by Russell and let's take the whole hands up for a negative works and just raise your hand if you are voting against abstaining because I don't see any hands up Abraham.\nWe will we're operating at a seventy percent to thirty percent food drink which already a lot of coffee and things like that and alcohol.\nWe took the motion to make sure that we got rid of it as soon as possible, anything under 13 days to get that you know, would have done it as quickly as we could and at which time we also had the proposal for what we wanted to do after which was open, seating, floor plan, which was approved by thankfully, by a community board and by the city as well.\nThink this crisis I live doing something else, So I didn't see on the application what the hours were and what the food and drink you know."
    }
}