{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB10",
            "channelId": "https://www.youtube.com/channel/UCu2IUja1ASnGIr_ORrtLReg",
            "title": "July 2020 Land Use/Housing Joint Committee Meeting",
            "publishDate": "2020-07-17",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB10",
            "normalizedName": "Manhattan Community Board 10",
            "twitterName": "Manhattan CB 10",
            "youtubeChannelName": "Manhattan CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
            "twitterHandle": "@mancb10",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 248,
            "um": 282
        },
        "wordCountFullTranscript": {
            "housing": 67,
            "community": 60,
            "people": 54,
            "city": 34,
            "residents": 29,
            "projects": 28,
            "time": 27,
            "hcci": 25,
            "lot": 24,
            "buildings": 21
        },
        "wordCountSummary": {
            "community": 25,
            "housing": 13,
            "people": 9,
            "projects": 7,
            "residents": 7,
            "time": 6,
            "estate": 6,
            "hcci": 6,
            "city": 6,
            "buildings": 6
        },
        "fullTranscript": "Foreign good evening, good evening, charles, how are you hey karen? How are you doing I'm good? Thank you, how's everything going everything's going! Well, you know working, you know doing everything, how about yourself much the same lots of calls, as I'm sure you're on lots of things to you know to deal with and happy to be able to come together this evening. You know so yeah! It's been! It's been unusual. Yes, hello, charles! It's michelle good evening, hey michelle! How are you hey, I'm good, I'm good you're taking a walk! Oh that's good! You know and bianda. How are you glad to see you're on the call, hi, you're, muted, so you're trying to unveil mute herself? Yes, I was saying hello nice to connect with some and reconnect with others. So good just see everyone. Thank you so much for joining us this evening. I'm sure we'll have some really good questions. Look forward to you giving us a snapshot of the new normal for the city of new york and HPD. Yes, glad to be here, I'm also joined by joan huang who's. Also with the Manhattan planning team. Hey joe hi good evening, everyone good evening joan so joan bianda I see we have. I know we have karen dixon who's, the vice chair of the land use committee- you I think you know karen and I'm here on behalf of the housing committee. I know we're waiting on. You know lisa downing, to join us, shatika you, there muted and we have michelle booker board member and I see a few other lisa's in the house. Oh lisa, how are you? Okay, it's just not at my desk, but I'm at I'm here so lisa. You know it's 6, 33 I'll. You know be guided by you as to when we should actually start our conversation. I know we have beyond and joan bianda and joan do you guys have any sort of a time constraint for this evening? No we're at your disposal- okay, great, so lisa! I know we're waiting for malcolm punter. Do you want to wait a few more minutes just to let a few other people join or you want to get started? I would give it a few more minutes if people don't mind, okay, great, so we'll just wait. A few more minutes and folks can just talk to each other yeah. How many people are on nepal, ten all together, including charles myself, shatik and michelle, and you hmm so lisa karen- will give it to maybe 6 40. and then we're going to begin. You know, because I know that there are everyone's involved with other meetings that are going on simultaneously with our meeting tonight, but I want to take full advantage of bianda and joan and I'm assuming we're going to get malcolm puncher to join us and very soon. So why don't? We say four more minutes and then we'll get started agreed lisa karen? Yes, that's fine! For me! Okay, sleep more! I think it's summer and people have kind of faded out. I don't blame them. Okay, malcolm is joined, so one more minute we'll get started. Welcome, malcolm yes, we can okay. I can't hear you sure, send it to me, I'm actually on there were you able to upload whatever you wanted to upload hello. I think he was having difficulty hearing us. Okay, I think we're going to get started, malcolm welcome. We have bianda, you know, martin simmons, you know from hbd we have joan wang from hbd lisa downing. The chair of the land use committee is here and the vice chair for land use karen dixon and I am prayerful since I don't control this meeting that shatika someone is on, so we can make sure that folks are unmuted when necessary. You know the chat room is available, so please take advantage. You know to put questions in so we can see and, of course, in the chat room you can raise your hand and and be acknowledged, so I'm going to turn it over to lisa. You know for welcoming introductions and we'll go on. Thank you all for joining this evening. Lisa coming! Oh, can you hear me? Yes, I'm just in the process of your microphone is unmuted. Your video is stopped hold on two seconds. Sorry, and by the way shateek mitchell is probably I don't know if you're there shitty. I know there is another meeting going on shatika. Are you doing two meetings all at the same time? No just this one, okay, so shatik. Thank you for joining us. So good evening, everyone and I will switch screens in a second, but thank you all for joining the joint land use housing committee this evening. Hopefully, we have some rich information to provide for you, and we have some robust speakers who will be providing us with information this evening tonight we're actually in a good place, because we have two special related announcements that have come out of both the state and the mayor's office within the 24-hour period that are applicable to the discussion this evening. So first before we get into specifics, I just wanted to give you sort of an overview on what happened on the land use side of things during this pandemic, which is essentially nothing and that's because we had so many other crises, citywide that had to be dealt with respect to the economy, stopping businesses from operating. You know the increase in numbers of covic cases, the subsequent deaths that we all have been impacted by so from a city planning perspective. From a your luck perspective, you know once business, you know everything stop with the exception. My name is ian from homelight on a recorded line. I was calling because it looked like we're interested in potentially purchasing a home in pomona. Is that correct? No, I'm not going to be interested. Thank you sure. Okay, so the lamb might be cheap out. There might be a good time to invest. So you know everything shut down with the exception of the essential workforce, so that meant anybody involved in affordable housing. Anyone involved in emergency repairs on houses that had to be fixed right away. Anybody who was working solo in a environment where they wouldn't come in contact with a lot of people, so that was basically the mandate from March 7 2020 and there were a lot of DOB. I work in the business. There were a lot of DOB people roaming, the field, making sure that those essential projects were following social distancing rules that were giving out hand sanitizer or pro were following proper protocol, and if they didn't, they were facing fines upwards of ten thousand dollars in violations on may 13th. New guidelines were issued where, when things started to open up again, they still impose standards for social distancing. You know no gathering on the construction sites, stagger lunch hours, coffee breaks, you know for drop off for a product, it had to be in one designated location and all construction sites had to give out pp equipment to their employees, so just to backstep a little bit. The purpose of tonight's discussion is to give a broad overview of things that are happening in land use and, as we have our advocacy discussions on housing, we have to infuse sort of the backdrop of what happens in the in the overall landscape as it pertains to construction as it pertains to planning, as it pertains to any kind of policy initiatives that come into play that affect the work that we do. So I'm just giving you some sort of context and we'll be infusing that, as part of our discussions on the land use side moving forward today, construction has resumed as of June, 8th and things are back in full swing. Another thing that stopped during the pandemic was a lot of the public meetings. You know, because de Blasio didn't want anyone meeting or being in close proximity to one another when business stop all the public agencies shut down, so the department of city planning who approves all the decisions around development in the city they too shut down and eventually the agencies got themselves organized technologically and they began holding meetings digitally. But up until now, your looks which we finally know from the lenox terrace six-month procedure we experienced last fall. All that stuff has been shut down. One of the new announcements that just came out 24 hours ago that the first city planning meeting will be held on august 3rd, so we're very excited about that people were getting anxious in a pandemic and all the loss of housing and loss of jobs. What's the demand right now in our community? It's affordable housing. So there are pretty much 91 000 units in the pipeline that have been held up as a result of Covid-19 19 that couldn't get approvals that couldn't get signed off that couldn't get the green light to move forward. So, as of august 3rd, we will be able to proceed as a city to move forward with those projects. So that's a good thing as part of that the city planning commission has redeveloped developed their website. They have a specific portal called new york city engaged upon which residents and the community at large will be able to go on and find out what the development projects are that are going to be discussed for the pending meeting and find when there will be ways to instruct those who are interested on how to access public meetings remotely so we're moving slowly by slowly we're moving forward as a city and opening back up. So a few things that we've learned as planners in this shutdown and things that have caused us to re think about one is density right. This invisible virus- that's knocked everyone out is being transmitted through. It was the am I saying the right word through communication, essentially right through droplets, through droplets that are being transmitted through sneezing through coughing through just general communication. So what does that say for a city as dense as new york that has a pipeline of development projects that will accommodate nine million people? Well, should we continue to do all this building? Is that really the safest thing for all new yorkers? So as planners, we really have to rethink you know and as architects, we have to rethink how we design our buildings our infrastructure, to consider this density. So it may mean planning moving forward out into the outer boroughs, where there's more mixed-use opportunity, and if you see you know, Queens has enjoyed low density. Parts of the Bronx have enjoyed low density for a long time for a long time, and perhaps there'll be some rezonings in certain key areas and they've already started in jamaica and some parts of the Bronx to up zone just to make the city a little bit more equitable in terms of density and accommodation, particularly around this covert virus, with respect to housing, which is another key topic, but very interrelated and again as land use chair. My goal is to try to create linkages, so the community has a better understanding of how land use and housing go together as a part of the pandemic. We were fortunate that new york state suspended eviction proceedings and pending eviction orders until august 20th under the tenant state of harbor act, and this is to allow until people can start getting back on their footing economically to distances start opening up. This has been tremendous relief for our residents here in harlem, but it's put a tremendous burden on our landlords because they are still responsible for their mortgages and they can't you know if it's one thing: if a a resident one resident doesn't pay the rent. But what happens if a non-profit like hcci, which we'll hear from tonight if 10 residents lose their jobs and that's 10 times whatever the rent was that the landlord is losing? So again, we have to think broadly as practitioners about how this pandemic is not just affecting the renter, but also the landlord. To that point, there's there was a one-shot deal program where the city allocated 41 million 41 thousand dollars per household for people who had some sort of crisis. That program was already in effect, and we were petitioning to have the program to be more inclusive of people who were directly hit hard by Covid-19. Then we had state employment insurance at the federal level through the cares act where, in addition to unemployment insurance, those who are unemployed were able to receive an additional 600 thousand dollars. But I'm proud to announce today that if you read senator brought senator bryan's benjamin's email that under the department of community relua, I believe it's a hundred billion dollars available, 100 million dollars available for rental assistance and that's something that is sorely needed. So if you took from where we started March middle of March with nothing increasingly, the various agencies have been able to formulate policy and programs to provide all new yorkers. Some relief- and I know bianda, will speak to that. So this is sort of where we are today. Two great pieces of legislation have come out in our favor, so that allows us to remain very hopeful about the future, the future of new york and the future of harlem and I'd now like to open the discussion up to just talk number one from the agency perspective. I know beyond, and your team you've been working hard, trying to put things together. Working at home, working in flux, short staff, wearing a numerous number of hats. Joining on interagency teams tell us a little bit about what your experience has been like, both as a professional and as a planner in this covered time, and some of the things that your agency has been able to assemble and put together for new yorkers in harlem nights, community board 10 in particular, so bianda before you begin. Can I just go back to something that lisa just mentioned, and the important and value of what senator brian benjamin emailed to us today and I just want to make sure that for those residents or others or community leaders that can communicate, and I'm sure malcolm you've already communicated that to your residents, that this process of the Covid-19 rent relief program, which he's established through state legislation, actually started today and the applications are open. You know with respect to you know those residents who are able to get up to you know four months worth of rent relief, so lisa. Thank you for mentioning that very critical. It does go back, you know, and into March April may and June, so you can actually even with. If you paid your rent, you can actually get retroactive relief. There are some limitations, it's an 80 AMI. I know that beyond always we always talk about AMI, so I just want to mention and just want to segue. You know lisa before we went to beyond you know, just to say that's a tremendous program that we're hoping you know can also fight against what our housing committee and land use committee has been dealing with, and that's the issue of displacement and the fact that at some point or another, this rent moratorium will expire and therefore there will be people who are still subject to civil court judgments. You know for rent arrears, no malcolm and I'm sure beyond that. We'll talk about that. So I just wanted to take that moment before we open it up to beyond. So beyond the welcome. Thank you shatik did you unmute bianda or let me unmute her see if I can do that. I think so. Thank you both for your updates and kind of setting the context for what all of us have been going through in one form or another regarding the pandemic and then in the middle of that trying to get a grasp of on how we'll get acclimated to the new normal so to speak. Then here comes a myriad of police brutality, incidents and murders that creates a shift as well. So I will say that our agency has been working diligently, just as your community has been working diligently to really shift as quickly as possible, in addition to managing our own lives, whether we have family members who have been directly impacted during this time period, as I have, as many of you have, unfortunately- or we also know of many of our friends and relatives who lost their jobs and were unable to pay rent. So again, I want to commend all of you for making it through and being vigilant and also confirming that the community gets as many resources and assistance as possible. So I will say that in terms of and again for those of you who didn't hear earlier, my name is beyonded of the Manhattan planning division at HPD and I'm joined by my colleague, joan huang, who is also on the Manhattan planning team. When I was first requested to participate this evening, I gladly agreed to participate with a caveat that there are many other team members at HPD who work on other aspects of housing development. We have a division, as lisa mentioned, that re remains active as essential workers when the agency shut down, and we were quickly told within a couple of days to go home and do not come back. You'll be working remotely. There are many in, for example, our office of emergency management that make sure, throughout the cold months people received heat. There are many who again remained very active as essential workers and responded to violations, responded to landlord issues and complaints, and then many of our co-workers shifted to become food distributors, so there are seniors as well as many residents in need who did not have food supply, who could not even go outside of their houses? I think for me personally, even during the cold months, I had to take a walk every day I get a little bit claustrophobic, but there are many who could not get outside and many who are frankly, very fearful of going outside and interacting with others on any level. So again, there were essential workers, as well as many of our colleagues who normally do not participate in any activity related to food distribution that really rallied to make sure that many people did not go hungry during the winter months. So, as lisa also mentioned, we had a shutdown of the city's uniform land use review process, so that comes into play with our division, that advances, housing, development or mixed use, housing projects from the beginning stages from its planning and pre-development stages onto euler certification, and then we work closely with our new construction team underwriting team to confirm that the projects move forward through closing, we also work with our legal team, and many of us had to really shift and understand how our projects that were in queue to be certified that were in queue to be closed, that were in queue for city council hearings. You know what did that mean in terms of the priorities? What did that mean in terms of our work, as the financial crisis in the city continue to be exacerbated with the lack of assistance from our federal government? You know again that left a lot of unknowns, not only for the projects that we were trying to advance throughout the borough of Manhattan, which is what my team works on, but also just in terms of our sustainability as well as an agency. So here we are July 16th and, as lisa mentioned, there's just an announcement, a recent announcement that the city's europe processes will start up again, which is wonderful news. What we've been doing in the meantime, there are projects at varied stages. We have projects that are just beginning and that have been presented to us they're in their infancy stages, for example right before the shutdown development teams proposed certain projects in varied community boards, and then you have to go through at a preliminary approval process. Now the drawings you have to have the architect against the unplanned. We have to make sure that they are on the surface, initially financially feasible, because that the financial feasibility of projects changed throughout his lifetime and then we also had to make sure they were compliant with zoning. So we were busy moving forward. Those projects that were again, we call it infancy stages. We had a couple of projects that were up for vote for city council that halted but started up. I think, maybe a couple a couple of months ago, as city council started their virtual hearings a little earlier, and then we have varied projects that are in its closing stages, such as actually a great project that malcolm hunter is advancing called enemy. Three, so we're we were at closing stages when the pandemic occurred and we're looking to have that project closed yesterday, but because of financing constraints, there are considerations in terms of OMB funding that are being revisited by the city. All of these unknowns affects the progression of our projects, so we're doing the best that we can to advocate for projects that should be prioritized based upon the projects that are already in the pipeline, and we also have many of our staff members, as well as our commissioner, who are involved in agency-wide task force that are focused on addressing diversity, inclusion and social justice. So again, the unfortunate deaths of many of our men and women across the nation has resulted in many organizations internally and externally, really revisiting our practices. How we work with mwbe group groups, how we work with communities of color which have been hardest hits such as community board, 10., and so a lot of those conversations are still ongoing and we look forward to hearing about some of these changes that are in place and that are taking place as it relates to Covid-19 and the pandemic, so bianda, thank you does joan want to add anything to what you just discussed. Thank you for that report. We can unmute joan yeah I'm trying to right now, hi everyone. I don't think I have an additional information going to end beyond that. I chose all the information we want to express to do it so just see if a committee member has any like a question, I will add just wanting to make sure that people are aware of the mayor's office. The fact sheet that they produced the latest update was June 22nd, the mayor's office fact sheet to protect tenants. I will share the link on the chat room, okay, yeah. That would be great joan, because I'm not aware of that fact sheet. Oh okay, so again, she'll share the link in the chat room and we'll also send it to the leadership separately as well. But you know the mayor's office has created a fact sheet in terms of how tenants can be protected and so again you know we have a large agency about 2 500 employees and there are so many different divisions at HPD a lot of times. I get questions from varied community boards asking for updates on a particular project or a particular initiative. If I don't know that information, I always do my best to provide you with the right division or the right contact. Who can give you the updates. So again we have a neighborhood stabilization team that focuses on primarily on how HPD can work to help protect tenants rights. We also have a legislative division that has been very active and many of these the protections for tenants to not get evicted and to extend that eviction process out. So that's our. You know our legislative team that works in albany works with a lot of our electives and advocating for attendance rights, and so again we receive this fact sheet mayor's office attendant to protect tenants and just some of the few updates that exists on the fact sheet and as you look through it yourself, you'll see a lot of invaluable information and you know some landlords. Although they're very much aware of the extension have tenants in place and to not move forward with eviction proceedings, we don't always have tenants that operate above board. I mean landlords that operate aboveboard, so you know, one of the mandates that's listed here is that your landlord cannot evict you without going to court and getting an order from a judge. Tenants who receive court papers for housing court case do not need to even go to court to respond in person. There are also once the process for evictions do they proceed and they're allowed to resume. Hra's office of civil justice will work with city-funded legal service providers to provide extra assistance to residents who are under unrepresented. Additionally, you have as a result of Covid-19 19. If a person is unable to pay their rent, there are resources available from hra. So again, that link is within some may know about these resources and some may not. The new york city commission on human rights is keeping tabs and accounts of landlords who discriminate against residents or discrimination period throughout the city during this cobit process. So there are a lot of great resources that joan will share in the chat room and that I'll share separately with everyone. Also, we talked with our division that focuses on neighborhood education and outreach, and joan will provide pam and charlissa's contact information. They are set up to once everything moves forward and, as of September, you know the city's processes. We will be moving forward with more rounds of presentations and the neighborhood education and outreach committee will provide tenant resource sessions. So they do that around the city, but I think community board 10 has not had any of those workshops. Probably in the past. I don't think since I've been at HPD, which has been about six years, I'm not sure if that group has come to HPD. No, I certainly would welcome you know. You know us being able to talk about that. I'm sure lisa would agree that whatever informational educational efforts, you know for our constituents to be able to have, but I also had a question for you or joan. I know that in my own, affordable housing portfolio and malcolm may speak to this a little later when he comes into the discussion, can you talk to us about? You know what your efforts of your agency to get. You know some of our affordable housing projects, more section 8 vouchers. Actually I will get the responses on to that question and get back to you within a week. There's another division, that kind of focuses on section, 8 vouchers, and so I can get those updates to you. Okay, thanks does anyone on the call have any questions? I don't see anything in the chat. At least I guess we're ready to move the agenda along and bianda and joan. Thank you so much for I mean I hope you can stay with us. You know and listen to your partner, malcolm hunter, as he presents what's happening with you know. Hcci and our affordable housing, you know portfolios here in central harlem. Yes, I I'd like to just weigh in a little. This is the first time I got this through hcci and this is the first time I've participated but- and you guys were talking about helping people out with regards to rent rental rears and so forth and so on, and I don't know because I came on a little late. I was on another call, the governor rolled out a new program today, right yeah, we spoke about that brian benjamin announced the new legislation, so maybe you can put that into the chat you're, absolutely right and it's up there literally the application started today. Yeah. We do speak about that. Yes, okay, I just wanted to say that- and this is my other thing about that, because I think a lot of times. I think it's six steps to fill the application out at. Sometimes things aren't as easy as they appear because in one area, they'll say something like because I read the frequently asked questions and in the frequently asked questions they said you don't consider, they didn't consider public assistance as part of household monthly income. But then, when you go to the application it and you punch on that little information sign at the end. It's it tells you everybody who's eligible, not everybody who's eligible, but all of the different things that they consider household monthly income. They had welfare assistance so like which one is it? Is it that or is it not that? And I think that a lot of times what will happen if we don't have some kind of a situation available for people, because I don't know if there's a phone number to call, it's not one readily available for you to ask questions or anything, and I don't know if that's just because today's the first day but it's like because I was trying to help one of my neighbors with it, and we just ran into that problem, and I don't really know who to call- and I think that a lot of people will be discouraged from wanting to follow through when they run into situations like that, if anybody's even sliding over to open up the information to see you know, you know how it is. They'll ask a question and then they'll have a little eye right there and you can punch on that and it'll tell you basically what that means or what it includes. Thank you for that comment. I think you raised some excellent points. It is very new, I'm just reviewing it. I'm the chair of the housing committee. I will say this that you know we have a board member, that you know that actually runs the office of the new york state, division of housing and community renewal at 125th street in the state office. Building I'm going to reach out to her, and if you put your email into the chat, you know we'll make sure that we follow up with you, but it's good advice to be able to say that obviously, information is empowerment and thanks for your observations, I'm not sure how all of that is gonna roll out and operate, but will be very intentional about responding to you and others who have questions or issues regarding how that program can have a direct impact doesn't matter that they announce the program is going to be how many people are really going to be able to avail themselves of it and yeah. We agree. We got seniors and others who may not be able to navigate through. You know an online. You know scenario. So thank you so much for that. You know for that comment so make sure that you just put your email in, because these are recorded and we keep the notes. Okay, just put it in there because that's exactly was the problem that I ran into because I'm trying to help my neighbor. You know that lives in my building and I was trying to afford that service to you know some of the other seniors in my building as well, who don't have a computer or what have you and don't know about this or whatever? So, thank you very much great point. We'll definitely follow up so lisa. I think we're ready for mr puncher sure I just wanted to give a little preload before malcolm dr malcolm hunter begins to speak. So, in our conversations over these past few months, as we try to figure out what problem to solve and the best way to solve it here in harlem we've, all always known housing to be a one-sided look at housing from a one-sided perspective, the programs, the subsidies, you know any kind of government support that we can get or be assisted with, and that's very important in a low to moderate income community like harlem ourselves, talking about housing and just for those who don't know housing is real estate and real estate in new york city is our life. It's our lifeblood. You know eric borough, president eric I've said that we lose the real estate industry. It's like texas losing oil, so we just have to be mindful of the big again the bigger pre, the bigger picture as it pertains to housing and real estate. Real estate has to have repairs done. Real estate requires capital improvements. Real estate has to be financed, and one of the comments that I heard on one of our calls in our rage in our pain, it became this conversation of landlords versus renters. Well, not landlords are bad actors and we have to embrace and appreciate the work of landlords, particularly in our community, as they manage as they provide affordable housing and they build new housing for the residents here, and so I asked malcolm to join the call today, not only because he's brilliant and has a lot of knowledge that he likes to share with the harlem community. But I wanted to him to speak in his role as a leader of one of the most prolific organizations that we have here in harlem and probably across the country, a face, a faith-based non-profit organization that specializes in housing that was founded by visionary faith leaders, namely wyatt walker and other visionaries, who not only wanted to bring quality decent, affordable housing to our neighborhood. But knowing that our community was the need of social support, educational services, online seminars, food pantry, retail space and other small businesses. So again, when we look at housing, we have to look at real estate sale and know that, with the profit margins that the returns of that these nonprofits receive in exchange for what they do goes beyond just the greed that we associate with real estate moguls. This is a labor of love. This is the labor of love for malcolm and I think we need to just listen to what he has to say what he does on a daily basis, how he has helped his constituents in his housing with supportive services around this cove pandemic and also the history of his organization. Malcolm thank you for being here. Thank you, lisa, and thank you to the land use and housing committee. I'm happy to be here with you, as we all collectively go through the stages of grief and trauma, because we are effectively still in that process and I'll describe it as a process as an ongoing and, in a sense, a nightmare that continues to recur. You know, as you attempt to sleep through the night, you know none of us. I was traveling in January of 2020. I was traveling to seattle, washington, on a mission of sorts, because I've built a relationship with a faith group out in seattle, and I've been try. I've traveled to seattle for the last 24 months about three times and in January 19th the weekend of January 19th, the martin luther king weekend. I was invited to give a keynote address with a church group in seattle, washington and also cut a ribbon on a small, modest development that they had completed, and certainly was my honor to do so, particularly during the martin luther king weekend, and I was asked to give an address about hcci's history as well as the social injustices that are happening and that community likes like it and compare the success of hcci as and the success of the city of new york in housing development and in the beloved community of harlem that we all you know are endeared to. I haven't, have grown up here and you know sort of a fourth generation harmonite. You know, I know from the stories of my elders the ebbs and flows of the community and, as I was being born, it was on an air as opposed to a flow. The ebb was obviously the crime that was associated with drugs, the heroin epidemic and then the crack cocaine epidemic, and you know when I, when I come when I when I think about you, know the shootings that we've experienced in the last few months. You know, I think, about 1990, when new york city had 2 200 homicides and how far we've come as a community to in one homicide obviously is too many, but how far a city has come and how that has been achieved over time and that has been achieved through a diff, a host of different strategies, many of which go back to the honorable david dinkins, who started the community policing program in new york city and which was, you know, expanded doing subsequent mayoral administrations. But one of the strategies hcci used- and this is kind of what I communicated to the folks in seattle- was that we've always had a close relationship with the city agencies. Every city agency that exists, including the new york city, police department and acci, having been created in 1986 by those faith leaders that lisa mentioned, understood that in order to turn and revitalize the harlem community that it had to be a deep well of partnership along the private industries, nonprofits faith communities, city agencies- and you know even the law enforcement community, so hcci has been meeting with the NYPD, the sanitation department, the district attorney's office and HPD and other agencies on a monthly basis for close to 35 years, and that strategy has helped us connect with those agencies and also connect our residents who live in our buildings with those agencies. Because the purpose of that meeting we call it. The community improvement group meeting- is to make sure that our tenants, our residents, have a voice directly to the responsible parties in the city agencies, particularly the police department, because the quality of life of residents in our buildings are so important that we want to make sure we are the bridge between. You know the bureaucracy that's often experienced by large municipalities. So we want them to have a voice, and hcci is important to hdci, certainly is important to me as the leader of hcci in this time. So in January I was on the flight six-hour flight and you know unbeknownst to me. The Covid-19 virus had already presented itself to the city of seattle, and seattle was a hub for trans trans-pacific travel. You know from asia and in the place where we believe that the cova virus was originated. So in many in many in many in a lot of senses, I was on the plane with those travelers. But what I wanted to share with you about seattle and my mission to seattle is that people in the west coast and every urban center are dealing with the pressures of the need for affordable housing for low, very low and moderate income. People in seattle there's a district that they compare themselves to harlem, where there used to be the majority of african-americans, there's no more african-americans living in that district, and this church and a few others are the only remnants left of that african-american community and that and they happen to own property and they're, trying to do the right thing. So the struggle that we sometimes take for granted here is a struggle for people all over the country and I'm committed to replicating the model of hcci and other jurisdictions. So I'm doing so there in seattle and I'll talk about some of the other places that were moving the mission too so to speak. But it's very important that I would like to share that. You know what has come out of the covic crisis is certainly a crisis of a generation. Is I've seen the galvanization of community people residents, in particular community leaders, political and elected officials, and common folks that work in and about this neighborhood come together in a way that you can only have seen it based on a crisis sort of reminding me of superstorm sandy in a way? But much more intense and I said I was grieving because I am still not completely over. You know a death of a very dear friend of mine, a tenant leader and a companion of the founders of hcci, mr frederick wilson. In the early days of the pandemic. You know I learned that mr wilson had been homebound, which is really unusual for him, because he was an energetic person and always an advocate and to help others. But you know because of the intensity of the crisis. You know he was. You know he succumbed to. You know some related illnesses as a result. That truly saddens me because you know, I think our first obligation as hcci as holland, congregation for community improvement and as any not-for-profit organization, is to care for the people that you're responsible for yeah. Our core business happens to be real estate, because that happened to be the issue at hand when we were created, but our responsibility is far greater than our core business obligation. Our responsibility is for the welfare of the people in our community and that's a mission that I take very seriously, and I think that our staff members and our board members take that at heart as well. I can easily you know, you know it's certainly a lot of reasons to fall down and feel so aggrieved and paralyzed by this situation. You know it is inconceivable that 800 people a day were dying from this virus. I still can't wrap my head around so when events like this happen, you know it really underscores our responsibility as community members and workers to make sure that we give all of the care and concern and attention to all the matters that are important to the success in survival and even the thriving of our community and what I believe the partnership, as of hcci has been with. The community board, has been to create a safe haven for our community members in a way that really is short of a miracle hcci in his 35 years has built up a capacity that really far exceeds any small, not-for-profit or small type of business in the community. We now possess over a responsibility over 120 buildings in the harlem community, and we've also expanded outside of our traditional borders of harlem into washington heights, as well as the Bronx and even in new jersey and in atlanta georgia, because the need for the model of building, affordable housing and providing social services to boot is a model worthy of replication has nothing to do with. You know who's in the leadership at the time whether the organization is this or that it's really about how the service is being provided to the people in the most need. I believe that the best amongst us is the best the people that are most useful. You know for the benefit of the of human humanity. So I'd like to talk to you about you know some of the partnerships that we were able to continue doing to Covid-19. But before that I do that. I want to describe what the impact of the interruption of the real estate programming and affordable housing was on agency cci, because the first thing we needed to do is to assess make an assessment on what the Covid-19 economy and the covert shutdown would mean for us and as any organization, particularly not-for-profits, you know, there's no net bankroll. That's gonna happen. After our fiscal year, we're not gonna make hundreds of millions of dollars we're not gonna split hundreds of million dollars with shareholders. It's just not the model for a not-for-profit organization. So our budget is a zero budget. You know we can only exp spend what we bring in and we have a responsibility of accounting for that every year in and year out, and we have to file our our tax returns in our 990s, all of which are public record. So when the Covid-19 hit the united states, in particular new york city, we assessed that a almost 3 million dollars from our annual budget was wiped out on March 30th, when it was announced that we were all restricted to do anything, because we knew that the city agencies weren't going to be able to close deals, and we knew that it would be very difficult to operate under those circumstances and, like other organizations, I'm sure they all experience similar budgetary difficulties. We certainly haven't recovered from that, but our responsibility is to continue to operate our services day in and day out, even on the most trying circumstances. While the protocol was to re work, remotely hcci is considered a essential business. It took a few days to clarify what that essential business meant versus non-essential, but once every once the governor was able to explain it and that information filtered down. We were clear. I have not worked remotely throughout this process. 80 of not 80 to 90 percent of my staff have worked from home. They still are working from home, but I thought it was my responsibility to continue to come out because, as the president and ceo of hcci, you know there's certain processes we just could not do remotely and we needed to show an example to our community. I did so responsibly following all the guidelines of the CDC, all the protocols for making sure I was safe, but it still is a difficult situation to come out when you know, there's danger out there and people are dying every day, but we continue to provide services because our most vulnerable population of people were our senior citizens and our people that live living with hiv and aids and our other immuno-compromised folks that live in our building. So we have to continue to service those folks and make sure that they were safe. But we did so by providing over 2 000 meals to our senior residents. We were giving them so much services that they told us stop giving us food, and I was happy for them to react that way, because that means that we were making an impact, an effective change on their lives, to make sure that they were safe. We parted with assemblyman inez dickens, assemblyman al taylor, the Brooklyn borough president's office, the Manhattan borough president's office to distribute food as well as personal protective equipment, and we continue to do that to this day and we haven't stopped. One of the things I was proud to be a partner in is the greater holland chamber of commerce who convened a weekly meeting of what could be described as all the stakeholders that possibly could participate to make sure that harlem itself had a had a group of people that were looking after the needs of the folks in the home, because we knew that the lower Manhattan had their own strengths in terms of organization. We wanted to make sure we were organized, so greater holland chamber took the lead, but it was certainly an effort of all of us as participants and some of you, members of the board, and I'm sure some of the listeners today were part of that group which communicated to the community and the leadership that you know the needs of the community. So we were able to work with out al tayla and anez dickens and gail brewer and carl hasties from the the speaker of the assembly as well as brian benjamin, and the first thing we want to do is make sure we were keeping the lines of communication open to our residents, because we knew that if hcci and organizations and businesses are hurting, the residents are hurting a thousand times greater. And then once we found out, people were being laid off and 2 million 10 million 20 million americans were laid off. We knew we had to immediately halt, even without any governmental orders. We were not going to start any eviction processes and I was happy that the governor did step in and make sure that the courts would not even accept any evictions during their period time. Now, that's a pretty difficult thing for a housing sponsor slash landlord to say, but it was the right thing to do and I believe that we would we were better for it. I'm happy that the legislature in new york created a program that would help residents, I'm just afraid that the window of opportunity for that program is too short. It's my understanding that it's about two weeks or a little more than that, and I don't think it is even enough time for anybody to get a handle on the complicated application process that was described by one of our folks today and I'll and I'll. Give you an illustration. The government also came out with a program for businesses and nonprofits right the paycheck protection program. We couldn't even figure out how to apply it, took several weeks and maybe even two months or so, for anybody to get that grapple with that particular process and I'm still confusing to this very day, but fortunately, after being denied by certain major banks, hcci was approved by one of our local institutions. Carver's federal savings bank, carbon federal savings bank took his time, helped us fill out the application and we were successful in getting that ppp loan, which averted our the necessity to lay off or furlough any of the employees in a in our in our in our organization. So that was a win. You know for the community, when you know community-based bank a minority institution was able to assist. You know a local, not-for-profit, some of the other supporters that came through for us was, you know our local insurance company, our property management company, gave donations to our residents and and some religious groups from other areas, such as Queens came out. A restaurant gave food partnership with us chocolate restaurant, who happens to be one of hcci's tenants, we're able to give food out on wednesdays to first responders. You know particularly the health care workers as well as residents. I myself went out to distribute those food stuffs in when I was able to as well department of health. Health first was one of the health insurance companies, and even private individuals came out to give pvp. You know. While we made the adjustments to our schedule, you know we know that we had to give not only keep people employed but also give them. You know the mental health services that they need, so we connected people to services. So one of the things that I was asked to describe is how the covert impact, as well as the unfortunate murders of the innocent or otherwise unarmed folks in our community, how all of that has been impactful on our ability to operate and provide services. As I mentioned, you know about three million dollars was wiped away from our budget and all of that money would have been part of the real estate operations. So when real estate operations stalled at the city of new york in the state that also filtered down to our organization and one of the one of the deals that I'm really saddened about is we were transferring hcc. I was transferring a co-op building to long-term residents in the holland community, so we couldn't close that transaction, because the Covid-19 economy has caused a deficit in the city, new york city's. You know real estate pipeline as well as the new york state budget. I hear today on a call with our elected officials that the budget gap from new york state is currently 16 billion. So we can't even you know, get a balanced budget for new york state and we have a shortfall 16 billion dollars. I believe that's going to have long-term impact on hcci organizations like it, the real estate industry and other services for the community, so we hope that new york could get assistance from the federal government, which I believe is that responsibility to do. But that's remains to be seen other projects that, fortunately, were not stopped because they were considered to be essential. Essential projects was a project. We bought before you at the land use and the housing committee about two and a half years ago, and that is the victory plaza senior housing, hcci developed the first senior housing building on west 118th street off of fifth avenue back in the 1990s, and that was called victory, one which was 110 apartments of senior housing. So the second victory plaza was in construction during the cobra period it is 135 apartments and 41 of the units was. We are set aside for homeless, formerly, homeless, seniors well, they'll be formerly homeless when they enter our buildings. But it's set aside for homeless, seniors, chronically homeless seniors. In addition to that, hcci will be providing intense case management services for those residents of that building. All 135 and every senior in that building will only be required to pay 30 of their annual income as their particular contribution towards rent. All the remaining rent will be covered by a section 8 voucher. I heard that mentioned through the senior affordable rental apartment program of HPD came up with a innovative program called the sarah program and in part to cover the deficit from the united states. Housing and urban development agency who's really effectively out of the senior housing building, so I'm happy to be a partner with HPD on developing senior housing and providing not only senior housing but the social services that should accompany senior housing in any vulnerable population. You know there are other projects that have been impacted like there's: a cluster of buildings, 75 units west 139th street right in central harlem right in your district that is scheduled to become affordable, co-ops for the long-term residence of those buildings. There's about 50 families in the buildings that are expected to have some ownership stake in their property, but because of the cove impact that project is in delayed, but we continue to work on the project with HPD on those items that we can and at some point you know there will be light at the end of the tunnel, we'll work with the folks at hpe to get those projects back on track. One of the projects that we're involved in we weren't the lead developer, but we're involved in is the victoria theater project on west 125th street. I'm happy to say that there was a local minority developer, who two local minority developers that spearheaded that project. And yes, there was investors that were out from outside of the community, but that building is practically finished, hcci, assisted by bringing its experience in developing low-income housing tax credits, so an entity that is owned by hcci called the toria theater hdfc is providing the 191 affordable housing units that is part of that greater project that includes a hotel and cultural space. So that will be that is completed and will be marketed for applications very soon. The victoria plaza senior housing is already in the marketing phase. So if you're interested in applying you should go to housing, connect, look for victoria, plaza victory class, I should say, and the application is being taken now you have to be 60 years or 62 years or older in order to successfully apply for that apartment, and I mentioned that we're replicating our model in other communities, for example we're building 400 units in atlanta, georgia, which is for some people, is considered the mecca of the black south in the united states, but 400 units pretty large project, and it has the economic development component, and I also want to underscore that every project that we do every project that you approve as a community board not only creates housing, but it also creates jobs. Some of the jobs are construction jobs that last about three to four years, but some of the jobs are permanent. For example, the victoria hotel project will have about 600 permanent jobs, so I applaud you know the city as well as the community board, when they approve projects that will have a not only a residential housing impact, put an economic impact on for workers in our community. Many who are starting out and in the first careers- and this could be the boost they need to push them from low income to moderate income and perhaps even beyond. So in the last four years, at least since my tenure, we have preserved at hcci over a thousand units of affordable housing, and some of those preservation projects are in buildings that were in our portfolio from long ago, and we've created innovative ways to include partners that are partly developers from our community and through trying not to bring take any other money from HPD on those projects. When we do the preservation, where we try to bring in new money and also do some repairs as as part of that process. In the last five years, we've invested through capital acquisitions of about 81 million dollars in the community, and I have to tell you that 81 million is not coming to hcci it's going into the buildings and it's tied up into the mortgages of those buildings. So it's really part of production of the housing and the services for the community. I also participated in some of the advocacy during this period of time. So, as she said, I did support the new york state legislative press conference happening in June. That was part of assemblyman taylor's seminars, dickens and other elected officials who were who are really calling for a change to the way the law enforcement, new york city operates and hiding. You know their employee records, and perhaps you know not giving us the opportunity, as the public to have a say on whether a police officer or a law enforcement agent, who has a bad employment record, should continue to be in the service of our community. So I make sure I was a part of the advocacy group and participated in that and also we supported the March on freedom, justice and quality that was sponsored by the united missionary baptist church. While hcc I didn't sponsor it. I participated because I thought it was a worthy cause and that will help our community and our children not be subject to unwarranted aggression by police officers. That really don't that may not have our best interests at hand. We know that we have a deep partnership with NYPD and we applaud those men and women who go out and do their jobs honorably. But those people who have an intent to oppress or attempt to be aggressive is our obligation to speak out against it. You know we also need to program continue to program some of our open space. We had to temporary close some of them because of the covert virus risk and we got some calls and people took video and mail emailed it to us saying that people were not social distancing and they were doing this and that you know, as a private owner, we can't be responsible for anybody getting sick. We certainly don't want to be responsible for the death of anyone through covert or any other form of neglect. So we make sure we make those right decisions, so I think you know in terms of the how local developers and landlords are, you know, faring during the covert pandemic. You know we're a community. You know whether someone is a business owner or a landlord or a tenant or a resident. You know cobra 19 and the associated impact is affecting us all. You know it's universal, there's, no big bucket of money in any of the affordable housing portfolios. So you know the only income for any landlord is rent. There's no extra money coming through that business. There's no real diversification for a landlord that they can do. They can't take money buying stocks and make a win for the stock market or invest in some other company and offshore. You know as a landlord. The only income that comes to the building is rent and our obligation is to make sure we keep the upkeep of the building and make repairs and that's the only source of income to do so. So we're happy when the legislature steps in provides relief for the residents and that relief can pass down to the building for its upkeep one of the things that happened during Covid-19 is that because of the agencies, not allowing them, for example, the inspection agencies or the permitting agencies such as DOB or the utilities such as con edison very difficult to respond to problems in buildings. When con edison can't come out and do inspections, or you know, you can't really send a plumber to someone's apartment. So I'm glad we're over that period of time. We're now resuming repairs emergency responses, but for a minute there, when the cover 19 was in rage, you know it was very difficult to make sure we respond effectively. You know, tenant protection is certainly the responsibility of government and and the well-being of the tenant is. My in my opinion is my as a landlord is my responsibility. First and foremost, so you know, we agree with policies that make sense and protect residents and residents that are comfortable also have a hand in protecting the property right when people are under pressure. In fear, you know oftentimes that is exhibited and not caring for the places that they live in so it goes hand in hand. So we certainly as hcci and we personally support protection of iran residents. One of the things I wanted to do is make sure that people didn't have to exit their apartments, so we put into a process. If people paid their rent, they could pay their rent. We gave them a free, wash and dry from one of the local hauling businesses who also needed help because they were experiencing a downturn in their industry, so that business was able to pick up laundry from shut-in people, do the laundry at their business facility and then and then and then redeliver that laundry to seniors and people that may have been unable to exit their apartment. So we did that as a service, and we thought that added value and care for the residents, in addition to providing the food and other PPES. So I think short term, I think everybody's impacted, but long term. I think that new york is resilient and you know we have some very smart people in leadership and politic. You know and political leadership. I think in the long term, we'll be back on top as the financial center of the world, and I think that harlan will benefit from that as well. I like to see, of course, more affordable housing and less luxury housing. You know I had a conversation with the borough president yesterday and she asked me you know: what could we? What could she do to assist? You know hcci and all the organizations at hcci. My comment was, you know. I think this is an issue of forced advertising, particularly in these luxury apartment buildings. There's a multi-family on west 148th, 40th street, on adam clinton, powell and in their advertising they said they were going to bring a louis vuitton store to the retail. You know that doesn't make sense. Why would they even say that, and I think they should be? I think they should be stopped from doing that, because that gives them a false impression and then, when they finish the project, what happens? Is they put a 99-cent story? I think is disingenuous and and if they're getting 428 benefits, I think we should scrutinize how they market to the community. You know, unfortunately, we weren't, we didn't, have to lay off anybody from our from our organization, but I understand that a lot of people are impacted by you know furloughs and layoffs, so I agree with any unemployment assistance that you know one might have access to and in terms of cb10. I think I think you continue to scrutinize every project, but you should you know you should support. You know the nonprofit organizations and other for-profit organizations that their specialty is affordable housing. We need affordable housing, we're still getting 60 000 applications for 50 apartments that are available. That just illustrates a demand. That's really a really. You know we can't fill that demand, so we should. We should build more affordable housing and even in this might be controversial, even in some of the open spaces in the blocks we should we should. We should try to try to figure out a way to build, affordable housing there, because we need it. I think that open space can be returned by maybe putting a roof deck and allow the public to use that open space, or at least the people in the building sort of how the upper west side has public pavilions, even though the pavilion space is privately owned. I think we can do something like that and we have an awful lot of real estate on the roofs of every building in harlem. Maybe we can build structures where people can be on the roof safely by building fences that encloses the roof. Semi encloses the roof, but people can use that as a recreation, space and figure out a way to use all the real estate that we have on our roofs. Yes, it's eight o'clock and I just want to make sure that no, I just wanted to make sure that people have an opportunity for questions, because I know there's some questions that are coming in to the chat room, but you hit all the points that I asked and you have such a wide breadth of information on the subject that I hope people are starting to see. The interconnections between land use development and affordable housing and advocacy, and I hope that when you come back to cb10 with your proposals, that we embrace you with open arms, as it's obvious from your presentation, the love and care and commitment that you show for the residents of all demographic groups and that you're one of the good players and that we should be partnering with you time and time again. So with that being said, we want to hear more from you, but I just want to make sure that we have an opportunity to address the questions that are in the chat room. Is that, okay with everyone, so barbara nelson had a question about like specific to hcci and the lack of response of NYPD in some of the hcci buildings that are unfortunately have drug sales and are dealing with other issues and wanted to know? Is there a way to reenact with the da's office and partner with them to, I guess, clean up the situation? Yeah? I thank you, barbara nelson and you know. Certainly you know. I know you to be a sincere advocate for the community and thank you for that question. I think it is certainly NYPD needs to step up on drug enforcement. I think that you know what our responsibilities online was to make sure that if we, if it's known to us, that we report it to the police department and the district attorney's office- and we have a method to do that, we have a staff member specifically signed as the liaison between the NYPD and the district attorney's office. You're right. I think the no trespass program which was popular in the times where hcci started to take over the buildings and they and that program was very effective in removing drug sales from the building. I'll give you an example, one of our very one of our co-op buildings had someone selling drugs in it was actually a family member of an individual and the police department. You know during the course of this investigation I think, there's a methodology they have to use. It's not like you know. If they see it happen, one time they can obtain a warrant, they have to have it seen it over a period of time. So sometimes that takes time to run its course, but they arrested in a csd apartment and actually did a civil forfeiture of the actual apartment against the landlord, even because they said essentially, the landlord shouldn't allow somebody to be in the door and that sells drugs out it's difficult to figure that out, but we had to go to court and I think, at the time judge tingling was on the bench and judge chingling understood that you know. Aci is a landlord. You know absent us supplying this person with drugs and they selling drugs out of our apartment, that it's very hard to make the connection between the landlord being responsible for attendance behavior, and you know they believe that the of the court process in that case, but we continue to have a partnership with the NYPD and we report any allegations to them. Then we have the process for that, and I think you know working in close proximity with the responsible law enforcement agencies is the solution. The other question and I'm in the supportive housing space, I'm assuming that a lot of your buildings are mixed populations. So some of the seniors are complaining about the individuals with developmental disabilities and the lack of specialized caseworkers to help them with their behavioral issues and again, barbara nelson wanted to know how is that being addressed? So the senior buildings have a full-time case manager that complements the services there and they will be master's degree level or greater social workers so they're trained to. If they you know, if they're, not clinical social workers, they're trained to refer, you know, someone, that's exhibiting bad behavior and some of our buildings have. I think, specific question was around not the buildings dedicated to one population, but the populations that are mixed throughout our buildings, and that is the case, and some of those people have special classifications that I can't really identify them because they're protected class, but if they're acting out, then we go back to the referring agency and that's usually a city of new york and try to get them a placement that is higher level than you know, independent living. That's not always easy, because the city of new york has a three-tiered process that almost never happens to the termination of the process, and you know no matter how much we advocate. You know it's a non-displacement policy. You know we can't evict them and we have that situation in a couple of departments, and I know that has happened in 150th street between frederick douglass and bradhurst. But in that particular case I won't identify the apartment. The individual has left the person that we were servicing, but they left a drug deal in their apartment and a drug dealer went to court when we tried to evict him and essentially convinced the judge that, even though he's a drug dealer, he had right to stay in a partner so until we can catch them literally red-handed, not us personally, but you know the law enforcement agencies, it's very hard to get that type of individual out of the apartment and they've threatened staff members, and we have to deal with that as well. Thank you. Barbara's next question is about 301 west 150th street in particular. Vandalism, teens from the neighborhood with drugs continue to sleep in the laundry room and they need help in that building. Yeah I'd like to have that conversation offline since you're so specific. Thank you. I have a question. How have your investors, funders tax indicators responded to you for the agency in this time of crisis yeah? Initially we were unsure, because the investor is, I don't know if you're aware, but we don't know who the investors are the way. The low income housing tax credit program, which was the tax code signed in 1986, was created, is that the investors invest through a syndicate and that's not syndicated in a bad word, that's syndicated in a formal legal sense and the people we know in the affordable housing industry are called syndicators, essentially they're, the middle men or women that act on behalf of these anonymous investors and sometimes their commercial banks, sometimes they're not-for-profit organizations. So one not-for-profit organization that acts as a sent up two acts as a syndicator in new york city is enterprise and lisc, which is a low local initiatives support corporation. They actually act on behalf of the investors and you know, prior to them. Investing in affordable housing is a 300 page document, a legal document that says all of the obligations that the sponsor, usually the non-profit organization or for-profit organization, are required to do, and one of the things that they're required to do is, if there's any losses in terms of profits in the property that the nonprofit or the sponsor is responsible for covering those deficits. So you can imagine if you know a deficit happens. You know the nonprofit who itself is struggling because there's no profit in the business that they're in has to come up with money to cover those deficits. One of the other things that happened is that there's such a long period of time where you have to be in compliance on the affordable housing structure, the compliance period is 30 years. That means that, if there's a instance of non-compliance at any time during that period, those tax credits that you were awarded are at risk of being taken from you by the irs. If that happens, because somebody was not qualified to be in the apartment based upon them being over income or some other instance of non-compliance, the irs is responsible for coming in and taking those tax credits back, which means that all of the benefits of the tax credits and all of the money that invested by the syndicator by the investor through this indicator, the not-for-profit or sponsor, could be a for-profit would be responsible for paying all that money back to them and that's usually hundreds of thousands of dollars and a lot of times. The new construction building, for example, hcci's new building cost about 38 million dollars. So imagine, if some property manager, you know refused to apply the guidelines under the tax code but to the apartment and that tax credit was recaptured, then hcci would be responsible, paying someone back 38 million dollar and that investor is not going to say. Oh okay, we'll forego that money. You know they're in it for the investment, so we have a affirmative obligation to meet all the terms of the agreements under those under that partnership structure. And that's really in my role as the president of hcci, that's my direct responsibility and I have to meet those obligations indeed. Well, this has been fantastic. I don't and informative. I don't see any other questions in the chat room, but I know you'll be coming back to the community board because vyond and I are already in conversation about how to bring more information to the community, around low income, tax credits, financing and educating our community about the technicalities around real estate, development and land use and things we need to know when developers come before us. Please don't miss the question. One of the questions is the community board going to hold some sort of form to assist within the two-week period or at least show people how to apply for the funding, which will be a win-win not only for the not-for-profit, because the money is money that does not have to be paid back, but as dewana said, people are not all computer savvy. There are questions so with this limited two weeks, because it is a two-week window. Is this any way that there can be some sort of form forum to help individuals that are in need of the services which will in turn help malcolm? I think that's a question for charles, so I've been. I saw this question barbara. I certainly think that that's something we could look at I'd love to speak to malcolm and his and his team. You know about that. I mean the only thing that you know, as you barbara know, and all of the community board members tell there's so many meetings I mean even tonight. You know there is the exonerated five. You know panel and forum that kind of like conflicted with ours, so love to do it so barbara, maybe you and I can and talk about it and certainly I'm available to even say if we can bring in you know others malcolm. I don't know whether we need you know. Folks from you know, you know our legal team. You know we have been working with Manhattan legal services and we can talk with dhcr and you know so barbara. Let's just try to do it. I was really reading what you had written and to say that it's something that we need to consider that can occur. It's definitely needed. You know whatever. I can do to help I'll be happy to. So I think, with malcolm saying that barbara and with your support and with everyone on board, now speak to sicily, let's make it work yeah. Definitely I malcolm has always been a person of his word from and I've known, malcolm. We don't want to say how many years but get in contact with me, malcolm it's important. I will I'll talk to the some of the legislators that created the program and asked them if there's resources out there as well got it thanks. Thank you, lisa. Thank you. Chad, thank you so because there was so much of a conflict. In terms of the scheduling of this meeting, I'm going to ask shatik to send out the recording to the board members, so they can get a flavor of all the wealth of knowledge that you shared with us this evening just on to new business. If there are no any questions from the land use committee, so guys, as I told you, it was going to be light, but now that the city plan commission is opening up and your lot, your looks are happening. We will be in full swing, starting in September, and I know vianda has some proposals that have been on the back burner that she presented to us. She was about to present to us and got sidelined because of Covid-19, and I expect that song will start bringing off applying to get on our calendar so with that enjoy the rest of summer in august, and I want to thank malcolm and bianda and other members of HPD who participated this morning. My co-host sauce powell, my partner karen dixon, and all the other community board members of community britain that participated this evening. So if there's nothing else, we will call this. Oh redhead bianda has another comment. Okay, I just want to again thank you all for inviting us to this important discussion. I also look forward to really galvanizing others around the agency who work in different facets of not only community activism, tenant protection, but also on the legislative side. So I look forward to continue and malcolm. Thank you for your presentation as well. I just want to say a few closing comments. One is that joan put in the chat room, some information about section, 8 vouchers, and then I emailed the leadership, some more resources that I got from the intergov team. So you know feel free to share all that information with your constituents. It's a wealth of important updates that we get from all city agencies that will be helpful to commemorate 10, and I want to also say that again, a lot of us are working on varied committees internally and externally, with other city agencies really bringing to light a lot of discussions about inequity and social justice, and that also focuses on advocacy for mwbes and nonprofits as well. We are all aware, the larger some of the larger development teams don't have to worry about lending institutions or investors pulling out of their projects as much as the smaller organizations or the faith-based institutions such as hcci and so again, a lot of us really fight really hard in many ways and in many platforms to really advocate equitable housing in communities of color. So I think the unfortunate part about all these police brutality, events and deaths that are still going on. The good news is that these conversations, that many of us have been really having in different forms are now coming out to the forefront and so there's task force involved in really ensuring again. You know internally that practices are fair as well as externally, so we we're all working on the same team just from different angles, and I also appreciate community board for holding this city to task. There are certain things that our team doesn't have control over, but the more that you challenge us to do better to act differently or to do more, the more that we can take back to our executive team members and certainly charles reached out to our deputy commissioner anne-marie hendrickson, and so she has a larger platform than I do to advocate on behalf of kimber 10. and so beyond. I'm glad you mentioned that I was going to close with that one. I thank you for reminding me that I did put into the chat, I'm sure, malcolm you are aware of it, the RFP for project. You know, base vouchers for section 8 vouchers. I put that link into the chat, I'm sure you're working on that with ann marie hendrickson deputy commissioner anne marie hendrickson's help. You know greater harlem housing, my affordable housing portfolio is already applying you know for that project. You know base vouchers which are significant because they stay with the project and they don't you know, go with the tenant when a tenant moves. If it's an individual section, a voucher, it goes with the tenant. These vouchers stay with the project which, malcolm I understand are you know good points for when you're dealing with future underwriting, and you know future you know financing of your project so beyond it. Thanks for reminding me, I'm glad I put that in and yes and marie hendrickson. I think, based on what barbara was saying that you know I know housing. I think what we should do. Barbara is just do a august housing committee meeting focus on exactly what you said. The help and support for residents get that word out and- and commissioner hendrickson has indicated, she'd love to join our august meeting so beyond to thank you and joan so much for jumping on you responded in less than a day. You know I'm sorry, we didn't get that information out to you sooner, but really thank you always for being there for us and community board 10 in our community. So if there's nothing further, thank you all for joining this call and I've been told by satique mitchell, who had to leave that I can actually end the meeting right lisa unless there's something more from you or karen we'll move to adjourn. I would just say on a closing note. I think if nothing else we got out of this meeting is that we are definitely all in this together and moving forward and onward or onward and upward have a good night everyone good night. Thank you all for being on so much and we'll talk to you in august. Yes, thank you, charles, so we've been on motion to close out the meeting we have you know I second thank you good night everybody and thank you all good night.",
        "summary": "So first before we get into specifics, I, just wanted to give you sort of an overview on what happened on the land use side of things during this pandemic, which is essentially nothing and that's because we had so many other crises, citywide that had to be dealt with respect to the economy, stopping businesses from operating.\nThere were a lot of DOB people roaming, the field, making sure that those essential projects were following social distancing rules that were giving out hand sanitizer or pro were following proper protocol, and if they didn't, they were facing fines upwards of ten thousand dollars in violations on may 13th.\nThey have a specific portal called new york city engaged upon which residents and the community at large will be able to go on and find out what the development projects are that are going to be discussed for the pending meeting and find when there will be ways to instruct those who are interested on how to access public meetings remotely.\nTwo great pieces of legislation have come out in our favor, so that allows us to remain very hopeful about the future, the future of new york and the future of harlem I'd, now like to open the discussion up to just talk number one from the agency, perspective.\nTell us a little bit about what your experience has been like, both as a professional and as a planner in this covered time, and some of the things that your agency has been able to assemble and put together for new yorkers in harlem nights, community board 10 in particular, so bianda before you, begin.\nAnd I just want to make sure that for those residents or others or community leaders that can communicate, and You've already communicated that to your residents, that this process of the Covid-19 rent relief program, which he's established through state legislation, actually started today and the applications are open.\nSo I will say that our agency has been working diligently, just as your community has been working diligently to really shift as quickly as possible, in addition to managing our own lives, whether we have family members who have been directly impacted during this time, period, So again, I want to commend all of you for making it through and being vigilant and also confirming that the community gets as many resources and assistance as possible.\nYou know again that left a lot of unknowns, not only for the projects that we were trying to advance throughout the borough of Manhattan, which is what my team works on, but also just in terms of our sustainability, as well as an agency.\nI know that in my own, affordable housing portfolio and malcolm may speak to this a little later when he comes into the discussion, can you talk to us?\nThis is the first time I got this through hcci This is the first time I've participated, but- You guys were talking about helping people out with regards to rent rental, rears and so forth, and so on, I was on another call, the governor rolled out a new program today, right And, it's up there literally the application started.\nThink that a lot of times what will happen if we don't have some kind of a situation available for people, because I don't know.\nDon't know if that's just because today's the first day, And I, think that a lot of people will be discouraged from wanting to follow through when they run into situations like that.\nI, will say this that you know we have a board member, that you know that actually runs the office of the new york state, division of housing and community renewal at 125th street in the state.\nYou know any kind of government support that we can get or be assisted, with, and that's very important in a low to moderate income community like harlem ourselves, talking about housing and just for those who don't know housing, Is real estate and real estate in new york city is our life.\nWell, not landlords are bad actors and we have to embrace and appreciate the work of landlords, particularly in our community, as they manage as they provide affordable housing and they build new housing for the residents.\nKnowing that our community was the need of social support, educational services, online seminars, food, pantry, retail space and other small businesses.\nSo, particularly during the martin luther king, weekend, and I, was asked to give an address about hcci's history as well as the social injustices that are happening and that community likes like it and compare the success of hcci as and the success of the city of new york in housing development and in the beloved community of harlem that we all you know, are endeared to.\nBut how far a city has come and how that has been achieved over time and that has been achieved through a diff, a host of different strategies, many of which go back to the honorable david dinkins, who started the community policing program in new york city and which was, you know, expanded doing subsequent mayoral administrations.\nLeaders that lisa mentioned, understood that, in order to turn and revitalize the harlem community that it had to be a deep well of partnership along the private industries, nonprofits faith, communities, city, agencies- And, you know even the law enforcement community, so hcci has been meeting with the NYPD, the sanitation, department, the district attorney's office and HPD and other agencies on a monthly basis for close to 35 years, and that strategy has helped us connect with those agencies and also connect our residents who live in our buildings with those agencies.\nThe community improvement group meeting, is to make sure that our tenants, our residents, have a voice directly to the responsible parties in the city agencies, particularly the police department, because the quality of life of residents in our buildings are so important that we want to make sure we are the bridge.\nWhat I wanted to share with you about seattle and my mission to seattle is that people in the west coast and every urban center are dealing with the pressures of the need for affordable housing for low, very low and moderate income.\nBecause, you know, I, think our first obligation as hcci as holland, congregation for community improvement and as any not-for-profit organization, is to care for the people that you're responsible for Our core business Happens to be real estate, because that happened to be the issue at hand when we were created.\nSo when events like this happen, you know it really underscores our responsibility as community members and workers to make sure that we give all of the care and concern and attention to all the matters that are important to the success in survival and even the thriving of our community and what I believe the partnership, as of hcci, has been with.\nNow possess over a responsibility over 120 buildings in the harlem community, and we've also expanded outside of our traditional borders of harlem, into washington heights, as well as the Bronx and even in new jersey and in atlanta georgia, because the need for the model of building, affordable housing and providing social services to boot is a model worthy of replication.\nYou know who's in the leadership at the time whether the organization is this or that it's really about how the service is being provided to the people in the most need.\nI want to describe what the impact of the interruption of the real estate, programming and affordable housing was on agency cci, because the first thing we needed to do is to assess make an assessment on what the Covid-19 economy and the covert shutdown would mean for us and as any organization, particularly not-for-profits, you know, there's no net bankroll.\nWhen the Covid-19 hit the united states, in particular new york city, we assessed that a almost 3 million dollars from our annual budget was wiped out on March 30th, when it was announced that we were all restricted to do anything, because we knew that the city agencies weren't going to be able to close deals, and we knew that it would be very difficult to operate under those circumstances.\nOne of the things I was proud to be a partner in is the greater holland chamber of commerce who convened a weekly meeting of what could be described as all the stakeholders that possibly could participate to make sure that harlem itself had a had a group of people that were looking after the needs of the folks in the home, because we knew that the lower Manhattan had their own strengths in terms of organization.\nI believe that's going to have long-term impact on hcci organizations like it, the real estate industry and other services for the community.\nYou know there are other projects that have been impacted like there's, a cluster of buildings, 75 units, west 139th street right in central harlem right in your district.\nThere was investors that were out from outside of the community, but that building is practically finished, hcci, assisted by bringing its experience in developing low-income housing tax credits.\nYou know the city as well as the community board, when they approve projects that will have a not only a residential housing impact, put an economic impact on for workers in our community.\nWe have preserved at hcci over a thousand units of affordable housing, and some of those preservation projects are in buildings that were in our portfolio from long ago, and we've created innovative ways to include partners that are partly developers from our community and through trying not to bring take any other money from HPD on those projects.\nI, think that new york is resilient and you know we have some very smart people in leadership and politic.\nSo barbara nelson had a question about like specific to hcci and the lack of response of NYPD in some of the hcci buildings that are unfortunately have drug sales and are dealing with other issues and wanted to know?\nBut I know you'll, be coming back to the community board, because vyond and I are already in conversation about how to bring more information to the community, around low income, tax, credits, financing and educating our community about the technicalities around real estate, development and land use and things we need to know.\nYou know we have been working with Manhattan legal services and we can talk with dhcr So I think, with malcolm saying that barbara and with your support and with everyone on board, now speak to sicily."
    }
}