{
    "YoutubeMetadata": {
        "author": "BCB10",
        "channelId": "https://www.youtube.com/channel/UC8p1vwvWtl6T73JiExfWs1g",
        "title": "Parks Committee",
        "publishDate": "2020-05-11",
        "shortDescription": "A meeting of the Parks Committee of Brooklyn Community Board 10\\nMonday, May 11, 2020\\n7:00 PM"
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "BCB10",
        "normalizedName": "Brooklyn Community Board 10",
        "twitterName": NaN,
        "youtubeChannelName": "Brooklyn Community Board 10",
        "youtubeChannelURL": "https://www.youtube.com/channel/UCPueX4MsL5dhnFZ-wqDwvKw",
        "twitterHandle": NaN,
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "Richard, okay, good evening, everyone welcome to our community for 10 clocks, a mini department of committee, meeting I'm glad that you were all able to join us and I would like to introduce the members of the parks department who will be making a presentation this evening regarding the Shore Road Park dog run construction. We have with us Mike madman, Rachel, Cramer, Chris and Olli Terry, no Naranjo, Morano and Chris siren all from the parks department and with no further ado I'm going to turn over the meeting for their presentation. So here we go wonderful, so I'm gonna try to share my screen here. Let's hope this works. Well. Is everyone able to see this looks good? Wonderful! You can hear me: okay, absolutely perfect. Okay, I'm just gonna, try to get a full screen, all right, so I, just wanna, say in general. Thanks for having this meeting it's great that we can do this via zoom and move this project forward, and my name is Mike Madden I work for the New York City Parks, Department I'm, a designer and I worked on this project in conjunction with Zoe Chen, who is currently out on maternity leave. Some details on the project. The budget was 1 million dollars and that was allocated by City Council district 43 and Justin Brandon, and the project size is a small but ample point, four acres. So that's about a half acre there. So we have some goals for the project and these were based on our community input meeting that was in November of last year on the 12th which took place on site. So our goals are to provide spaces to come large and small dogs. We want to include amenities for dogs and dog walkers both and to provide a welcoming entrance and enhance existing lighting. These are our goals on this slide, but we also have a couple of other goals that are based on community input and those are to have softer surfaces, so less concrete, for example, and on top of that, we wanted to think about correcting some of the drainage issues that are currently happening on site. So, if you're familiar with this area of site, it is a very low point in the park and there have been some issues with water accumulating there. Oh and sorry, one last thing: we also want to make sure it's a be a accessible, which is just a general goal for parks, but especially here, I think that's very important and you all likely know a lot about this park. More than I do I would imagine, but just some background, choro Park spans the entirety of Bay Bridge, it's 58 acres in our site is at the southernmost tip of that. So of the 58 acres. We are point four of those and we are located between 3rd and 4th Ave right next to the tennis courts between shore Parkway and Belt, Parkway and Shore Road again stuff to the community. Probably knows this is the land use on the site. Currently, it's largely residential in terms of the other parks in the area. There are a handful within a 10-minute walk and also quite a lot more of Shore Road Park in terms of program, so Sherwood Park itself offers basketball and baseball and ball tennis, etc. John, Paul, Jones and David promenade are more passive parks, and then we have John Jake Rd, which offers some of the same features as Shore Road are, but none of these parks have a dedicated dog run space, and here I just want to talk about the existing conditions on the site. So at certain points throughout this site's history, it was a playground. It was also a temporary ice-skating rink and it has been used more recently for construction staging. You may have noticed the large, not in perfect condition, ten foot high fence here that's been used for construction staging and within that we have a really large swath of asphalt. So this is a big impermeable surface and little bits of concrete and some remaining features. So we have some playground features in here that we'll see in some of the site photos later in the presentation, and we've got three great light posts and a currently empty planting bed on the outside of the site and just beyond this 8-foot fence. We have a small wooded area and we also have the entry ramp beyond that to get on the Belt Parkway and then a view of the Verrazano down here. So this slide kind of explores some of the same topics, so I'm not going to stay on here much. This is kind of just our assessment of what those things mean. So you can see we have this fence, that's not in great condition and some old play equipment and these little tree pits here in terms of accessing the site. There are four ways to enter the short road park from this southern point of the park, so we have three pedestrian-only entries here: two on either side of the comfort station, one just north of the post and then our main or not our main rather another entry. Our main entry for maintenance purposes is at the intersection of 4th Avenue here, so this is a combined pedestrian and maintenance vehicle entry. This is a very important slide. This is our tree inventory. So luckily we have a number of really established beautiful, shade trees on site and we've been out there with our Forester in their own, very good condition. So we're excited to say that we'd like to be keeping all of those and we're going to work to do that and I think these trees will be a great resource in the summer months, when it's very warm- and here we have a view from those stone steps that come down from the comfort station. So it's a panorama and you can see that 10-foot high fence, that's not an excellent condition and you can see through the trees because it's fall, the Verrazano in the background and between the park site and the view point we have the path and then we have our little planting bed outside of the fence. Next, it's a view of the paths very similar to the last photo in terms of content, but this is just a view of those planting beds, a view of the path and then some of those light posts here are two views from inside the park or the future dog run, and you can see the remains of former sandpit in the playground and by and large, the site is mostly just covered with asphalt. So it's cracked asphalt. It's not an excellent condition. There's some differential settlement and we're just excited to transform this four foot of six and seven. We have an inactive drinking fountain. This has probably not been in any usable condition for decades at this point, and we don't plan to make active use of this connection, we'll be putting in new connections that are much more updated and then there are some sinkholes next to a manhole on site. We have been in touch with DEP in order to remedy, what's actually happening here before we begin construction and with all of this stuff in mind, I'm very excited to show you our schematic plan for the dog run itself, so the schematic plan all starts at this entry. So we have this double door: double gate entry here off of the main path which is aligned with the stairs and within that vestibule we have a trash bin and a dog bag dispenser, of course, and from there the path there's a concrete path that leads to either side of the dog run and that's an ata, accessible path which will have companion, seating and bench seating and the site is divided by a four foot. High fence into two distinct dog runs with a lot of the same features. So we have the small dog run here on the southern point of the site, with both open lawn and synthetic turf, and that's just under 4,000 square feet, and then we have the large dog run here, which is about 12,000 in total and dogs are able to run from the synthetic turf to the lawn and enjoy that shade and kind of Explorer as much of the site as we were able to provide. Also to note we will be including water access in this design. So there is a bottle. Filler with a dog hole will have hose spigot connections and we will also be having we will be, including our storage box, so community. The community group can actually store accessories necessary for the dog run in this when they're, not there just outside the fence. Here outside of the 4-foot fence, which I'll talk about in a moment, we will have compacting carry which is a beautiful native, very adaptable, evergreen shrub and that's not going to grow above the fence. It's going to just enhance and soften that edge. So what that will do is make this look nice in the winter as well as the summer, and it's also going to change the feel of this pathway so that you don't have a very large fence as you walk by it. Here's the fence diagram- and this is pretty important, because it's really changing the way this space will feel to people both using the dog run and people walking by it so based on the site, requirements and also kind of in line with the parks. Without Borders initiative we're lowering the fence on the path side to 4 feet, which is definitely adequate for a dog run and we're also dividing the dog run with that four foot: high fence we're gonna, keep the existing 8 foot fence along the back of the site, because that protects us from the adjacent properties it's connect to the highway, and it also helps kind of change the view of this site and then we're going to keep the existing 12 foot high chain-link fence on the side of the tennis courts. But what we're going to do is we're going to add a geotextile fabric to kind of obscure the view for the dogs in the bottom four feet of that, because we don't want these large dogs being distracted or barking or really enjoying the tennis balls in the tennis court and maybe not the tennis balls of their owners, throwing and then we're gonna protect our trees with some pretty interesting steel tree guards. The kid of parts that we were thinking of using and that we hope to use for this site will be a synthetic turf, synthetic turf, that's k-9 friendly. It's specifically designed for dogs, and it will align similar to how this photo does. It will be flush with a concrete, walkway, so visually that will have some similarities. We will be using a one-inch chain-link mesh and that will prevent dog paws and noses and God forbid teeth from going through the fence either between the two dog runs, but also with the path we're gonna provide two types of edge so, depending on your seating needs, we'll have both an eight-foot armed, backed bench, but also a backless bench and a four-foot length, and here's that Hank berry. Shrub I was mentioning great native habitat, providing evergreen shrubs, that's available to are able to adapt to a lot of conditions, and then these tree grades or tree guards I think we also saw some of these in the plan. So we have the steel storage loss, the trash bin, of course- and importantly, we have the bottle filler with the dog bowl and then the dog bag dispenser. So this is one of the last slides, but in some ways kind of one of the most important. So this is what we're doing in terms of improving the permeability on the site, so this site, while it's not technically in a flood zone, it's just outside of it, is really susceptible to some of these drainage issues that you may have seen if you've been there. So what we're hoping to do with our synthetic turf application is used that as a way to do some clever engineering and underneath that we'd like to install a pretty robust drainage system that prevents input onto this area of the path up here, but also just manages and collects all of the stormwater that hits our site instead of sending it elsewhere or sending it directly into the river and then we'll also be just improving the overall health of the trees by including that softened lawn area, because their roots will finally have space to breathe and that just about ends our slideshow presentation for the dog run. Thank you for inviting us to show it to you and I think it's just a great opportunity to have a project to look forward to moving forward. Thank you very much. Mike before I, open the floor to questions, I have a question of my own metal tree guards mm-hmm. How do those operate in order to keep the area nice and clean? Is there a gate that opens up that area can be cleaned for any kind of leaves or other debris that following there that's a great question. So, while we haven't worked out the exact detail for what we're going to use there, we're gonna make sure that we run it by our maintenance and operations and just make sure that everything is really readily able to be cleaned because, of course, we don't want dog bags or refuse or leaf litter or anything to accumulate in there and that'll be a big part of how we design them. The image that you saw was from a playground, so that has slightly different requirements. I imagine ours might be a little bit shorter than that and we're really hoping that'll be very accessible for maintenance. Okay, thank you. Does anyone else on the committee or in the meeting? Have any questions I can't really see if anybody does or not Oh mark, can you let me know or Josephine familiar with the participants? There is a raise hand feature you can press the raise hand? So we know if you have a question, but I have a question for Parks about the width of the fence. Do you feel the living? So? Could you rotate that code a bit for money? Will they be matched to the smaller dogs? Is that is a fence weight adequate yeah? So the fencing between the dog runs as well as on the other side that will have the one-inch chain-link mesh, so it'll be a much smaller mesh to keep everybody safe. The geotextile fabric, I mentioned, will only be on the 12-foot side, just to kind of obscure the view a bit, but otherwise they'll all have a very dog-friendly and dog safe small mesh. When is this? How long project projected to you know take? Well that's a great question, so our design timeline. We will finish our design phase, November 12th, so exactly a year to the date of the original community input meeting and then from there. We have a procurement process, which is typically nine months, some of then going faster, but I definitely can't promise anything and our construction. We usually budget between 12 and 18 months, for that, so that leaves us with a good projection getting to August, 22, 2022 I, believe, ok, jumping in and I think we'll do a 12 month, construction. Here, it's not getting the full 18 months. We're gonna gain some time there any other questions yeah. This is Dan I'm, seeing the double gate on the far right. The four-foot high double gate, I'm, assuming that's maintenance, access right, that'll, mostly usually be locked exactly so that will be locked nearly at 100% of the time, except for when maintenance crews are coming in. So they'll come right off the path here and then there is also, as you can see, there's another double gate here, just that they can easily go from one section to the other alright and the existing le the LED lights about how bright would they go? Cuz I know that a lot of dog walkers in Bay Ridge they'll bring their dogs in very early down to shore road, so like early pre-dawn kind of hours, just interested to see how far those lights could kind of stretch into the main area. Yeah. That's a great question: I haven't looked into the exact lumens of those, but they'll definitely provide light that is adequate or greater than what a current typical light post in the parks property would have. So the new LED fixtures typically shed more light and on top of that they're just much more efficient and environmentally friendly because of it great and the shading provided by the trees I'm. Imagining there's a shading study that would happen to just see about how much shade that would provide, especially on very hot days, I know in Bay Ridge. We have a lot of people that really clamor, especially in this summer, for a very nice shaded dog-walk area, especially because a lot of the benching and things seem well at least for the small dog area. It looks like the large dog area actually has some pretty good canopy cover from the north from the upper part of the image there, but just wanted to make sure that there's enough shading and near the seating areas for people waiting around watching their dogs play. Yes, that's an excellent point. So we've definitely looked at the overall canopy width of these trees, which will be greatly extended. Considering this park faces pretty much due south, so we're gonna. Imagine these shadows here extending a bit further in the summer months and I do believe that the benches and the small dog one will be covered. However, in terms of being realistic, I think that some of these benches here are likely to get some Sun, so we're trying to offer some shaded seating on the northern side here in the water dog run great. Yet just having that alternative seating is really good. Okay, anyone else. Okay, then well I do not believe that we have a quorum this evening, so in terms of Bell, I, guess, Josefin or Dorothea, as I can't see who they are. I saw Laurie King dommage is not a member of the committee she's, the chair of the board, though I, don't I, don't think you have a quorum. Okay recommendation of course. Yes, one second, no boys, the chair. It's always nice to have her on the TV, no I Lori hi Laurie. There we go so in terms of how we proceed. If there is no further comment or questions for the Parks Department I would like to entertain a recommendation that we can make to the full board that considering everything that was presented, that we move forward with our recommendation to proceed with this with this project, anyone would like to make such a motion or a recommendation I'm open to it, but I can't see everybody mark. Can you bring us back to the to the full Oh Justin has his hand raised Justin hi it okay, Justin. Okay, thank you. Thank you for that. There we go okay, so Justin you want to make a recommendation. So what ideas just motion on the floor here to recommend to make a recommend that we do proceed with this? Isn't in our next community board meeting okay, there are seconds, I recommend, I, don't have to go, and so all committee members I guess you were just signified by- is there a hand I don't see, make a raised hand thing, but you could just raise your hand. So I can see parks committee members all in favor, okay, so we anybody opposed to it. Anybody has any questions that they'd like to raise at this time, seeing none. We will present at the full board meeting on Monday and we will move forward with this recommendations. I do want to thank the parks department for such a concise study. It was really interesting and I'm looking forward to this, to seeing this area of the park be reconstructed so that you know even our furry animals can have a place to run and exercise and be in a nice area instead of cracked asphalt and concrete. They deserve much more. So with that was the only thing on our agenda this evening. My correct yes, I would like to thank everyone for joining us this evening and I do hope that all the mothers had a wonderful Mother's Day yesterday and the mothers of all the other members attending this evening had a wonderful Mother's, Day I do hope that you all keep safe and keep well and I, look forward to seeing you all on our next stretch at home forward, meaning thank you so much for facilitating this meeting for us and again to the parks department. Representing this thing you very much for attending with that I'm gonna say good night. Thank you. Thank you. So much! Never! Thank you good night. Everyone.",
        "summary": "These are our goals on this slide, but we also have a couple of other goals that are based on community input and those are to have softer surfaces, so less concrete, for example, and on top of that, we wanted to think about correcting some of the drainage issues that are currently happening on site So. If you're familiar with this area of site, it is a very low point in the park and there have been some issues with water accumulating there, especially here I think that's very important and you all likely know a lot about this park.\nThink these trees will be a great resource in the summer months when it's very warm- So, it's a panorama and you can see that 10-foot high fence , that's not an excellent condition and you can see through the trees because it's fall, the Verrazano in the background and between the park site and the view point, and then we have our little planting bed outside of the fence Next.\nHigh fence into two distinct dog runs with a lot of the same features: We have the small dog run here on the southern point of the site, with both open lawn and synthetic turf, and that's just under 4,000 square feet, and then we have the large dog run here, which is about 12,000 in total and dogs are able to run from the synthetic turf to the lawn and enjoy that shade and kind of Explorer as much of the site as we were able to provide Also to note, we will be including water access in this design.\nThis park faces pretty much due south, so we're gonna Imagine these shadows here extending a bit further in the summer months, However in terms of being realistic, I think that some of these benches here are likely to get some Sun, so we're trying to offer some shaded seating on the northern side here in the water dog Just having that alternative seating is really good."
    }
}