{
    "data": {
        "YoutubeMetadata": {
            "author": "BXCB11",
            "channelId": "https://www.youtube.com/channel/UCG-BOeUcviapIkDFQfxLuiA",
            "title": "Full Board 9/2020",
            "publishDate": "2020-09-28",
            "shortDescription": "",
            "lengthSeconds": "2:49:44"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BXCB11",
            "normalizedName": "Bronx Community Board 11",
            "twitterName": null,
            "youtubeChannelName": "Bronx Community Board 11",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCG-BOeUcviapIkDFQfxLuiA",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "Zw-DqAguXSY",
            "fillerWordCount": {
                "uh": 270,
                "um": 305
            },
            "readTimeFullTranscript": "86 min read",
            "readTimeSummary": "9 min read",
            "wordCountFullTranscript": {
                "motion": 68,
                "person": 38,
                "shelter": 34,
                "session": 32,
                "men": 30,
                "minutes": 26,
                "housing": 21,
                "email": 19,
                "member": 18,
                "services": 17
            },
            "wordCountSummary": {
                "shelter": 14,
                "nomination": 8,
                "housing": 8,
                "motion": 7,
                "shelters": 7,
                "person": 6,
                "families": 5,
                "men": 5,
                "elections": 4,
                "officer": 4
            },
            "fullTranscript": "Is 7:14 pm I'm going to start live streaming, it bear with me Jeremy, I'm in who's that brother yeah? No! Thank you. Okay, thank you. Do you Wanna say that you're trying to get on what you can get on who's, that Joanna says she's trying to get him, but she can't get on Joanne tear a lounge, you're right, okay and she can always call in like some that's worst case scenario. Oh, let me call her back then. Okay, yeah, just me yourself. Please all right! Thanks! Thank you all right, all right! So let me Al. Do you want to begin? I guess I guess or no you want to start moment. Silence it we are recording it is. It is September. 24Th 2020 is 7:15 p.m. This is the Bronx board 11 full board meeting for September franno. You want to lead us off with a moment of silence. Are you still there Franno? Thank you Jeremy I'll start. First of all, I want to welcome everybody and hope everyone is feeling well just let's pause for one moment, among with silence for all our fallen first responders, medical military service personnel and all victims for the Covid-19 pandemic and all victims of racial unrest in the country. So let's take a minute of silence and just keep those in our silent prayer. Thank you great. Thank you both in your court. Okay, let's turn over eight to eighty she's, the chair of the Nominating committee, and we have an election on the agenda Eddie. Could you underneath yourself? Yes, we have to vote on the first vice chair, correct and I believe, Jeremy sent out a very detailed email on how we should vote and we will be able to vote at 7:30 if I'm not mistaken as soon as soon as we run through the nominations and I update the ballot based on who's nominated. Yes, I will email it out. That's the plan. I hope I hope everybody has access to their email. I could send it via chat for whoever's. Has a problem like I said privately through the chat, the function too. So do you want to take nominations from the floor baby? Yes, so we're going to open it up. I guess to anyone who either once who wants to make another nation I'd like to make a nomination, says: Joanne Rubino for a first vice chair, I'd like to nominate Yahaya, Obeyed d. You want to see if there's any other nominations before we close them. Yeah, that's fine! Are there any other and I'm actually before I do open it up yeah, I did submit a statement of interest and Jeremy did forward it to everyone about a week or so ago. But does anyone have any questions for your eye? Sometimes you do not even know who you're voting for so it's become so hard to say we're hoping for someone we do not even know. That is the reason why we requested that members write a letter of interest expressing their interest. Why they're interested? Did you get a chance to read his April? Did you hear that? No, so what I indicated was that wrote a letter and expressing interest in running for vice Chair Jeremy sent out the email about a week or so ago, and I'm asking if you have any questions for yahei based on the letter that he submitted. I can't have any question because I'm not even too sure who the person is right now you mean you do not know what he looks like or you do not know who he is. I'm not too sure I can't bring the name, I'm not too sure who the person is. So I do not know how we're voting. I do not know if everyone get it. I just I received the information for the meeting, but I'm not too sure about reading someone. You know I got the information today, but it was just last minute or do you want to go with someone else? Well, I do not know who is up. Who is you know the names I thought we would have names and everyone can make a decision who they want to vote for, but to just come tonight and be put on the spot. I do not know can't call any names: hey miss April, like I, in the Chat box within Webex, like I included, like Yahay's Bio page. If you wanted to like just glance over that to get like an idea of who, like we're nominating okay Jeremy. Is there any way you can put his picture up, so people can see who he is yeah if you click the link like it takes you to his bio and he has like a picture in his bio as well. So we can see him yeah, okay, I just needed everybody. So, let's stay muted, please and let Yah say whatever he wants. If he wants to say anything, maybe unless you got a better idea yeah do you want to just tell the board why you're interested in the price chair? Well, just like everybody else we signed up for this for community service. We all have the energy. We all want to do the right thing. We all want to serve the community and represent our communities. So here I am I've been on the board for four years. I was the ch. I've been the chair of the Public Safety committee for a couple of years. Currently the also the chair of the ethics and disciplinary committee. I love what I do. I love the community board. I think we have a very important job to do and represent in our community. That's pretty much it I'll keep it short, but if anyone has any questions, I'll take questions, ethics committee and he's very impressive, he's very thorough, very patient, and he really takes. I mean he spends a lot of time outside of our scheduled meetings with the work that he does like to make sure that he gives his all. So I second his nomination for sure. So unless anybody has questions tweet to see, if there's any other nominations from the floor, thank you so, okay, so I was saying Jeremy. I do not know I've been on this board for a while myself and when we're talking about you know just having a meeting tonight nominating a person. I do not know how it was sent out, but I always thought that you know people would be aware. That is the position available. So you know folks can prepare themselves for time as this other than just coming on a meeting and nominating someone. So I really, I really do not know. I do not know anything about what's happening here tonight. I understand his credential and everything, but we are talking about a community, so we're not just talking about a title and a position, and you know just having that we're talking about a community that we choose to serve and for too long I've been watching community boards and politicians and everybody use this I'm here and I want to serve the community but really ensure it's bigger than just a title. So for me to nominate someone, I have to know who the nominees are, so that I could make a decision. So I do not know if Aida you want to address that or anybody else does I mean I could, but I want to leave it to the board. This was talked about in June of of last year. That's when the first information came up about taking over. You know somebody stepping into Tony's spot. So it was. We were available in June talking about it in June, so that was okay, bro yeah. Well, I'm sorry! In June of last year I traveled to work. I know I do not recall. He met juno this year, June of this year or June of this year. Well, I guess during the pandemic, I assume my was probably absent, but I'm sorry that I missed it, but we could continue with the meeting. I do not choose to hold your meeting. Let's move on again Jeremy. Can we move on if there's no idea? No, it's not about just moving on it's about respect. If somebody's talking it's not about Jeremy, can we move on? If I'm not clear on something, I have every right to ask the question: would you like to know? Would you like to nominate anyone that you think are it should qualify for the position? No, because I do not know anyone right now that I could think of for the position, because for me I need to know what the position is all about. I did not know this position was available, so right now, as Fran would say, let's move on with the with the meeting, I'm not going to try to hold it up any longer. If that's the way you do things. Okay, please, okay! I was not questioning Miss Abral's statement. All I was saying is: if there's another nomination, let's put that nomination. I do I understand her concern, but let's take other nominations if they are available. Okay, thank you, know, Jeremy, just to be clear. For the last couple months we have gave a numerous amount of email collateral to keep the board. You know debrief, you know briefed on who the nominations are. So this is not something that's fairly new. It's been emailed to all of the boards for them to be aware, so darrell. If it's nothing new. I said this is my first time getting the email. Today I discuss it. I responded and if I was not aware only making myself clear so in June, I was not available during the pandemic and I'm just coming back. So if it's new to me or if I overlooked it, I apologize, but it's I'm just letting you know. I do not know who the nominees are. So, as I think says, let's move on whoever the nominees are. Let's move on with the way things are done. Okay, I guess. If there's no others aiden, do you want to close the nominations? Yes, if there are like there's clearly no other nominations. So, yes, I would like to post okay, so nominations are closed for the the elections and in this case, if there are no other nominees, I believe the bylaws and David could correct me. Allow for the nominating committee to cast a single vote for the single nominee. I do not know if anybody wants to quickly look up the bylaws. If you want me to do that or I do not think we can do that jeremy, because then we would not be able to have the ability of write- in candidates. Oh yes, I forgot about that. That's no longer valid and I forgot about that. Yeah. Okay, so we still got ta do a ballot. So in that case, I think we should just go over a roll call, one more time, at least in terms of the people who were not there before, because I saw Junior just joined, even though somebody said he was there. I just want to make sure, there's I'll, give make sure there's the opportunity for somebody to say I'm hey, I'm here people, so the person I did not hear from before was bernadette, which she said she most likely can't make the meeting Melanie Lahose, Sylvia, Mazzella and Norris. She could not. She said she could not make it any Prezioso, Keith Ramsey, Marnie, Rodriguez Oceano said he could not make it Joseph Schenzler Tony Signorelli said he could not make it. Das Gutierrez said he could not make it Joanne terrell launch any update with her. Does anybody see her name? Did she call in shadow looking at it, but I did not. I do not see her on the screen. She said she's in everybody, but I might be watching her on Facebook. I do not know how he's not getting in. I just spoke to her oh she's, watching it. I do not know if you want to consider her present. She just she's, just muted, okay. Let me look at the attendance hold on yes she's here. Thank you, I'm going to make her a panelist, so the ballots will get to send to everybody that checked off minus the people I just named that are not in the meeting last person was Linda White. He said you could not make it most likely. Okay, anything else I need, or we can move on with the meeting. Are you sending about now Jeremy? When do we get the ballots? I'm working? I just got to update it and I'm going to send it just to the people that were present. So we'll just wait for you to finish that and let's just vote, I think and get that out of the way is that okay, what's up I'm suggesting that we just wait for everyone to vote before we proceed, if that's okay, so Jeremy, to be clear, you're sending us an email with the ballad, because how am I going to do? Yes, my intention is to send is for you to check your email. That is that, okay with everybody, think that's how we did it last time, yeah anything wrong, I'm sorry to to interrupt, but I tried to get through the Keith Ramsey and he's trying to get in now. I'm just I just tried to call him. So that's what I'm doing so. I do not know 80. Do you want to include him if someone's trying to join anything, we'll wait like a few minutes? Okay, so I will we'll all right. Let me just send out the ballot bear with me. Give me a few seconds. You can actually take that long. Oh people downstairs. Yes, I just sent it so. Can you please confirm if you received it yeah, I'm confirming that I have received the email okay great. So if everybody wants, I received it. How do I- okay Jeremy? Okay, you should have got now janice, oh chicken, oh, has the god been able to join yet who was having trouble Pat Charles? Is he receiving Jeremy? Are you he may see Keith Ramsey's name. Wait there we go, do not see Keith's name. Pat Charles is Keith still trying to join in you know. I have a new crawler and I can check that person. Let me try to find out who that is, while everybody's doing their ballot, I have a caller number nine from a seven one, 718- 547 number, if you'd like to identify yourself, if you, especially if you're Keith, Ramsey that'd, be appreciated. Hi, it's Diana finch, not a member jeremy. I received and sent the valet back. Okay, Jeremy. Do you hear me yeah? He does all right. I filled it out and send it right back to you. Thank you very much. I filled out the ballot and sent it in okay and I hope everybody put in there, then their full legal name please. So I do not have to try to figure out who you are and make you stew your ballot again. Please make sure you do your full name. Put it type it in. This is a test for a mail- in ballot for the election. What's that I was joking. I said this is like a test: let's not jinx ourselves. Let's not jinx ourselves! Come on Jeremy I submit mine too trout, hey Jeremy, Joe, hey John, yeah, I'm having I'm having trouble with the ballot. Can you just put me in and I'm definitely for yahay sure I mean yeah. If we're is everybody good to move on yes or is there any other concern? Jeremy? No, I know I know so. If anybody has any problems, please let me know now. Otherwise we could try. Turning over. I do not know if the captain is here, I know the captain. I know I see Jay Sturdivant as them, so I assume he is. What do you want? You want to keep give it a little bit more time. Yeah. Can we no? Let's move on hold on speaking of the chair of the Nominating committee, she's in charge? Right now, can we can we just wait? Three more minutes, I mean we can pursue other things, but maybe in three more minutes just see if anyone else has joined, allow them to vote, and then we can close. What's checked about real quick, let me just see who I have not received so well. I have 33 responses so far. 30, did you get mine Jeremy, I'm not doing individuals. Now, let me just hold on is that Ellie Jerry did you get mine? Is that Ellie Rodriguez? Yes, I have 30 responses, but I have 33 people in the meeting. So two, if you count Joe Thompson's troubles, so I'm missing two people give me I sent the first one in without putting my name in and then I put in my name, then we're missing. Okay. So then we're really missing three people Al, it's Ken gilling I have to. I have to abstain, because I just received my vote questioning. First what'd, you say chair it's up to you. If you want abstaining, that's up to you. I forget who the candidates are Jeremy Junior received. My vote hold on. Let me finish with Ken Jr okay, so we only have one nominee Ob and I'll vote huh. What's that, what's him you're going to vote for him? Yes, okay, a junior I can go through and I can go through and see if he's voted. If that helps through who's voting. Who has not excuse me that may help that may help Jeremy yeah. Okay, just bear with me: junior okay, please everybody mute yourself. Okay, I'm almost there just bear with me. Please everybody, please Alfredo or Chris. Can you guys add anything he's not being themselves and asking to meet themselves all right? Everyone? Please mute your microphone. We do not hear others until Jeremy says so. I just got ta meet everybody trying to do it. Jeremy. I just muted everybody. Okay bear with me all right, I'm going to read off names of votes. I have Albert D'angelo Andrea Siegel Christian Amato Daisy Rodriguez David Levitt Deborah Collick Jerrell Bohan, Aydie, Schrale, Edith, Blitzer, Eliezer, Rodriguez, Lisa, Soto, Franco, Zagretta, Hazel, Miura, Janice, Walcott, Joanne, Rubino, Joe, Menta, Joe, Thompson, Junior, Campbell, Ken, Gelnick, Moshe, Fuchs, Natalie, Medina, Orles, Elkridge, Patricia, Charles, Paula, Carey, Sandra, Unger, Shraddle Purdum hold on. Let me scroll down Throw Yahoo B. Who are we missing this name? Can I hear you called Johan and you're missing abroad? So if any of those people are so test name, you just announce yourself right. Yes and I voted through the email yeah. So do it again and put your make sure you type in your name- maybe you did not type in your name, okay and then April. Are you obtaining abrasion? What's that this is Joanne I'm going to recent symphony, so I'm waiting on Joanne, Pat's name and Avril? Are you who who's that who's speaking? I just sent mine this Joanne Turner, I'm checking now what Jeremy Sandy Jeremy I'm talking to Joe Bakode. He did not get his ballad okay! Well, I emailed him. Does he just want to announce it like? I guess some of the other people that have problems. Do you there are some people all right hold on. He told you he was like. Do you want me to tell him who you're voting for? Are you voting for Ia, or do you have someone else all righty, I'm going to tell that to Jeremy did not get the ballot, but he cares to vote for Yay. I have him on the phone. Is that okay yeah hold on yeah? I mean that's. I do not see it that way. A.D you're! Okay with that right is that, okay with you I mean we can't hear him, but sure I mean I guess we're taking a representation. I mean you want he could you know you could always defend it later. Yeah I could, I would say loud. Joe hold on Ahead Joe. Tell him that you're voting for you. What's that noise, it's feedback because of his audio alrighty. I do not know, but I told him that did you were you able to talk to Jeremy all right speak louder, Joe. Maybe he could hear you over my heart, yeah Joe. I hear you hear me. I do not know, what's happened, Jeremy, but he's voting fiat all righty. Okay, joe I'm hanging up. He got your okay, so I heard him. I think I heard enough to verify that. Putting the way Sandy said so is that okay, 80. yeah? That's fine! Okay, let me go back to Jeremy. All you need is a majority. If he has more than half he's there. I can't drink this one forever. Yeah I know I can. I can 80. I can follow up with people, okay, so whoever a wrap. So I think we can just close the voting and we could just declare who is the first vice chair and we and the exact the exact results will come later with the minute I mean I mean if that's, okay with everybody, I do not see anybody. Let's see, I see two, maybe two of stems: let's see two exceptions. Okay, can you guys mute yourself because whoever is typing we can hear you typing? Okay, so I see I believe I see two extensions for yahay. Otherwise the rest are for yeah votes. Great. Thank you so much Jeremy. Thank you baby. I guess we will we'll close the elections and move to the 49 precinct. Okay, as the captain here, hey Jeremy, how you doing. Can you hear me yes perfect here? You know yes, captain the t, detective, how's everything all right. First, I just want to thank everybody, Jeremy and the board. I want to thank the the residents of the 4- 9, the community whole establishment for the support behind the fortnite priesthood. The police department we're in difficult times right now and it is very difficult to be a police officer. It's very difficult to be in law enforcement right now in this country, particularly in New York City. So I want to thank everyone for their support. I know the meeting is kind of going along already, so I will try to be somewhat brief. I just want to give a little basis a comparison put out there how the 49 precinct is doing to the rest of the city. I know a lot of people reading different things in the newspapers, so I want to put things into perspective for everyone. When we look at New, York, City or five borough as a whole. Theater date, we see a large increase in violent crimes, particularly when I talk about violent crimes, I'm talking so for the city, all five boroughs for the year we're seeing an increase in homicides of 37 percent. That's 327 homicides versus 236. From last year. That's almost 100 extra victims shootings were up 94 percent that was 100 increase in shootings for the city 1123 first 580 from last year. Now we drill down a little smaller. When we look at the Bronx as a whole, the Bronx is is experiencing the same trend. The rest is, the city is following: basically there up, there's a huge increase in violent crimes in the Bronx as a whole. Homicides are up, 16 shootings are up 80 percent. When we look at the 409, we see a little different trend. Our violent crimes are even our homicides are, shooting are basically even from last year. So that's a good thing: we're not seeing an increase in our violent crimes. However, what we are seeing an increase in is our property crimes, we're seeing a major increase in our burglaries, particularly to commercial establishments, we're up 36 percent, that's 129 versus 95, that's almost 35 more burglaries than last year, and our grand Larceny of autos is up drastically 131,125 versus 54., huge jump in our grand larceny or basically stolen cars. In the last four weeks, we're seeing two major trends in crime trends. In the four nine precinct, the first one we have a male black, approximately 20 years old, doing gunpoint robberies during the daytime. Basically, this male he's following victims from different banks on white plains, white plains and pound parkway south there's a couple different banks over there he's waiting for people to go in and use the atm and then he's following them. A couple blocks away: displaying a firearm and basically telling demanding the money that they just took from the atm last week. Last Monday, actually one of the victims of the robbery fought back and the the firearm went off accidentally and the victim was struck one time in the leg again horrible tragedy, but the Good News is. We did identify this individual, the perpetrator. We had deed him on four of the five incidents and I'm happy to say that he will be arrested shortly. We are tracking his whereabouts and hopefully we can bring him to justice soon. These discuss with everyone is we're having a huge jump in Locker break- ins at gyms. So, as everybody knows, September 2nd our gyms opened up in the five boroughs and basically, a week later, we've seen a huge jump in Gym Locker Break- ins. Basically, what is that you go into the gym? You go into the locker room, you put your lock on one of these lockers. You leave your belongings in there and someone comes in and basically clips. The lock breaks the lock and walks off with your credit cards and one instance. They walked off with a car keys and stole the car out of the parking lot good news with that. We do have a up an individual who's, probably good for a person of interest and we're working on bringing him to justice as well, but just for everyone out there. If you're going to the gym, make sure you use a a secure, lock. One of the pro I just wanted to talk about briefly one of the programs NYPD has started up a few months ago, I'm not sure too many people familiar with it. I know everyone's familiar with the NCO program. The NYPD created another program called the Yco program. It basically stands for youth coordinator offices and that it basically mirrors the NCO program. I'm not sure everybody's aware, but the four nine preaching is broken down into three separate sectors or three separate divisions. We have three ycos, that's one! Youth officer for each one of those sectors, so what does the Yco do? What's their function, basically with the yco they they're, focusing on individuals, youths who are less than 18 years old. So that's people who are our youth that are 17 and under and basically we're doing three things. Our yseals are doing three things: we're monitoring we're monitoring, at- risk youths right. So, what's an at- risk, youth, an at- risk youth is a juvenile someone. Less than 18 who've been locked up, been arrested for a violent crime or may have been arrested for any types of crime. So what we're doing is we we're going to visit them? We're trying to get them proper services and kind of you know trying to get them on the right path. The second thing that we do is we're following up with youth victims, a lot of times our youth are victims of crimes, bullying, robberies things of that nature and we're following up with these victims of the youth crimes, again trying to get them services trying to go talk to them. Enroll them in programs try to help them out, and the last component of the Yco program is basically programs for our youth. We have the explorer program over at the priesthood. However, at the beginning of the summer we started another program, a basketball tournament. We basically have these probably about 15 kids arranging an age. They play basketball. We set up a a tournament with the other precincts every Tuesday night, we're going up to the east chester houses using the canadian up there. You know, get kids off the streets and get them more involved with with the police and get them more involved with each other. If you look at some of the things we've done over the summer, we've taken kids to the Bronx zoo, we took them upstate to Tannersville New York, to go sightseeing to go hiking and we even took some time in October we're taking them out the great adventure to do a you know. I think they have a haunted house up there. So again, it's a great program. If anyone on the board or anyone in the community wants to you know, coordinate with us to do stuff donations or anything on the the NYPD 49 precinct website, also just put out there any questions you know you can always monitor. Please monitor us on social media. We have a twitter account. We have facebook, we try to keep everything current and if you have any questions, please well Jeremy I'll turn it over to you. If you want to yeah, I was informed you have to leave at eight o'clock. If that's true, we should probably let you go. Should we make an axe? One question well hold on captain: do you have to leave? You got two minutes. I mean yeah he's been on the call since seven o'clock just right now, okay, he said two minutes. It's going to ask a question: jeremy! Okay! I thank you so much for that. I was waiting to hear that kind of information. I'm very excited about it. One of the things that I do. I host a talk, show for the last 19 years very much involved in the community with the youths, and I put together something similar to that. So if I can get in touch with Jay or anyone- and you spoke about the nation, my foundation every year raise money to help you it's in the community back to school events, so whatever I can do, please reach out to Jeremy and Jeremy can give you my information or Jay, and we can speak more about this. I thank you so much for doing something this magnificent and if it's the first present, I applaud you for doing so. All right. We look forward to working together with you. Thank you. So much can I just say something real, quick, one less than one minute, probably: okay, there's a quality of life issue, that's going on all over women in part of tent, where they have these large. These events that go on sometimes they start at 2, am and go on till. Whenever and one time it was 11:00 to 6 A.M. They have the lines of cars with these giant speakers and they hear you can hear them for maybe miles. I do not know miles around, I do not. We do not have an address, but they seem to be popping up free like who? Can I you know? Who can I contact at three in the morning? You know that's yeah and the thing is we do not have a dress, because there was once a group spotted on Allerton going for several blocks and it was like a line of cars with the giant speaker. So it's happening here. It's happening in Van Ness and I do not know a lot of people have been complaining to me about it. I brought it up before our public safety chair. We had a conversation about it, it's just very difficult. They wanted to make you aware of it and maybe there's something we could do about it. I do not know, are they now? Are they? Are they mobile? Are they like? Are they? I believe? Yes, I believe that parking only accidentally, somebody saw them at 4. Am they were walking their dog and they actually saw a bunch of cars? They saying this is what it is and they heard you could hear them from. Oh from Pelham gardens all the way to cough city, and it was insane, but that's just one incident, but it's happening in other. You know in other communities like Van ness as well. Okay, I would urge you to call 311. Okay, obviously 3- 1- 1 has can be a little bit of delayed response, because you know we prioritize emergencies. First 9- 1-, 1 calls, and at that time of night we do have less resources to go to sure. If this group is out there if they're, if this group is out there and they're being loud obnoxious disorderly, then you then call 9-, 1- 1 and say that it's disorderly doing what they're doing and we can get a quicker response. Even if there's no address that's the problem, I mean I could use my address. They could hear it, but you know, even if you give a like in the vicinity, you know if you say, Holland Avenue, you know and the cops get they do not see anything and it's disorderly group noise, hopefully they'll, be able to hear and take some kind of okay thanks, very much to move, break them up and take enforcement. Thank you, okay. I think we should move on all right. So thank you very much. First. I want to thank the Nominating committee for their work. They did a stellar job. Thank you guys for your work and the time and effort you put into this the executive board as soon as now that we have a new first vice chair, we'll be having our leadership meetings again. We're going to have an executive board meeting later on next week to discuss a proposed bylaw change about the equity, Comm Police Committee, to discuss that and see. If that is something that we we can use on our board, that's it Jeremy on you. Let's see a treasures report bronco, the treasurer's report was emailed out to you as noted in the email. It's a preliminary report. There are a couple answers or increases that we did not get answers on, but once I do receive those answers, I'll be sending out a finalized one to Jeremy and he'll, distribute it to email, okay, Secretary's report: Hazel: are you still there? June minutes were, I think, uploaded finally to the website and I'm not I'm not sure what the procedure is. Remember I'm new at this. So there's a motion so motion. What we always do is a motion to approve the gym. Okay, can we have a motion to approve June's minutes? What's up yeah if you're comfortable making the motion somebody could just second it? Oh okay, all right, a second in Germany, okay, so Hazel made a motion, approve the June 2020 full board meeting and it's as distributed seconded by Shraddle. Any discussion. There's no discussion on favor. Let me do this is: are there any against or any abstentions? No? Okay. Just so thank you Hazel unless there's anything else, district managers report. So I just got an email from the city that it was finally uploaded. You know this highlights a good reason. Why last minute changes are not an easy thing to do. I know a member of the public want to know why they had to sign up to speak in the gallery as early as may as Monday, because it's the I this city. Let me put my video on bear with me and show my beautiful mug. I can figure it out yeah there we go so my district's man Jeremy you do not have enough. Okay! Is that better? Yes, okay, sorry I wanna at least you saw me so disadvantage of support upload to the September minutes website again. This is a good reason. Why please mute yourself you're, not talking to hear somebody typing. Please everybody mute yourself if you're not talking, please. I do not know how many times I have to say that September district managers report is finally online. I did the email to the board. I I'm sorry I'm. I need to mute everybody, because somebody keeps typing and stay muted. Please I muted everybody. Hopefully, you can also hear me thumbs up if you can still hear me. Thank you, okay. So it's your manager's report online June, I'm still having done that. It's trust me. It's still on my mind. It's I still had it somewhere: price gouging dispositions. There are four businesses that got price gouging violations and fines either a default fine settlement. Fine, they got fines for businesses for price gouging in relation to Covid-19 like hand, Sanitizer Gloves, Mass office, 311 policy. So it is, there's always been the policy of the CB11 office that constituents must call 301. We used to make exceptions for board members. We would do it for them in many cases. We do not do that anymore, but discussions have discussed this with Al. If something requires you to call 3- 1- 1, I need you to do it first before contacting the office, we have. We have a lot of people. We assist I'm not trying to push off work. I have. I will. I have more work that will last me well beyond my death. So three one policy: everybody must do it race relations, so some people think I bring up race relations just to cause trouble. No, I do not if you, if you saw my announcement emails over the summer, I four board members. I asked you know what how do they feel about certain things being african- American and I wrote those responses. I am asking the police, the police law enforcement officials, the same thing. Do you feel safe in this country, because I'm sure many of them do not right. I think the other day two cops got shot in Louisville, so race relations, it's something we need to talk about. I think in many ways it's about communication getting out of this hole, we're in solar energy systems. Some of you know I purchased the solar energy system for my own house last year and I encourage other people to do it. There was a news article I saw this morning on social media about the warming of the earth. This is part of that strategy. It's a long! It's a long- term investment it! It's a short- term investment. It helps you save money. If you can do it, if you're a homeowner, not everybody can do it. You got to be a property owner. Homeowner, discarded dog had somebody that threw their dog possibly alive in the garbage can by the community board at 11 office police were investigating. I do not know if they conclude their investigation did not. It did not seem much too. Hopeful did not seem like they could do much, but it's illegal to do discard of a dead animal in a corner trash can a public trash. Can you can describe an animal such as a dog in your household trash, but there's a proper way to do it: transparency, CB11 website? Sometimes people like to complain about like transparency here they have to a degree, but I highly encourage any critic to look at other community board websites. Please I highly I mean we're, not perfect, but we try. You know Chris. I make Chris make the stupidest minute changes to our website, because I want to be perfect new interns. I sent out an email that we have new two new interns. Well, we only have one currently so that new intern will be two days a week, thursdays and wednesdays. So if you get a phone call from an intern, do not take offense. It's not me speaking to you. We, I can't do everything by myself parliamentary parliamentarians of New, York Workshop. They had a couple recommendations. All committees on their agenda should now put the review of the last meetings. Minutes it's a good way. To recap: that's this is a recommendation for the parliamentarians of New York. You do not have. I think it might be a Robert rules of war, which is what we should be following. If our bylaws do not explicitly state something, we can talk more about that anybody wants to committee chairs when we do your agendas, Blonde Avenue, Homeless Shelter. This is not my dm report because it's not much to discuss it's just really to. There was a news article that told everybody that there was a second homeless shelter going on Blondell Ave. No there's only one there's still only one proposal, there's a motion on the on the agenda regarding the original proposal and then I think, Al said we're having an executive board meeting. I and that's nothing really from my dm report. It's just I plan on going to that meeting, because I want to talk about some personal issues that have come up over the summer. Okay, unless anybody else needs to hear more from me, please do not, let's save it, for offline and move over to committee reports, the motions we have to vote on. Obviously it's a long meeting already David Levitt. Are you there goodbye I'm here? Do you mind taking over sure, so the violence committee met in last month and we considered three changes that were proposed at the June meeting. They are to rename the nominating committee to the nomination nominating an elections committee to require board officer candidates to provide a written or oral statement to the community board at least 72 hours prior to each election, stating why they are seeking the position and third to allow nominees for board officer positions to accept the nomination in writing within 10 working days of the nomination or in person at the April or May meeting. I will make one I'll attempt to make one motion to make all those changes and then open it for discussion or questions. So I make a motion to amend the bylaws for those changes. Are there any questions about the proposed changes? David? Yes, Sandria. I would like you to put number three as a separate motion. Please, okay, fair enough, so I will amend the motion so that the first motion will be to rename the nominated committee to nomination and elections and also included in that motion. Is that each board officer candidate, who has to provide a written or oral statement at least 72 hours prior to each election? Is there any other discussion on making those changes? If not, then I will ask: is anybody abstaining or voting against those changes? If anybody is not abstaining and not voting against those first two changes, then we will consider the vote to be unanimous, that everybody is supporting those two changes last chance if anybody wants to abstain or to vote against okay. So that brings us to the third change, which is to allow nominees for board officer position to accept the nomination in writing within 10 working days of the nomination or in person at the April or may meeting just to give a two sentence. Background on this was a change back to our original policy. We've had this policy where you could accept in writing or in person, and then we changed it so that you could only accept in writing. So now we're changing it back so to give to a more liberal interpretation so that people have more of an opportunity to accept the nomination, either in writing or in person. Is there any discussion or questions about that motion? Andrew, Andre, yeah, okay, I would like it to just be. You have to be in person because I feel, if you're nominated for a position, you should be there to accept the nomination, because if you can't attend the meeting to when they're nominating, then how are we to know that you're going to attend other meetings, so you should. I feel that the person being nominated should be at the meetings to it to accept. Not putting in writing is not acceptable to me. Okay, does anybody else feel strongly about that? That's part of the discussion or we'll see if that, if that carries the day on the vote, Andrea does anybody else hurt on this I'd like to say something it's Joanne Rubino? I do not think I think in person does not take into account special circumstances. Like personally I was with my family member in the hospital and ran back like a lunatic to come to the meeting, and it was such a hardship and I think another nominee had another similar issue, so it was it was. It was because of that. I think that you know there might be special circumstances and you know that was pretty awful, so I just wanted to make that statement yeah and I kind of agree with Joanne with that one. I'm not sure what the emphasis is to have making sure someone has to be there in person. If they have personal issues coming up, why should I disqualify them from being nominated? I'm not sure what the emphasis is to have someone there in person oral. I feel that if you're not there at a meeting- and you have personal issues- then who's to say you're not going to have personal issues for the other meetings, you can't make that assumption. That's not fair! You can't make that assumption. Well, my opinion Jeremy or David. Can I say something I guess yeah. I think I think then it turn it becomes up to the individual like for. If you think that person's not there but his opponent, is there then vote for the opponent if you feel like he's not there, but we should not require it so Joanne when Joanne said it was definitely two people. Last year we had Joanne and another person, both meetings, April and may they could not be there physically for beyond their control. Two people also, I want to just add one thing in regards to Andrea's concern. Our board usually publishes attendance of people right, and so, if there's like a circumstance that does not allow someone to attend a particular meeting, I mean we were in the middle of a pandemic this year, so those are very legitimate excuses or whatever is going on in a person's life. If you have a concern about their track record, it is public and we know who come and does not come, and so I do not think that one meeting should determine you know, should disqualify a person from being nominated. I think we should just you know, keep in mind that these records are public and that we can refer to them. If that's a concern of ours agreed. I agree. I do not think we should hang on too hard on the verbiage. I think we should accept it. The way it is- and you know go from there in my honest opinion- is there any other discussion on this? If not, then I will call for a vote and I will ask: is anybody abstaining from the vote? No obstacles? Is anybody voting against this motion, so your motion has not changed right, David, it's the same promotion, it's officer positions to accept the nomination in writing within 10 working days of the nomination or in person at the April or may full board meeting. So is anybody voting against this motion? Andrea? I have a question David. This is Joe Mente. Is it possible and maybe the questions for Jeremy that we can post the this actual motion on this call? So we can all read it it's on the yeah, I'm just saying: if we could share it here Jeremy, can you share the link to the agenda into the Chat box? Okay, I can. I can copy it into the Chat box. I think. Well, we see it now and David do you have to state March or may in there? If we have a situation like Covid-19, where it might be September, it's a good point. It's like this reason is written. The reason it's written. That way is because our elections are in. Can you mute not speaking, it's very difficult to I'm going to mute. Everybody give me embarrassment. Oh hey, go ahead, David I'll, mute yourself. So the reason it's written that way is because our elections are held in June and we had this discussion. You know in last May or June. I think it was April may and June that we had this discussion, whether or not we could change the elections to a different month and we really can't because the bylaws have it locked in there so to allow people to accept in earlier months, really or later months does not really work out, because the elections are fixed in June, which is one thing exactly so that that's why it's written that way, so it does say or in person it says either in writing within 10 days or in person. So you have the option yes correct. So then, that should just put to rest the issue of being in person. I would think so. Yes, yeah okay. So let's get back to the voting, as I understand it, nobody's abstaining so the next. The next category is anybody voting against this motion. Andrea? Are you voting against it? Andrea? No, I'm not okay! So then, unless anybody objects now we're going to mark this down as being unanimous that everybody is voting in favor of this motion nobody's voting against it, but are they abstaining? Oh I asked if anybody was abstaining and there were no abstentions. I do not ask you, I'm sorry, but I'll answer again. Is anybody? Is anybody abstaining from the vote? Excuse me, I'm sorry. Can you just hold on for a second, because Debbie just wrote on the chat box that she's not able to vote because she's, muted she's right if she's abstaining or against? Oh okay? I just asked and I'm waiting for a response. I mean we can always ch if she said she's, abstaining or against, then we can change that later. But until then I would say especially unanimous just to move on I'll. Just give one: does anybody want to vote against this motion or to abstain hearing none will mark it down as unanimous. If anybody has any issues that they were not able to vote because they could not unmute themselves, then they should let Jeremy know and will adjust the vote accordingly. That concludes the report of the Bylaws Committee. Thank you. Thank you. Okay ethics and disciplinary committee. Yeah, hey obedient, you do have yeah, we do have a motion, but we would have to move it into executive session so where we have the discussion and executive session, do you want to skip me and then we'll come back later? Well, so you want to move the your motion. Let me share the screen for people who do not have the agenda yeah. Can you explain that I mean? Can you what does what does this motion mean motion to require New, York, C learning and development, diversity, training for a community board 11 member? Is this one person? Is it one particular person yes and that's why we would have to have that discussion in the executive session I mean I can. I can give you. I can give you the no it's okay understood it's: okay, yeah I'll, discuss the other thing, which is the complaint form we did have some concerns about the complaint form that it was. It did not have enough details or did not have the process or the procedures for filing a complaint. I'm working with Jeremy to get that updated, I'm not sure he's, probably in the final stages of updating that we were. We called it. He did not call the motion to amend the form, but then we figured it did not require a motion to change the form that we can just change it. So we're just going to do the edits. I have a question in regards to requiring, like the diversity training for like the one community board member. Is this something that can be open for, like all of us, like as a community board? Just so it's like something that's covered for everyone. So it's not like a individual type of issue. Yeah we would have to. I can explain that in the executive session, okay, cool, great jeremy, why do not we just move that to the end? No, let's not because I'm not 11 o'clock at night. Well, then, you have to send everybody away and all the people that are on Standby that have to wait. I hear you with that. One do not stay. Let them wait, we're here to serve the public. That's how I look we're all in the comfort of our homes. We have nowhere to go to. Can you yes, Christian I've been I've been working from eight this morning I have a show, that's going to last till 11 tonight and I've been on this hole from 6 30., so you can't say we have no way to go because we're in a comfortable home, because I'm very tired right now, all right that that's you and that's fine on a case- by- case exception. I think that's okay, but I do not see the need to off- board the members of the community who are in this meeting now when the rest of us can stick around till the end and have this discussion you and your prior commitments you know. Notwithstanding I respect you. I respect that. It's okay, why do not we take some time and move this meeting along a little quicker and maybe we can get everything in and people can go to sleep on mute if you're trying to say something Jeremy, you're, muted, we have not heard you in a couple of minutes. You had to go to the bathroom how about taking away the okay? Now we came back, you know, I'd like to just say something to Christian. There are people that probably have not eaten dinner. There are people that came right from work. So, yes, we might be in our home, but it's really wrong to always assume that they can stay there. Maybe they have to eat, maybe it's necessity. So I it's unfair. So comment is noted for the meeting. Okay. So to stop the back and forth. Can you ever hear me? Yes, all right, I'm going to move off the agenda and until somebody makes a motion we got other motions to vote on, for example, health and social services, which I think is your committee Sandy. I think, because Joe I mean I can I can I can have Joe or do you want to do it sandy really up to you? No, we just had the meeting with the various people right about the shelter and whatever yeah. So do you want me to turn it over to Joe or do you want to do it get over? It turn it over to Joe. Can you talk Yo Baco Chris, which Joe Baker? Is he four or five? I thought he was four. I thought so too, and I muted him. So I do not know. What's going on there he's four sandy or Chris number four, yes, Chris! Yes, he's number four all right sandy he's not answering! I need you to take over all righty. Well, there was special meetings in August we met with some politicians and whatever to discuss the homeless, shelter and we're just waiting. We really did not come to any conclusion because we did not get any answers. Really am I correct Jeremy so well, we made a motion to send written correspondence to the city and others, like our elected officials, can share. What's that I said, was it done? Well, the board did not vote on it. So I mean that's what we have to do then yeah, that's the motion for tonight. So I can share my screen for people who can't look at the agenda. Hopefully there won't be as hopefully something zone goes haywire with life all right, but the idea is we have we met and you know that it with this shelter, that's supposedly going to come to Blondell Ave Avenue. We've made several suggestions that and you could see them from senior housing, a combination of senior citizen and affordable housing, affordable housing or a shelter for homeless families, not a shelter for men only. So this is voted on committee. I was going to take the motion sandy, so we can vote on it and move on. I am I'm saying I would like to make a motion that community board 11, along with community board 10, send letters and give our recommendations for the homework. We are not in favor of a men's homeless, shelter, and these are the three ideas that we would like to see happen high second, so you do not have to. Second, I was voted on committee. It's open for discussion. Is there anyone who disagrees with what we're saying? I have a question: why are we opposed to it? Well, we did not first of all of where it's situated there was not it also near a school not far from a school. We would drive it not that we would rather have senior housing or a combination of senior or affordable or if we have to have a homeless shelter that it be for families not for just homeless men and this when conjunction with Community Board 10, because the area literally is in both districts or near both districts. Well, I still question: if a homeless shelter is being proposed for our community that currently houses zero, why is like, if you have a if the committee had an opposition to it being a men's? Only? Why is it the priority for a family, homeless, shelter number four versus number one, because I mean homelessness- is a real, serious issue right now and with the pandemic, it has been exacerbated. So I just do not think I do not personally oppose to one being located in our community and also you know our community playing its part jeremy. What is the statistic of homeless, homeless, shelters, slash dwelling slash homes in Community, Board 11., supposedly they removed all of ours, say again, supposedly they removed all of ours. Now this is so, let's be clear on come on. I have to have noise okay, so so this is department of homeless services. This is not hra, which does AIDS patients or does domestic violence, people that you know, because those people become homeless too or find themselves in homelessness situations. This is just purely homeless, maybe because the person has maybe mental illness or there's no specified reason like domestic violence. Supposedly, the city has removed all of ours. We have no private dwelling ones, they could. There could be plenty of programs through the State Department of Health through again the city human Resources administration, which does AIDS shelters for AIDS patients and and domestic violence victims. This is just purely department, homeless services. I actually took a continuing legal education on that like recently and they converted, I forget how many hotels and to almost like transient, homeless, shelters- and I do not know if you guys are familiar, but those areas are have been negatively affected. So I do not know. I mean it's worth, I guess going to areas where homeless shelters. Ferment only do you exist. There's one open near my high school a few years ago and in their own, like Married Avenue area and everyone as opposed, was opposed to it and people moved out. So any other discussion, yeah Jeremy, you know I mean I just want a counter to say that a lot of the areas that have pre- existing shelters, for example, like Community, Board, six and seven, have quite a lot of homeless. Shelters in that area and you've noticed a lot of issues with economic disparity. You know problems for small businesses issues when it comes to just quality of life and safety in those communities, and I do not think that it's our responsibility as a community board to ignore those demands- and you know further- hurt an area- that's already overwhelmed by shelters, we've known for quite a few years that the mayor had a plan to put a shelter in CB11. We knew for quite a few years that there was a zoning issue with Blondell Ave commons, and you know. I think that at this point this there's not much. We can do we're going to have to at some point accept the shelter and I agree with Natalie. The exacerbating effects of the pandemic have forced us to sort of adapt to this environment, and I just want to put that on the record. Okay, so the only thing unless there's anyone else, I would say yeah help. I would it would be helpful to just you can clearly state what we're against. I think that would be helpful for whatever I do send so other than that. Let's vote hey Jeremy, where exactly on London Avenue, yes, yeah, you're! Really you're really coming in badly. But yes, I heard you. Yes, it's 13 forward, 136 1400 block. I forget what the Cross Street is, but you know it's between. It's, like almost in the middle of the block between Westchester, Avenue and chester. Think, okay, think any other questions. Discussion corresponds to the city of New, York or elected officials, and Committee Board 10, asking for the proposed and only homeless, shelter on Blonde Avenue be instead converted to number one senior housing, accommodation for housing. Number: three: a homeless couple: anybody again that who was the other person. I was saying it's not something I could vote on right now because it just seems a little biased to me. I do not know I'm against so Christian, Darrell and Natalie are against and then two abstentions, one from junior one from April. I also obtained from it Paula Quirky. So that's all right. So three extensions, two against the three again Jeremy. Are you against it too against right here? Let think we need roll call, make it easier. It's just easier versus trying to. Is that? Okay with everybody? Yes, okay by last name, starting with a lj, you see she's still in immediate yeah. Can you just repeat what exactly we're voting on because everyone's cutting in and out so it did not really understand. I'm sharing my screen still right. Yes, okay motion is to send to the city of New York elected officials and Committee Board 10, asking for the proposed men only homeless, shelter on blind avenue, be instead converted to senior citizen housing, combination of senior citizen and affordable housing, affordable or a homeless shelter with the families, so basically no men's shelter. One of these four things instead is that clear enough for everybody. Can? Yes, everybody stop typing who's. Talking that clear test name. I agree. Okay, I'm just going to use this elections ballot thing that I was doing name for the motion against or abstain, Jeremy, quick question for you, yeah. Okay, if I, if I want it the letter to be written a different way, well just abstain from it, because if to me, if you move homeless, shelter for families to number one, I like that better. But oral, can I talk? Jeremy, okay, it was just listed the the way it's listed or the order can be changed and all you made a good point. Yes, you could put homeless shelters for families as number one we just you know they were just rattling off and that's how it came out. So then them the numbers can be changed or the order can be changed. Okay, thanks or a combination of all the other thing is or a combination of you know the order you could, you could combine, say: affordable housing with some homeless shelters for families, so that could be done. Also, no, you can't you do not think so. Jeremy can this is Chris. Can you also mention it that this shelter or whatever you guys, are proposing it's exactly one block away from water's place that we're already having already having a lot of issues over there, especially with the dunk clinic? So if you put a combination of everything, then that's going to be a war zone and should everybody know excuse me, everybody should know that the people that live around there that there are houses over there, private houses are completely against it and also all the merchants that are in westchester square are against them. So the only thing that's where the motion was brought up this way given prior to senior citizen housing due to the fact that we do not have that in our entire in our district, and that's why I was private rise from one to four. But it's up to you guys. Can I say something generally. I said yeah yeah, because I have to leave pretty soon, but I was saying that someone said that there's a methadone clinic over there and to put up all men, shelter there with a methadone clinic, it's going to be bad. What we want to put seniors there to with the methadone clinic there, so I'm a little confused, because are we going against it because it's all men, because we can not judge people today, because all these noise we're hearing half of these people do not live in our community but they're still in our community. So is it where you put the homeless shelter or where the people going to hang out eventually, so, if you put it downtown, they come to the Bronx and homelessness is homelessness and if they have a need for men for men's shelter, I really do not understand the fight, and I I'm not against anything. I just need to understand things more before I make decisions yeah. Well, I have a I work for the city, so I survey, shelters and I've surveyed families, shelters that are just for women, shelters that are for families and shelters that are for all men and there's a big difference. Can you explain the difference? That's great yeah. We can't agree with the differences, since you actually are the only one here who can actually yeah like yeah there's a men's shelter in, and I think it's near it's in the Bronx. I forget what area it's in. It's just that. It's just that it's it take there's a lot of you know. I do not want to get political about this thing, but there's a lot of mental health issues that need to be addressed with male shelters, and I do not think that the city really puts enough effort into addressing those issues with male issues. With that happen, I mean there's a lot of abuse, there's a lot of violence. This happens because you're talking about male with testosterone right yeah, so there is an issue with you know. I have to say with male homelessness and a lot of it has to do to me. When I see it is they need a lot of mental health and to me, families usually are Muslims who have been kicked out, can't afford rent and they're with their children and they'll be trying to make ends meet, and so they have a different mindset. When I see them and they tend to want to try to because I have a family and even the male who are married- they do not. They do not have a job. They're they're, not here, legally there's a lot of issues that are going on there, but the emphasis is try to keep the family together and try to really make ends meet and you see the difference in there and then you have families that their mothers who they do not have the same male and female they're, just naturally different. I mean they're, just naturally different. You know so you know I grew up in the Bronx. I was part of gangs growing up, so I know the difference between males attitudes and female attitudes. It's just a way life is, and I think that the government in New York City really have more addressing mental health issues with men, especially males, I think so. When I survey these buildings, I see a difference and I think that once you get more counseling done and see the ones that are really effective. Have a lot of counseling have a lot of things to help males because any you know even issues with adhd attention deficits. You know hypertension issues that happen, and these are the kind of things that really need to be addressed. So I do not know. I have to see what type of shelter is Shelter. This is going to happen. What kind of resources they have for the the males that are going there if they have resources so- and I know the ones that do not tend not to do very well, they do not. They do not do very well. Thank you so much for trying to figure stuff out. Yes and, like I said I'm here, so I'm going to leave. I thank you so much for you know being a little player and that's why I say I can not vote against something that I'm not clear about. I can not do that because I understand exactly what old was saying: it's a big problem for me that I'm dealing with in the community that I see need to be addressed. So, if the men, if they have a need for a home, a male homeless shelter, then maybe we need to look into it more before we say no, do not bring it here, because you have to understand, as he say, what's going on with mental illness and look at the streets that we're living in and watch what's going on with the male. It is sad and for me to even speak about it. Right now is very emotional jeremy may have to leave. I have a show, starting in less than 10 minutes all right. Thank you. Thank you. So much one of the things that I want to bring up. One of the things I want to bring up is a number about. Two years ago, we were warned that we were going to get homeless shelters in the community, which is not a bad thing. Mark Jonathan told us to find an area that would be conducive to a homeless shelter that would would not impact the community to it, be detrimental to areas of the community where schools were available, and things like that we did not do our homework. The people of that area did not want a, I think. First, was low- cost housing. They wanted us to fight against the low- cost housing. They did not want it in their community and at that time I believe Mark told us that you know if you do not get a little. If you do not put into low- cost housing you're going to end up with a homeless shelter. Here, he did give us the opportunity to look around the community and find a place where homeless, shelter would be, in other words, that there would be infrastructure that would be able to handle a group of homeless people coming into the community. As oral pointed out, you need, you know, mental health care, you need schools, you need transportation, all these things and I guess we did not do our homework because we should have found something that was. It would have all these things come into play so that these people could be helped Hazel's been wanting to say something: hazel yeah. Thank you very much. First of all, we do have senior housing in this community. Beth Abraham has a couple of 202 senior housing buildings around where I live. We do have a nightclub building on Boston Road, so we do have senior housing and you know a lot of people have been out of work since March and even though there is a moratorium on evictions right now, it's set to expire on October 1st, because it's not extended, so we are going to have a big problem with homelessness. That being said, you know we do have affordable housing being built in this in this community. In case you do not know this one was built right next door to my building and another one's going, acrosss the street and probably another one on Bronx park. East, oh and affordable housing really is not affordable anyway, so we are going to have people that are going to be losing their apartments because they have been out of work. They have no resources out there for them and we are going to have a lot of families that are going to be facing eviction. So we do have to have a shelter. You know it's being rammed down everybody's throat, whether we like it or not. I do not think the senior housing is going to work because we already have that, and I really truly feel that homeless. Shelter for families is something that we can look into, or at least accept, because we're going to have to anyway. A lot of a lot of families from our community are going to be facing eviction, and it would be great if they could at least find a plane within their community that they can live in until they can get back to back on their feet. You see you see it in the news now is you can watch your news and you see people families being pulled out of their apartments with their kids and all their belongings and told to leave, because it's going to happen sooner or later, it's going to happen so on Charles, okay, as far as Aura was saying, with the mental health. As a matter of fact, right now, I've been helping several men in Manhattan and Harlem and Queens, and it's horrible how men are being taken advantage of, because if they do not have an advocate which I'm advocating and I'm not getting paid to do it, but I'm doing it anyway. It's a sin. How people are going through all these issues with their apartments, with these landlords, with just getting the appropriate size apartment that they put their they they're supposed to be getting, and then they do the flip- flop and they give it to somebody else who they claim that they want to give it to, because a single man that has nothing to do with him not being able to get a one- bedroom apartment that he should be getting to accommodate his needs. So even if they're going to be having some mental, you know issues or some type of building that is going to accommodate these men, these homeless, men or men period or even women, because they're out there. I got assaulted by one and this and it's a sin that they're out there and they're allowing them to be out there and do this. So we need to do something and we need to be in there to make sure that the services are being rendered to what they're supposed to be servicing these people for and with that's. The main thing is to get them to make sure these people that are doing their job they're supposed to be assisting them and doing what they're supposed to do and they're not doing that. So that's what needs to be put in place as well. So let me let me throw something in. I do not want to throw a monkey wrench into all this, but I want you to be prepared for the come back from the city, so the city will say well we're putting in a full service homeless, shelter here where we will have medical and other. We will have services provided on site that are not only just for the homeless but for they're open to the community. That's what they're proposing here! That's the type of shelter that is operating on Jerome Avenue, so I do not know if oral anybody else would want to respond to that, but they are looking to be a full service site. I thought that when we were having the meeting the health meeting, it was medical services were going to be supplied, but not necessarily is very bad. At providing those services, they will put it in a wonderful beautiful proposal and then nothing happens. So it's like we're at the mercy of something that won't be done. You know that the basically the you know we done. We know it because of the history of all the homeless shelters that these poor men are not getting. Services and pat Charles is giving her. You know she's volunteering and all this stuff, because there's a need- and it's really sad and then that's all. I have to say that it's really the city does not do a good job joanne. If I may intercede remember, this was supposed to be set up, the building was going to be created by a company or another group, and they were going to have this medical center, which was or clinic that was supposed to serve these men and also serve the community. But you could say whatever you want, but it's not. You know they're not going to do what they say, because the reports of what they've done in the past have not lived up to what they said. They were going to do Jarvis information on the property they're going by the statistics of downtown Manhattan, where they have different services down there to comparing to where we are up here and not getting those type of services they can't. They can't I'm not saying they can't, but it's going to be hard for them to have the same success rate of what they have in Manhattan, where they have different situations going on compared to what we have up here. You should see third Avenue Lexington avenue and Harlem. It's a wreck down there. So if it comes up here, it's going to be even worse than that. Yeah right, that's what I was saying. Jeremy depends: I mean the ones that get the services work like I said before, if you do not get, it gets very difficult right, but so what? If I may say so, they said or in the report that they were going to have these services available and if I'm not mistaken, it was supposed to be 24 7.. This will be a sticking point for us, whether you're the shelter against it. I think everybody can agree that we want to make sure that these people, if they come to the you know the homeless population comes to this area. We want the city to you know at this point. Did you ever hear me Jeremy? Maybe we should put in that they would have to be responsible if there is a shelter for the medical part of it also. Well I mean you can't put stipulations in a letter like yeah. We have the potion, let's vote on the motion and move on and then we'll work on whatever, but the city's going to do what they want anyway. So as much talk as we do now, they're going to create what they want, that's the way it's going to be all right. So hopefully everyone can see green, so we're doing roll call. Then we need the motion again. Are we clear on the motion at this point? The motion is to propose something else of the men's. Only homeless, shelter, oh well, it does not matter does not it. I mean for some people. It does not matter some people does it does not matter? Okay, so are you in favor of trying to get something other than men's homeless? Shelter? Yes, you're for it against abstain, tough name? Yes, Christian, I'm looking at you either you're cutting in and out it's hard to hear you, but I'm against my wife, my Wi- fi stocks, and I I'm I heard people are tired of hearing that it's okay, I'm a guest. Okay, let me stop sharing my screen that might help that will help. Hopefully, okay Christian is against Valerie that promotion against their Abstain Valerie Bab. Okay, I do not know if Joe Bitcoat is still back in the meeting have to jump through hoops to get to him. Bear with me, Jeremy go down the list and come back to the ones that you missed: okay, Joe, Joseph Baiko. Can you hear me Joseph baicote? What's that he's unmuted? So he's not there? Okay, Fifth Blitzer, Grill bowhead, no against yeah Junior, Campbell, Bronchia Castro, I'm going viracus for it right. Yes, she said: okay, I'm going by last name, so we're on C's right now so be prepared to unmute yourself, please pat Charles Patricia, Charles, Paula Creary against Mr D'angelo. Yes, in favor, April left rabbi, hughes right, no and Gal Nick. I think she's against somebody. Texted me David, four Jeremy, yes yeah! This is debbie! Yes, yeah. When I said against, I was against a men's shelter. If it's a letter to have motion or okay, yes you're for it. Yes, four, yes or four means you want something other than men's shelter, Joseph Menta, yes, Hazel, Mirror, four for the letter, okay, Yahayo B for the motion rodriguez against. So you want the men's shelter. Are you you're? Not necessarily okay, not! I do not want to say that because it's not exactly what you mean: maybe crazy, Joanne rubino! Yes, oh okay, yes for the motion or against the motion representation. That's what I meant! Sorry Ellie Rodriguez Oral, Selfridge, Oral yeah. I am fought in motion. Okay, 80 squarely for the motion and Siegel Lisa soto again against the motion: Julian Caroline, Joseph Thompson. What's that for the motion for the motion, I think left and I do not think anybody else is here- Daisy Rodriguez texted me. I do not know what she said, though she's against Sylvia Mazzella's in the meeting. Does anyone know how he's voting Al? Can he knew himself and Jeremy Joe would vote for the letter? Joseph Baker is four Yeah Blitzer Valerie Babb Junior Campbell. I'm still waiting to hear from you. If you're there, please let somebody know as soon as possible, patricia Charles. What's that at Gaines, Junior Campbell is against the motion. Patricia Charles, I said I was for the motion she's for the motion. Hero Fran left Rabbi Ken, Galnick, Allie, Babb, Jesus, Blister, Joanne, Terrellange, Joe Thompson is any of these people. Still in the meeting anyway, Jack Sylvia always fought a motion. Thompson is still showing I mean okay hold on. I got put in silvio because Sylvia I'm using the election results. Sylvia did email with me how he wanted to vote, but I do not know if he was in the media at the time of roll call. I have no idea he's on the me he's in the meeting he's here. He can hear you. I know that I got that now. The question is Joe Thompson, I'm just letting you know that for the election hold on, I will unmute Joe Thompson. If he's muted. Okay, let me tell him yes, then Joe Johnson are you for the motion or against? Well? No, they propose something that say. Yes, let me tell her you do not want to show. Do you want? I'm against the motion. Joe Thompson is against the motion, I'm against the motion. Okay, Keith Ramsey. Also, he was somebody that was in the meeting, but did not answer for roll call. Though Charles said he was trying to get in. That's why I did not call his name. Is how do you vote? Can you can you unmute yourself yep? How are you voting against okay unless anybody else is in the meeting Joanne Terrellange Jones just said? Yes, she just come out of the meeting, but she said to tell you yes, she's voting for the motion. Okay, final call on Ken Galnick, Rabbi, Edith, Valerie Babb. Let me sort this hold on the motion. Carries we have 10 against the rest, are in favor all right, all right. Okay, so let me go back to the Agenda Transportation Committee Daisy. Are you able to talk or meet yourself? Let me know, and I'll do my best to meet you. Can you hear me so the agenda does not have a motion that we would like to bring forward to the board, wondering if I can do that. So, let's let me just clarify no after I tapped up the agenda and sent it out. Nobody notified me that I was missing it. So what was the motion in committee Daisy? It was a street co- naming on Leiden Avenue and Holland Avenue for Joe Triotti, who was the owner from John and Joe's Pizzeria now, which corner is this because one corner is already mother Teresa away, but is it for Holland? Is it the Holland side or is it the? It should be the Holland side right. The store is on the corner of Holland and living. It's that I understand mother Teresa weighs on lighting, but this would be for Holland Debbie. Can you clarify it's right on the corner? Okay, but there are two: there are two street sides for a corner: everybody's muted Debbie go ahead. Debbie has the floor. Yes, mother Teresa is ridic, so we're we want Holland to be named after Joe and just so everybody knows who Joe is or was he's the owner of was the owner of John and Joe's deputy. Yes, all right. He passed away this year last year. I do not remember this year. Okay from what I understand from what I understand he's been there for years and 30 years: okay, anybody else, Chris. I think you try to say something: maybe it was already covered anybody else, Joe Thompson yeah. He supported the Pelham Parkway Little League for over 20 years, making yearly contributions. Okay. So this was voted on in committee right, Daisy, yes, and it passed right unanimously. Yes, okay, so you do not know really any objection to us voting now tonight. If anybody has an opinion, you know, Tom Lekini is in the meeting and he's usually one of our experts. We have David, here's usually one of our experts. So then I say that I would say: there's a motion on the floor. No, so because the committee voted on it does not need to be made again and seconded. This was voted on committee. It's passed unanimously and this is to Rename Holland Avenue at the corner of Leideg and Holland. This is the South North West Corner any discussion any all in favor, any objections or abstentions or against your abstentions. This is Natalie. I abstain. I do not know who this person is. Would you does anybody need further? Okay, two obsessions. I abstain as well. Was that paula? Yes, okay? So three extensions? Any others is that that's not that it passes daisy great, thank you, okay, so that is that conclude, the transportation committee that includes all the rest are the notes and the amendments that come okay. So then we'll turn it over to Community Development Andrea, Siegel. Okay, we held our first meeting of this year on September 9th. The minutes have been uploaded to the website and we decided we're going to have a public hearing on October 14th to go over the budget for 2022.. Do you ever hear that, because my audio cut out you ever hear that Andrew? I could hear yeah. If you heard it right all right, so then we'll move on to Nominating committee. We already have the results. Are we unless there's anything else, 80 just turn it to public safety, yeah? Okay, so public fit yeah Ob yep? We did meet everything's in the minutes. If you have any questions you can, let me know after the meeting okay and then that would we'll turn over to gallery. We have three galley session speakers, hopefully they're. Still in the meeting with me, can we find them these everybody meet themselves? I hear a lot of background. Noise still hear background Noise. I do not hear any background noise now. Well, because, maybe it's yours! So if you can mute yourself, please do Amelia. Yes, hi, I'm surviving yes hold on before we begin, I'm muting you of somebody wants to play sergeant arms and time her for two minutes. Remember that's what we have for the agenda two minutes uninterrupted speaking time and then four questions at most or statements by board members who would like to time her. Can somebody else do it besides me? Anyone please Frano! Thank you time! You got it christian! Yes, thank you very much. All right come here. Go yes, hi! I'm Camelia Tapelos executive director for the Morris Park beads. Thank you all for allowing us a space to speak here. I just wanted to say that the Bead and Morris Park Avenue was featured in an article in the Wall Street Journal, this Sunday highlighting our work and our appreciation for the community supporting our local businesses. Through this very trying time, we receive very good feedback from the community on our sanitation program and we will start this fall. Horticulture program that will mulch and aerate over 100 trips on Maurice Park Avenue, but my really big news of the day is that we obtained a three- year grant from New York City Department of small business services called Avenue NYC and the first year of this project. We need to conduct a big research study called the commercial needs assessment studies capacity. We will reach out to several of you for information and support and input so that we we create a report that truly conveys the views of the community of non- profit organizations, community organizations, along with the merchants. We were also able to hire a full- time staff member, which is a local resident homicide. He was feeling a little bit under the weather, so he resisted the for one hour and 45 minutes of this. But then he emailed me that he's collapsing. So I sent him to bed, but I would we will introduce him at the next economic development meeting and we look forward to hear your thoughts and suggestions about what more spark how you would like to see further development on Morris Park Avenue, and we are open to any questions anybody may have for the more responding. Thank you and that's two minutes, perfect. Okay, unless you have anything we'll move on. Thank you very much camellia. Thank you. Okay, our next gallery session Speaker is Annie Martinez, hopefully he's still in the meeting. I know Francis came from the public library. I do not know she's covering for him. I do not know if she's still here, I do not know if anybody called in if you called in you got to. Let me know somehow, if not we'll, move on to our next gallery. Session Speaker Roxanne Organo, I'm going to tap on her. Tell me when you're ready, Christian, I'm ready, okay hold on Roxanne. Can you hear us? Yes, okay, you're on Go may I have a 30-second warning before the two- minute, cut- off absolutely I'll start your time once you start speaking too. Thank you so much. I like to first express my disappointment at the executive elections because I feel like when you have uncontested elections with no opponents. It makes no sense of having an election and not to mention that there's not one block or brown person on the executive board, not one black or latino, which is shameful because the community is over majority black and latino demographics. I do not have anything against yahweh, but I do not know if a muslim trump supporter support is reflective of the community, but that's just my opinion. So again I hope going forward. We will have more choice. The there will be more opponents and will be more reflective of the community at large. Now, regarding the executive session, I sent an email to y' all my complaint towards this unnamed community board member was regarding a stereotypical remark directed at Latinos. Nowhere does that complaint fall in any of the eight subject areas that falls under the open meetings law under executive sessions. So I do not know why you're going into executive sessions when none of those eight subject areas applies to my complaint. So I will formally on the record, object to you going to the executive session on addressing my complaint towards this unnamed community board member now, regarding my other, my complaints regarding the community per open meetings, law minutes or records shall be taken of all open. Meetings of the public and minutes of records available to the public within two weeks from date of meeting applies to the open meeting law in regards to minute has been even before the pandemic in some regards we're missing for over a year and until may former complaint, those minutes were posted yet and still not available to open to the public. In short, we have an issue in minutes you're, not in compliance with open meeting law. Regarding minutes, that's it because my time right now, but I hope this chair, Angelo Al, D'angelo, responds to my email- puts this on the agenda, because this will never be addressed as long as I have less than two minutes to just voice my complaint. Thank you have a good night. Thank you and that's time, Jeremy! Thank you. Yes Sandy! I just want to say, is not Veronica Castro a latina and she's a treasurer. I that's up for her to determine. I mean yeah. I am so therefore you know let boxing know that. Okay, I mean I we do have other. So am I I'm a puerto Rican? Oh okay, thank you, hey so great okay, so we have to get the record straight. Okay, thank you. Unless does anything else, the other galley session speaker did email me that they had to drop out, because, obviously you know they had something to do so. Let's move on to the electives, let me just pull up the list. Of course I should not forget. It starts with the President's office. Bear with me right. I got ta find Tom he's in the meeting. Thomas Lucania from the broad President's office Christian we normally time these people too, but great go ahead and start speaking I'll start timing. You thank you good evening. Everyone thank you for your participation this evening again, I know it's a long night for everybody, but thank you for your dedication to the board and working for your community just a couple of quick items. One is that, as Jeremy did mention, or somebody mentioned earlier, the census is still very important to be completed by all the residents of the district. I know the bid has done a yeoman's job in trying to get people out to complete their census. The borough president has allocated funds to the Bronx works to work in community district 11 in order to get more people to fill out the census and to participate in this portion of our democracy. Secondly, last month or two months ago, you had asked about the blood center and in terms of the possibility of this blood center opening a facility in the borough we did reach out to them and while they did have a plan at some point in the past to open a facility in the borough, Covid-19 has put that to the side. They've been hit financially very much during this pandemic. They are now concentrating on trying to get locations for blood for their blood banks. Not many locations are willing to open their doors right now to large groups of people, and the blood center has some very specific space requirements for locations that may be interested. So if you have a location, that's interested, please let me let me know, and we can pass it on to the blood center and then finally, just to congratulate yahay on his election as first vice chair. We congratulate him and all the work that he has done for the community and will continue to do. Thank you. Thank you and that's time. Thank you. Tom. We have admire from Council member's office. Tell me when you're ready, I'm ready. Let me go all right. I hope everyone is doing well, I'm filling in for Pharah today, just a couple announcements. Elections are just around the corner. Make sure you have your voting plan, whether it is voting early or absentee voting, there's also a need for poll workers. So please apply to be a poll worker. If you would like Tom said from the Bp's office, the census 2020 deadline is approaching. September 30th, so please make sure to fill out your census. Indoor dining will reopen at 25% capacity on September 30th as well. We have a food hand, Sanitizer Mass Giveaway at the district office, every Tuesday at 11 A.M. We also have a food and face mask Giveaway every saturday at 9:00 A.M at 2141, Holland Avenue, with Aaoha and igna relief. As you may know, there's a budget deficit in New, York City our office is striving to make neighborhoods safer, cleaner better. So our new initiative is cleanup district 13, where we partner with community organizations and city agencies to clean up our parks and neighborhoods. So please contact our office. If you would like to schedule a cleanup with us, our office is still open, even though we're physically closed, you can call us and email us if you would like you can subscribe to our weekly newsletter as well by contacting our office and yep. That's all I have okay. Thank you thank you and if you did not meet yourself, if you can meet yourself, thank you. Yeah, perfect, Joseph Mcmanus is next Councilmember Torrez's office mutant. I need a job. Okay, I just want to let everybody know. I have not been sick or anything, but I've been vacant because when the pandemic started, I took a leave of absence from the office and I just got back at the middle of August, so not that I've been avoiding anybody, but I've been very cautious just want to let you know that the office is actually open. The hours are short from Tuesday to Friday 10 A.M to 3 P.M, and you must call because only one constituent is allowed in the office at one time. So if you, if your issue could be adjudicated over the phone, we would like that to be the best way if it can't be, and you've got to bring paperwork in or something to do whatever you have to do. I call the office and they will slide you in for an appointment. You definitely have to have a mask on your temperature will be taken and you'll have to register your name address phone number, so we can just get back to you. We actually the councilman had a cleanup. We cleaned up with Fed cap around the folies are on the transit police station on 180Th Street. I know I got to request what the councilman put towards the Van nest that memorial we did put in for the flagpole and the flagpole was sixty thousand dollars all the Councilmember Taurus reappointment, the community bought have been approved. I sent at the District Service Council meeting. We had a discussion about restaurants and the covent surcharge. I sent that information to Jeremy and turkeys. People have been asking about turkeys. Well, you know just as everything's been happening, there's a lot of businesses that are not doing well, so we do not know what we're going to be doing with the turkeys last year. I know we got 50 turkeys from the governor and other businesses supplied stuff, so we're really here or there without the Turkey show that's the strength of my report. Thank you, okay. Thank you. Joe okay should be Bob press if he's still in the meeting. Okay. Thank you Jeremy. I checked on the address. You gave me about the disturbance about a party. What the address is a phone store I'll be with the councilman king on Saturday at an event right, acrosss the street and we're going to check on the address again to see if it was a different store. As for the homeless, shelter on proposal on Blondell Ave Avenue, westchester, Avenue and Community Board nine had the same proposal. I asked the mayor why he was pushing adult men and women homeless, shelters over family homeless, shelters. Now the mayor said that all of a sudden there has been an increase in homeless men and adult homeless men and women at the Westchester Avenue plan, though site the plan is to have 18 to 20 adult men in one single room on cots with one communal bathroom on Blondell Ave avenue. You have a different problem because this site is by royal Flush, which flushed their whatever it was down the sewer and you have two abandoned service stations with whatever hazardous materials they have that fell on underneath the ground and an environmental in an Eis study is needed of the site as well as you need to see what the floor plan is since we're in a pandemic right now and lastly, as for wanting affordable housing, a developer in 7:8 and 12, I won't mention their name proposed market rate housing which wound up homeless, shelters in those three community boards, and that's it just be careful what you wish for, and I believe I said that to you once before. Okay, thank you. Bob Mariel, De, La Cruz in the controller's office she's here, unmuted now, hello, okay, so she muted herself she's, I'm on two lines. So, if you can, let me immune myself on the other one and, what's the other, let me say: what's the other number? Oh, it's a 2-, 1- 2 number, I'm not seeing! Oh! I see I see I got you, I got you all right, okay, hi everyone! Can you hear me? Thank you, okay, I'm! So sorry about that. This is hi. Everyone welcome back from the summer. I know there have been a few meetings in the past, but I'm glad to be here right now. My name is Marien De La Cruz. I am the Bronx borough director for New York City, Comptroller, Scott Stranger he's been doing a lot. I'm sorry about that. He's been doing a lot of work over the summer regarding education, small businesses, but I'm talk about today, one which was really soon. The comptroller believes that the open streets program should be year- round. I know that some folks have been innovative and figuring out how to make sure that their customers are comfortable with colds and heat and all that kind of stuff. The open street has helped about 90,000 restaurant jobs and allowing more than 10,000 restaurants to open back amid the pandemic. So we think it was a wonderful idea. You know there was always you know certain things that had to be worked out, but people had the opportunity to continue to run their businesses successfully, and we would want to make sure that restaurants had that opportunity to not only regain where they were but be able to get to continue to succeed, because I know that was a concern for lots of folks. When it comes to education. The comptroller has put out a few calls one call it was suggestions for safely opening. Another call is just to make sure that the over a hundred thousand homeless or students and elsewhere to succeed and make sure they have workspaces that are comfortable, but also so that they have positive access to Wi- fi when it comes to the Wi- fi piece. There's also another call to ensure that it's an extension or continues to be support from the big internet providers to ensure that people have access to internet, let it be free or, if not persecuting, folks, 10 seconds, how many out of here, okay and then. Lastly, we have a back to school guide with a bunch of Doa information in English Spanish and I believe Mandarin. But if folks have any questions for me, I always share my contact info and again. If I do not know about your meeting, I can not attend either be virtual or in person. So please ensure that I am that's. Why get notified, but thank you so much. Everyone have a beautiful night and thank you for thank you. Thank you Marielle. So, let's see first man, let me find her and I'll mute her, christina and good evening, and welcome back community board 11., although I feel like you guys, took much of a break, but we are fully resuming just a few announcements. I have today there'll be two events we're participating in this weekend. One of them is tomorrow, Friday, the 25th, the other is on Saturday September 26th. So the event on the 25th is a community March against gun violence and we're doing that. Collaboration with bragg Bronx rises against gun violence, the 52nd precinct, councilman, Fernando, Cabrera and good shepherd services and we're hosting. If you've been paying attention. We we've been hosting anti- crime events throughout the borough, just to bring awareness and to get community participation in terms of when it comes to trial. When cases come and just getting people to come to speak out on behalf of the crime, that's happening in their community and also like, I said, to bring awareness so the March against gun violence and the 52nd precinct actually takes place at 6:00, P.M and it it'll be held. The starting point is Bedford Park and Bainbridge Avenue, and the one for Saturday is actually being hosted by released grip, which is also another cure. Violence agency, so they're having a family fun day and a block party, and so we're going to have events for the community and that begins at 1 pm on Garden Street 30 seconds and Southern Boulevard. Okay, thank you, Christian all right, so another event that we're actually hosting within our office, in collaboration with the mayor's office, to end gender- based violence, we're hosting a virtual 5k walk. So, if you'd like to participate, I will send the information to Jeremy. You can participate any date from October 3rd to the 10th and what all you have to do is kind of take a picture of you doing a picture or video of you walking or of your the pedometer. Can I just say one more thing, and I also share two more press releases these, so she shared more stuff. If you need her contact info, let me know I'm sorry Christina. I have to meet you because if I do not, I set a bad precedent and it just goes on and on with everybody you take advantage of it. So let that be a lesson marcus from Congresswoman Obasio Cortez's office. Is he still here? Was he ever in see him? Okay, good. I mean sorry if you're calling in on the phone. I need you to text me or something. Let me know you're calling in from a phone. You should have, hopefully my cell phone number, still emily Vasquez from Senator Biaggi's office. It's going to be unmuted now two minutes. I only need 30 seconds. I hope everyone had a great summer. We held our annual end of summer event. We had a spin to it this like this season and it was the census event. Thank you. So much to the Morris park bid for being part of our event. Last Saturday we also women led Caravan all over the district. In order to make noise for the census, we are phone, banking and making sure everyone is counted. If anyone knows of any kids that needs any learning devices for back to school, please let our office know and we'll try our best to get you guys in contact with the appropriate people. That's all! Thank you. Okay. Sorry, I had to type because Ronnelle is calling in. I see his name three times, though, so all right, it was three times hold on. Let me see if I can mute him nope. I need to know the number Renault you're calling in from Renault is that you yeah okay, Gotcha, perfect, worked out. All right go ahead: okay, hi! My name is Ronnelle from Senator Bailey's office, so our office opened up towards the end of July, so we are doing constituent services from 11 A.M to 4 P.M, but we are doing our constituent services outside and under a tent as a precaution for Covid-19. We also encourage anyone, that's coming in for constituent service to wear a mask and if you do not have one, we will supply you on during the cold, the course of of the pandemic. We have been collaborating with Natalia Fernandez office, doing food distribution and PPE giveaways, so July 7th. We did a full distribution, August 13 of full distribution and August 14th. We did a Pp Giveaway, also just a reminder for everyone to do their census. There are six days left. We strongly encourage you to do your senses. Thank you. Thank you. Renee. We have caitlin from Senator Rivera's office, yes she's. Here I see her caitlyn. I think she, I think now you can hear me. Yes, okay, perfect hi everybody. I am going to be very quick because I believe I'm the last thing on your agenda. So I will let you guys go, but I hope you all had a good summer. I just want to say: Senator Rivera has been working really hard to make sure that our schools are reopening safely, not only for our students but for our teachers and other staff members as well. In fact, we just hosted a town hall with Assembly member Prachardo a few hours ago, if you're interested in that you can watch it on either of our facebook pages. But if you guys have questions about your child going back to school, please reach out to us and we can coordinate with the Department of Education. I'm going to hit it like everybody else. Did please fill out your census, make sure you're asking your family, your friends, to fill out the census, and I will leave my information in the chat. So if any of you need to be in contact with me, please reach out. Thank you. Thank you. Caitlyn is Natalia Fernandez's office. Here they said they were not going to attend. I do not see a name. I recognize. I do not know if they're calling in so, if not we'll, move on, he left early, Jeremy, okay, so then moving on, we have old business any old business before maybe we get to the ethics, Committee old business, okay, I'm sorry, oh business, yeah, old business, anything rehash so to speak! Okay, it's just that. I was still asking for the Community Board to give me a letter for me to take to our constituents to help me with this project, this capital project for each just regardless parks, so I never received yet so Lisa. I know we talked about this and we did finally get something from the Parks Department I think come out. I believe I did not really get a chance to look at it. Yet did you get that pat? No, I'm talking about the letter from the Community board for me to take to Hasty's office and Senator Jamal Bailey's office to get funding we had so we had already agreed to do it, but I never received another okay. I do not remember if we voted on us a full board meeting. Maybe we did I do not. I do not know if anyone else recalls it's been a while, since they had voted on it, but I never received it and I kept questioning it, but no one responded. Okay, I mean I'll go back and look through our records and if we did vote on yeah I mean we'll make it happen. So thank you. Okay, let's see so then any other old business. I have something I'm not sure if this is all business or new. What is it something maybe discussed before? That's really what it okay, so I have sent the email about. The survey for the community district needs was, did anything come out of. That was that I did not see any email or it being shared today. I assume that's something we're going to discuss in the committee to make sure the rest of the committee members are on board with it. I know some people did respond. Okay. I think that would be the appropriate okay. So our next committee meeting is on the 14th. At the same time as the our public hearing right yeah, I mean you know, I encourage you to definitely. I know you did email some of the community members if you're hurtful, then I'll touch base with our committee beforehand. Just because I think timing is yeah. I agree there is a timing, there's a timing issue. So, yes, okay and we've talked about this it well. As many people know, I usually contact. If I need you to look at something I'll contact you right or Harriet or crystal so right, so any other old business we'll go back to ethics. Can I just make a statement yeah? I just wanted to let everybody know that Nidc has finally moved and we are now located at Matthews Avenue between Pelham, Parkway, South and lydic avenue, we're still unpacking. We are functioning as an office. So if anybody needs any questions, Monday Wednesday Friday by appointment only the number has not changed. So if you need us call us okay, yeah, hey do you want to start? Do you want me to start or how do you want to do this, because I think there should be much clarity in terms of what we're proposing to do yeah. So before we even call for the motion, I believe it's best to go into executive session since we're discussing personal matters of a community board that might lead to possible discipline. So just so, let me just clarify that for everybody, because we have members of the public still. So let me share my screen. If you go to the handbook for community board members open meetings. Law requires all meetings of public bodies where a public body community board loves a public body, be open to the public, with certain exceptions not applicable permits. Public bodies to close portions of their meetings go into executive session when certain types of issues are to be discussed and the correct procedure to close the meeting is followed. So Yahei already mentioned the reason there are these: oh no jeremy, are you Jeremy. We lost Germany yeah. I think when he shares his screen. His internet goes really slow, Jeremy close the screen. He can't, I think so, yeah as you can see on the top of the second page you show in there. If anyone still sees it, demotion or discipline are in there and because we are recommending some sort of discipline, the matter has to be discussed in private we're in executive session Yah. May I ask a question if it involves the member directly negative, but if it's just a general question I can answer. No, I want to know who the member is, because you know I think we should know who is involved. Yeah we'll know in executive session after executive session, and once we vote, then it becomes public. Are we in executive session not yet we're going to wait for Jeremy to come back and then we'll call for a motion to go into executive session? Okay, can I make a statement? I did not hear if you said yes, just switching earpieces, because the other one the battery died. Oh, I understand well, my one statement would be I you know. I do not know. What's behind this specific request, I do not know who the member of the board is, but I actually do not think we should put that person's name in any form whether it's an executive session or now. I think we can correct this. I personally believe that everyone should be mandated as a member of the Community Board, to take that training and rather than holding one particular person accountable. I think it's something that every board member should be accountable, for we have the annual training, which is the ethics course that everybody takes this was this would be in addition to that great just an aside. It's so bad Jeremy is trying to excuse me one second jeremy is trying to get his Wi- fi back on. He lost his Wi- fi, so we're not in executive session. Thanks Al, I agree with you Christian if I think everyone should take it. Take that training yeah. This is in addition to it's not the same. It's completely different yeah unless you want to Sandy. If you want to make a motion for everybody to take two courses annually, then I do not think you have many fans, I'm not taking two courses in it. It's okay, I took I took so many already yeah honestly. I do not even take this many at work, so I think I'm going to thoughts on that on the other training to have more of a discussion on this. Can we hear what was what was the reason for wanting to you know make this person take this training. Jeremy gets back. I see an open Mic for Jeremy, but I just do not hear him so Al. How long do we wait if he can't get his Wi- fi on? We have to postpone this. What do you think? I know I guess we'll you know we'll give him five to ten minutes and if he does not get on in five or ten minutes, we'll just postpone it maybe make a call one night when it's convenient to everybody and get that done. Chris can't take over no, I can not have. I do not have oh Jeremy's back in anything. I do not know how to take everybody else off. No, the point is there any time frame of when we may go back to regular meetings hold on he's. Just he's just texting me. No not yet I can not be the host because I do not have that. I did not check him at home. I see his. I see his screen. You do not know how to remove everybody that does not belong. I can not do it because I'm not the whole I'm. I do not think you can actually remove people in that way. Yes, you can. You can kick people out if you're the host you can as a host? You can do that? Yes, absolutely you can kick people off temporarily or like kick them off for the whole meeting. No, you can sometimes people bomb your zoom or this session. You can remove them. Oh no. I thought you much temporarily because I thought the goal was to get back in once you're always done disgusting, so I know that you could kick people off, but I'm not sure you could like bring people back in because once we come to the executive customer, we have to see everything we have to. Let them be able to come back in which I think so they do not have to come back in Chris when you hover, when you hover over the participant tab and zoom in the in the zoom call the web call, it says, Reclaim host role. I do not know if that's something that would work yeah, I know, but I had to check. I had to check in as a whole. I was kind of oh you're supposed to do. Did that that's a lot of responsibilities happen what he wants to do. If we can't get back in, can he he's he tried he's trying to get in? I saw him it lit up and after that it went out again. I do not know I mean I can try to call him again hold on come on, give him a call and finally Jeremy's on the budget plan for internet. It expires at 10 o'clock. Sorry Jeremy! You can't you can't defend yourself. I have a question for everybody. Is everyone, okay, with using zoom for future reference? If we need to go into executive session, I think this is a city. I think what the D- O- I- T- T uses. I do not know if they could, they could use Zoom. I asked Jeremy the same question and he said that we had to stick with this one, because I work for the city and I think they do not use that you can have people anywhere. Do it use it back in no congratulations yeah, my wi- fi is down, so I do not know what my ability is to kick people out, because that's what this comes down to so I was starting to so I was starting to explain why the details about executive session. Are we still there at the same point? I do not know Jeremy, he can't he's no longer host. I can see oh okay, so, if he's not being close, he can't do certain things now all right hold on hold on. You have to get back to being a host jeremy yeah. So here so let me so my wi- fi is down. It does not look like it's coming back up, so this relies upon Harriet to do this or Chris Logs in Chris, logs out and logs in, and does it and kicks people off. I have no idea, that's how this my wife, I rebooted my phone. It's still, you should come down to the office and run the meeting from the office Sandy. Thank you in the office I'm going to get I'm going to get out, I'm going to sign in as a host. Okay, just do it Chris and thanks Chris everybody having fun. I want to go home, oh wait a minute, I'm just told Jeremy. While we wait for Chris. Can you please explain regarding the I did executive session email from a public member saying that it only applies to employees and not to community board members? Okay, but it? So let me yes, that's what I was trying to do and there is the explanation needed in my opinion, because the public has the right to know. So I need everybody to mute themselves. I no longer have the ability to mute, everybody or Harry meet them all. Oh god. I do not know how no you have to be the host here. You've done it before Harriet. You click on participants at the top, okay, I've unmuted myself. So there is so. You have to be very clear on the reasons for going into executive session and I had it up, but I just basically shut down my computer to work out to try to fix the Wi- fi bear with me. Okay, guys, I'm the host. You want me to what you want me to do. No, let me you guys did not actually vote to go in the executive session. Yet right they did not vote yet right, Chris, no okay! So let me before you before you go into executive session, you're, very clear on the reasons okay, so bear with me. I'm pulling it up right now, so the open meetings law requires all meetings of public buyers to be open to the public. That includes community boards because we're a public body, but we may close portions of the meeting by going into executive session and the subjects that may be discussed in closed meetings are what Yahei, what yahei said. So, in terms of matters leading to the appointment, employment promotion, demotion, discipline, suspension, dismissal or removal of a particular person or corporation now, the community board does have the power to remove its own members. We have done this before as some as those of you who are aware have been around long enough and Yahei is saying that this is this type of situation where these are the type of complaints. His committee is dealing with right, a disciplinary matter, yeah, so a particular person. It does not specify an employee or anyone else, so it could be any particular person that we, you know that we can discuss. So you just have to make sure when we vote, when you vote on the motion by the ethics Committee that that's done in public, you vote to go into the executive session, and then you vote on the motion in public after you come out of the executive session. Is that clear enough for everybody correct all right now the public before we go? The public can come back into the meeting once the executive session is over or the meeting is back open back up right. Okay, so so yeah, you made a motion to go into executive session. I'm making a motion to go into executive session to discuss a particular person's matter that may lead to discipline. Do I have a second all right, I'll? Second, it but you're saying may so there's no decision yet exactly we have to discuss it and then vote for that decision to occur. Since we have a second jeremy, can we just go into executive session? No, you need to vote. Everybody needs to be in favor against abstentions, all right all in favor aye or I anyone any against or abstentions, poor abstentions, okay unanimously, so Chris. So any member of the public, any member of the public I wishes to rejoin, I'm not sure when the meeting will come back online, but I do not know, I guess you'll have to notify us. Let us know I mean if you know how to get in touch with us by all means, does did Christian, take it off of Facebook. Well, it was me that was on facebook live it's! Oh okay! Once my internet went down, so did facebook, okay, but this still is recording Jeremy are you I have to stop the recording correct? Is it still recording? Yes, I have the red, then stop it stop it hold up. Hopefully the recording is saved because it might have went too when I tried it now. It started now under me for 2 minutes and 49 seconds. So then stop.",
            "summary": "I, guess to anyone who either once who wants to make another nation I'd like to make a nomination, says: Joanne Rubino for a first vice chair, Are there any other Actually before I do open it up Sometimes, you do not even know who you're voting for so it's become so hard to say we're hoping for someone we do not even know.\nYou know the names I thought we would have names and everyone can make a decision who they want to vote for, but to just come tonight and be put on the spot.\nBut if anyone has any questions, I'll take questions, ethics committee I mean he spends a lot of time outside of our scheduled meetings, with the work that he does like to make sure that he gives his all.\nI responded and if I was not aware only making myself clear so in June, I was not available during the pandemic Allow for the nominating committee to cast a single vote for the single nominee.\nI'm here people, so the person I did not hear from before was bernadette, which she said she most likely can't make the meeting Melanie Lahose, Sylvia, Mazzella and Norris.\nI can follow up with people, okay, So I think we can just close the voting We could just declare who is the first vice chair and we and the exact the exact results will come later with the minute Thank you baby.\nYou, know yes, captain the t, detective I want to thank the the residents of the 4- 9, the community whole establishment for the support behind the fortnite priesthood.\nI know a lot of people reading different things in the newspapers, so I want to put things into perspective for everyone.\nAnyone on the board or anyone in the community wants to you, know, coordinate with us to do stuff donations or anything on the the NYPD 49 precinct.\nWe're, going to have an executive board meeting later on next week to discuss a proposed bylaw change about the equity, Let's, see a treasures report bronco.\nThere are a couple answers or increases that we did not get answers on, but once I do receive those answers, I'll be sending out a finalized one to Jeremy and he'll, distribute it to email, okay, Secretary's report, June minutes, were, I think, uploaded.\nAll right, a second in Germany, okay, so Hazel made a motion, approve the June 2020 full board meeting Unless, there's anything else, district managers report.\nAnybody wants to committee chairs when we do your agendas, Blonde Avenue, Homeless Shelter.\nThere was a news article that told everybody that there was a second homeless shelter going on Blondell Ave. There's a motion on the on the agenda regarding the original proposal.\nIt's, just I plan on going to that meeting, because I want to talk about some personal issues that have come up over the summer.\nUnless anybody else needs to hear more from me, please do not, let's save it, for offline and move over to committee reports, the motions we have to vote.\nThey are to rename the nominating committee to the nomination nominating an elections committee to require board officer candidates to provide a written or oral statement to the community board at least 72 hours prior to each election, stating why they are seeking the position and third to allow nominees for board officer positions to accept the nomination in writing within 10 working days of the nomination or in person at the April or May meeting.\nThat brings us to the third change, which is to allow nominees for board officer position to accept the nomination in writing within 10 working days of the nomination or in person at the April or may meeting just to give a two sentence.\nIf there's like a circumstance that does not allow someone to attend a particular meeting, I mean we were in the middle of a pandemic, this year, so those are very legitimate excuses or whatever is going on in a person's life.\nIt's officer positions to accept the nomination in writing within 10 working days of the nomination or in person at the April or may full board meeting.\nMay and June that we had this discussion, whether or not we could change the elections to a different month We really can't because the bylaws have it locked in there so to allow people to accept in earlier months, really or later months does not really work out, because the elections are fixed in June, which is one thing exactly so that that's why it's written that way, so it does say or in person.\nSo you can't say we have no way to go because we're in a comfortable home, because I'm very tired, right, now, all right that that's you But I do not see the need to off- board the members of the community who are in this meeting now when the rest of us can stick around till the end and have this discussion you and your prior commitments, you know.\nYes, all right, I'm, going to move off the agenda and until somebody makes a motion we got other motions to vote on, for example, health and social services, which I think is your committee Sandy.\nWe just had the meeting with the various people right about the shelter and whatever We met with some politicians and whatever to discuss the homeless, shelter We made a motion to send written correspondence to the city and others, like our elected officials, can share.\nThere won't be as hopefully something zone goes haywire with life all right, but the idea is we have we met You know that it with this shelter, that's supposedly going to come to Blondell Ave Avenue.\nWe would drive it not that we would rather have senior housing or a combination of senior or affordable or if we have to have a homeless shelter that it be for families not for just homeless men and this when conjunction with Community Board 10, because the area literally is in both districts or near both districts.\nWell, I, still question: If a homeless shelter is being proposed for our community that currently houses zero, Why is like.\nThere's, one open near my high school a few years ago and in their own, like Married Avenue area and everyone as opposed, was opposed to it, and people moved out.\nI mean I just want a counter to say that a lot of the areas that have pre- existing shelters, for example, like Community, Board, six and seven, have quite a lot of homeless.\nYou know problems for small businesses issues when it comes to just quality of life and safety in those communities, and I.\nDiscussion, corresponds to the city of New, York or elected officials, and Committee Board 10, asking for the proposed and only homeless, shelter on Blonde Avenue, be instead converted to number one senior housing, accommodation for housing.\nYou just repeat what exactly we're voting on, because everyone's cutting in and out Motion is to send to the city of New York elected officials and Committee Board 10, asking for the proposed men only homeless, shelter on blind avenue, be instead converted to senior citizen, housing, combination of senior citizen and affordable housing, affordable or a homeless shelter with the families.\nOkay, I'm just going to use this elections ballot thing that I was doing name for the motion against or abstain, Jeremy, quick question for you, If I, if I want it the letter to be written, a different way, well just abstain from it, because if to me, if you move homeless, shelter for families to number one, I, like that better.\nYes, you could put homeless shelters for families as number one Okay, thanks or a combination of all the other thing is or a combination of you know the order you could, you could combine, say, affordable housing with some homeless shelters for families, so that could be done.\nBecause I have to leave pretty soon, but I was saying that someone said that there's a methadone clinic over there and to put up all men, shelter there with a methadone clinic We want to put seniors there to with the methadone clinic there, so I'm a little confused, because are we going against it because it's all men, because we can not judge people today, because all these noise we're hearing half of these people do not live in our community but they're still in our community.\nIs it where you put the homeless shelter or where the people going to hang out?\nI do not want to get political about this thing, but there's a lot of mental health issues that need to be addressed with male shelters, and I.\nThey're they're, not here, legally, there's a lot of issues that are going on there, but the emphasis is try to keep the family together and try to really make ends meet You know I grew up in the Bronx.\nIf they have a need for a home, a male homeless shelter, then maybe we need to look into it more before we say no, do not bring it here, because you have to understand, as he say, what's going on with mental illness and look at the streets that we're living in and watch.\nTwo years ago, we were warned that we were going to get homeless shelters in the community, which is not a bad thing.\nThey did not want it in their community and at that time I believe Mark told us that you know.\nWe do have a nightclub building on Boston Road, so we do have senior housing You know a lot of people have been out of work since March and even though there is a moratorium on evictions right now, it's set to expire on October 1st, because it's not extended.\nI. Do not think the senior housing is going to work because we already have that, and I really truly feel that homeless.\nThat's, the type of shelter that is operating on Jerome Avenue, so I do not know if oral anybody else would want to respond to that, but they are looking to be a full service.\nI. Think everybody can agree that we want to make sure that these people, if they come to the you- know the homeless population comes to this area.\nLet's vote on the motion and move on And then we'll work on whatever, but the city's going to do what they want.\nOnly homeless, shelter, I mean for some people.\nSylvia did email with me how he wanted to vote, but I do not know if he was in the media at the time of roll call.\nSo I will formally on the record, object to you, going to the executive session on addressing my complaint towards this unnamed community board member now.\nAgain, I know it's a long night for everybody, but thank you for your dedication to the board and working for your community.\nThe address is a phone store, I'll be with the councilman king on Saturday at an event, right, acrosss, the street As for the homeless, shelter on proposal on Blondell Ave, Avenue, westchester, Avenue and Community Board I asked the mayor why he was pushing adult men and women homeless, shelters over family homeless, shelters.\nPlease let our office know And, we'll try our best to get you guys in contact with the appropriate people.\nSo before we even call for the motion, I believe it's best to go into executive session since we're discussing personal matters of a community board that might lead to possible discipline.\nI, think it's something that every board member should be accountable, for we have the annual training, which is the ethics course that everybody takes this One second jeremy is trying to get his Wi- fi back on.\nI asked Jeremy the same question and he said that we had to stick with this one, because I work for the city, And I think they do not use that you can have people anywhere.\n, so I do not know what my ability is to kick people out, because that's what this comes down to It does not look like it's coming back up.\nThat includes community boards because we're a public body, but we may close portions of the meeting by going into executive session and the subjects that may be discussed in closed meetings are what Yahei, what yahei said.\nAny member of the public I wishes to rejoin, I'm, not sure when the meeting will come back online, but I do not know."
        }
    }
}