{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCV61VqLMr2eIhH4f51PV0gA",
            "title": "July 2020 CB8M Housing Committee Meeting",
            "publishDate": "2020-07-22",
            "shortDescription": "",
            "lengthSeconds": "1:26:26"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "ZXqKuEEdQjA",
            "fillerWordCount": {
                "uh": 199,
                "um": 127
            },
            "readTimeFullTranscript": "44 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "rent": 72,
                "housing": 55,
                "income": 35,
                "state": 26,
                "tenants": 24,
                "program": 20,
                "eviction": 20,
                "moratorium": 16,
                "bill": 15,
                "percent": 13
            },
            "wordCountSummary": {
                "housing": 17,
                "rent": 14,
                "tenants": 12,
                "income": 9,
                "state": 6,
                "program": 5,
                "eviction": 5,
                "bedroom": 5,
                "moratorium": 4,
                "landlords": 4
            },
            "fullTranscript": "C Ed is just now signing on, and so I was just waiting until okay, I'm here Barbara's here Ed. I am here, hello, everyone, hi Rita, I'm running out, I'm running out to get some a refill I'll, be right back all right and it's 6:30. Do you want to wait a little while or do you want to get started? Can we just now? This is Barbara Sharkey, I'm co-, chair of the Housing committee and won't be introduced any board members who are on say who they are. Please sure do you want to wait a couple of minutes, barbara. We have oh, we can wait a couple of minutes: okay, hi Sam, it's him muted! He is yeah you I mean. I mute him. No, that's! Okay! He waved okay, hi Rita. Okay, you want to wait till 6:35. Is that? Okay, everybody is that okay, yeah okay, I gave Wilma the numbers he should be coming on. Wilma Johnson will. May you here she's not here yet not yet? Okay, nice! We have a good turnout here. Do so oh Betty's with us, hi, Buddy, Hey, Betty, see me. You can just hear me. You can only hear me too betty, I'm just waving. This is great. I love this is better than the sign- in sheet. I can just go down the participant list and I do not have to be a nudge and ask everybody to sign. This is great. This is this. Is great okay, two more minutes gang and then we'll get started. Okay, hey did you introduce yourself? Won't you introduce yourself, I'm going to give them two more minutes, okay, battering to chatter. So we have. We have tell you what all right. Why do not we we'll get started and I can write down names later I'll, let well! Okay, let's just have the board members who are on introduce themselves. I'm Barbara, Sharkey co-, chair of the committee, Ed Ed, Hartzog co-, chair of the committee. I think everybody's muted, though Barbara so I'll, read off who's here, because I can see who's. Oh okay, who was it yeah? So those of you who are not on the phone and those who are on the phone, but if you're not on the phone, you can go to the participants tab at the bottom of your screen and see who's here. But from the board we have. Our chair, Elita camp is here: Anthony Cohn, Gail, Barron, Kim, Selway, Marco, Tamayo, Rebecca, Lamorte, Rita Popper is here, Sandra Coleman is here and Tanya. Barrero is here, along with a lot of familiar faces, happy to see everybody welcome to the July Housing committee meeting and to our first I think, Barbara. My right. This is our first zoom meeting, I think, is a committee. So for those who have been to our board, meetings will is going to serve as our Dj Barbara and I are unmuted. Everybody knows how to raise their hand if they have questions, but on the agenda for tonight we have very happy to have through courtesy of an old friend. Rita knows very well. Our good friend, Victor Bach over at css, has put us in touch with our guest tonight, which is Sam Stein, a new housing policy analyst at Css and Sam Community Service society. If anybody does not know that, thank you Barbara. I was just thinking, that's a little too much for the acronyms. Thank you. Sam is going to update us on all things that are going on, including and beyond the rent assistance program that I believe and Sam I'll leave it to you to correct me if I'm wrong, which is still available for application until July 30., and we have the eviction moratorium. I think to talk about and Sam has told me that he has lots and lots of updates from Albany on pending legislation regarding rent housing and all things related to that. So without further Ado, I'm going to turn it over to Sam and let him do his thing and when he's done we'll open it up for questions Sam it's over to you thanks so much ed and nice to see many of you can you all hear me? Yes, okay, great! So, as I said, I'm a brand new housing policy analyst at the Community Service society. I was actually the community planning, fellow at Community, Board 8 way back in 2011, so nice to be back in this different forum. So Ed asked me to talk a little bit about the state of of housing evictions, the state of the rental assistance program and other things going on in Albany. Just for a time frame. You know how long would you like me to go for? As you know, you have, you know until people start dropping off, but you know use your discretion, but I mean you know. We want you to cover, what's important, to know everything's important right now so go ahead. What's yours all right, so I'll speak for a little bit and then I'll answer any questions that people have. I'm sure you'll also have questions that I do not have answers, for. I will do my best to get answers for them and get them back to the co- chairs to distribute to the committee. So the first thing is, you know, as everyone knows, that the housing situation is quite dire. We've seen a lot of alarming reports. You know without a blanket bank blanket statement. A lot of them are perfectly accurate, with unemployment around 20 officially and therefore likely quite a bit higher. A lot of tenants are having trouble paying rent. The latest statistics showed about a quarter of tenants, did not pay full rent last month, which is kind of high, given a 20 unemployment rate, since there is usually a number of tenants who do not pay, but a lot of people who are unemployed are relying on those unemployment, expanded checks, including the extra 600 which are set to expire. If they're not extended by Congress. We have in place an eviction moratorium which I'll talk about in a moment, but as that is phased out, if other action is not taken, we could see a whole lot of evictions. You see the same metaphor is being used all the time, a landslide, a tsunami. It's really true, and so it's important that action be taken, especially at the state and federal level, to stop this, but the city should do everything it can as well. So right now the state of New York has an eviction moratorium in place until August 20th, that's already been extended from. I think it was August 5th to August 20th. It could be extended again, but as it was extended this last time it was also diminished. So it now is not a blanket eviction moratorium. It's a moratorium on evictions for people who can't prove that their inability to pay is directly related to Covid-19 and that's going to cover a lot of people, but there's still going to be plenty who are left out, including people who are paid under the table and might not have the ability to get a reference for their newfound unemployment. It also does not cover people who became unemployed in phase four which we're in right now in New, York City. So that's going to be a lot of people as well. There we've just heard that there's a new round of restaurants and bars that are going to be closing workers in those restaurants who are newly unemployed are not covered under. What's called the tenant safe, Harbor act, which was passed at the end of June and is the piece of legislation that protects workers who lost income or became sick as a result of Covid-19? That said, the courts have still not really reopened, they can reopen, but in New York City they have not. So while cases are being filed, they're not yet being executed, the courts are open online for tenants filing housing part cases against their landlords for things like emergency repairs that need to be made or harassment or illegal lockouts, which can be one roommate against another or if they're, the courts are open for pre- coveted cases where both parties have have attorneys and are seeking either settlements or to file motions. But evictions are not going through at the moment, even though the protections are not as strong as we want them to be. On top of that, it's also worth noting that the city's department of investigations told its city marshals, not to conduct evictions, and we have no expiration on that. So it's also possible that the state could end its eviction moratorium, but the city could ex could continue to tell its city marshals not to act on them so that that's maybe something to keep an eye on for the future. There's also a federal eviction moratorium on tenants whose landlords receive federal funding and the clearest case of that is NYCHA residents whose landlord is the public authority, but also section 8, tenants, tenants in program in buildings that were built with a low- income, housing tax credit which is most affordable, housing and then most affordable housing. That's been built in the last 30 years anyway, and then any building that got mortgages with Freddie or fanny. If there was any federal intervention, then the tenants can't be evicted. So we've got this patchwork of federal state and city eviction protections. There are tenants who will fall through the cracks at the moment. I think it's doing its job, but if any combination of those are taken away, we could see real trouble for tenants in the future. So the legislature has passed one major rent relief program for those workers who you know it's mostly geared at people who lost some income, but not all, but it could be for people who lost all income. This is what it does. It's a one- time payment to landlords and this is complicated. So if it's not clear just please let me know, but it covers the increase in tenant's, rent burden for March, April may and June. So let's say that beforehand before the Covid-19 pandemic in New York, you were paying 35 of your income. Generally, we say tenants to be in housing, that's affordable to them, should pay 30 or less of their income. But if you were rent burdened before this and you were paying 35 of your income, but now your income has gone down as your rent stays flat. Your new rent burden might be 50 or it might be a hundred percent if you've lost all income altogether. Under this program, the state will pay the difference between what you paid before and what you can afford to pay. Now so let's say you, you know if your rent burden was 35 before now, it's 50, it will take you back to a 35 rent burden. In other words, if you were severely rent burdened before, though you'll still be severely rent bird and now you just won't be more rent burdened than you used to be so this really does not help tenants who are in rough shape beforehand. It's not clear where they're going to come up with the money to pay the rent if their incomes really have dropped as much as we've seen our agency does an annual survey of low- income workers. One question we always ask is how much savings do you have in reserved? Should you know, lose your income and it's very common that the answer is negligible. So we think this is. You know a better than nothing program, but really not close to the need for this moment Sam. Is it safe to say that really hurts regressively? Obviously, when you're talking about rent burdens on lower wage workers, obviously right they're more rent burden? I would imagine yes is that right? Okay, that is correct, especially if they're in private housing, without section 8 subsidies or something like that group was already the most rent burden, whereas somebody who had a small rent burden would still be qualified for this program. The other thing is, it has a cap of 100 million dollars, so that's how much the state is willing to spend. It will spend no more. It can be used to cover either missed or incomplete, rent payments or if a tenant has paid their rent. So far, even with that higher rent burden, it can be used to cover future rents. So that's a good thing: it can also replenish a security deposit if you used your security deposit to pay for some of the rent. You could not afford these last few months, so here's who is eligible for it, households that are in less than 80 percent of area median income before March, first and paid more than thirty percent of their gross income in rent. You can prove all of that, so you had to be under eighty percent of AMI, which is not really low income. That's kind of closer to moderate to comfortable incomes and you had to be rent burdened before March 1st. So if you're rent burden now, but you were not, then you do not qualify. If you earned more than 80 of AMI, then, but now you're unemployed, you do not qualify and you have to have lost income between April, 1st and July 31st. So it also does not cover anybody who was immediately affected by this pandemic in mid- march, which you know certain areas pretty hard pretty fast, so people who are ineligible, like I said people who are low income now, but were not then people who were not rentward and then but are now people who are rent burdened before and are still rent burdened, but have not lost income, undocumented households without a single citizen, who's or a person who's a legal resident. So if there's one legal resident in the household you qualify, but if none are then the household does not. This does not qualify. This does not include public housing, section, 8 or other voucher recipients, because they can reapply for their programs at their new lower income, and it does not cover people whose rent is over 125 percent of what Hud considers the fair market rent standards. So if your rent was already pretty high higher than Hud thinks it should be, you do not get covered, which I imagine could include some members in community board eight, even though they might be under 80 AMI. So how you get it is you apply online from the division of homes and community renewal? The website predictably crashed after 10 minutes of opening, given the magnitude of people who were trying to apply statewide, it's back up, but it's still very difficult. There's only a two week application window and we are in week one right now there's one more week and then it is closed. So people with limited internet access really need somebody else to help them through this, whether that's a tenant organization or a elected official's constituent service or the board itself. They are. The Hcr says that they're going to prioritize based on quote greatest economic and social need, so that could undo some of the regressive nature of this that Ed pointed to, but they have not given us a formula. So we do not exactly know how they're going to go about prioritizing. Who should get this? It's certain that more than 100 million dollars worth of rent support will be requested. So it's also certain that some people will be denied. I really hope that they do keep to this commitment to prioritize people who are most at risk of homelessness or eventual eviction once that eviction moratorium expires. But we do not know how they're going to make their decision exactly. Do you think they can add any money to it as the time goes on they could so. Albany is back in session right now for an emergency session, but the governor has suggested that the state not approve anything that will cost more money and so far the state, senator and assembly leadership have gone along with that, and their political logic is if the state shows that it is willing to spend more money. Now it will be harder for the state to request. You know major reimbursements from the federal government, which is absolutely necessary. It seems to me that the federal government is already showing that it's not really willing to pay as much as necessary. I do not know that they'll really be looking at the actions of Paul Histi and the assembly and legislature, but that is the current political line, and so there are people who are organizing against that or who are saying. We should just pass the legislation now and figure out how to pay it later and use that as leverage to get payments from the federal government or maybe do a millionaire tax income tax right so that legislation has been introduced. I believe Jessica Ramos in the state Senate is the sponsor there. I do not remember who the assembly sponsor is but to bring in more revenue by taxing the highest income residents and then that money could be used on expanding this rent assistance program. There are three big and fairly comprehensive bills that are being introduced right now in Albany, as well, which the coalition of groups that coalesced around the rent reforms last year are supporting. I can tell you about all three of them. I will say that it's very hard to see these bills passed without both a groundswell of support and without federal commitments of money. But this is what those groups which css is a part of have determined would be the comprehensive solution to the rent problem. So the first is a program called housing access vouchers, and this is a bill sponsored by Brian Cavanaugh on the assembly and Stephen Simberwith in the Senate. That would provide housing vouchers for those currently homeless and those at risk of homelessness to move from temporary hotels and shelters into permanent housing, and it would cover the pretty big gap that exists between what the city is currently offering homeless and your homeless residents in terms of rent vouchers and what the actual cost of rent is in New York City. So that would be a program to essentially very quickly shelter in safe conditions. Everybody who needs it and to eliminate some of the potential spread of Covid-19 that exists in congregate, housing, shelters, which are very dangerous conditions under any circumstance, but certainly under this pandemic, then there's a bill for extending the eviction moratorium and including foreclosures in it as well. That bill is a sponsored by Zelenor, Myriad, Assembly and Carinaes reyes in the Senate sorry to Interrupt. Could you give us the bill numbers for those yeah? Let me go back so: housing access, voucher, Senate, seven, six, two, eight, a seven six, two, eight, a the assembly bill is a 9657a, so those are the numbers for housing access, voucher program on the extended eviction and foreclosure moratorium. There is no assembly number, yet the Senate number is S-8667. That's s-8667, though this would protect commercial and residential tenants from eviction during the state of emergency, plus give them an extra year to recover, given that the economic fallout is going to be much longer than the epidemiological fallout and it prevents filings of and executions of, both evictions and foreclosures, and this, like I said it covers commercial and residential homeowners and renters. So this is a fairly comprehensive deal that would just keep people in place if businesses close, of course, the landlords can bring in a new tenant, but as long as they're operational, they can't be evicted final and perhaps most expansive and even controversial bill is a cancel rent bill. That is sponsored in the Senate by Julia Salazar and in the assembly by you lean new. The Senate bill number is zero. Eight zero, two s: zero, eight zero, two assembly, A10826 810826, so this quite simply cancels rents from March 7th until the duration of the crisis plus 90 days, it is designed to be universal because there are many ways that tenants fall through the cracks and we it understands that landlords can't simply operate without rents, but it puts the onus on the landlords rather than the tenants to prove the hardship. So it includes a Landlord hardship fund which is designed to prioritize small operators, non- profits and public housing authorities before all other potential landlords and landlords can basically get their rent payments covered in, but in exchange they have to open their books and demonstrate that they actually have a hardship that other programs work. Mitchell Lama also requires operators to open up their books to show that they do in fact need higher, rent or maintenance costs. The old rent control system similarly require that landlords show that they were reinvesting their rents into their buildings. So this would bring back that system for landlords that operate that take that hardship fund, and it also requires that landlords who take the hardship fund freeze their rents to pre- covered rates for five years and abide by what they call good cause eviction standards, which means tenants, can be evicted for non- payment once this cancel rent program ends, but they can't be evicted simply because the landlord would rather bring in somebody else who can pay higher rent. So it's a guaranteed lease renewal, essentially as long as tenants are paying rent and are nuisances to their neighbors Sam. Quick question on the on the duration of the crisis is the definition of the end of the crisis. Is that defined by what I read when I've been catching up on? All these executive orders from the governor is that preamble he has on all executive orders under the authority of I think it is 29b of whatever I forgot. The law that does not matter is that is that the trigger, when that look, when that authority ends that's the end of the crisis and then it's plus 90 days. That's my understanding. Yes, it's the state of emergency, which is the same as the extended eviction protections. Only those go a year out from the end of the state of emergency. The Cancel rent goes three months out 90 days: okay, wow! That's that's really great! Thank you! So much do you have more or is that that's pretty much? That was where I was going to close. That's the state of play right now, happy to answer any questions I can yeah. So what do you want to open it up to the public? First for those? Oh, let's just open it up to the public, at least if they have key questions. Yes, so nothing personal, just questions about the law of the stuff you can maybe submit later, but as a check, but questions about the new, the regulations or the proposed regulations, or how to interpret them. Nothing about your own situation, right, yeah and just a reminder for everybody to raise your hand so that Barbara and Ed can call on you go to the participants menu at the bottom of your screen. I can't call on them because I can't see so I'd have to do the calling on I'm going to dial in yeah. I recognize that it's the participants box at the bottom of your screen. You click on the button that says, participants has the number 19 next to it. It'll open up a box you'll see a button that says raise hand, click on that it'll elevate, you in the participants menu and, if you're on the phone, it's star nine and I see Rita right away Rita. If you could unmute her Rita good to see you, albeit far away, I'm I sama you were terrific, I'm just going to put some numbers to what you said. What is 80 AMI accordingly, one person, 80 percent AMI, falls between forty one thousand seven hundred dollars to sixty three thousand six hundred dollars for homeless people homeless, black male ladies homeless people, who are currently in hotels and motels. The city pays them the pays, the owners 250 per week. It does not matter how many people are in the room, that's their standard, so I just wanted to put you know, so you know where what is 80 mean? Thank you. Thanks, Rita, that's very helpful anybody else. I can't believe with this group that we do not have any questions in this group for Sam. I can't imagine really there we go. He was very clear that he was very clear. That's why yeah well! He was very clear: he was very good sam you're, too good we're going to have to not have you come anymore because you have no here we go. I knew we would have some questions. You have a few questions. Elizabeth rose, you have to mute yourself, Elizabeth you're good, to go you're good to go my I apologize for any background noise. My husband is in the same room on a call as well anyway, so in the bill that would provide funding for the gap between what the city is paying for rental assistance and the actual cost of rent for the currently homeless. Households are there in fact, enough available apartments such that if this bill were passed, all these families could be housed. The vacancy counts in the city are higher than the number of homeless people who have been counted. There's the question of where they are. There's the question of at what rents and given the recent you know, departure of a larger number of people from the city. There might even be a higher vacancy rate right now than the last time the city checked. There's a larger question also about hotel rooms that whose operators do not believe that tourism is going to return anytime, soon enough to make them economically viable and whether it makes sense to convert those into permanent housing. That's a question that I'm looking into that a lot of groups are thinking about and if so, how to do it in the safest way for residents and for the communities and what it would take economically to you know: convert hotel rooms into class, a apartments with kitchens and the rest, and also what kind of what kind of regulations are going to be for them for rent regulations. If we do that right, would it count, as you know, the old SRO travels, or would it be something else? Those are open questions and in some ways it's a quite dire situation. There are a lot of homeless people and there's a lot of rooms right now that are available, so it makes sense sac soon, on the other hand, is probably a very expensive proposition, and so we're going to need either new revenue streams or, in my opinion, a federal recovery package that would cover something like that, and we may need some supported services to go with those rooms. Right I mean in the past when hotels have been converted in this way by non- profits, they have been at least 20 supportive housing, which means having social support services. In- house that's right, a highly effective way of ending Street homelessness, Elizabeth muted, you because we heard a lot of background, but if you had any follow- up to that, you can get, but if not, no I'm sorry. I pronounced your name wrong when I introduced everyone- my apologies yeah. I just admitted myself thank you and totally okay, it's a soft name to pronounce. So it's all right. I appreciate it. Thank you Sam! Thank you that was extraordinarily helpful and very sort of well laid out sort of the best I've heard explained. I'm curious, if you can share you mentioned that under the Hcr program, one of the sort of one of the conditions was whether Hud thinks the rent is already too high, so applicants would not qualify, and so it sounded like you mentioned. That could be a problem that you would anticipate residents in our district and community Board able face. Can you either elaborate on that or talk a little bit more about some of the other qualifications and requirements of the hdr program that you think would make it difficult for people who should otherwise qualify or seem to be in need in our particular district in Community Board aid that might make it challenging for them to end up actually qualifying for these, for these benefits right. So the rule is that it does not cover people whose rent is over 125 percent of the Federal Housing and Urban Development agencies, fair market rent standards, and I'm not an expert in Hud, fair market rent standards. So I'm not totally sure how they're calculated. If anyone on this call is or if Rita wants to look up the numbers, maybe we could get more specific, but I imagine that might be more of a burden in higher rent parts of the city than in lower rent parts of the city, because I do not think that it's targeted by anything quite as specific as a community district. Now it's a much larger district, so I could I could check out. If no one knows it offhand, what exactly the bear market rate standards would be in district 8, but I imagine that might be an issue and the other issue is: if people earn too much before but are now earning nothing, then they would be caught in a in a loophole as well. Thank you, sorry or I mean just to go over the ineligibilities again. It's people who were not low income then, but are now people who are not rent burdened before but are now so maybe your rent actually matched your income before, but when your income drops it no longer does you would not be eligible for this relief households where no members are documented residents and then people who are above this 125 percent fair market redstone? Those are those are the exclusion categories. Sorry I was. I was trying to look up the fair market rent levels. If anyone can find them, I can follow up with those. So I can't see everybody, but I just dialed that up on Google, so Sam correct me if you think this is way off, but it looks like what I'm reading is for fiscal year: 2020 the fair market, rent documentation system for New, York, Hud, Metro, fair market, rent area Fmrs for all bedroom sizes, for an efficiency that is 16.65 for a one bedroom, 1700 for a two- bedroom 1951 for a three- bedroom, 2472 and for a four- bedroom. It is 2600 and then below that it says. New York is part of the New York New York Hud Metro Fmr area, which consists of the following counties: Bronx New, York, kings, Putnam, Queens, Richmond, Rockland and Rocklin County right. So thank you for looking that up. That does sound right, and that means that it's the same as the AMI catchment area, Median income, New, York, City, plus Putnam in rockland, which can have a distorting effect on the amounts. So if your rent was 25 higher than those numbers at your you know, bedroom number, then you would be disqualified from this program. I guess I leave it to the experts in CB8 whether you think that's going to be an issue in your community, but it seems worth looking into okay, any you have a follow- up or you're good. I see you put your hand down I'll. Take that as a no follow- up, and I think the next person up is billy Freeland Billy's, unmuted yeah. Thank you Sam. This was terrific and I'm very much looking forward to reading your book, which I've been putting off for too long apologies. If any of the background thunder distracts but I'll try to keep it quick, I'm not sure if, if any of these bills touch on commercial rent, specifically a lot of our beleaguered mom and pop small businesses, forgive me if I missed it, is there anything that's being contemplated for helping those businesses? I pulled up the salazar bill on rent cancellation looks like section four just specifies residential renters. So is there anything else that you can add? Did I miss it? Let us know thanks sure, and thanks for getting my book, the eviction moratorium extension bill does cover commercial as well as residential tenants. So of the three that I listed, that is the only one that will help small businesses. There may be other bills that have been introduced specifically on small business aid that I'm not privy to, because my work is in the housing section, that's worth looking into. I in fact suspect that there probably were but of the housing ones and the rent bills. Only the extended eviction protections cover commercial tenants as well as residential. Thank you thanks, Sam Marco. I see that you are up. We have marco Tamayo and Marco. You are unmuted. Thank you. Can you hear me? Yes, okay, thank you for these information, some information about this heart situation, but I'm going to write four points. My first point is the commercial moratorium. I think it's too late. Legislators are running late, no respect, but probably they do not even understand what's going on and I walk Second Avenue for promoting to help them second Avenue and Second Avenue. I found that fifty percent of the restore they are gone. I work first Avenue thirty percent or more are gone, so it's too late and York Avenue, I think, is a similar percentage, even though the York Avenue is residential and we have to maintain residential, even though the sun fellow community member, does not understand the concept of planning the concept of preservation of residential history. This is one point. The second point that I would like to raise is the Good news, which basically is it covers the Michelangelo and section 8 program. I do not think that we have much in our community this program and the second one for the landlord that receive funny- made Freddie Mac loans, you're going to have an opportunity to hold the payments in favor of the learner, which is, I think, is good, because the allowance deserves to be paid by the way and, finally, the bad news. The values is, our community approximately have, if I know wrong, 141,000 households from which 49,000 are households that have serious problems such as the 52 percent of the 141,000 they're, paying more than 20:30 of the rental income and 23. They already pay 50, which basically everything what you say. Those I was residents they already gone and I had to raise the issues in our community with all respect. I do not want to say I do not care the rest of the of the of the city, but our role is basically is to relationship always so to help our neighbor our residents not to help anybody else outside of the district. Indeed, I myself, I testify in the housing meeting and the budget in favor, while other fellow community members ask money for criminal justice which basically we do not have in our community. I think my perception is. We do not have on this bill. We do not have almost nothing for our communities and we are talking about approximately 50,000 households, and that is our concern. That is our discussion and I do not think it's going to be helpful and I'm seeing many in their part in the around my neighbor. I have a lot of friends that are learning so I went to the release and I saw that most of the tenants they laid they already left. Why? Because they considered that it won't be able to incapable to pay. So your information, I think, is good excellent but unhelpful for our needs, or maybe I can say it. Maybe our legislators does not help us. Much probably helps other communities more or may be more needed more in need people such as the homeless, which I agree with them- I'm not saying that they do not need, but for our community itself. I think we almost we do not have no legislation and we're going to see serious problems and, to finish this one I should say is it is sad that we do not have nothing about our community in this, and this and this bill you have for other communities, which is basically I'm very happy for them, but I'm happy for our community. We have to see what's going on in our community and a person of myself. I founded that very sad day for us. Thank you, okay Sam. I do not know if that was so much as a question, but if you have any thoughts on any of that, I leave it up to the board to decide whether either the actions that have been taken by the state and city federal governments live up to your needs. I would say that the three bills that I discussed probably would have a major impact on those tenants who are paying more than 50 percent of their income in rent. But again I leave that up to you all to decide how it would shake out and what to support. I would say that I strongly agree with marco that the scale of the problem and the speed that it's coming at us is far bigger than the scale and speed of action that has been taken, and I think we should all take that very seriously. I would like to write that one more one more point, so you may will understand. What's going on, I was discussing with isabel from the board president the same issues, because I handled very well this point since more than six months, and I prepare a plan for that also too. But she told me when I was raising the issue of of how much you contribute for rent and she stopped me and she said, wait a minute. Affordable housing is my problem and I had to face them. You know why, because I work for the Board of President. My first check is she received two checks. Apparently she said my first check is just only for rent and part of the second check is also for the rent so clearly right there. This is our. We have a serious problem. It's a big disparity of the rental market versus what is the real income. Even though that there is now a law that the people they should have an ink minimal income per hour, which is fifty dollars and you're talking about if it's one family one person and the family is working you're talking about thirty thousand dollars right there, but the question is they really receive the 30 of their income? Thank you I like this. I do not know who put that up, but that's great. No, that was that was not me. Thank you very much. I like that, marco. No, it was not me. Okay, our youtube viewers are only seeing black screen, so I just wanted yeah something to see that was nice Sam. I had a question for you, which one of these three I mean it looks like the second one has you know, based on what you described the second one as a more comprehensive for everybody with the commercials and the owners and the renters which one of these three, if any, has a shot of passing or are they all going to pass? Or what do you think? I do not want to get ahead of it too much, either. As a you know, political pundit, or as a as a housing policy analyst. I I've definitely heard concern that very little will be passed in this emergency session because there's so much uncertainty at the federal level, but I think there's also going to be a major push from all those groups that mobilized in the summer of 2019 around the rent, and so I would not write any of them out, and I also we really do not know what the federal timeline is for the next round of stimulus or for extending the expanded unemployment insurance, and so that could happen sooner, in which case some of these bills might become more possible. But I guess I I'm dodging the question, but for good reason I understand I understand anybody have any thoughts, comments, questions I'm I do not know. I will confess I'm not sure, I'm not sure what we can do from our humble perch. I, of course, have all ears for anything that anybody has in terms of constructive ideas or things that you know we can do to help move positive forward. I mean our elected officials are all supporting this. So that's the problem. Others are not marco Arco. You have your hand up. You have an idea. Of course the idea is. First, we have to stop for 421- 8 the program to be to have just only for 30 years. It has to be in perpetuity because one you have not perpetuity. You have an opportunity to this housing become a regulator in the housing market. Why? Because the issue is in 30 years is going to disappear. The investment of millions of dollars that put the city in the affordable, housing after 30 years is gone, so we're going back to zero in 20 years and while the city paid millions of dollars to the developers just only to the developer, to become millionaires, and I suppose strongly support the developers by the way I would like- and I think they deserve to have some income. They deserve to have some some possibilities to make successful in those business, but I can not support that after 30 years gone, so it has to be in perpetuity. I have another issue: they afford the workhouse. If the I believe is one of the issues in our community is this is something brand new, I believe not in the millionaire tax. I believe in the in the taxes for developments near to the subway station, the city put at 14 billion dollars to do the second Avenue subway and the developers commented they demolished the existing, affordable housing, and why? Because they said this is their house, they put it the people outside. They reduce the affordability in our community while they reduce their com. The affordability, the housing in our community become harder to find a more expensive and poor quality, all some of the residents they have to leave. So it creates a special segregation in our community so that that program it should be implemented, especially for the same amount of affordable units that they demolished. It has to be produced inside of the development. Oh well, most of the people. That say no. It can not do that because I can not put together wealthy people with low income family. Okay, I understand more or less. The concept is the water and the oil fine, but put it inside of the community war. Buy it another building, put affordable housing over there. So we do not lose the housing stock. Affordability in our community. We have another choices. Those developers are coming to develop, affordable housing do not put in a declining neighborhood like they did before. You know very well, the they put it and Bronx they asked and the and the on the on the wealthy people is just only moving in the apartment rent or in the studio five thousand dollars rent for for the penthouse. I think it's thirty six thousand dollars a month, so you they wanna, bring rich people wealthy people. Fine, I'm not have a problem with that. When I have a problem is, do not demolish the affordable housing do not put they come in, they offered to put affordable housing and they put in decline in the neighborhood. That is wrong, absolutely wrong. Thank you. Okay, Barbara, hello, yeah, you're, muted. Still, oh Rita has her hand up. I see Rita Orlando, obviously in an emergency situation, a situation that we have never been in before. The question is that, unfortunately, legislators who do get their salary every month move slowly. It's like turning an elephant around in a very small elevator. What happens? Let's say if it takes three months from this from today, three months until something passes, what happens to those people in between this? Can this have to pass now or it'll be too late? This is Barbara you at least we do not. They do not have that long. They have to pass now they're going to not going to keep on going back into session yeah I mean, I think, that they think they are going to keep going back into session, and you know they seem. Their approach seems to be from the governor down to do just enough to keep things held as they are. As the problem you know gets bigger, so you know the eviction moratorium in the first place was very important and needed to happen, but a moratorium is just for stalling an eventual eviction unless some other action is taken and we did pass the attendance Safe Harbor Act, which says that, basically you know you can't be evicted for not paying rent because of Covid-19, but you still have to repay the rent. And if you lost your income, it's going to be next to impossible to do that, especially if you're already rent burden, so some of them may have left the city by then plenty will, and you know we do not want people to have to leave the city under these dire circumstances, and it's going to be very hard for the city to recover. If those who can leave- and so I think we are going to need a lot of action but, like you say, that's not how the system is designed, but they are responsive to a groundswell of voices calling for immediate action. That's more than just the smallest repair and I think, having a vision of what you all decide is necessary to match. The scope of the problem is what it will take, and I know that you do not yourself, as the housing committee of a community board, have the legislative power at the state level, but it does matter if you know, especially if you can organize with your colleagues in other community boards, if there can be a program of what you think needs to happen at the state, I think that's an important voice to get out there, whether that means revenue, whether that means extended tenant protections, thinking, commercial thinking, residential, whether it means you know demanding a federal intervention because they have the power of debt spending whatever it is, that you decide is necessary. I believe that it's important that you have your voices heard yeah. I agree with you Sam. I do not, I think, you're. Also right in terms of you know, you know that Marco was saying we need to look out for the obviously the residents of community district. Eight, that's our job, we're community board aid, but I think a lot of us. I think all of us agree that we're obviously stronger with all 12 community boards in Manhattan and obviously all 59 in the city but all 12. I wonder if anybody knows what the borough president's office, what our borough, president, where she is on this, I'm sure she's supportive of these of all of these bills. I just do not know you know where she is in terms of trying to provide, as you say, Sam a little more additive incentive. I see. Elita has her hand up, maybe elita you might have some info for us from Gail's office or maybe from the latest parole board meeting or something I do not. There are so many issues surrounding the virus and Covid-19 and all of the economic fallout that I do not, and I and I wish I did had I anticipated this. I would have had maybe the foresight to have asked. But what I'm wondering is one of the things that may make sense is some kind of comprehensive city plan with housing, because New York City should not be a Greenwich connecticut for the wealthy. Only there are middle class people, the teachers, the nurses, the nurses. There are lower income people, everyone has to be here. Could this be? I mean I know that there are it's a dire emergency and something needs to be done right away, but could this become an opportunity to rethink how the city functions and how people should live together and to have a city that works economically for the people who want to be here and the people who work here? It's something that we've asked for with the charter commissions and something that's been fought by by certain people with certain political interests. So I'm just wondering thank you and oh, you did an excellent job in explaining this and talking about it. So thank you for that happy to do it and I've been a proponent of comprehensive and community based planning for a long time, and I agree with you. This is a moment where I think the inefficiencies and insufficiencies of the existing planning system are very clear for all to see and there's it's a moment where the crisis hits different communities differently, but it does touch everybody enough that I think there might be more momentum around comprehensive planning than there might have been a year ago when really the city should have done it in the charter process. There's also a new mayoral election and something like two- thirds of the City Council turning over, so that, combined with the scale of issues we're facing combined with a change in consciousness of a city that I think got to see, just how unplanned things are and how dangerous that can be could be the impetus for comprehensive planning. I want to make sure that it is simultaneously comprehensive and community- based and that's a tough tight rope. That's odd. It is hard, it's certainly hard and what it does not mean to me is listening to everybody and then doing what you were going to do anyway. It has to also not mean every community plans for itself, and this is a longer conversation, but it probably means a series of guidelines shared responsibilities among community boards, taking into account the sensitivities of local areas as well as the ways that certain areas have been privileged in the past in terms of environmental, citing and other issues and saying everybody has to do this much, you figure out how you're going to accomplish that. So that's. I think the way that you combine comprehensive with community- based again, it's not easy and it requires some shared sacrifice as well as shared gain, but it's. I think it should be clear that in a moment of crisis we were not prepared and we suffered tremendously in terms of human life, let alone all the economic impacts. Afterwards Rita I saw you have your hand up. Can we unmute rita? You just have to confirm it you're good. I have a question in all the years in the state, Senate and housing has been a very hard topic to get any passage on, because so much of this state, New York City, is so different than the rest of the state than Buffalo. Then rochester, then Albany and those people do not the people in the suburbs. You know who have a smaller population. It does not affect them that much and there's no incentive for them to hurry up and get it done. What do we do? In the meantime, I mean like I'm, trying to breathe life into the patient, and I do not know I. How long is this going to take? I mean tomorrow is too late. What do we do in the meantime? I'm scared. That's completely reasonable. It has been very hard to move on housing legislation in the past. The changing composition of the state summit and elections this year may add some fuel to that fire. I'd say that you're right that the conditions in those places that you named Buffalo Rochester Albany are different than New York, but they're kind of getting closer. There are certain problems that are that are faced in New York city as well as there are also certain landlords that have bought property in those places as well, including even mobile, home centers. So in this last round of organizing around the rent laws, tenants in New York City found common cause with mobile home residents in the outer ring suburbs, because some of the same corporate investors had bought the buildings in New York City and were buying these basically rv lots and raising the rents in both places, and so there can be organizing that happens. Acrosss the state. I think there is a greater urban suburban rural divide than there is a divide between upstate cities and downstate cities, and that common cause could be useful in pushing forward. But I'd also say that a lot of homeowners are going to be facing potential foreclosure and it's so it's not just renters and it's not just co- op owners and other forms of ownership that we're more familiar with in New York City. I think that, as after 2008 there's going to be a significant amount of pressure on the single- family home stock as well in the past, we've sometimes seen those housing issues get a lot more money in terms of stemming foreclosure of single- family homeowners, rather than multi- family homeowners or the evictions of tenants that can result in those cases, and so I hope that the changing political balance means that we can address the real and pressing needs of potentially foreclosed homeowners, as well as the very real impressing needs of tenants and multi- family dwellers in New, York, City Marco. You had your hand up. Thank you. I'm going to start with Rita just said tomorrow's too late. I think she's, absolutely right, she's afraid of the future, because you, sam you just mentioned you touched. You touched the big point right here. New elections with the mayor and the other officials and the biggest problem that we have is a lot of demagogues running and when they finish to learn their period is gone. So we're still back to point zero. So in the in a good example is, I was in the state house in the hearings last night in November, and you see it that there are some good legislators. They are have good intentions to produce affordable housing, but there is at the same times other people that they do not like the idea, for instance, some people they go and they say look when you can put affordable housing in the low densities community. They are right, but they are wrong. They're right because they're supposed to have affordable housing too, but they are wrong because the infrastructure underground can no receive no more affordable, no more density. However, in our district we have- and that's called me my attention. The NYCHA development is a meat density. When I analyze very careful, First, Avenue and York Avenue are high densities. Indeed, the developers already put huge buildings and we in affordability in affordable housing. We put a lot of meat density, I mean it does not have no sense and another point right. There is the quality of housing that they offer to the NYCHA residents. You're talking about the social justice, they said the blacks die around the country more than anybody else and secondly, spanish and New York City Hispanics die more than the blacks, but if you analyze this development of NYCHA, where there are 3,800 complaints about the building, most of them is about the elevator. And what are they talking about the problems of the violence? You have to reduce to the 50 percent of the capacity of the elevators. However, in NYCHA development they all in all the nouches. I guess the elevator does not work so right there they reduced their capacity to 50, and then the government said and they're right. By the way. Now you have to reduce 50 more. I just I'm thinking a person like our fellow community member, which I admire a lot wilma, she's, a wheelchair and she has to take the elevator down and one or one of the elevators does not work. So how is how is the fairness in the in the social justice right here that, when a person can not be in compliance with their own rules of the government? So I think this is the major issue is they do not understand? They want to put low density when the infrastructure under in those areas was developed to put a higher the higher density, and this is one of the biggest problems. What I perceive enough in to produce affordable housing. Another problem is in our neighborhood. This is another characteristic unique. We do not have bacon lots for affordable housing because everything is built up. So what are we going to put affordable housing? So, okay, this is Barbara. Can we do anybody have any other ideas? What we should do now about the legislation? That's in Albany, the least at the least. We want to get that passed. Well, the only thing I would say the only way I would like to say is well you have to live to do something for us because for us there's almost nothing. Thank you well wait a minute. I think those bills will help us too, and I think we should push those bills. I mean I would love it. I do not think the board will slowly we're not well there's no board meeting until September, but I really I would like to definitely go back and I've done this before with the budget to talk about a millionaire income tax, how he could pay for some of these things, because I think that's what it's down to is: redistribution of wealth and we're not going to help any affordable housing if we do not start doing that, but right now this bill they're in orbiting they're in session. As I said, I think our legislators are doing all they can to push it. What do we do? That's why? I think that a leader the borough board is important. I wonder what the other boards are. They supporting this legislation everybody's talking about it, but are they pushing their legislators and we have to talk to legislators outside of New York City yeah? I mean I guess the question is: do we have do we have something? Does anybody have an idea as to you know a resolution or something that we could you know, get that get something going? Does anybody have any thoughts? Billy? I see you have your hand raised. Well, maybe we should do a resolution's not going to pass the full board until September, so that may be a problem. That's a good point too. That's yeah! That was going to be my comment, which is I'm happy to propose a resolution that we support all the legislation that Sam has sort of reviewed and explained to us, but I want to first make sure, there's interest in the committee. I think there's some value of at least the committee passing a resolution, even if we're not able to get it in front of the whole full board, but I want to defer to, but I would certainly be willing to do that, and maybe we should. We can do a letter, though, to the speaker and to the speaker, who I know is supporting this too: the speaker of the assembly and the and the majority leader of the Senate and get at least we can do a letter. We can do a letter without him can't we a leader we can do a letter without going to the full board. Can we, I do not know yeah other committees? Have we have that we have? I think I think we can't wait to the third week of September to do this. Yes, we should. We should write a letter with once there's a committee approval of doing something like that, and I will reach out to all of the other Manhattan boards and ask if they are supporting the legislation. Alternatively, once there's a letter, I will send that along to the other boards and ask them for their support and see if there's some kind of either joint letter or they could do their own and talk to the borough president about it. But I know the borough president is pushing it as much as she can. You know the governor and the desert and the mayor do not always listen to her. Unfortunately, I know I meant in terms of getting some kind of uniform response from all of the community boards, but in the meantime I think I think a letter is a is a really good start, but the committee needs to and that helps them, because then they can use the letters. If all the boards write these letters because they can use it to get other legislators to support it. That's right and it's something that touches every district in the city. So there should be a lot of billy made a motion. Does somebody want to second it? I see Rita put her hand up. It looks like she's seconding that okay, we do it like we do it full board. Yeah everybody, any board, members loading, no anybody or staining yeah raise your hand. Okay, so we'll write a letter billy you want to take a shot at the first draft on that, okay and then with circulated around the committee. The members of the committee or you want me to I have. I think I have everybody who's on the. I have everybody down all circulated among the board members who are on the call here. How about that just for the public record. Would you read out everybody who's, a board member who's still here that way, yeah. So I have Alita, I have Billy Elizabeth rose, Gail, Barron, Kim Selway. I have Marco, I have Rebecca Rita, I have Sandra correct. Am I pronouncing that Right Sandra and Sandra Andrea? I apologize boy just terrible today and Taina yes got that right. The second time. Thank you and the two of us and the two of us. Okay, is that everybody yes billy, and I think we also have to have next meeting you really have to discuss marco. You keep them, bring it up, but we have to also talk about. What's the how we're going to get a real, affordable housing in this community and that's something we have to talk about, and I mean I do not know if the board will do it and we have to certainly you can't do it by letter, but I really want to talk about ray how we raise money, which I seem to think it should be: income tax and capital gains taxes or whatever you want to do it to pay for affordable housing. So we can build more affordable housing, real, affordable housing because I'm sick of hearing the word and it's not- it ends up being a foss okay. If I could just jump in and before we lose Sam. I want to make sure for my own notes. I had the bills that we're supporting and what I have are: seven six, two, eight, a the housing axis vouchers. I have s, eight, six: seven, that's extending the eviction moratorium. I have s, zero, eight, zero! Two! That's the rent cancellation Sam did I miss any. Those are the three that I talked about and those are the Senate numbers. Of course, there's assembly numbers as well: there is no assembly number for the extending the eviction and foreclosure moratorium. Great. I just want to make sure so Ed and Barbara, unless you have anything to add I'll draft something that captures those three bills. Thank you very much. That's terrific and then we'll have every rule circulated among all the board members and then sent that I guess on to you Alita, for circulating among the other community boards elite when's, the next Spiral Board meeting it's in August. I think August 20th, the third Thursday okay, but you can get it to the other board chairs before that right, yeah I'll, send it by email. I've done that with other issues that have come before us good. Anybody have anything else, jokes umbrellas, I guess we're not going outside the thunder is now the thunder is over in the mid 70s, at least it seems it's still in the 80s Sam. Thank you very much very pleasure. So glad you came Sam yeah thanks for inviting me really great stuff. Anybody any thoughts, anything parting, no okay! I guess we won't have our next meeting till September, but we'll pass the letter around in the interview right. Okay, stay, safe, everybody see everybody, albeit remotely look forward to seeing everyone in person. The September date you guys have is the 23rd. Is that still good for you? I think so great September yeah, I think probably you'll have to be on. I do not think we'll be meeting in public. Yet, okay, stay safe, bye, everybody stay dry.",
            "summary": "Sam is going to update us on all things that are going on, including and beyond the rent assistance program that I believe and Sam Leave it to you to correct me if I'm wrong, which is still available for application until July 30., and we have the eviction moratorium.\nI, think to talk about and Sam has told me that he has lots and lots of updates from Albany on pending legislation regarding rent housing and all things related to that.\nSo without further Ado, I'm, going to turn it over to Sam, and let him do his thing and when he's done, we'll open it up for questions So, as I said, I'm, a brand new housing policy analyst at the Community Service society.\nSo Ed asked me to talk a little bit about the state of of housing, evictions, the state of the rental assistance program and other things going on in Albany.\nThe latest statistics showed about a quarter of tenants, did not pay full rent last month, which is kind of high, given a 20 unemployment rate, since there is usually a number of tenants who do not pay, but a lot of people who are unemployed are relying on those unemployment.\nIt also does not cover people who became unemployed in phase four which we're in right now in New, York City.\nNot yet being executed, the courts are open online for tenants filing housing part cases against their landlords for things like emergency repairs that need to be made, or harassment or illegal lockouts, which can be one roommate against another or if they're, the courts are open for pre- coveted cases where both parties have have attorneys and are seeking either settlements or to file motions.\nAlso, a federal eviction moratorium on tenants whose landlords receive federal funding and the clearest case of that is NYCHA residents whose landlord is the public authority, but also section 8, tenants, tenants in program in buildings that were built with a low- income, housing tax credit which is most affordable, housing and then most affordable, housing.\nIt also does not cover anybody who was immediately affected by this pandemic in mid- march, which you know certain areas pretty hard, pretty fast, So People who are ineligible, like I, said people who are low income now, but were not then people who were not rentward And then, but are now people who are rent burdened before and are still rent burdened, but have not lost income, undocumented households without a single citizen, who's or a person who's.\nThis does not include public housing, section, 8 or other voucher recipients, because they can reapply for their programs at their new lower income, and it does not cover people whose rent is over 125 percent.\nEverybody, who needs it and to eliminate some of the potential spread of Covid-19 that exists in congregate, housing, shelters, which are very dangerous conditions under any circumstance, but certainly under this pandemic, then there's a bill for extending the eviction moratorium and including foreclosures in it as well.\nThat's s-8667, though this would protect commercial and residential tenants from eviction during the state of emergency, plus give them an extra year to recover, given that the economic fallout is going to be much longer than the epidemiological fallout and it prevents filings of and executions of, both evictions and foreclosures, and this, like I, said it covers commercial and residential homeowners and renters.\nEight zero, two s: zero, eight zero, two assembly, A10826 810826, so this quite simply cancels rents from March 7th until the duration of the crisis, plus 90 days, it is designed to be universal because there are many ways that tenants fall through the cracks So. It includes a Landlord hardship fund which is designed to prioritize small operators, non- profits and public housing authorities before all other potential landlords and landlords can basically get their rent payments covered in, but in exchange they have to open their books and demonstrate that they actually have a hardship that other programs work.\nThere's the question of at what rents and given the recent you know, departure of a larger number of people from the city.\nYou either elaborate on that or talk a little bit more about some of the other qualifications and requirements of the hdr program that you think would make it difficult for people who should otherwise qualify or seem to be in need in our particular district in Community Board aid that might make it challenging for them to end up actually qualifying for these.\nImagine that might be more of a burden in higher rent parts of the city than in lower rent parts of the city, because I do not think that it's targeted by anything quite as specific as a community district.\nIf you think this is way off, but it looks like what I'm reading is for fiscal year, 2020, The, fair market, rent documentation system for New, York, Hud, Metro, fair market, rent area Fmrs for all bedroom sizes, for an efficiency that is 16.65 for a one bedroom, 1700 for a two- bedroom 1951 for a three- bedroom, 2472 and for a four- bedroom.\nLeave it to the experts in CB8, whether you think that's going to be an issue in your community, but it seems worth looking into okay, any you have a follow- up.\nLet us know thanks sure, and thanks for getting my book, the eviction moratorium extension bill does cover commercial as well as residential tenants.\nI do not think that we have much in our community This program and the second one for the landlord that receive funny- made Freddie Mac loans, you're going to have an opportunity to hold the payments in favor of the learner, which is, I think, is good, because the allowance deserves to be paid by the way: and, finally, the bad news.\nI would say that the three bills that I discussed probably would have a major impact on those tenants who are paying more than 50 percent of their income in rent.\nI I've definitely heard concern that very little will be passed in this emergency session, because there's so much uncertainty at the federal level, but I think there's also going to be a major push from all those groups that mobilized in the summer of 2019 around the rent, and so I would not write any of them out, and I.\nThe investment of millions of dollars that put the city in the affordable, housing after 30 years is gone, so we're going back to zero in 20 years and while the city paid millions of dollars to the developers just only to the developer, to become millionaires, and I suppose strongly support the developers by the way I would like- And I think they deserve to have some income.\nIf you lost your income, it's going to be next to impossible to do that, especially if you're already rent burden, so some of them may have left the city by then plenty will, and You know.\nYou know that Marco was saying we need to look out for the obviously the residents of community district.\nI have a question in all the years in the state, Senate and housing has been a very hard topic to get any passage on, because so much of this state, New York City, is so different than the rest of the state than Buffalo.\nI. Think that, as after 2008 there's going to be a significant amount of pressure on the single- family home stock as well in the past , we've sometimes seen those housing issues get a lot more money in terms of stemming foreclosure of single- family homeowners, rather than multi- family homeowners or the evictions of tenants that can result in those cases, and so I hope that the changing political balance means that we can address the real and pressing needs of potentially foreclosed homeowners, as well as the very real impressing needs of tenants and multi- family dwellers in New, York, City, Marco.\nThey say: look when you can put affordable housing in the low densities, community.\nAnd I've done this before with the budget to talk about a millionaire income tax, how he could pay for some of these things, because I think that's what it's down to is: redistribution of wealth And we're not going to help any affordable housing if we do not start doing that, This bill, they're in orbiting, I, think that a leader, the borough board, is important.\nAnd we have to talk to legislators outside of New York City Anybody have an idea as to you know a resolution or something that we could you know, get that get something going?\nWhat's the how we're going to get a real, affordable housing in this community Certainly you can't do it by letter, but I really want to talk about ray how we raise money, which I seem to think it should be: income, tax and capital gains taxes or whatever you want to do it to pay for affordable, housing."
        }
    }
}